{"name":"ACECLUS","statements":[{"name":"PROC ACECLUS","description":"The ACECLUS (approximate covariance estimation for clustering) procedure obtains approximate estimates of the pooled within-cluster covariance matrix when the clusters are assumed to be multivariate normal with equal covariance matrices. Neither cluster membership nor the number of clusters needs to be known. PROC ACECLUS is useful for preprocessing data to be subsequently clustered by the CLUSTER or FASTCLUS procedure.","help":"PROC ACECLUS <ABSOLUTE> <CONVERGE=c> <DATA=SAS-data-set> <INITIAL=DIAGONAL|D | FULL|F | IDENTITY|I... > <MAXITER=n> <METHOD=COUNT|C | THRESHOLD|T> <METRIC=DIAGONAL|D | FULL|F | IDENTITY|I> <MPAIRS=m> <N=n> <NOPRINT> <OUT=SAS-data-set> <OUTSTAT=SAS-data-set> <PP> <PREFIX=name> PROPORTION=p <QQ> <SHORT> <SINGULAR=g> THRESHOLD=t;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tFREQ variable;     \n\tVAR; \n   \n\tWEIGHT variable; ","arguments":[{"name":"PROPORTION=","aliases":["PERCENT=","P="],"description":"Specifies the percentage of pairs to be included in the estimation of the within-cluster covariance matrix.","help":"PROPORTION=*p*","type":"value"},{"name":"THRESHOLD=","aliases":["T="],"description":"Specifies the threshold for including pairs of observations in the estimation of the within-cluster covariance matrix. A pair of observations is included if the Euclidean distance between them is less than or equal to t times the root mean square distance computed over all pairs of observations.","help":"THRESHOLD=*t*","type":"value"},{"name":"ABSOLUTE","optional":true,"description":"Causes the THRESHOLD= value or the threshold computed from the PROPORTION= option to be treated absolutely rather than relative to the root mean square distance between observations.","type":"standalone"},{"name":"CONVERGE=","optional":true,"description":"Specifies the convergence criterion.","help":"CONVERGE=*c*","type":"value"},{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be analyzed.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"INITIAL=","optional":true,"description":"Specifies the matrix for the initial estimate of the within-cluster covariance matrix.","help":"INITIAL=DIAGONAL | FULL | IDENTITY | INPUT=SAS-data-set","type":"choice","arguments":[{"name":"DIAGONAL","aliases":["D"],"description":"Uses the diagonal matrix of sample variances as the initial estimate of the within-cluster covariance matrix.","type":"standalone"},{"name":"FULL","aliases":["F"],"description":"Uses the total-sample covariance matrix as the initial estimate of the within-cluster covariance.","type":"standalone"},{"name":"IDENTITY","aliases":["I"],"description":"Uses the identity matrix as the initial estimate of the within-cluster covariance matrix.","type":"standalone"},{"name":"INPUT=","description":"Specifies a SAS data set from which to obtain the initial estimate of the within-cluster covariance matrix.","help":"INPUT=SAS-data-set","type":"value"}]},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations. By default, MAXITER=10.","help":"MAXITER=*n*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the clustering method.","help":"METHOD=COUNT|C | THRESHOLD","type":"choice","arguments":[{"name":"COUNT","aliases":["C"],"description":"Requests a method that uses a number of pairs, with the smallest distances to form the estimate at each iteration.","type":"standalone"},{"name":"THRESHOLD","aliases":["T"],"description":"Option requests a method (also the default) that uses all pairs closer than a given cutoff value to form the estimate at each iteration.","type":"standalone"}]},{"name":"METRIC=","optional":true,"description":"Specifies the metric in which the computations are performed, implies the default value for the INITIAL= option, and specifies the matrix Z used in the formula for the convergence measure, ei, and for checking singularity of the A matrix.","help":"METRIC=DIAGONAL | FULL | IDENTITY","type":"choice","arguments":[{"name":"DIAGONAL","aliases":["D"],"description":"Uses the diagonal matrix of sample variances diag(S) and sets Z=diag(S)^(-1/2) , where the superscript -1/2 indicates an inverse factor.","type":"standalone"},{"name":"FULL","aliases":["F"],"description":"Uses the total-sample covariance matrix S and sets Z=S^(-1/2).","type":"standalone"},{"name":"IDENTITY","aliases":["I"],"description":"Uses the identity matrix I and sets Z=I.","type":"standalone"}]},{"name":"MPAIRS=","optional":true,"description":"Specifies the number of pairs to be included in the estimation of the within-cluster covariance matrix when METHOD=COUNT is requested.","help":"MPAIRS=*m*","type":"value"},{"name":"N=","optional":true,"description":"Specifies the number of canonical variables to be computed. The default is the number of variables analyzed. N=0 suppresses the canonical analysis.","help":"N=*n*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output. Note that this option temporarily disables the Output Delivery System (ODS).","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set that contains all the original data as well as the canonical variables having an estimated within-cluster covariance matrix equal to the identity matrix.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Specifies a TYPE=ACE output SAS data set that contains means, standard deviations, number of observations, covariances, estimated within-cluster covariances, eigenvalues, and canonical coefficients.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PP","optional":true,"description":"Produces a PP probability plot of distances between pairs of observations computed in the last iteration.","type":"standalone"},{"name":"PREFIX=","optional":true,"description":"Specifies a prefix for naming the canonical variables. By default the names are Can1, Can2, ..., CAN. If you specify PREFIX=ABC, the variables are named ABC1, ABC2, ABC3, and so on.","help":"PREFIX=*name*","type":"value"},{"name":"QQ","optional":true,"description":"Produces a QQ probability plot of a power transformation of the distances between pairs of observations computed in the last iteration. Caution:The QQ plot can require an enormous amount of computer time.","type":"standalone"},{"name":"SHORT","optional":true,"description":"Omits all items from the standard output except for the iteration history and the eigenvalue table.","type":"standalone"},{"name":"SINGULAR=","optional":true,"aliases":["SING="],"description":"Specifies a singularity criterion 0 < g < 1 for the total-sample covariance matrix S and the approximate within-cluster covariance estimate A. The default is SINGULAR=1E-4.","help":"SINGULAR=*g*","type":"value"}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"Treats observations as if they appear multiple times in the input data set.","help":"FREQ variable"},{"name":"VAR","aliases":["VARIABLES"],"description":"VAR variable(s); Specifies the numeric variables to be analyzed. If the VAR statement is omitted, all numeric variables not specified in other statements are analyzed.","help":"VAR"},{"name":"WEIGHT","aliases":["WEIGHTS"],"description":"If you want to specify relative weights for each observation in the input data set, place the weights in a variable in the data set and specify that variable name in a WEIGHT statement. This is often done when the variance associated with each observation is different and the values of the weight variable are proportional to the reciprocals of the variances.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_028","docsetTargetFile":"statug_aceclus_toc.htm"}}