{"name":"ANOVA","statements":[{"name":"PROC ANOVA","description":"The ANOVA procedure performs analysis of variance (ANOVA) for balanced data from a wide variety of experimental designs. In analysis of variance, a continuous response variable, known as a dependent variable, is measured under experimental conditions identified by classification variables, known as independent variables. The variation in the response is assumed to be due to effects in the classification, with random error accounting for the remaining variation. † The ANOVA procedure is one of several procedures available in SAS/STAT software for analysis of variance. The ANOVA procedure is designed to handle balanced data (that is, data with equal numbers of observations for every combination of the classification factors), whereas the GLM procedure can analyze both balanced and unbalanced data. Because PROC ANOVA takes into account the special structure of a balanced design, it is faster and uses less storage than PROC GLM for balanced data. † Use PROC ANOVA for the analysis of balanced data only, with the following exceptions: one-way analysis of variance, Latin square designs, certain partially balanced incomplete block designs, completely nested (hierarchical) designs, and designs with cell frequencies that are proportional to each other and are also proportional to the background population. These exceptions have designs in which the factors are all orthogonal to each other.","help":"PROC ANOVA <DATA=SAS-data-set> <MANOVA> <MULTIPASS> <NAMELEN=n> <ORDER=DATA | FORMATTED | FREQ... > <OUTSTAT=SAS-data-set> <PLOTS=NONE>;     \n\tABSORB variables ;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <TRUNCATE> ; \n   \n\tFREQ variable;     \n\tMANOVA <E=effect> <H=<<effects> | INTERCEPT | _ALL_>> <M=equation,...,equation | (row-of-matrix,...,row-of-matrix)> ...; \n   \n\tMEANS <ALPHA=α> <BON> <CLM> ...; \n   \n\tMODEL <INTERCEPT> <NOUNI> ; \n   \n\tPERFORMANCE;     \n\tREPEATED <CONTRAST<(ordinal-reference-level)>> <HELMERT> <IDENTITY> ...; \n   \n\tTEST <E=effect> <H=effects> ; ","arguments":[{"name":"DATA=","optional":true,"description":"Names the SAS data set used by the ANOVA procedure.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"MANOVA","optional":true,"description":"Requests the multivariate mode of eliminating observations with missing values.","type":"standalone"},{"name":"MULTIPASS","optional":true,"description":"Requests that PROC ANOVA reread the input data set, when necessary, instead of writing the values of dependent variables to a utility file.","type":"standalone"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length of effect names to be n characters long, where n is a value between 20 and 200 characters. The default length is 20 characters.","help":"NAMELEN=*n*","type":"value"},{"name":"ORDER=","optional":true,"description":"Specifies the sorting order for the levels of the classification variables (specified in the CLASS statement).","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]},{"name":"OUTSTAT=","optional":true,"description":"Names an output data set that contains sums of squares, degrees of freedom, F statistics, and probability levels for each effect in the model.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Syntax: PLOTS <(MAXPOINTS=NONE | number)> <=NONE> PLOTS=NONE Controls the plots produced through ODS Graphics. Specify the PLOTS=NONE option in order to prevent these plots from being produced when ODS Graphics is enabled.","help":"PLOTS=NONE","type":"choice","arguments":[{"name":"NONE","description":"Specify the PLOTS=NONE option in order to prevent these plots from being produced when ODS Graphics is enabled.","type":"standalone"}]}]},{"name":"ABSORB","description":"Absorption is a computational technique that provides a large reduction in time and memory requirements for certain types of models. The variables are one or more variables in the input data set.","help":"ABSORB variables "},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","aliases":["CLASSES"],"description":"The CLASS statement names the classification variables to be used in the model.","help":"CLASS &lt;TRUNCATE&gt; ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that classification levels should be determined by using only up to the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"Treats observations as if they appear multiple times in the input data set.","help":"FREQ variable"},{"name":"MANOVA","description":"If the MODEL statement includes more than one dependent variable, you can perform multivariate analysis of variance with the MANOVA statement. The test-options define which effects to test, while the detail-options specify how to execute the tests and what results to display.","help":"MANOVA &lt;E=effect&gt; &lt;H=&lt;&lt;effects&gt; | INTERCEPT | _ALL_&gt;&gt; &lt;M=equation,...,equation | (row-of-matrix,...,row-of-matrix)&gt; ...","arguments":[{"name":"CANONICAL","optional":true,"description":"Produces a canonical analysis of the H and E matrices (transformed by the M matrix, if specified) instead of the default display of characteristic roots and vectors.","type":"standalone"},{"name":"E=","optional":true,"description":"Specifies the error effect. If you omit the E= specification, the ANOVA procedure uses the error SSCP (residual) matrix from the analysis.","help":"E=*effect*","type":"value"},{"name":"H=","optional":true,"description":"Specifies effects in the preceding model to use as hypothesis matrices.","help":"H=&lt;*effects*&gt; | INTERCEPT | _ALL_","type":"choice","arguments":[{"name":"effects","placeholder":true,"description":"Specifies effects in the preceding model to use as hypothesis matrices.","type":"standaloneOrValue"},{"name":"INTERCEPT","description":"Produces tests for the intercept.","type":"standalone"},{"name":"_ALL_","description":"Produces tests for all effects listed in the MODEL statement.","type":"standalone"}]},{"name":"M=","optional":true,"description":"Specifies a transformation matrix for the dependent variables listed in the MODEL statement.","type":"value"},{"name":"MNAMES=","optional":true,"description":"Provides names for the variables defined by the equations in the M= specification.","help":"MNAMES=*names*","type":"value"},{"name":"MSTAT=","optional":true,"description":"Specifies the method of evaluating the multivariate test statistics.","help":"MSTAT=FAPPROX | EXACT","type":"choice","arguments":[{"name":"FAPPROX","description":"Specifies that the multivariate tests are evaluated by using the usual approximations based on the F distribution.","type":"standalone"},{"name":"EXACT","description":"Computes exact p-values for three of the four tests (Wilks’ lambda, the Hotelling-Lawley trace, and Roy’s greatest root) and an improved F-approximation for the fourth (Pillai’s trace).","type":"standalone"}]},{"name":"ORTH","optional":true,"description":"Requests that the transformation matrix in the M= specification of the MANOVA statement be orthonormalized by rows before the analysis.","type":"standalone"},{"name":"PREFIX=","optional":true,"description":"Is an alternative means of identifying the transformed variables defined by the M= specification. For example, if you specify PREFIX=DIFF, the transformed variables are labeled DIFF1, DIFF2, and so forth.","help":"PREFIX=*name*","type":"value"},{"name":"PRINTE","optional":true,"description":"Displays the error SSCP matrix E.","type":"standalone"},{"name":"PRINTH","optional":true,"description":"Displays the hypothesis SSCP matrix H associated with each effect specified by the H= specification.","type":"standalone"},{"name":"SUMMARY","optional":true,"description":"Produces analysis-of-variance tables for each dependent variable.","type":"standalone"}]},{"name":"MEANS","aliases":["MEAN"],"description":"Computes means of the dependent variables for any effect that appears on the right-hand side in the MODEL statement.","help":"MEANS &lt;ALPHA=α&gt; &lt;BON&gt; &lt;CLM&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the level of significance α for comparisons among the means. By default, α=0.05. You can specify any value greater than 0 and less than 1.","type":"value"},{"name":"BON","optional":true,"followsDelimiter":"/","description":"Performs Bonferroni t tests of differences between means for all main effect means in the MEANS statement.","type":"standalone"},{"name":"CLDIFF","optional":true,"followsDelimiter":"/","description":"Presents results of the BON, GABRIEL, SCHEFFE, SIDAK,SMM, GT2, T, LSD, and TUKEY options as confidence intervals for all pairwise differences between means, and the results of the DUNNETT, DUNNETTU, and DUNNETTL options as confidence intervals for differences with the control.","type":"standalone"},{"name":"CLM","optional":true,"followsDelimiter":"/","description":"Presents results of the BON, GABRIEL, SCHEFFE, SIDAK,SMM, T, and LSD options as intervals for the mean of each level of the variables specified in the MEANS statement.","type":"standalone"},{"name":"DUNCAN","optional":true,"followsDelimiter":"/","description":"Performs Duncan’s multiple range test on all main effect means given in the MEANS statement.","type":"standalone"},{"name":"DUNNETT","optional":true,"followsDelimiter":"/","description":"Performs Dunnett’s two-tailed t test, testing if any treatments are significantly different from a single control for all main effects means in the MEANS statement.","type":"standalone"},{"name":"DUNNETTL","optional":true,"followsDelimiter":"/","description":"Performs Dunnett’s one-tailed t test, testing if any treatment is significantly less than the control.","type":"standalone"},{"name":"DUNNETTU","optional":true,"followsDelimiter":"/","description":"Performs Dunnett’s one-tailed t test, testing if any treatment is significantly greater than the control.","type":"standalone"},{"name":"E=","optional":true,"followsDelimiter":"/","description":"Specifies the error mean square used in the multiple comparisons.","help":"E=*effect*","type":"value"},{"name":"GABRIEL","optional":true,"followsDelimiter":"/","description":"Performs Gabriel’s multiple-comparison procedure on all main effect means in the MEANS statement.","type":"standalone"},{"name":"HOVTEST=","optional":true,"followsDelimiter":"/","description":"Requests a homogeneity of variance test for the groups defined by the MEANS effect.","help":"HOVTEST=BARTLETT | BF | LEVENE | OBRIEN","type":"choice","arguments":[{"name":"BARTLETT","followsDelimiter":"/","description":"Specifies Bartlett’s test, a modification of the normal-theory likelihood ratio test.","type":"standalone"},{"name":"BF","followsDelimiter":"/","description":"Specifies Brown and Forsythe’s variation of Levene’s test","type":"standalone"},{"name":"LEVENE","followsDelimiter":"/","description":"[Syntax: LEVENE<(TYPE= ABS | SQUARE)>] Specifies Levene’s test, which is widely considered to be the standard homogeneity of variance test.","type":"standalone"},{"name":"OBRIEN","followsDelimiter":"/","description":"[Syntax: OBRIEN <(W=number)>] Specifies O’Brien’s test, which is basically a modification of HOVTEST=LEVENE(TYPE=SQUARE).","type":"standalone"}]},{"name":"KRATIO=","optional":true,"followsDelimiter":"/","description":"Specifies the Type 1/Type 2 error seriousness ratio for the Waller-Duncan test. Reasonable values for KRATIO are 50, 100, and 500, which roughly correspond for the two-level case to ALPHA levels of 0.1, 0.05, and 0.01. By default, the procedure uses the default value of 100.","help":"KRATIO=*value*","type":"value"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of the BON, DUNCAN, GABRIEL, REGWQ, SCHEFFE, SIDAK,SMM, GT2, SNK, T, LSD TUKEY, and WALLER options by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding means.","type":"standalone"},{"name":"NOSORT","optional":true,"followsDelimiter":"/","description":"Prevents the means from being sorted into descending order when the CLDIFF or CLM option is specified.","type":"standalone"},{"name":"REGWQ","optional":true,"followsDelimiter":"/","description":"Performs the Ryan-Einot-Gabriel-Welsch multiple range test on all main effect means in the MEANS statement.","type":"standalone"},{"name":"SCHEFFE","optional":true,"followsDelimiter":"/","description":"Performs Scheffé’s multiple-comparison procedure on all main effect means in the MEANS statement.","type":"standalone"},{"name":"SIDAK","optional":true,"followsDelimiter":"/","description":"Performs pairwise t tests on differences between means with levels adjusted according to Sidak’s inequality for all main-effect means in the MEANS statement.","type":"standalone"},{"name":"SMM","optional":true,"followsDelimiter":"/","aliases":["GT2"],"description":"Performs pairwise comparisons based on the studentized maximum modulus and Sidak’s uncorrelated-t inequality, yielding Hochberg’s GT2 method when sample sizes are unequal, for all main effect means in the MEANS statement","type":"standalone"},{"name":"SNK","optional":true,"followsDelimiter":"/","description":"Performs the Student-Newman-Keuls multiple range test on all main effect means in the MEANS statement.","type":"standalone"},{"name":"TUKEY","optional":true,"followsDelimiter":"/","description":"Performs Tukey’s studentized range test (HSD) on all main effect means in the MEANS statement.","type":"standalone"},{"name":"T","optional":true,"followsDelimiter":"/","aliases":["LSD"],"description":"Performs pairwise t tests, equivalent to Fisher’s least-significant-difference test in the case of equal cell sizes, for all main effect means in the MEANS statement.","type":"standalone"},{"name":"WALLER","optional":true,"followsDelimiter":"/","description":"Performs the Waller-Duncan k-ratio t test on all main effect means in the MEANS statement.","type":"standalone"},{"name":"WELCH","optional":true,"followsDelimiter":"/","description":"Requests Welch’s variance-weighted one-way ANOVA.","type":"standalone"}]},{"name":"MODEL","description":"The MODEL statement names the dependent variables and independent effects.","help":"MODEL &lt;INTERCEPT&gt; &lt;NOUNI&gt; ","arguments":[{"name":"INTERCEPT","optional":true,"followsDelimiter":"/","description":"Displays the hypothesis tests associated with the intercept as an effect in the model.","type":"standalone"},{"name":"NOUNI","optional":true,"followsDelimiter":"/","description":"Suppresses the display of univariate statistics. You typically use the NOUNI option with a multivariate or repeated measures analysis of variance when you do not need the standard univariate output.","type":"standalone"}]},{"name":"PERFORMANCE","description":"","help":"PERFORMANCE"},{"name":"REPEATED","description":"When values of the dependent variables in the MODEL statement represent repeated measurements on the same experimental unit, the REPEATED statement enables you to test hypotheses about the measurement factors (often called within-subject factors), as well as the interactions of within-subject factors with independent variables in the MODEL statement (often called between-subject factors).","help":"REPEATED &lt;CONTRAST&lt;(ordinal-reference-level)&gt;&gt; &lt;HELMERT&gt; &lt;IDENTITY&gt; ...","arguments":[{"name":"CANONICAL","optional":true,"followsDelimiter":"/","description":"Performs a canonical analysis of the H and E matrices corresponding to the transformed variables specified in the REPEATED statement.","type":"standalone"},{"name":"CONTRAST","optional":true,"followsDelimiter":"/","description":"Generates contrasts between levels of the factor and a reference level.","type":"standalone"},{"name":"HELMERT","optional":true,"followsDelimiter":"/","description":"Generates contrasts between each level of the factor and the mean of subsequent levels.","type":"standalone"},{"name":"IDENTITY","optional":true,"followsDelimiter":"/","description":"Generates an identity transformation corresponding to the associated factor.","type":"standalone"},{"name":"MEAN","optional":true,"followsDelimiter":"/","description":"Generates contrasts between levels of the factor and the mean of all other levels of the factor.","type":"standalone"},{"name":"MSTAT=","optional":true,"followsDelimiter":"/","description":"Specifies the method of evaluating the multivariate test statistics.","help":"MSTAT=FAPPROX | EXACT","type":"choice","arguments":[{"name":"FAPPROX","followsDelimiter":"/","description":"Specifies that the multivariate tests are evaluated by using the usual approximations based on the F distribution.","type":"standalone"},{"name":"EXACT","followsDelimiter":"/","description":"Computes exact p-values for three of the four tests (Wilks’ lambda, the Hotelling-Lawley trace, and Roy’s greatest root) and an improved F-approximation for the fourth (Pillai’s trace).","type":"standalone"}]},{"name":"NOM","optional":true,"followsDelimiter":"/","description":"Displays only the results of the univariate analyses.","type":"standalone"},{"name":"NOU","optional":true,"followsDelimiter":"/","description":"Displays only the results of the multivariate analyses.","type":"standalone"},{"name":"POLYNOMIAL","optional":true,"followsDelimiter":"/","description":"Generates orthogonal polynomial contrasts. Level values, if provided, are used as spacings in the construction of the polynomials; otherwise, equal spacing is assumed.","type":"standalone"},{"name":"PRINTE","optional":true,"followsDelimiter":"/","description":"Displays the E matrix for each combination of within-subject factors, as well as partial correlation matrices for both the original dependent variables and the variables defined by the transformations specified in the REPEATED statement.","type":"standalone"},{"name":"PRINTH","optional":true,"followsDelimiter":"/","description":"Displays the H (SSCP) matrix associated with each multivariate test.","type":"standalone"},{"name":"PRINTM","optional":true,"followsDelimiter":"/","description":"Displays the transformation matrices that define the contrasts in the analysis.","type":"standalone"},{"name":"PRINTRV","optional":true,"followsDelimiter":"/","description":"Produces the characteristic roots and vectors for each multivariate test.","type":"standalone"},{"name":"PROFILE","optional":true,"followsDelimiter":"/","description":"Generates contrasts between adjacent levels of the factor.","type":"standalone"},{"name":"SUMMARY","optional":true,"followsDelimiter":"/","description":"Produces analysis-of-variance tables for each contrast defined by the within-subjects factors.","type":"standalone"}]},{"name":"TEST","description":"Although an F value is computed for all SS in the analysis by using the residual MS as an error term, you can request additional F tests that use other effects as error terms. You need a TEST statement when a nonstandard error structure (as in a split plot) exists.","help":"TEST &lt;E=effect&gt; &lt;H=effects&gt; ","arguments":[{"name":"E=","optional":true,"description":"Specifies one, and only one, effect to use as the error (denominator) term. The E= specification is required.","help":"E=*effect*","type":"value"},{"name":"H=","optional":true,"description":"Specifies which effects in the preceding model are to be used as hypothesis (numerator) effects.","help":"H=*effects*","type":"value"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_021","docsetTargetFile":"statug_anova_toc.htm"}}