{"name":"ASSESSBIAS","statements":[{"name":"PROC ASSESSBIAS","description":"The PROC ASSESSBIAS statement invokes the ASSESSBIAS procedure.","help":"PROC ASSESSBIAS <options>;                 \n\tFITSTAT  PVAR=variables / PEVENT=\"event-list\"<options>;                 \n\tFREQ variable;                 \n\tINPUT variable;                 \n\tSENSITIVEVAR variable</options>;                 \n\tTARGET  variable </options>;                 \n\tWEIGHT variable;                 ","arguments":[{"name":"CUTOFF=","optional":true,"description":"specifies a user-defined threshold for target events for multiclass classification, where ratio is between 0 and 1. By default, CUTOFF=0.5.","help":"CUTOFF=*ratio*","type":"value"},{"name":"DATA=","optional":true,"description":"names the input data table for PROC ASSESSBIAS to use. The default is the most recently created data table.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"NBINS=","optional":true,"description":"specifies the number of bins to use in the lift calculation, where integer is an integer greater than or equal to 2. By default, NBINS=20.","help":"NBINS=*integer*","type":"value"},{"name":"NCUTS=","optional":true,"description":"specifies the number of cuts to use in the ROC calculation, where integer is an integer greater than or equal to 2 and less than or equal to 100. The inverse of integer represents the step size of the quantile. For example, NCUTS=10 generates 10 intervals for ROC analysis, where each step size is 0.1. You do not need to specify this option when you specify an interval-type response variable in the TARGET statement. By default, NCUTS=100.","help":"NCUTS=*integer*","type":"value"},{"name":"SELECTIONDEPTH=","optional":true,"description":"specifies the depth to use in lift calculations, where integer is an integer greater than or equal to 1 and less than or equal to 100. By default, SELECTIONDEPTH=10.","help":"SELECTIONDEPTH=*integer*","type":"value"}]},{"name":"FITSTAT","description":"The FITSTAT statement reports the statistical metrics that are related to lift analysis and ROC analysis that the ASSESS procedure performs. This statement is required when the target is nominal.","help":"FITSTAT  PVAR=*variables* / PEVENT=*\"event-list\"*&lt;options&gt;;                                              ","arguments":[{"name":"PEVENT=","description":"specifies the events that correspond to each variable in the PVAR= option. The \"event-list\" cannot include the event that corresponds to the variable in the TARGET statement. The \"event-list\" is case-sensitive, and missing values are not allowed. You must specify the PEVENT= and PVAR= options the same number of times and in the same order. The maximum length of \"event-list\" is 5,000 characters.","help":"PEVENT=*\"event-list\"*","type":"value"},{"name":"PVAR=","description":"specifies the posterior probability for each level in model prediction except the variable that you specify in the INPUT statement. Duplicate variables are not allowed.","help":"PVAR=*variables*","type":"value"},{"name":"DELIMITER=","optional":true,"followsDelimiter":"/","aliases":["DLM="],"description":"specifies the delimiter that is used to separate events that you specify in the PEVENT= option. A delimiter is used when event names contain embedded spaces (such as \"Fuel Oil\") or special characters (such as \";\" or \"*\"). You must use quotation marks around character. You can specify only one delimiter; combinations of delimiters are not supported. The valid values of the DELIMITER= option are \" \" (space), \";\" (semicolon), \"*\" (asterisk), \".\" (period), and \",\" (comma). By default, DELIMITER=\" \" (space). If you specify a delimiter other than \" \", PROC ASSESSBIAS treats any spaces (including empty spaces) as valid characters. You are responsible for mapping events correctly in order to obtain correct results.","help":"DELIMITER=*\"character\"*","type":"value"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the input data table that contains the frequency of occurrence of each observation. PROC ASSESSBIAS treats each observation as if it appears f times, where f is the value of the FREQ variable for the observation. If f is not an integer, it is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When you omit the FREQ statement, each observation is assigned a frequency of 1.","help":"FREQ  variable;                                              "},{"name":"INPUT","description":"The INPUT statement specifies the name of one variable to be analyzed in model assessment. When you specify a nominal variable in the TARGET statement, variable is the posterior probability of the event to be analyzed. When you specify an interval-type variable, variable is the predicted value.","help":"INPUT variable;                                              \nVAR variable;                     "},{"name":"SENSITIVEVAR","description":"The SENSITIVEVAR statement specifies the sensitive variable in modeling. Only one sensitive variable is accepted.","help":"SENSITIVEVAR  variable &lt;/options&gt;;                                              ","arguments":[{"name":"REFERENCELEVEL=","optional":true,"followsDelimiter":"/","description":"specifies the base level of the sensitive variable to be compared with. If you omit this option, PROC ASSESSBIAS reports the maximum pairwise difference among all levels of the sensitive variable. If you specify this option, PROC ASSESSBIAS reports the maximum pairwise difference between the specified reference level and all other levels of the sensitive variable.","help":"REFERENCELEVEL=*\"string\"*","type":"value"}]},{"name":"TARGET","description":"The TARGET statement specifies the response variable in supervised learning","help":"TARGET  variable &lt;/options&gt;;                                              ","arguments":[{"name":"EVENT=","optional":true,"followsDelimiter":"/","description":"specifies the string formatted value of the response variable that represents the event. For an interval target (LEVEL=INTERVAL), the EVENT= option is ignored. For a nominal target (LEVEL=NOMINAL), the EVENT= option is required.","help":"EVENT=\"*string*\"","type":"value"},{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"specifies the variable type. By default, LEVEL=INTERVAL.","help":"LEVEL=INTERVAL | NOMINAL","type":"choice","arguments":[{"name":"INTERVAL","followsDelimiter":"/","description":"specifies that the response variable is interval, which must be numeric.","type":"standalone"},{"name":"NOMINAL","followsDelimiter":"/","description":"specifies that the response variable is nominal, also known as a classification variable, which can be numeric or character.","type":"standalone"}]}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of ROC information and fit statistics. If specified, the WEIGHT statement is ignored in lift analysis. If you analyze ROC information and fit statistics, nonpositive or missing weights are ignored in the analysis. When you omit the WEIGHT statement, all observations that are used in the analysis are assigned a weight of 1.","help":"WEIGHT *variable*;                                              "}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"latest","docsetTargetFile":"casml_assessbias_toc.htm"}}