{"name":"BINNING","statements":[{"name":"PROC BINNING","description":"Binning is a common step in the data preparation stage of the model-building process. You can use binning to classify missing variables, reduce the impact of outliers, and generate multiple effects. The generated effects are useful and contain certain nonlinear information about the original interval variables. The BINNING procedure supports a few binning methods that are described in the following subsections. The BINNING procedure can also calculate the weight of evidence (WOE) and information value (IV) based on binning results.","help":"PROC BINNING <DATA=CAS-libref.data-table> <METHOD=BUCKET | QUANTILE | WINSOR(RATE=)... > <NTHREADS=number-of-threads> <NUMBIN=integer> <WOE(WOEADJUST=number)>;     \n\tCODE <FILE= filename> ;\n    \n\tFREQ variable ;\n    \n\tINPUT <NUMBIN=integer> ;\n    \n\tOUTPUT <COPYVAR=variable | COPYVARS=(variables)> <OUT=CAS-libref.data-table> ;\n    \n\tTARGET <EVENT=“category”> ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC BINNING to use. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"METHOD=","optional":true,"description":"Specifies which binning method to use. You can specify one of the following methods:","help":"METHOD=BUCKET | QUANTILE | WINSOR(RATE=) | CUTPTS(NUMLIST=)","type":"choice","arguments":[{"name":"BUCKET","description":"Specifies the bucket binning method.","type":"standalone"},{"name":"QUANTILE","description":"Specifies the quantile binning method.","type":"standalone"},{"name":"WINSOR","description":"Specifies the Winsorized binning method and the rate that it uses. The range of the RATE= suboption is between 0 and 0.5, exclusive.","help":"WINSOR(RATE=)","type":"value"},{"name":"CUTPTS","description":"Specifies the cut-points binning method and the bin lower and upper bounds.","help":"CUTPTS(NUMLIST=)","type":"value"}]},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads to be used. The default is the CPU count on each node. The number of threads can be specified between 1 and 64, inclusive.","help":"NTHREADS=*number-of-threads*","type":"value"},{"name":"NUMBIN=","optional":true,"description":"Specifies the global number of binning levels for all binning variables. The value of integer can be any integer between 2 and 1,000, inclusive.","help":"NUMBIN=*integer*","type":"value"},{"name":"WOE=","optional":true,"description":"Enables computation of the weight of evidence and information values. WOEADJUST specifies the adjustment factor which is between 0 and 1, inclusive, for the weight- of-evidence calculation.","help":"WOE=WOEADJUST=","type":"choice","arguments":[{"name":"WOEADJUST=","type":"value"}]}]},{"name":"CODE","description":"The CODE statement generates score code and stores it in a file that can be used for scoring purposes. Only one CODE statement is processed. If you specify multiple CODE statements, only the first one is used. You must specify the following option: FILE=filename specifies the filename of the file to write the SAS score code to.","help":"CODE &lt;FILE= filename&gt; ","arguments":[{"name":"FILE=","optional":true,"description":"Specifies the filename of the file to write the SAS score code to.","type":"value"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. PROC BINNING treats each observation as if it appears f times, where f is the value of the FREQ variable for the observation. If f is not an integer, it is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable "},{"name":"INPUT","description":"The INPUT statement names one or more variables as input variables for binning. The specified variables must be interval variables. If classification variables are provided, PROC BINNING stops with an error message. PROC BINNING does not support duplicate variables. If the INPUT statement contains a duplicate variable, PROC BINNING takes only the first variable and provides a warning message.","help":"INPUT &lt;NUMBIN=integer&gt; ","arguments":[{"name":"NUMBIN=","optional":true,"followsDelimiter":"/","description":"Specifies the number of binning levels for all binning variables in the current INPUT statement. The value of integer can be any integer between 2 and 1,000, inclusive.","help":"NUMBIN=*integer*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement enables you to write an output table back to the CAS server by creating an output data table that contains the results of PROC BINNING. If you do not specify the OUTPUT statement, the write-back process is skipped. This is useful when you want only the ODS output. By default, the output table contains the new binned variables. If you specify the COPYVARS= option, the output table contains the “copied variables” and the “binned variables.” NOTE: If an input variable value is missing, then the binning output level value is 0.","help":"OUTPUT &lt;COPYVAR=variable | COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; ","arguments":[{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Lists one or more variables from the input data table to be transferred to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"names the output data table for PROC BINNING to use. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"TARGET","description":"The TARGET statement names the variable that PROC BINNING uses to calculate the weight of evidence and information value.","help":"TARGET &lt;EVENT=“category”&gt; ","arguments":[{"name":"EVENT=","optional":true,"followsDelimiter":"/","description":"Specifies the target event category that PROC BINNING uses to calculate the weight of evidence and information value in a quoted string of characters.","type":"value"}]}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"v_023","docsetTargetFile":"casstat_binning_toc.htm"}}