{"name":"BOOLRULE","statements":[{"name":"PROC BOOLRULE","description":"The BOOLRULE procedure is a SAS Viya procedure that enables you to extract Boolean rules from large-scale transactional data. † The BOOLRULE procedure can automatically generate a set of Boolean rules by analyzing a text corpus that has been processed by the TEXTMINE procedure and is represented in a transactional format.","help":"PROC BOOLRULE <DATA=CAS-libref.data-table | DOC=CAS-libref.data-table> <DOCID=variable> <DOCINFO=CAS-libref.data-table> <GNEG=g-value> <GPOS=g-value> <MAXCANDIDATES=n | MAXCANDS=n> <MAXTRIESIN=n> <MAXTRIESOUT=n> <MINSUPPORTS=n> <MNEG=m> <MPOS=m> <TERMID=variable> <TERMINFO=CAS-libref.data-table>;     \n\tDOCINFO <EVENTS=(value1, value2, ...)> <ID=variable> <TARGET=(variable, variable, ...)> ...;\n    \n\tOUTPUT <CANDIDATETERMS=CAS-libref.data-table> <RULES=CAS-libref.data-table> <RULETERMS=CAS-libref.data-table> ...;\n    \n\tSCORE <OUTMATCH=CAS-libref.data-table> <RULETERMS=CAS-libref.data-table> ;\n    \n\tTERMINFO <ID=variable> <LABEL=variable> ;\n","arguments":[{"name":"DATA=","optional":true,"aliases":["DOC="],"description":"Names the input data table for PROC BOOLRULE to use. CAS-libref.data-table is a two-level name, where","type":"value"},{"name":"DOCID=","optional":true,"description":"Specifies the variable that contains the ID of each document. The document ID can be either a number or a string of characters.","help":"DOCID=*variable*","type":"value"},{"name":"DOCINFO=","optional":true,"description":"Names the input data table that contains information about documents. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"DOCINFO=*CAS-libref.data-table*","type":"dataSet"},{"name":"GNEG=","optional":true,"description":"Specifies the minimum g-score needed for a negative term to be considered for rule extraction in the term ensemble. If you do not specify this option, the value that is specified for the GPOS= option (or its default value) is used.","help":"GNEG=*g-value*","type":"value"},{"name":"GPOS=","optional":true,"description":"Specifies the minimum g-score needed for a positive term to be considered for rule extraction in the term ensemble. A rule also needs to have a g-score that is higher than g-value to be considered in the rule ensemble. The g-value is also used in the improvability test. A rule is improvable if the g-score that is computed according to the improvability test is larger than g-value. By default, GPOS=8.","help":"GPOS=*g-value*","type":"value"},{"name":"MAXCANDIDATES=","optional":true,"aliases":["MAXCANDS="],"description":"Specifies the number of term candidates to be selected for each category. Rules are built by using only these term candidates. By default, MAXCANDS=500.","type":"value"},{"name":"MAXTRIESIN=","optional":true,"description":"Specifies the k-in value for the k-best search in the term ensemble process for creating rules.","help":"MAXTRIESIN=*n*","type":"value"},{"name":"MAXTRIESOUT=","optional":true,"description":"Specifies the k-out value for the k-best search in the rule ensemble process for creating a rule set.","help":"MAXTRIESOUT=*n*","type":"value"},{"name":"MINSUPPORTS=","optional":true,"description":"Specifies the minimum number of documents in which a term needs to appear in order for the term to be used for creating a rule. By default, MINSUPPORTS=3.","help":"MINSUPPORTS=*n*","type":"value"},{"name":"MNEG=","optional":true,"description":"Specifies the m value for computing estimated precision for negative terms. If you do not specify this option, the value specified for the MPOS= option (or its default value) is used.","help":"MNEG=*m*","type":"value"},{"name":"MPOS=","optional":true,"description":"Specifies the m value for computing estimated precision for positive terms. By default, MPOS=8.","help":"MPOS=*m*","type":"value"},{"name":"TERMID=","optional":true,"description":"Specifies the variable that contains the ID of each term. The variable can be either a number or a string of characters. If the TERMINFO= option is not specified, variable is also used as the label of terms.","help":"TERMID=*variable*","type":"value"},{"name":"TERMINFO=","optional":true,"description":"Names the input data table that contains information about terms. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"TERMINFO=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"DOCINFO","description":"The DOCINFO statement specifies information about the data table that is specified in the DOCINFO= option in the PROC BOOLRULE statement.","help":"DOCINFO &lt;EVENTS=(value1, value2, ...)&gt; &lt;ID=variable&gt; &lt;TARGET=(variable, variable, ...)&gt; ...","arguments":[{"name":"EVENTS=","optional":true,"description":"Specifies the values of target variables that are considered as positive events or categories of interest as follows:","type":"value"},{"name":"ID=","optional":true,"description":"Specifies the variable that contains the document ID. To fetch the target information about documents, the values in the variable are matched to the document ID variable that is specified in the DOCID= option in the PROC BOOLRULE statement.","help":"ID=*variable*","type":"value"},{"name":"TARGET=","optional":true,"description":"Specifies the target variables. A target variable can be either a numeric variable or a character variable.","type":"value"},{"name":"TARGETTYPE=","optional":true,"description":"Specifies the type of the target variables.","help":"TARGETTYPE=BINARY | MULTICLASS","type":"choice","arguments":[{"name":"BINARY","description":"Indicates that multiple target variables can be specified and each target variable corresponds to a category.","type":"standalone"},{"name":"MULTICLASS","description":"Indicates that only one target variable can be specified and each level of the target variable corresponds to a category.","type":"standalone"}]}]},{"name":"OUTPUT","description":"The OUTPUT statement specifies the data tables that contain the results that the BOOLRULE procedure generates.","help":"OUTPUT &lt;CANDIDATETERMS=CAS-libref.data-table&gt; &lt;RULES=CAS-libref.data-table&gt; &lt;RULETERMS=CAS-libref.data-table&gt; ...","arguments":[{"name":"CANDIDATETERMS=","optional":true,"description":"Specifies a data table to contain the terms that have been selected by the BOOLRULE procedure for rule creation. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"CANDIDATETERMS=*CAS-libref.data-table*","type":"dataSet"},{"name":"RULES=","optional":true,"description":"Specifies a data table to contain the rules that have been generated by the BOOLRULE procedure for each category. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"RULES=*CAS-libref.data-table*","type":"dataSet"},{"name":"RULETERMS=","optional":true,"description":"Specifies a data table to contain the terms in each rule that is generated by the BOOLRULE procedure. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"RULETERMS=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"SCORE","description":"The SCORE statement specifies the input data table that contains the terms in rules and the output data table to contain the scoring results.","help":"SCORE &lt;OUTMATCH=CAS-libref.data-table&gt; &lt;RULETERMS=CAS-libref.data-table&gt; ","arguments":[{"name":"OUTMATCH=","optional":true,"description":"Specifies a data table to contain the rule-matching results (that is, whether a document satisfies a rule). CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTMATCH=*CAS-libref.data-table*","type":"dataSet"},{"name":"RULETERMS=","optional":true,"description":"Specifies a data table that contains the terms in each rule that the BOOLRULE procedure generates. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"RULETERMS=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"TERMINFO","description":"The TERMINFO statement specifies information about the data table that is specified in the TERMINFO= option in the PROC BOOLRULE statement. If you specify the TERMINFO= data table in the PROC BOOLRULE statement, you must also include this statement to specify which variables in the data table contain the term ID and the term label, respectively.","help":"TERMINFO &lt;ID=variable&gt; &lt;LABEL=variable&gt; ","arguments":[{"name":"ID=","optional":true,"description":"Specifies the variable that contains the term ID. To fetch the text of terms, the values in variable are matched to the term ID variable that is specified in the TERMID= option in the PROC BOOLRULE statement. The variable can be either a numeric variable or a character variable. Its type must match the type of the variable that is specified in the TERMID= option in the PROC BOOLRULE statement.","help":"ID=*variable*","type":"value"},{"name":"LABEL=","optional":true,"description":"Specifies the variable that contains the text of the terms, where variable must be a character variable.","help":"LABEL=*variable*","type":"value"}]}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"v_016","docsetTargetFile":"casml_boolrule_toc.htm"}}