{"name":"CANCORR","statements":[{"name":"PROC CANCORR","description":"The CANCORR procedure performs canonical correlation, partial canonical correlation, and canonical redundancy analysis. † Canonical correlation is a generalization of multiple correlation for analyzing the relationship between two sets of variables. In multiple correlation, you examine the relationship between a linear combination of a set of explanatory variables, X, and a single response variable, Y. In canonical correlation, you examine the relationship between linear combinations of the set of X variables and linear combinations of a set of Y variables. These linear combinations are called canonical variables or canonical variates. Either set of variables can be considered explanatory or response variables, since the statistical model is symmetric in the two sets of variables. Simple and multiple correlation are special cases of canonical correlation in which one or both sets contain a single variable.","help":"PROC CANCORR <ALL> <B> <CLB> <CORRB> <CORR> <DATA=SAS-data-set> <EDF=error-df> <INT> <MSTAT=FAPPROX | EXACT> <NCAN=number> <NOINT> <NOPRINT> <OUT=SAS-data-set> <OUTSTAT=SAS-data-set> <PARPREFIX=name> <PCORR> <PROBT> <RDF=regression-df> <REDUNDANCY> <SEB> <SHORT> <SIMPLE> <SINGULAR=p> <SMC> <SPCORR> <SQPCORR> <SQSPCORR> <STB> <T> <VDEP> <VNAME=label> <VPREFIX=name> <WDEP> <WNAME=label> <WPREFIX=name>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tFREQ variable;\n    \n\tPARTIAL variables ;\n    \n\tVAR;\n    \n\tWEIGHT variable;\n    \n\tWITH variables ;\n","arguments":[{"name":"ALL","optional":true,"description":"Displays simple statistics, correlations among the input variables, the confidence limits for the regression coefficients, and the canonical redundancy analysis.","type":"standalone"},{"name":"B","optional":true,"description":"Produces raw regression coefficients from the regression analyses.","type":"standalone"},{"name":"CLB","optional":true,"description":"Produces the 95% confidence limits for the regression coefficients from the regression analyses.","type":"standalone"},{"name":"CORRB","optional":true,"description":"Produces correlations among the regression coefficient estimates.","type":"standalone"},{"name":"CORR","optional":true,"description":"Produces correlations among the original variables.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be analyzed by PROC CANCORR.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"EDF=","optional":true,"description":"Specifies the error degrees of freedom if the input observations are residuals from a regression analysis.","help":"EDF=*error-df*","type":"value"},{"name":"INT","optional":true,"description":"Requests that statistics for the intercept be included when B, CLB, SEB, T, or PROBT is specified for the regression analyses.","type":"standalone"},{"name":"MSTAT=","optional":true,"description":"Specifies the method of evaluating the multivariate test statistics.","help":"MSTAT=FAPPROX | EXACT","type":"choice","arguments":[{"name":"FAPPROX","description":"Specifies that the multivariate tests are evaluated using the usual approximations based on the F distribution.","type":"standalone"},{"name":"EXACT","description":"Computes exact p-values for three of the four tests (Wilks’ lambda, the Hotelling-Lawley trace, and Roy’s greatest root) and an improved F approximation for the fourth (Pillai’s trace).","type":"standalone"}]},{"name":"NCAN=","optional":true,"description":"Specifies the number of canonical variables for which full output is desired.","help":"NCAN=*number*","type":"value"},{"name":"NOINT","optional":true,"description":"Omits the intercept from the canonical correlation and regression models.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output. Note that this option temporarily disables the Output Delivery System (ODS).","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set to contain all the original data plus scores on the canonical variables.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Creates an output SAS data set containing various statistics, including the canonical correlations and coefficients and the multiple regression statistics you request.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PARPREFIX=","optional":true,"aliases":["PREFIX="],"description":"Specifies a prefix for naming the residual variables in the OUT= data set and the OUTSTAT= data set.","help":"PARPREFIX=*name*","type":"value"},{"name":"PCORR","optional":true,"description":"Produces partial correlations between regressors and dependent variables, removing from each dependent variable and regressor the effects of all other regressors.","type":"standalone"},{"name":"PROBT","optional":true,"description":"Produces probability levels for the t statistics in the regression analyses.","type":"standalone"},{"name":"RDF=","optional":true,"description":"Specifies the regression degrees of freedom if the input observations are residuals from a regression analysis.","help":"RDF=*regression-df*","type":"value"},{"name":"REDUNDANCY","optional":true,"aliases":["RED"],"description":"Produces canonical redundancy statistics.","type":"standalone"},{"name":"SEB","optional":true,"description":"Produces standard errors of the regression coefficients.","type":"standalone"},{"name":"SHORT","optional":true,"description":"Suppresses all default output from the canonical analysis except the tables of canonical correlations and multivariate statistics.","type":"standalone"},{"name":"SIMPLE","optional":true,"description":"Produces means and standard deviations.","type":"standalone"},{"name":"SINGULAR=","optional":true,"aliases":["SING="],"description":"Specifies the singularity criterion, where 0 < p < 1.","help":"SINGULAR=*p*","type":"value"},{"name":"SMC","optional":true,"description":"Produces squared multiple correlations and F tests for the regression analyses.","type":"standalone"},{"name":"SPCORR","optional":true,"description":"Produces semipartial correlations between regressors and dependent variables, removing from each regressor the effects of all other regressors.","type":"standalone"},{"name":"SQPCORR","optional":true,"description":"Produces squared partial correlations between regressors and dependent variables, removing from each dependent variable and regressor the effects of all other regressors.","type":"standalone"},{"name":"SQSPCORR","optional":true,"description":"Produces squared semipartial correlations between regressors and dependent variables, removing from each regressor the effects of all other regressors.","type":"standalone"},{"name":"STB","optional":true,"description":"Produces standardized regression coefficients.","type":"standalone"},{"name":"T","optional":true,"description":"Produces t statistics for the regression coefficients.","type":"standalone"},{"name":"VDEP","optional":true,"aliases":["WREG"],"description":"Requests multiple regression analyses with the VAR variables as dependent variables and the WITH Variables as regressors.","type":"standalone"},{"name":"VNAME=","optional":true,"aliases":["VN="],"description":"Specifies a character constant to refer to variables from the VAR statement in the output. Enclose the constant in single or double quotes.","help":"VNAME=*label*","type":"value"},{"name":"VPREFIX=","optional":true,"description":"Specifies a prefix for naming canonical variables from the VAR statement.","help":"VPREFIX=*name*","type":"value"},{"name":"WDEP","optional":true,"aliases":["VREG"],"description":"Requests multiple regression analyses with the WITH variables as dependent variables and the VAR variables as regressors.","type":"standalone"},{"name":"WNAME=","optional":true,"aliases":["WN="],"description":"Specifies a character constant to refer to variables in the WITH statement in the output. Enclose the constant in single or double quotes.","help":"WNAME=*label*","type":"value"},{"name":"WPREFIX=","optional":true,"aliases":["WP="],"description":"Specifies a prefix for naming canonical variables from the WITH statement.","help":"WPREFIX=*name*","type":"value"}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"If one variable in your data set represents the frequency of occurrence for the other values in the observation, specify the variable’s name in a FREQ statement. PROC CANCORR then treats the data set as if each observation appears ni times, where ni is the value of the FREQ variable for observation i.","help":"FREQ variable"},{"name":"PARTIAL","description":"You can use the PARTIAL statement to base the canonical analysis on partial correlations.","help":"PARTIAL variables "},{"name":"VAR","aliases":["VARIABLES"],"description":"VAR variable(s); The VAR statement lists the variables in the first of the two sets of variables to be analyzed. The variables must be numeric.","help":"VAR"},{"name":"WEIGHT","aliases":["WEIGHTS"],"description":"If you want to compute weighted product-moment correlation coefficients, specify the name of the weighting variable in a WEIGHT statement.","help":"WEIGHT variable"},{"name":"WITH","description":"The WITH statement lists the variables in the second set of variables to be analyzed. The variables must be numeric. The WITH statement is required.","help":"WITH variables "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_019","docsetTargetFile":"statug_cancorr_toc.htm"}}