{"name":"CATMOD","statements":[{"name":"PROC CATMOD","description":"The CATMOD procedure performs categorical data modeling of data that can be represented by a contingency table. PROC CATMOD fits linear models to functions of response frequencies, and it can be used for linear modeling, log-linear modeling, logistic regression, and repeated measurement analysis. PROC CATMOD uses the following estimation methods: † o weighted least squares (WLS) estimation of parameters for a wide range of general linear models † o maximum likelihood (ML) estimation of parameters for log-linear models and the analysis of generalized logits † The CATMOD procedure provides a wide variety of categorical data analyses, many of which are generalizations of continuous data analysis methods. For example, analysis of variance, in the traditional sense, refers to the analysis of means and the partitioning of variation among the means into various sources. Here, the term analysis of variance is used in a generalized sense to denote the analysis of response functions and the partitioning of variation among those functions into various sources. The response functions might be mean scores if the dependent variables are ordinally scaled. But they can also be marginal probabilities, cumulative logits, or other functions that incorporate the essential information from the dependent variables. † Note:PROC CATMOD specializes in WLS modeling and analysis of a wide range of models on contingency tables. For ML modeling on standard models, especially with continuous predictors, it might be more appropriate to use a procedure such as PROC GENMOD or PROC LOGISTIC.","help":"PROC CATMOD <DATA=SAS-data-set> <NAMELEN=n> <NOPRINT> <ORDER=DATA | FORMATTED | FREQ... >;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCONTRAST <ALPHA=value> <ESTIMATE=<PARM | EXP | BOTH>> ; \n   \n\tDIRECT variables ;     \n\tFACTORS <PROFILE=(matrix)> <_RESPONSE_=effects> ; \n   \n\tLOGLIN <TITLE=’title’> ; \n   \n\tMODEL <ADDCELL=number> <ALPHA=number> <AVERAGED> ...; \n   \n\tPOPULATION variables ;     \n\tREPEATED <PROFILE=(matrix)> <TITLE=’title’> <_RESPONSE_=effects> ...; \n   \n\tRESPONSE <ALOGIT> <CLOGIT> <JOINT> ...; \n   \n\tRESTRICT parameter=value < parameter=value> ;     \n\tWEIGHT variable; ","arguments":[{"name":"DATA=","optional":true,"description":"Names the SAS data set containing the data to be analyzed.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length of effect names in tables and output data sets to be n characters long, where n is a value between 24 and 200. The default length is 24 characters.","help":"NAMELEN=*n*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Orders the values of a group, order, or across variable according to the specified order.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CONTRAST","description":"where a row-description is defined as follows: <@n> effect values < <@n> effect values > The CONTRAST statement constructs and tests linear functions of the parameters in the MODEL statement or effects listed in the LOGLIN statement.","help":"CONTRAST &lt;ALPHA=value&gt; &lt;ESTIMATE=&lt;PARM | EXP | BOTH&gt;&gt; ","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the significance level of the confidence interval for each contrast when the ESTIMATE= option is specified. The default is ALPHA=0.05, resulting in a 95% confidence interval for each contrast.","help":"ALPHA=*value*","type":"value"},{"name":"ESTIMATE=","optional":true,"followsDelimiter":"/","description":"Requests that each individual contrast or exponentiated contrast be estimated and tested.","help":"ESTIMATE=PARM | EXP | BOTH","type":"choice","arguments":[{"name":"PARM","followsDelimiter":"/","description":"Specifies that the contrast itself be estimated.","type":"standalone"},{"name":"EXP","followsDelimiter":"/","description":"Specifies that the exponentiated contrast be estimated.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Specifies that both the contrast and the exponentiated contrast be estimated.","type":"standalone"}]}]},{"name":"DIRECT","description":"The DIRECT statement lists numeric independent variables to be treated in a quantitative, rather than qualitative, way. The DIRECT statement is useful for logistic regression.","help":"DIRECT variables "},{"name":"FACTORS","aliases":["FACTOR","REPEATED"],"description":"where a factor-description is defined as follows: factor-name <$><levels> and factor-descriptions are separated from each other by a comma. The $ is required for character-valued factors. The value of levels provides the number of levels of the factor identified by a given factor-name. For only one factor, levels is optional; for two or more factors, it is required. The FACTORS statement identifies factors that distinguish response functions from others in the same population.","help":"FACTORS &lt;PROFILE=(matrix)&gt; &lt;_RESPONSE_=effects&gt; ","arguments":[{"name":"PROFILE=","optional":true,"followsDelimiter":"/","description":"Specifies the values assumed by the factors for each response function.","type":"value"},{"name":"_RESPONSE_=","optional":true,"followsDelimiter":"/","description":"Specifies design effects. The variables named in the effects must be factor-names that appear in the FACTORS statement.","help":"_RESPONSE_=*effects*","type":"value"}]},{"name":"LOGLIN","description":"The LOGLIN statement is used to define log-linear model effects. It can be used whenever the default response functions (generalized logits) are used.","help":"LOGLIN &lt;TITLE=’title’&gt; ","arguments":[{"name":"TITLE=","optional":true,"followsDelimiter":"/","description":"Displays the title at the top of certain pages of output that correspond to this LOGLIN statement.","type":"value"}]},{"name":"MODEL","description":"","help":"MODEL &lt;ADDCELL=number&gt; &lt;ALPHA=number&gt; &lt;AVERAGED&gt; ...","arguments":[{"name":"ADDCELL=","optional":true,"followsDelimiter":"/","description":"Adds number to the frequency count in each cell, where number is any positive number.","help":"ADDCELL=*number*","type":"value"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Sets the significance level for the Wald confidence intervals for parameter estimates. The value must be between 0 and 1. The default value of 0.05 results in the calculation of a 95% confidence interval.","help":"ALPHA=*number*","type":"value"},{"name":"AVERAGED","optional":true,"followsDelimiter":"/","description":"Specifies that dependent variable effects can be modeled and that independent variable main effects are averaged across the response functions in a population.","type":"standalone"},{"name":"CLPARM","optional":true,"followsDelimiter":"/","description":"Produces Wald confidence limits for the parameter estimates. The confidence coefficient can be specified with the ALPHA= option.","type":"standalone"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the parameter estimates.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays Si, which is the covariance matrix of the response functions for each population.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the parameter estimates.","type":"standalone"},{"name":"DESIGN","optional":true,"followsDelimiter":"/","description":"Displays the design matrix X for WLS and ML analyses, and also displays the _RESPONSE_ matrix for log-linear models.","type":"standalone"},{"name":"EPSILON=","optional":true,"followsDelimiter":"/","description":"Specifies the convergence criterion for the maximum likelihood estimation of the parameters.","help":"EPSILON=*number*","type":"value"},{"name":"FREQ","optional":true,"followsDelimiter":"/","description":"Produces the two-way frequency table for the cross-classification of populations by responses.","type":"standalone"},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"Displays parameter estimates and other information at each iteration of a maximum likelihood analysis.","type":"standalone"},{"name":"MAXITER=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of iterations used for the maximum likelihood estimation of the parameters. By default, MAXITER=20.","help":"MAXITER=*number*","type":"value"},{"name":"MISSING=","optional":true,"followsDelimiter":"/","aliases":["MISS="],"description":"Specifies whether a missing cell is treated as a sampling or structural zero.","help":"MISSING=STRUCTURAL | SAMPLING | &lt;*value*&gt;","type":"choice","arguments":[{"name":"STRUCTURAL","followsDelimiter":"/","description":"Structural zeros for one population; sampling zeros for multiple populations. This is the default.","type":"standalone"},{"name":"SAMPLING","followsDelimiter":"/","aliases":["SAMP"],"description":"Sampling zeros for one or multiple populations.","type":"standalone"},{"name":"value","placeholder":true,"followsDelimiter":"/","description":"Sets missing weights and cells to value for one or multiple populations.","type":"standaloneOrValue"}]},{"name":"ML=","optional":true,"followsDelimiter":"/","description":"Computes maximum likelihood estimates (MLE) by using either a Newton-Raphson algorithm (NR) or an iterative proportional fitting algorithm (IPF). You can specify the following ipf-options within parentheses after the ML=IPF option. CONVCRIT=keyword specifies the method that determines when convergence of the IPF algorithm occurs. You can specify one of the following keywords: CELL termination requires the maximum absolute difference between consecutive cell estimates to be less than 0.001 (or the value of the EPSILON= option, if specified). LOGL termination requires the relative difference between consecutive estimates of the log likelihood to be less than 1E–8 (or the value of the EPSILON= option, if specified). This is the default. MARGIN termination requires the maximum absolute difference between consecutive margin estimates to be less than 0.001 (or the value of the EPSILON= option, if specified). DF=keyword specifies the method used to compute the degrees of freedom for the goodness-of-fit G-square test . You can specify one of the following keywords: UNADJ computes the unadjusted degrees of freedom as nc-np. ADJ computes the degrees of freedom as (nc-np)-(nz-nn). ADJEST computes the degrees of freedom as , which adjusts for fitted zeros only.","help":"ML=NR | IPF","type":"choice","arguments":[{"name":"NR","followsDelimiter":"/","description":"Computes maximum likelihood estimates (MLE) by using a Newton-Raphson algorithm (NR). This option is available when you use generalized logits, and also when you perform binary logistic regression with logits, cumulative logits, or adjacent category logits.","type":"standalone"},{"name":"IPF","followsDelimiter":"/","description":"[Syntax: IPF<(ipf-options)>] Computes maximum likelihood estimates (MLE) by using an iterative proportional fitting algorithm (IPF). This option is available for fitting a hierarchical log-linear model with one population (no independent variables and no population variables).","type":"standalone"}]},{"name":"NODESIGN","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the design matrix X when the DESIGN option is also specified. This enables you to display only the _RESPONSE_ matrix for log-linear models.","type":"standalone"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Suppresses the intercept term in the model.","type":"standalone"},{"name":"NOITER","optional":true,"followsDelimiter":"/","description":"Suppresses the display of parameter estimates and other information at each iteration of a maximum likelihood analysis.","type":"standalone"},{"name":"NOPARM","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the estimated parameters and the statistics for testing that each parameter is zero.","type":"standalone"},{"name":"NOPREDVAR","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the variable levels in tables requested with the PRED= option and in the \"Estimates\" table. Population profiles are replaced with the sample number, classification variable levels are suppressed, and response profiles are replaced with a function number.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses the normal display of results. The NOPRINT option is useful when you only want to create output data sets with the OUT= or OUTEST= option in the RESPONSE statement.","type":"standalone"},{"name":"NOPROFILE","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the population profiles and the response profiles.","type":"standalone"},{"name":"NORESPONSE","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the _RESPONSE_ matrix for log-linear models when the DESIGN option is also specified. This enables you to display only the design matrix for log-linear models.","type":"standalone"},{"name":"ONEWAY","optional":true,"followsDelimiter":"/","description":"Produces a one-way table of frequencies for each variable used in the analysis. This table is useful in determining the order of the observed levels for each variable.","type":"standalone"},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | REFERENCE","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Uses the EFFECT parameterization method","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","description":"Uses the REFERENCE parameterization method","type":"standalone"}]},{"name":"PREDICT=","optional":true,"followsDelimiter":"/","aliases":["PRED="],"description":"Displays the observed and predicted values of the response functions for each population, together with their standard errors and the residuals (observed minus predicted).","help":"PREDICT=FREQ | PROB","type":"choice","arguments":[{"name":"FREQ","followsDelimiter":"/","description":"Specifies the computation and display of predicted cell frequencies","type":"standalone"},{"name":"PROB","followsDelimiter":"/","description":"Specifies the computation and display of predicted cell probabilities.","type":"standalone"}]},{"name":"PROB","optional":true,"followsDelimiter":"/","description":"Produces the two-way table of probability estimates for the cross-classification of populations by responses. These estimates sum to one across the response categories for each population.","type":"standalone"},{"name":"PROFILE","optional":true,"followsDelimiter":"/","description":"Displays all of the population profiles. If you have more than 60 populations, then by default only the first 40 profiles are displayed; the PROFILE option overrides this default behavior.","type":"standalone"},{"name":"TITLE=","optional":true,"followsDelimiter":"/","description":"Displays the title at the top of certain pages of output that correspond to this MODEL statement.","type":"value"},{"name":"WLS","optional":true,"followsDelimiter":"/","aliases":["GLS"],"description":"Computes weighted least squares estimates.","type":"standalone"},{"name":"XPX","optional":true,"followsDelimiter":"/","description":"Displays X'S⁻¹X, the crossproducts matrix for the normal equations.","type":"standalone"},{"name":"ZERO=","optional":true,"followsDelimiter":"/","description":"Specifies whether a missing cell is treated as a sampling or structural zero.","help":"ZERO=STRUCTURAL | SAMPLING | &lt;*value*&gt;","type":"choice","arguments":[{"name":"STRUCTURAL","followsDelimiter":"/","description":"Structural zeros for one population; sampling zeros for multiple populations.","type":"standalone"},{"name":"SAMPLING","followsDelimiter":"/","aliases":["SAMP"],"description":"Sampling zeros for one or multiple populations.","type":"standalone"},{"name":"value","placeholder":true,"followsDelimiter":"/","description":"Sets zero weights to value for one or multiple populations.","type":"standaloneOrValue"}]}]},{"name":"POPULATION","description":"The POPULATION statement specifies that populations are to be based only on cross-classifications of the specified variables.","help":"POPULATION variables "},{"name":"REPEATED","description":"where a factor-description is defined as follows: factor-name <$><levels> and factor-descriptions are separated from each other by a comma. The $ is required for character-valued factors. The value of levels provides the number of levels of the repeated measurement factor identified by a given factor-name. For only one repeated measurement factor, levels is optional; for two or more repeated measurement factors, it is required. The REPEATED statement incorporates repeated measurement factors into the model.","help":"REPEATED &lt;PROFILE=(matrix)&gt; &lt;TITLE=’title’&gt; &lt;_RESPONSE_=effects&gt; ...","arguments":[{"name":"PROFILE=","optional":true,"followsDelimiter":"/","description":"Specifies the values assumed by the factors for each response function.","type":"value"},{"name":"TITLE=","optional":true,"followsDelimiter":"/","description":"Displays the title at the top of certain pages of output that correspond to this REPEATED statement.","type":"value"},{"name":"_RESPONSE_=","optional":true,"followsDelimiter":"/","description":"Specifies design effects. The variables named in the effects must be factor-names that appear in the REPEATED statement.","help":"_RESPONSE_=*effects*","type":"value"}]},{"name":"RESPONSE","description":"The RESPONSE statement specifies functions of the response probabilities. The procedure models these response functions as linear combinations of the parameters.","help":"RESPONSE &lt;ALOGIT&gt; &lt;CLOGIT&gt; &lt;JOINT&gt; ...","arguments":[{"name":"ALOGIT","optional":true,"followsDelimiter":"/","description":"Specifies response functions as adjacent-category logits of the marginal probabilities for each of the dependent variables.","type":"standalone"},{"name":"CLOGIT","optional":true,"followsDelimiter":"/","description":"Specifies that the response functions are cumulative logits of the marginal probabilities for each of the dependent variables.","type":"standalone"},{"name":"JOINT","optional":true,"followsDelimiter":"/","description":"Specifies that the response functions are the joint response probabilities. A linearly independent set is created by deleting the last response probability. For the case of one dependent variable, the JOINT and MARGINALS specifications are equivalent.","type":"standalone"},{"name":"LOGIT","optional":true,"followsDelimiter":"/","description":"Specifies that the response functions are generalized logits of the marginal probabilities for each of the dependent variables.","type":"standalone"},{"name":"MARGINAL","optional":true,"followsDelimiter":"/","description":"Specifies that the response functions are marginal probabilities for each of the dependent variables in the MODEL statement.","type":"standalone"},{"name":"MEAN","optional":true,"followsDelimiter":"/","description":"Specifies that the response functions are the means of the dependent variables in the MODEL statement. This specification requires that all of the dependent variables be numeric.","type":"standalone"},{"name":"OUT=","optional":true,"followsDelimiter":"/","description":"Produces a SAS data set that contains, for each population, the observed and predicted values of the response functions, their standard errors, and the residuals.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTEST=","optional":true,"followsDelimiter":"/","description":"Produces a SAS data set that contains the estimated parameter vector and its estimated covariance matrix.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"READ","optional":true,"followsDelimiter":"/","description":"Specifies that the response functions and their covariance matrix are to be read directly from the input data set with one response function for each variable named.","type":"standalone"},{"name":"TITLE=","optional":true,"followsDelimiter":"/","description":"Displays the title at the top of certain pages of output that correspond to this RESPONSE statement.","type":"value"}]},{"name":"RESTRICT","description":"where parameter is the letter B followed by a number; for example, B3 specifies the third parameter in the model. The value is the value to which the parameter is restricted. The RESTRICT statement restricts values of parameters to the values you specify, so that the estimation of the remaining parameters is subject to these restrictions.","help":"RESTRICT parameter=value &lt; parameter=value&gt; "},{"name":"WEIGHT","aliases":["WEIGHTS"],"description":"You can use a WEIGHT statement to refer to a variable containing the cell frequencies, which do not need to be integers. The WEIGHT statement lets you use summary data sets containing a count variable.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_017","docsetTargetFile":"statug_catmod_toc.htm"}}