{"name":"CCDM","statements":[{"name":"PROC CCDM","description":"In many loss modeling applications, the loss events are analyzed by modeling the severity (magnitude) of loss and the frequency (count) of loss separately. The primary goal of preparing these models is to estimate the aggregate loss—that is, the total loss that occurs over a period of time for which the frequency model is applicable. For example, an insurance company might want to assess the expected and worst-case losses for a particular business line, such as automobile insurance, over an entire year given the models for the number of losses in a year and the severity of each loss. A bank might want to assess the value-at-risk (VaR), a measure of the worst-case loss, for a portfolio of assets given the frequency and severity models for each asset type.","help":"PROC CCDM <ADJUSTEDSEVERITY=symbol-name | ADJSEV=symbol-name> <COUNTSTORE=SAS-item-store> <DATA=CAS-libref.data-table> <IGNOREPARMCOVARIANCE> <MAXCOUNTDRAW=number | MAXCOUNT=number> <NOPRINT> <NPERTURBEDSAMPLES=number | NPERTURB=number> <NREPLICATES=number | NREP=number> <OUTDRAW=CAS-libref.data-table | OUTSAMPLE=CAS-libref.data-table> <PCTLDEF=1 | 2 | 3... > <PRINT <(global-display-option)> =display-optionPRINT <(global-display-option)> =(display-option …display-option)> <SEED=number> <SEVERITYEST=CAS-libref.data-table> <SEVERITYSTORE=SAS-item-store | SEVSTORE=SAS-item-store> <VARDEF=divisor>;     \n\tABORT <ABEND> <CANCEL> <CANCEL FILE> ...;     \n\tARRAY <_ALL_> <_NUMERIC_> <_TEMPORARY_> ...; \n   \n\tATTRIB <FORMAT=format> <INFORMAT=informat> <LABEL='label'> ...; \n   \n\tBY variable-list;     \n\tCALL routine(parameter-1<, ...parameter-n>);     \n\tCONTINUE; \n   \n\tDELETE;     \n\tDESCRIBE; \n   \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...; \n   \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...; \n   \n\tDO <OVER> <> <> ...; \n   \n\t;     \n\t; \n   \n\tDROP variable-list;     \n\tELSE <DO> <IF> <THEN> ...; \n   \n\tEND;     \n\tENDRSUBMIT; \n   \n\tERROR <message>;     \n\tEXECUTE; \n   \n\tEXTERNALCOUNTS <COUNT=count-variable> <ID=replication-id-variable> ; \n   \n\tFILE <DISK> <DUMMY> <LOG> ...; \n   \n\tFORMAT <DEFAULT=default-format> ; \n   \n\tGO TO label | GOTO label;     \n\tIF <DO> <THEN> <WHEN> ...; \n   \n\tINFILE <DATALINES4> <DATALINES> <DISK> ...; \n   \n\tINFORMAT <DEFAULT= default-informat> ; \n   \n\tINPUT <specification(s)><@|@@>; \n   \n\tKEEP variable-list;     \n\t; \n   \n\tLEAVE;     \n\tLENGTH <DEFAULT=n> ; \n   \n\tLINK label;     \n\tLIST; \n   \n\tLOCK <CLEAR> <LIST> ; \n   \n\tMERGE <ALTER=> <BUFNO=<n | nK | hexX>... > <END=variable> ...; \n   \n\tMISSING character(s);     \n\tMODIFY <END=variable> <KEY=index> <NOBS=variable> ...; \n   \n\tOTHERWISE <DO> ; \n   \n\tOUTPUT ADJSAMPLEVAR=variable-name | ADJSAMPLEVAR=(variable-name <…variable-name>) OUT=CAS-libref.data-table | OUTSAMPLE=CAS-libref.data-table SAMPLEVAR=variable-name ...;     \n\tOUTSUM <KURTOSIS|KURT < =variable-name >> <MEAN < =variable-name >> <OUT=CAS-libref.data-table | OUTSUM=CAS-libref.data-table> ...; \n   \n\tPAGE;     \n\tPUT <_ALL_> <_INFILE_> <_ODS_> ...; \n   \n\tPUTLOG 'message';     \n\tRENAME old-name-1=new-name-1 ... <old-name-n=new-name-n>; \n   \n\tREPLACE <data-set-name-1><...data-set-name-n>; \n   \n\tRETAIN <element-list(s) <initial-value(s) |; \n   \n\tRETURN;     \n\tRSUBMIT <options>; ENDRSUBMIT <CANCEL>;     \n\t; \n   \n\tSET <END=variable> <INDSNAME=variable> <KEY=index</UNIQUE>> ...; \n   \n\tSEVERITYMODEL <DEFINITIONSTABLE=\"CAS-table-name\" <(CASLIB=\"caslib\")> | SEVDEF=\"CAS-table-name\" <(CASLIB=\"caslib\")>> ;   \n \n\tSKIP <n>;     \n\tSTOP; \n   \n\tWHEN <DO> ;     \n\tWHERE where-expression-1; ","arguments":[{"name":"ADJUSTEDSEVERITY=","optional":true,"aliases":["ADJSEV="],"description":"Syntax: ADJUSTEDSEVERITY=symbol-name | ADJSEV=symbol-name ADJUSTEDSEVERITY=(symbol-name <…symbol-name>) | ADJSEV=(symbol-name <…symbol-name>) Names one or more symbols that represent an adjusted severity value in the SAS programming statements that you specify. If you specify more than one symbol-name, then separate them with spaces and enclose them in parentheses.","type":"value"},{"name":"COUNTSTORE=","optional":true,"description":"Names the item store that contains all the information about the frequency (count) model. The CNTSELECT procedure generates this item store when you use the STORE= option.","help":"COUNTSTORE=*SAS-item-store*","type":"value"},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC CCDM to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"IGNOREPARMCOVARIANCE","optional":true,"aliases":["IGNORECOV"],"description":"Specifies that the covariance estimates be ignored for perturbation analysis.","type":"standalone"},{"name":"MAXCOUNTDRAW=","optional":true,"aliases":["MAXCOUNT="],"description":"Specifies an upper limit on the number of loss events (count) that is used for simulating one aggregate loss sample point.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Turns off all displayed output. If you specify this option, then PROC CCDM ignores any value that you specify for the PRINT= option.","type":"standalone"},{"name":"NPERTURBEDSAMPLES=","optional":true,"aliases":["NPERTURB="],"description":"Requests that parameter perturbation analysis be conducted. The model parameters are perturbed the specified number of times and a separate full sample is simulated for each set of perturbed parameter values. The summary statistics and percentiles are computed for each such perturbed sample, and their values are aggregated across the samples to compute the mean and standard deviation of each summary statistic and percentile.","type":"value"},{"name":"NREPLICATES=","optional":true,"aliases":["NREP="],"description":"Specifies a number that controls the size of the compound distribution sample that PROC CCDM simulates. The number is interpreted differently based on whether you specify the EXTERNALCOUNTS statement.","type":"value"},{"name":"OUTDRAW=","optional":true,"aliases":["OUTSAMPLE="],"description":"Specifies the output data table to contain the individual severity random draws. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","type":"value"},{"name":"PCTLDEF=","optional":true,"description":"Specifies the method to compute the percentiles of the compound distribution.","help":"PCTLDEF=1 | 2 | 3 | 4 | 5","type":"choice","arguments":[{"name":"1","description":"Definition 1 for computing quantile statistics","type":"standalone"},{"name":"2","description":"Definition 2 for computing quantile statistics","type":"standalone"},{"name":"3","description":"Definition 3 for computing quantile statistics","type":"standalone"},{"name":"4","description":"Definition 4 for computing quantile statistics","type":"standalone"},{"name":"5","description":"Definition 5 for computing quantile statistics","type":"standalone"}]},{"name":"PRINT=","optional":true,"description":"Specifies the desired displayed output. If you specify more than one display-option, then separate them with spaces and enclose them in parentheses. You can specify the following global-display-option:","help":"PRINT=ONLY","type":"choice","arguments":[{"name":"ONLY","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies the integer to use as the seed in generating the pseudo-random numbers that are used for simulating severity and frequency values.","help":"SEED=*number*","type":"value"},{"name":"SEVERITYEST=","optional":true,"description":"Names the input data table that contains the parameter estimates for the severity model. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"SEVERITYEST=*CAS-libref.data-table*","type":"dataSet"},{"name":"SEVERITYSTORE=","optional":true,"aliases":["SEVSTORE="],"description":"Specifies the item store that contains the context and estimates of the severity model. A PROC SEVSELECT step with the OUTSTORE= option creates this item store.","type":"value"},{"name":"VARDEF=","optional":true,"description":"Specifies the divisor to use in the calculation of variance, standard deviation, kurtosis, and skewness of the compound distribution sample.","help":"VARDEF=*divisor*","type":"value"}]},{"name":"ABORT","description":"Stops executing the current DATA step, SAS job, or SAS session. n is an integer value that enables you to specify a condition code: o when used with the CANCEL argument, the value is placed in the SYSINFO automatic macro variable o when not used with the CANCEL argument, the error code that is returned by SAS is ERROR. The value of ERROR depends on the operating system. The condition code n is returned to the operating system as the final SAS system exit code.","help":"ABORT &lt;ABEND&gt; &lt;CANCEL&gt; &lt;CANCEL FILE&gt; ...","arguments":[{"name":"<n>","optional":true,"placeholder":true,"description":"Replace <n> with an actual integer value. n is an integer value that enables you to specify a condition code: o when used with the CANCEL argument, the value is placed in the SYSINFO automatic macro variable o when not used with the CANCEL argument, the error code that is returned by SAS is ERROR. The value of ERROR depends on the operating system. The condition code n is returned to the operating system as the final SAS system exit code.","type":"value"},{"name":"ABEND","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the ABEND option of the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment; further action is based on how your operating environment and your site treat jobs that end abnormally. o windowing environment and interactive line mode","type":"standalone"},{"name":"CANCEL","optional":true,"description":"Causes the cancellation of the current submitted statements. The results depend on the method of operation: o batch mode and noninteractive mode o The entire SAS program and SAS system are terminated. o The error message is written to the SAS log. o windowing environment and interactive line mode o It only clears the current submitted program. o Other subsequent submitted programs are not affected. o The error message is written to the SAS log. o workspace server and stored process server o It only clears currently submitted program. o Other subsequent submit calls are not affected. o The error message is written to the SAS log. o SAS IntrNet application server","help":"CANCEL ","type":"standalone"},{"name":"CANCEL FILE","optional":true,"description":"Causes only the contents of the autoexec file or %INCLUDE file to be cleared by the %ABORT statement. Other submitted source statements will be executed after the autoexec or %INCLUDE file.","type":"standalone"},{"name":"NOLIST","optional":true,"description":"Suppresses the output of all variables to the SAS log. Requirement: NOLIST must be the last option in the ABORT statement.","type":"standalone"},{"name":"RETURN","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the RETURN option in the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment with a condition code indicating an error. o windowing environment and interactive line mode","type":"standalone"}]},{"name":"ARRAY","description":"Defines the elements of an array.","help":"ARRAY &lt;_ALL_&gt; &lt;_NUMERIC_&gt; &lt;_TEMPORARY_&gt; ...","arguments":[{"name":"_ALL_","optional":true,"description":"Specifies all variables.","type":"standalone"},{"name":"_CHARACTER_","optional":true,"description":"Specifies all character variables.","type":"standalone"},{"name":"_NUMERIC_","optional":true,"description":"Specifies all numeric variables.","type":"standalone"},{"name":"_TEMPORARY_","optional":true,"description":"Creates a list of temporary data elements.","type":"standalone"}]},{"name":"ATTRIB","description":"Associates a format, informat, label, and length with one or more variables.","help":"ATTRIB &lt;FORMAT=format&gt; &lt;INFORMAT=informat&gt; &lt;LABEL='label'&gt; ...","arguments":[{"name":"FORMAT=","optional":true,"description":"Associates a format with variables in a variable-list.","help":"FORMAT=*format*","type":"value"},{"name":"INFORMAT=","optional":true,"description":"Associates an informat with variables in a variable-list.","help":"INFORMAT=*informat*","type":"value"},{"name":"LABEL=","optional":true,"description":"Associates a label with variables in a variable-list.","help":"LABEL='*label*'","type":"value"},{"name":"LENGTH=","optional":true,"description":"Specifies the length of variables in a variable-list.","type":"value"},{"name":"TRANSCODE=","optional":true,"description":"Specifies whether character variables can be transcoded.","help":"TRANSCODE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"Specifies that character variables can be transcoded.","type":"standalone"},{"name":"NO","description":"Suppresses transcoding.","type":"standalone"}]}]},{"name":"BY","description":"You can use the BY statement in the CCDM procedure to process the input data table in groups of observations defined by the BY variables. If you specify the BY statement, then unlike procedures that do not use a CAS server, PROC CCDM does not need the input data table to be sorted in the order of the BY variables. As a consequence, the NOTSORTED and DESCENDING options have no effect and PROC CCDM ignores them.","help":"BY variable-list"},{"name":"CALL","description":"Invokes a SAS CALL routine.","help":"CALL routine(parameter-1&lt;, ...parameter-n&gt;)"},{"name":"CONTINUE","description":"Stops processing the current DO-loop iteration and resumes processing the next iteration.","help":"CONTINUE"},{"name":"DELETE","description":"Stops processing the current observation.","help":"DELETE"},{"name":"DESCRIBE","description":"Retrieves source code from a stored compiled DATA step program or a DATA step view.","help":"DESCRIBE"},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates the CAS output tables on all nodes.","type":"standalone"}]},{"name":"DO","description":"Specifies a group of statements to be executed as a unit.","help":"DO &lt;OVER&gt; &lt;&gt; &lt;&gt; ...","arguments":[{"name":"BY","optional":true,"description":"Precedes an increment integer (other than 0) or an expression that generates an integer to be added to the value of the index variable in each iteration of the DO loop.","type":"standalone"},{"name":"OVER","optional":true,"description":"","type":"standalone"},{"name":"TO","optional":true,"description":"Separates the start and stop integers or expressions that control the number of times the portion of the DATA step between the iterative DO and END statements is processed.","type":"standalone"},{"name":"UNTIL","optional":true,"description":"...more SAS statements... END","type":"standalone"},{"name":"WHILE","optional":true,"description":"","type":"standalone"}]},{"name":"DO UNTIL","description":"Executes statements in a DO loop repetitively until a condition is true.","help":""},{"name":"DO WHILE","description":"Executes statements in a DO loop repetitively while a condition is true.","help":""},{"name":"DROP","description":"Excludes variables from output SAS data sets.","help":"DROP variable-list"},{"name":"ELSE","description":"If the condition in an IF-THEN statement is false and an ELSE statement is present, then the ELSE action is carried out.","help":"ELSE &lt;DO&gt; &lt;IF&gt; &lt;THEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"IF","optional":true,"description":"Executes a SAS statement for observations that meet specific conditions.","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"}]},{"name":"END","description":"Ends a DO group or SELECT group processing.","help":"END"},{"name":"ENDRSUBMIT","description":"Marks the end of a block of statements that a client session submits to a server session for execution.","help":"ENDRSUBMIT"},{"name":"ERROR","description":"Sets _ERROR_ to 1. A message written to the SAS log is optional.","help":"ERROR &lt;message&gt;"},{"name":"EXECUTE","description":"Executes a stored compiled DATA step program.","help":"EXECUTE"},{"name":"EXTERNALCOUNTS","description":"The EXTERNALCOUNTS statement enables you to specify externally simulated frequency counts. By default, PROC CCDM internally simulates the number of loss events by using the frequency model input (COUNTSTORE= item store). However, if you specify the EXTERNALCOUNTS statement, then PROC CCDM uses the counts that you specify in the DATA= data table and simulates only the severity values internally.","help":"EXTERNALCOUNTS &lt;COUNT=count-variable&gt; &lt;ID=replication-id-variable&gt; ","arguments":[{"name":"COUNT=","optional":true,"description":"Specifies the variable that contains the simulated counts. This variable must be present in the DATA= data table.","help":"COUNT=*count-variable*","type":"value"},{"name":"ID=","optional":true,"description":"Specifies the variable that contains the replicate identifier. This variable must be present in the DATA= data table.","help":"ID=*replication-id-variable*","type":"value"}]},{"name":"FILE","description":"where file-specification identifies an external file that the DATA step uses to write output from a PUT statement. File-specification can have these forms: 'external-file' specifies the physical name of an external file, which is enclosed in quotation marks. The physical name is the name by which the operating environment recognizes the file. fileref specifies the fileref of an external file. Requirement: You must have previously associated fileref with an external file in a FILENAME statement or function, or in an appropriate operating environment command. There is only one exception to this rule: when you use the FILEVAR= option, the fileref is simply a placeholder. fileref(file) specifies a fileref that is previously assigned to an external file that is an aggregate grouping of files. Follow the fileref with the name of a file or member, which is enclosed in parentheses. LOG is a reserved fileref that directs the output that is produced by any PUT statements to the SAS log. PRINT is a reserved fileref that directs the output that is produced by any PUT statements to the same file as the output that is produced by SAS procedures. device-type specifies the type of device or the access method that is used if the fileref points to an input or output device or a location that is not a physical file: DISK, DUMMY, GTERM, PIPE, PLOTTER, PRINTER, TAPE, TEMP, TERMINAL, UPRINTER. type specifies the type of file in z/OS: DLI, HFS, MVS, PIPE, VSAM. operating-environment-options or host-options Additional specifications might be required when you specify some devices. See the SAS documentation for your operating environment before specifying a value other than DISK. Values in addition to the ones listed here might be available in some operating environments.","help":"FILE &lt;DISK&gt; &lt;DUMMY&gt; &lt;LOG&gt; ...","arguments":[{"name":"ALQ=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of blocks initially allocated to an external file when it is created. The value can range from 0 to 2,147,483,647. If the value is 0 (the default), the minimum number of blocks required for the given file format is used.","type":"value"},{"name":"BLKSIZE=","optional":true,"aliases":["BLK="],"description":"[Windows/UNIX Host Option] Specifies the number of bytes that are physically read or written in an I/O operation. The default is 8K. The maximum is 1M (Windows) or 1G-1(UNIX).","help":"BLKSIZE=*block-size*","type":"value"},{"name":"BLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"BOM","optional":true,"aliases":["BOMFILE"],"description":"[UNIX/z/OS Host Option] Includes a Byte Order Mark when a UNICODE-encoded file is created.","type":"standalone"},{"name":"BUFND=","optional":true,"description":"Indicates how many data buffers to use for the VSAM data set.","help":"BUFND=*value*","type":"value"},{"name":"BUFNI=","optional":true,"description":"Indicates how many index buffers to use for the VSAM data set.","help":"BUFNI=*value*","type":"value"},{"name":"BYTE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"CC=","optional":true,"description":"[OpenVMS Host Option] Specifies the carriage-control format of the SAS log and the procedure output file.","help":"CC=FORTRAN | PRINT | CR","type":"choice","arguments":[{"name":"FORTRAN","description":"Indicates FORTRAN carriage-control format. This is the default for print files.","type":"standalone"},{"name":"PRINT","description":"Indicates OpenVMS print format.","type":"standalone"},{"name":"CR","description":"Indicates OpenVMS carriage-return, carriage-control format. This is the default for nonprinting files.","type":"standalone"}]},{"name":"CLIENT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"CLOSE=","optional":true,"description":"[z/OS Host Option] Indicates how a tape volume is positioned at the end of the DATA step.","help":"CLOSE=REREAD | LEAVE | REWIND | FREE | DISP","type":"choice","arguments":[{"name":"REREAD","description":"Positions the tape at the logical beginning of the data set.","type":"standalone"},{"name":"LEAVE","description":"Positions the tape at the logical end of the data set.","type":"standalone"},{"name":"REWIND","description":"Rewinds the tape to the physical beginning of the volume.","type":"standalone"},{"name":"FREE","description":"Dynamically deallocates the tape volume.","type":"standalone"},{"name":"DISP","description":"Is implied by the control language.","type":"standalone"}]},{"name":"COLUMN=","optional":true,"aliases":["COL="],"description":"Specifies a variable that SAS automatically sets to the current column location of the pointer.","type":"value"},{"name":"COMMAND","optional":true,"description":"[Windows Host Option] Allows remote commands to be issued to DDE server applications that not use the SYSTEM topic name.","type":"standalone"},{"name":"CSRC","optional":true,"description":"[OpenVMS Host Option] Specifies that you want to use the CSRCESRV services (available with z/OS) to compress data on output. For example: data _null_; file myfile csrc; put ... ; run;","type":"standalone"},{"name":"DCB=","optional":true,"description":"specifies the fileref of an external file that was referenced in an earlier FILE or INFILE statement in the same DATA step. SAS uses that file's RECFM=, LRECL=, and BLKSIZE= information for the current file.","help":"DCB=*fileref*","type":"value"},{"name":"DELIMITER=","optional":true,"aliases":["DLM="],"description":"Specifies an alternate delimiter (other than a blank) to be used for LIST output.","type":"value"},{"name":"DEQ=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of blocks added when OpenVMS RMS automatically extends an external file during a write operation. The value can range from 0 to 65,535. The default value is 0, telling OpenVMS RMS to use the process's default value. A large value results in fewer file extensions over the life of the file; a small value results in numerous file extensions over the life of the file. A file with numerous file extensions might be noncontiguous, thereby slowing record access.","type":"value"},{"name":"DEVTYPE=","optional":true,"description":"Defines a character variable (minimum length 24) that SAS sets to the device type. SAS obtains the device type by using the z/OS operating environment DEVTYPE macro.","help":"DEVTYPE=*variable*","type":"value"},{"name":"DISK","optional":true,"description":"[device-type] Specifies that the device is a disk drive.","type":"standalone"},{"name":"DLI","optional":true,"description":"[type] For IMS-DL/I databases.","type":"standalone"},{"name":"DLMSOPT=","optional":true,"description":"Specifies a parsing option for the DLMSTR= T option that removes trailing blanks of the string delimiter.","help":"DLMSOPT='T'","type":"choice","arguments":[{"name":"'T'","description":"Removes trailing blanks of the string delimiter.","type":"standalone"}]},{"name":"DLMSTR=","optional":true,"description":"Specifies a character string as an alternate delimiter (other than a blank) to be used for LIST output","type":"value"},{"name":"DROPOVER","optional":true,"description":"Discards data items that exceed the output line length (as specified by the LINESIZE= or LRECL= options in the FILE statement).","type":"standalone"},{"name":"DSCB=","optional":true,"description":"Defines a character variable (minimum length 96) that SAS sets to the Data Set Control Block (DSCB) information from a non-VSAM data set.","help":"DSCB=*variable*","type":"value"},{"name":"DSD","optional":true,"description":"Specifies that data values that contain embedded delimiters, such as tabs or commas, be enclosed in quotation marks.","type":"standalone"},{"name":"DUMMY","optional":true,"description":"[device-type] Specifies that the output to the file is discarded. Tip: Specifying DUMMY can be useful for testing.","type":"standalone"},{"name":"ENCODING=","optional":true,"description":"Specifies the encoding to use when writing to the output file.","help":"ENCODING='warabic' | 'wbaltic' | 'wlatin2' | 'wcyrillic' | 'wgreek' | 'whebrew' | 'wturkish' | 'wvietnamese' | 'wlatin1' | 'utf-8' | 'ms-950' | 'ms-936' | 'ms-932' | 'ms-949'","type":"choice","arguments":[{"name":"'warabic'","description":"Arabic","type":"standalone"},{"name":"'wbaltic'","description":"Baltic","type":"standalone"},{"name":"'wlatin2'","description":"Central Europe","type":"standalone"},{"name":"'wcyrillic'","description":"Cyrillic","type":"standalone"},{"name":"'wgreek'","description":"Greek","type":"standalone"},{"name":"'whebrew'","description":"Hebrew","type":"standalone"},{"name":"'wturkish'","description":"Turkish","type":"standalone"},{"name":"'wvietnamese'","description":"Vietnamese","type":"standalone"},{"name":"'wlatin1'","description":"Western","type":"standalone"},{"name":"'utf-8'","description":"Unicode encoding","type":"standalone"},{"name":"'ms-950'","description":"Traditional Chinese","type":"standalone"},{"name":"'ms-936'","description":"Simplified Chinese","type":"standalone"},{"name":"'ms-932'","description":"Japanese","type":"standalone"},{"name":"'ms-949'","description":"Korean","type":"standalone"}]},{"name":"EOFCONNECT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes and is valid only when you are defining the server. This option indicates that if an end-of-file (EOF) character is received from a client, the server should try to connect to the next client.","type":"standalone"},{"name":"FAC=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file access attributes used for external files. Use this option to indicate the level of access you want to allow for an external file. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow read access, files opened for output allow WRITE access, and files opened for update allow READ and WRITE access. The form of the FAC= option is FAC=access-option-list where access-option-list can be one of the following: DEL specifies DELETE access. GET specifies READ access. PUT specifies WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want DELETE, READ, and WRITE access:","type":"value"},{"name":"FEEDBACK=","optional":true,"aliases":["FDBK="],"description":"Defines a numeric variable that SAS sets to the VSAM logical error code. This option is similar to the _FDBK_ automatic variable. When SAS sets the FEEDBACK variable, you must reset it to 0 in order to continue.","type":"value"},{"name":"FILEDATA=","optional":true,"description":"[UNIX/z/OS Host Option] The FILEDATA= option specifies that the file being processed is expected to contain either binary or text data.","help":"FILEDATA=BINARY | TEXT","type":"choice","arguments":[{"name":"BINARY","description":"The FILEDATA= option specifies that the file being processed is expected to contain binary data.","type":"standalone"},{"name":"TEXT","description":"The FILEDATA= option specifies that the file being processed is expected to contain text data.","type":"standalone"}]},{"name":"FILENAME=","optional":true,"description":"Defines a character variable, whose name you supply, that SAS sets to the value of the physical name of the file currently open for PUT statement output.","type":"value"},{"name":"FILEVAR=","optional":true,"description":"Defines a variable whose change in value causes the FILE statement to close the current output file and open a new one the next time the FILE statement executes.","type":"value"},{"name":"FLOWOVER","optional":true,"description":"Causes data that exceeds the current line length to be written on a new line.","type":"standalone"},{"name":"FOOTNOTES","optional":true,"aliases":["FOOTNOTE"],"description":"Specifies that the currently defined footnotes are printed.","type":"standalone"},{"name":"GSFCC=","optional":true,"description":"[OpenVMS Host Option] Specifies the file format of graphic stream files (GSF files). When specified in the FILENAME statement, it affects only the GSF files that are created using that fileref.","help":"GSFCC=PRINT | CR | NONE","type":"choice","arguments":[{"name":"PRINT","description":"Creates a GSF file. It is a VFC format file with carriage control set to null. These files can be used with most utilities with the exception of some file transfer protocols, such as Kermit. This is the default value for this option.","type":"standalone"},{"name":"CR","description":"Creates a carriage return carriage control file.","type":"standalone"},{"name":"NONE","description":"Creates a file with no carriage control. This format is useful if you plan to download the file to a personal computer.","type":"standalone"}]},{"name":"GTERM","optional":true,"description":"[device-type] Indicates that the output device type is a graphics device that will receive graphics data.","type":"standalone"},{"name":"HEADER=","optional":true,"description":"Defines a statement label that identifies a group of SAS statements that you want to execute each time SAS begins a new output page","type":"value"},{"name":"HFS","optional":true,"description":"[type] For UNIX System Services files.","type":"standalone"},{"name":"HOTLINK","optional":true,"description":"[Windows Host Option] Instructs SAS to use the DDE HOTLINK.","type":"standalone"},{"name":"IGNOREDOSEOF","optional":true,"description":"[Windows Host Option] Is used in the context of I/O operations on variable record format files. When this option is specified, any occurrence of ^Z is interpreted as character data and not as an end-of-file marker.","type":"standalone"},{"name":"JFCB=","optional":true,"description":"Defines a character variable (minimum length 176) that SAS sets to the Job File Control Block (JFCB).","help":"JFCB=*variable*","type":"value"},{"name":"KEY=","optional":true,"description":"[OpenVMS Host Option] Specifies which key SAS uses to read the records in an RMS file with indexed organization. The KEY= option is always used with the KEYVALUE= option.","type":"value"},{"name":"KEYLEN=","optional":true,"description":"Specifies a numeric SAS variable that, when used with GENKEY, specifies the length of the key that is to be compared to the keys in the file.","help":"KEYLEN=*variable*","type":"value"},{"name":"KEYPOS=","optional":true,"description":"Indicates the numeric variable that SAS sets to the position of the VSAM key field. This option enables you to read keys without knowing the key position in advance. This variable is set to the column number (starting from 1).","help":"KEYPOS=*variable*","type":"value"},{"name":"KEYVALUE=","optional":true,"description":"[OpenVMS Host Option] Specifies the key value with which to begin reading an indexed file.","type":"value"},{"name":"LINE=","optional":true,"description":"Defines a variable whose value is the current relative line number within the group of lines available to the output pointer.","type":"value"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Sets the maximum number of columns per line for reports and the maximum record length for data files.","type":"value"},{"name":"LINESLEFT=","optional":true,"aliases":["LL="],"description":"Defines a variable whose value is the number of lines left on the current page.","type":"value"},{"name":"LOG","optional":true,"description":"Is a reserved fileref that directs the output that is produced by any PUT statements to the SAS log.","type":"standalone"},{"name":"LRECL=","optional":true,"description":"Specifies the logical record length of the output file.","type":"value"},{"name":"MBC=","optional":true,"description":"[OpenVMS Host Option] Specifies the size of the I/O buffers that OpenVMS RMS allocates for a particular file. The value can range from 0 to 127 and represents the number of blocks used for each buffer. By default, this option is set to 0 and the default values for the process are used. The MBC= option (multiblock count) is used for both input and output to control the allocation for a particular file. If you want to control the allocation size for all the external files used during the current SAS session, you can use the MBC= option in every FILE, FILENAME, or INFILE statement. You can also use the DCL SET RMS_DEFAULT command to specify a process default, and let the SAS values default to the process's default values.","type":"value"},{"name":"MBF=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of I/O buffers you want OpenVMS RMS to allocate for a particular file. The value can range from 0 to 127 and represents the number of buffers used. By default, this option is set to a value of 2. If a value of 0 is specified, the default value for the process is used. The MBF= option (multibuffer count) is used for both input and output to control the number of buffers allocated for a particular file. If you want to control the number of buffers allocated for all the external files used during the SAS session, you can use the MBF= option in every FILE, FILENAME, or INFILE statement. The DCL SET RMS_DEFAULT command can be used to specify a process default. Then, you can let the SAS values default to the process's default values.","type":"value"},{"name":"MESSAGE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"MOD","optional":true,"description":"Writes the output lines after any existing lines in the file.","type":"standalone"},{"name":"MVS","optional":true,"description":"[type] For z/OS data sets.","type":"standalone"},{"name":"N=","optional":true,"description":"Specifies the number of lines that you want available to the output pointer in the current iteration of the DATA step.","help":"N=&lt;*n*&gt; | PAGESIZE","type":"choice","arguments":[{"name":"<n>","placeholder":true,"description":"Specifies the number of lines that are available to the output pointer. Replace n with an integer.","type":"value"},{"name":"PAGESIZE","aliases":["PS"],"description":"Specifies that the entire page is available to the output pointer.","type":"standalone"}]},{"name":"NOBLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"NOBOM","optional":true,"aliases":["NOBOMFILE"],"description":"[UNIX/z/OS Host Option] Specifies that a Byte Order Mark is not included when a UNICODE-encoded file is created.","type":"standalone"},{"name":"NOFOOTNOTES","optional":true,"aliases":["NOFOOTNOTE"],"description":"Specifies that the currently defined footnotes are not printed.","type":"standalone"},{"name":"NOPAD","optional":true,"description":"Specifies that records written to an external file are not padded with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Specifies that carriage-control characters are placed in the output lines.","type":"standalone"},{"name":"NOTAB","optional":true,"description":"[Windows Host Option] Instructs SAS to ignore tab characters between variables.","type":"standalone"},{"name":"NOTITLES","optional":true,"aliases":["NOTITLE"],"description":"Specifies that the current title lines are not printed on the pages of files.","type":"standalone"},{"name":"ODS=","optional":true,"description":"Specifies to use the Output Delivery System to format the output from a DATA step.","type":"value"},{"name":"OLD","optional":true,"description":"Replaces the previous contents of the file.","type":"standalone"},{"name":"PAD","optional":true,"description":"Specifies that records written to an external file are padded with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"PAGESIZE=","optional":true,"aliases":["PS="],"description":"Sets the number of lines per page for your reports.","help":"PAGESIZE=*value*","type":"value"},{"name":"PASSWD=","optional":true,"description":"Gives the appropriate password for a VSAM data set that has password protection.","help":"PASSWD=*value*","type":"value"},{"name":"PIPE","optional":true,"description":"[device-type] Specifies an unnamed pipe. Note: Some operating environments do not support pipes.","type":"standalone"},{"name":"PLOTTER","optional":true,"description":"[device-type] Specifies an unbuffered graphics output device.","type":"standalone"},{"name":"PRINT","optional":true,"description":"Either a reserved fileref that directs the output that is produced by any PUT statements to the same file as the output that is produced by SAS procedures, or an option that specifies that carriage-control characters are placed in the output lines.","type":"standalone"},{"name":"PRINTER","optional":true,"description":"[device-type] Specifies a printer or printer spool file.","type":"standalone"},{"name":"RC4STOP","optional":true,"description":"[VSAM Option] Stops the DATA step from executing if a return code greater than 4 is returned by the operating environment when the VSAM data set is opened.","type":"standalone"},{"name":"RECFM=","optional":true,"description":"[Windows/UNIX/z/OS Host Option] Specifies the record format of the external file. Under z/OS, the following values can be appended to the RECFM values:","help":"RECFM=F | P | S | V | N | s370V | S370VB | S370VBS | STREAMLF | FB | VB | U","type":"choice","arguments":[{"name":"F","description":"Fixed-record format","type":"standalone"},{"name":"P","description":"Print format.","type":"standalone"},{"name":"S","description":"Stream-record format.","type":"standalone"},{"name":"V","aliases":["D"],"description":"Variable-record format (the default)","type":"standalone"},{"name":"N","description":"Indicates binary format and causes the file to be treated as a byte stream. If LRECL is not specified, by default SAS reads 256 bytes at a time from the file.","type":"standalone"},{"name":"s370V","description":"Indicates the variable S370 record format (V).","type":"standalone"},{"name":"S370VB","description":"Indicates the variable block S370 record format (VB).","type":"standalone"},{"name":"S370VBS","description":"Indicates the variable block with spanned records S370 record format (VBS).","type":"standalone"},{"name":"STREAMLF","description":"[For OpenVMS] Specifies StreamLF record format. Records are delimited by LF.","type":"standalone"},{"name":"FB","description":"Specifies fixed-length records, blocked.","type":"standalone"},{"name":"VB","description":"Specifies variable-length records, blocked.","type":"standalone"},{"name":"U","description":"Specifies undefined-length records, unblocked.","type":"standalone"}]},{"name":"RECORDS=","optional":true,"description":"Defines a numeric variable that SAS sets to the number of logical records in a VSAM data set that has been opened for input.","help":"RECORDS=*variable*","type":"value"},{"name":"RECORG=","optional":true,"description":"[z/OS Host Option] Specifies the organization of records in a new VSAM data set. Use this option only if SMS is active.","help":"RECORG=KS | ES | RR | LS","type":"choice","arguments":[{"name":"KS","description":"Specifies a VSAM key-sequenced data set.","type":"standalone"},{"name":"ES","description":"Specifies a VSAM entry-sequenced data set.","type":"standalone"},{"name":"RR","description":"Specifies a VSAM relative-record data set.","type":"standalone"},{"name":"LS","description":"Specifies a VSAM linear-space data set.","type":"standalone"}]},{"name":"RESET","optional":true,"description":"[VSAM Option] Indicates that the VSAM file is reset to empty (no records) when it is opened. This option applies only to loading a VSAM data set that has been marked REUSE. You cannot use this option if the data set contains an alternate index.","type":"standalone"},{"name":"RETRY=","optional":true,"description":"[Windows Host Option]","help":"RETRY=*seconds*","type":"value"},{"name":"RRN=","optional":true,"description":"Defines a numeric variable that you set to the relative record number (RRN) of the record that you want to read or write. This option indicates that keyed direct access is being used; it is appropriate for RRDS only.","help":"RRN=*variable*","type":"value"},{"name":"SERVER","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"SHR=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file-sharing attributes used for external files. With this option, you can indicate the access level you want to give other users. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow shared read access, and files opened for output or UPDATE do not allow shared access. However, you can allow other users to have READ and WRITE access to a file that you are opening for input only. To accomplish this, use the SHR= option. The syntax of the SHR= option is SHR=share-option-list where share-option-list can be one of the following: DEL specifies DELETE access. GET specifies shared READ access. NONE specifies no shared access. PUT specifies shared WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want shared DELETE, READ, and WRITE access:","type":"value"},{"name":"STOPOVER","optional":true,"description":"Stops processing the DATA step immediately if a PUT statement attempts to write a data item that exceeds the current line length.","type":"standalone"},{"name":"TAPE","optional":true,"description":"[device-type] Specifies a tape drive.","type":"standalone"},{"name":"TEMP","optional":true,"description":"[device-type] Creates a temporary file that exists only as long as the filename is assigned.","type":"standalone"},{"name":"TERMINAL","optional":true,"description":"[device-type] Specifies the user's terminal.","type":"standalone"},{"name":"TERMSTR=","optional":true,"description":"[Windows/UNIX Host Option] Specifies the end-of-line character for the file. Use this option to share files between the UNIX and Windows operating environments.","help":"TERMSTR=CR | CRLF | LF | NULL | NONE | NL | LFCR | CRNL","type":"choice","arguments":[{"name":"CR","description":"Carriage return (CR).","type":"standalone"},{"name":"CRLF","description":"Carriage return (CR) followed by line feed (LF).","type":"standalone"},{"name":"LF","description":"Line feed only (the default).","type":"standalone"},{"name":"NULL","description":"NULL character (0x00).","type":"standalone"},{"name":"NONE","description":"Record terminators are not used. This parameter provides the same function as FILEDATA=BINARY.","type":"standalone"},{"name":"NL","description":"The newline character (x'15') is used as the record terminator. This parameter provides the same function as FILEDATA=TEXT.","type":"standalone"},{"name":"LFCR","description":"The sequence LF followed by CR is used as the record terminator.","type":"standalone"},{"name":"CRNL","description":"The sequence CR followed by NL is used as the record terminator.","type":"standalone"}]},{"name":"TITLES","optional":true,"aliases":["TITLE"],"description":"Specifies that the current title lines are printed on the pages of files.","type":"standalone"},{"name":"UCBNAME=","optional":true,"description":"Defines a character variable (minimum length 3) that SAS sets to the unit name (device address), which is derived from information in the unit control block (UCB).","help":"UCBNAME=*variable*","type":"value"},{"name":"UNBUF","optional":true,"description":"[UNIX Host Option] Tells SAS not to perform buffered writes to the file on any subsequent FILE statement. This option applies especially when you are reading from or writing to a data collection device. As explained in SAS Language Reference: Dictionary, it also prevents buffered reads on INFILE statements.","type":"standalone"},{"name":"UPRINTER","optional":true,"description":"[device-type] Specifies a Universal Printing printer definition name.","type":"standalone"},{"name":"VOLUME=","optional":true,"aliases":["VOLUMES="],"description":"Defines a character variable (with a minimum length of six characters) that SAS sets to the tape VOLSER or the disk volume serial number. In the case of a multivolume file, the VOLUME= variable contains the concatenated volume serial numbers up to the length of the variable or the first 30 volumes, whichever is less. The value in the VOLUME= variable contains the volume serial number of the first data set in the concatenation when the file is opened. This serial number changes if you open a subsequent data set in the concatenation.","type":"value"},{"name":"VSAM","optional":true,"description":"[type] For VSAM files.","type":"standalone"},{"name":"_FILE_=","optional":true,"description":"Names a character variable that references the current output buffer of this FILE statement.","help":"_FILE_=*variable*","type":"value"}]},{"name":"FORMAT","description":"Associates formats with variables.","help":"FORMAT &lt;DEFAULT=default-format&gt; ","arguments":[{"name":"DEFAULT=","optional":true,"description":"Specifies a temporary default format for displaying the values of variables that are not listed in the FORMAT statement. These default formats apply only to the current DATA step; they are not permanently associated with variables in the output data set. A DEFAULT= format specification applies to o variables that are not named in a FORMAT or ATTRIB statement o variables that are not permanently associated with a format within a SAS data set o variables that are not written with the explicit use of a format. Default: If you omit DEFAULT=, SAS uses BESTw. as the default numeric format and $w. as the default character format. Restriction: Use this option only in a DATA step.","help":"DEFAULT=*default-format*","type":"value"}]},{"name":"GO TO","aliases":["GOTO"],"description":"Jumps to a new statement.","help":"GO TO label | GOTO label"},{"name":"IF","description":"Continues processing only those observations that meet the condition of the specified expression.","help":"IF &lt;DO&gt; &lt;THEN&gt; &lt;WHEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"CALL","optional":true,"description":"Invokes a SAS CALL routine.","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"GO","optional":true,"aliases":["GOTO"],"description":"Jumps to a new statement.","help":"GO TO","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"PUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"RETURN","optional":true,"description":"Action statement in an IF-THEN construct. Stops executing statements at the current point in the DATA step and returns to a predetermined point in the step.","type":"standalone"},{"name":"SET","optional":true,"description":"Reads an observation from one or more SAS data sets.","type":"standalone"},{"name":"STOP","optional":true,"description":"Action statement in an IF-THEN construct. Stops execution of the current DATA step.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"},{"name":"WHEN","optional":true,"description":"WHEN statement in an IF-THEN-WHEN construct.","type":"standalone"}]},{"name":"INFILE","description":"file-specification identifies a file in one of the following forms: fileref specifies the assigned fileref or the allocated ddname of the file. A fileref must conform to the rules for ddnames. That is, it can consist of up to eight letters, numbers, or national characters ($, @, and #) and underscores (_). The first character must be either a letter or a national character. fileref(member) specifies a member of a partitioned data set, where the PDS or PDSE is specified by the assigned fileref or allocated ddname. If you specify a fileref that is not allocated, then SAS attempts to construct a data set name with the following three qualifiers: o the value of the SYSPREF= option (usually the user ID) o the specified fileref o DATA If a file is found that has this constructed data set name, then SAS opens it and reads it. The value of the FILEEXT= system option can affect the way SAS interprets PDS and PDSE member names. 'physical-filename' specifies a physical file, which can be a member of a partitioned data set (PDS), an extended partitioned data set (PDSE), or a UNIX System Services file, using the following syntax: o a fully qualified data set name. For example: 'myid.raw.datax' o a fully qualified data set name with a member in parentheses. For example: 'sas.raw.data(mem1)' o a partially qualified data set name with a period preceding it. For example: '.raw.data' o a partially qualified data set name with a period preceding it and a member name in parentheses. For example: '.raw.data(mem1)' o for PDS members, a fully or partially qualified data set name with a wildcard name in parentheses. For example: '.raw.data(mem*)', '.raw.data(*mem1)', '.raw.data(*)' o a UNIX System Services file. For example: '/u/userid/raw' or 'HFS:raw' or '/u/userid/data/*'","help":"INFILE &lt;DATALINES4&gt; &lt;DATALINES&gt; &lt;DISK&gt; ...","arguments":[{"name":"BACKWARD","optional":true,"aliases":["BKWD"],"description":"[VSAM Option] Causes SAS to read the VSAM data set backwards (INFILE only)","type":"standalone"},{"name":"BLKSIZE=","optional":true,"aliases":["BLK="],"description":"[Windows/UNIX Host Option] Specifies the number of bytes that are physically read or written in an I/O operation. The default is 8K. The maximum is 1M (Windows) or 1G-1(UNIX).","help":"BLKSIZE=*block-size*","type":"value"},{"name":"BLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"BUFND=","optional":true,"description":"Indicates how many data buffers to use for the VSAM data set.","help":"BUFND=*value*","type":"value"},{"name":"BUFNI=","optional":true,"description":"Indicates how many index buffers to use for the VSAM data set.","help":"BUFNI=*value*","type":"value"},{"name":"BYTE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"CCHHR=","optional":true,"description":"specifies a character variable to which the physical address (cylinder head record) of a record is returned. This applies to files on CKD disks only.","help":"CCHHR=*variable*","type":"value"},{"name":"CLIENT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"CLOSE=","optional":true,"description":"[z/OS Host Option] Indicates how a tape volume is positioned at the end of the DATA step.","help":"CLOSE=REREAD | LEAVE | REWIND | FREE | DISP","type":"choice","arguments":[{"name":"REREAD","description":"Positions the tape at the logical beginning of the data set.","type":"standalone"},{"name":"LEAVE","description":"Positions the tape at the logical end of the data set.","type":"standalone"},{"name":"REWIND","description":"Rewinds the tape to the physical beginning of the volume.","type":"standalone"},{"name":"FREE","description":"Dynamically deallocates the tape volume.","type":"standalone"},{"name":"DISP","description":"Is implied by the control language.","type":"standalone"}]},{"name":"COLUMN=","optional":true,"aliases":["COL="],"description":"Names a variable that SAS uses to assign the current column location of the input pointer. Like automatic variables, the COLUMN= variable is not written to the data set.","type":"value"},{"name":"CONTROLINTERVAL","optional":true,"aliases":["CTLINTV","CNV"],"description":"[VSAM Option] Indicates that you want to read physical VSAM control interval records rather than logical records. This option is typically used for diagnostic purposes (INFILE only).","type":"standalone"},{"name":"CSRC","optional":true,"description":"[OpenVMS Host Option] Specifies that you want to use the CSRCESRV services (available with z/OS) to compress data on output. For example: data _null_; file myfile csrc; put ... ; run;","type":"standalone"},{"name":"CVAF","optional":true,"description":"[VTOC Option under z/OS] Tells SAS to use the Common VTOC Access Facility (CVAF) of the IBM program product Data Facility/Device Support (DF/DS) for indexed VTOCs. If the VTOC is not indexed, or if your installation does not have CVAF, this option is ignored.","type":"standalone"},{"name":"DATALINES4","optional":true,"aliases":["CARDS4"],"description":"Specifies that the input data immediately follows the DATALINES4|CARDS4 statement in the DATA step. Using DATALINES4|CARDS4 allows you to use the INFILE statement options to control how the INPUT statement reads instream data lines.","type":"standalone"},{"name":"DATALINES","optional":true,"aliases":["CARDS"],"description":"Specifies that the input data immediately follows the DATALINES|CARDS statement in the DATA step. Using DATALINES|CARDS allows you to use the INFILE statement options to control how the INPUT statement reads instream data lines.","type":"standalone"},{"name":"DCB=","optional":true,"description":"specifies the fileref of an external file that was referenced in an earlier FILE or INFILE statement in the same DATA step. SAS uses that file's RECFM=, LRECL=, and BLKSIZE= information for the current file.","help":"DCB=*fileref*","type":"value"},{"name":"DELIMITER=","optional":true,"aliases":["DLM="],"description":"Specifies an alternate delimiter (other than a blank) to be used for LIST input.","type":"value"},{"name":"DISK","optional":true,"description":"[device-type] Specifies that the device is a disk drive.","type":"standalone"},{"name":"DLI","optional":true,"description":"[type] For IMS-DL/I databases.","type":"standalone"},{"name":"DLMSOPT=","optional":true,"description":"Specifies whether case-insensitive comparisons will be done, or trailing blanks of the string delimiter will be removed.","help":"DLMSOPT='I' | 'T'","type":"choice","arguments":[{"name":"'I'","description":"Specifies that case-insensitive comparisons will be done.","type":"standalone"},{"name":"'T'","description":"Specifies that trailing blanks of the string delimiter will be removed.","type":"standalone"}]},{"name":"DLMSTR=","optional":true,"description":"Specifies a character string as an alternate delimiter (other than a blank) to be used for LIST input","type":"value"},{"name":"DSD","optional":true,"description":"Specifies that when data values are enclosed in quotation marks, delimiters within the value are treated as character data. The DSD option changes how SAS treats delimiters when you use LIST input and sets the default delimiter to a comma. When you specify DSD, SAS treats two consecutive delimiters as a missing value and removes quotation marks from character values.","type":"standalone"},{"name":"DUMMY","optional":true,"description":"[device-type] Specifies that the output to the file is discarded. Tip: Specifying DUMMY can be useful for testing.","type":"standalone"},{"name":"ENCODING=","optional":true,"description":"Specifies the encoding to use when reading from the external file.","help":"ENCODING='warabic' | 'wbaltic' | 'wlatin2' | 'wcyrillic' | 'wgreek' | 'whebrew' | 'wturkish' | 'wvietnamese' | 'wlatin1' | 'utf-8' | 'ms-950' | 'ms-936' | 'ms-932' | 'ms-949'","type":"choice","arguments":[{"name":"'warabic'","description":"Arabic","type":"standalone"},{"name":"'wbaltic'","description":"Baltic","type":"standalone"},{"name":"'wlatin2'","description":"Central Europe","type":"standalone"},{"name":"'wcyrillic'","description":"Cyrillic","type":"standalone"},{"name":"'wgreek'","description":"Greek","type":"standalone"},{"name":"'whebrew'","description":"Hebrew","type":"standalone"},{"name":"'wturkish'","description":"Turkish","type":"standalone"},{"name":"'wvietnamese'","description":"Vietnamese","type":"standalone"},{"name":"'wlatin1'","description":"Western","type":"standalone"},{"name":"'utf-8'","description":"Unicode encoding","type":"standalone"},{"name":"'ms-950'","description":"Traditional Chinese","type":"standalone"},{"name":"'ms-936'","description":"Simplified Chinese","type":"standalone"},{"name":"'ms-932'","description":"Japanese","type":"standalone"},{"name":"'ms-949'","description":"Korean","type":"standalone"}]},{"name":"END=","optional":true,"description":"Specifies a variable that SAS sets to 1 when the current input data record is the last in the input file. Until SAS processes the last data record, the END= variable is set to 0. Like automatic variables, this variable is not written to the data set. Restriction: You cannot use the END= option with UNBUFFERED option, DATALINES or DATALINES4 statement, and an INPUT statement that reads multiple input data records.","type":"value"},{"name":"EOF=","optional":true,"description":"Specifies a statement label that is the object of an implicit GO TO when the INFILE statement reaches end of file.","type":"value"},{"name":"EOFCONNECT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes and is valid only when you are defining the server. This option indicates that if an end-of-file (EOF) character is received from a client, the server should try to connect to the next client.","type":"standalone"},{"name":"EOV=","optional":true,"description":"Specifies a variable that SAS sets to 1 when the first record in a file in a series of concatenated files is read.","type":"value"},{"name":"ERASE=","optional":true,"description":"Defines a numeric SAS variable that you must set to 1 when you want to erase a VSAM record (INFILE only).","help":"ERASE=*variable*","type":"value"},{"name":"EXPANDTABS","optional":true,"description":"Specifies to expand tab characters to the standard tab setting, which is set at 8-column intervals that start at column 9.","type":"standalone"},{"name":"FAC=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file access attributes used for external files. Use this option to indicate the level of access you want to allow for an external file. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow read access, files opened for output allow WRITE access, and files opened for update allow READ and WRITE access. The form of the FAC= option is FAC=access-option-list where access-option-list can be one of the following: DEL specifies DELETE access. GET specifies READ access. PUT specifies WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want DELETE, READ, and WRITE access:","type":"value"},{"name":"FEEDBACK=","optional":true,"aliases":["FDBK="],"description":"Defines a numeric variable that SAS sets to the VSAM logical error code. This option is similar to the _FDBK_ automatic variable. When SAS sets the FEEDBACK variable, you must reset it to 0 in order to continue.","type":"value"},{"name":"FILEDATA=","optional":true,"description":"[UNIX/z/OS Host Option] The FILEDATA= option specifies that the file being processed is expected to contain either binary or text data.","help":"FILEDATA=BINARY | TEXT","type":"choice","arguments":[{"name":"BINARY","description":"The FILEDATA= option specifies that the file being processed is expected to contain binary data.","type":"standalone"},{"name":"TEXT","description":"The FILEDATA= option specifies that the file being processed is expected to contain text data.","type":"standalone"}]},{"name":"FILENAME=","optional":true,"description":"Specifies a variable that SAS sets to the physical StatementOptionName of the currently opened input file. Like automatic variables, the FILENAME= variable is not written to the data set.","type":"value"},{"name":"FILEVAR=","optional":true,"description":"Specifies a variable whose change in value causes the INFILE statement to close the current input file and open a new one.","type":"value"},{"name":"FIRSTOBS=","optional":true,"description":"Specifies a record number that SAS uses to begin reading input data records in the input file.","type":"value"},{"name":"FLOWOVER","optional":true,"description":"Causes an INPUT statement to continue to read the next input data record if it does not find values in the current input line for all the variables in the statement.","type":"standalone"},{"name":"GENKEY","optional":true,"description":"[VSAM Option] Causes SAS to use the KEY= variable as the leading portion of a record's key. VSAM retrieves the first record whose key matches the generic key (INFILE only).","type":"standalone"},{"name":"GTERM","optional":true,"description":"[device-type] Indicates that the output device type is a graphics device that will receive graphics data.","type":"standalone"},{"name":"HFS","optional":true,"description":"[type] For UNIX System Services files.","type":"standalone"},{"name":"HOTLINK","optional":true,"description":"[Windows Host Option] Instructs SAS to use the DDE HOTLINK.","type":"standalone"},{"name":"IDMS","optional":true,"description":"[type] For CA-IDMS files.","type":"standalone"},{"name":"IGNOREDOSEOF","optional":true,"description":"[Windows Host Option] Is used in the context of I/O operations on variable record format files. When this option is specified, any occurrence of ^Z is interpreted as character data and not as an end-of-file marker.","type":"standalone"},{"name":"ISAM","optional":true,"description":"[type] For ISAM files.","type":"standalone"},{"name":"KEY=","optional":true,"description":"[OpenVMS Host Option] Specifies which key SAS uses to read the records in an RMS file with indexed organization. The KEY= option is always used with the KEYVALUE= option.","type":"value"},{"name":"KEYLEN=","optional":true,"description":"Specifies a numeric SAS variable that, when used with GENKEY, specifies the length of the key that is to be compared to the keys in the file.","help":"KEYLEN=*variable*","type":"value"},{"name":"KEYPOS=","optional":true,"description":"Indicates the numeric variable that SAS sets to the position of the VSAM key field. This option enables you to read keys without knowing the key position in advance. This variable is set to the column number (starting from 1).","help":"KEYPOS=*variable*","type":"value"},{"name":"KEYVALUE=","optional":true,"description":"[OpenVMS Host Option] Specifies the key value with which to begin reading an indexed file.","type":"value"},{"name":"LENGTH=","optional":true,"description":"Specifies a variable that SAS sets to the length of the current input line.","type":"value"},{"name":"LINE=","optional":true,"description":"Specifies a variable that SAS sets to the line location of the input pointer in the input buffer. Like automatic variables, the LINE= variable is not written to the data set.","type":"value"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the record length that is available to the INPUT statement.","type":"value"},{"name":"LRECL=","optional":true,"description":"Specifies the logical record length.","type":"value"},{"name":"MBC=","optional":true,"description":"[OpenVMS Host Option] Specifies the size of the I/O buffers that OpenVMS RMS allocates for a particular file. The value can range from 0 to 127 and represents the number of blocks used for each buffer. By default, this option is set to 0 and the default values for the process are used. The MBC= option (multiblock count) is used for both input and output to control the allocation for a particular file. If you want to control the allocation size for all the external files used during the current SAS session, you can use the MBC= option in every FILE, FILENAME, or INFILE statement. You can also use the DCL SET RMS_DEFAULT command to specify a process default, and let the SAS values default to the process's default values.","type":"value"},{"name":"MBF=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of I/O buffers you want OpenVMS RMS to allocate for a particular file. The value can range from 0 to 127 and represents the number of buffers used. By default, this option is set to a value of 2. If a value of 0 is specified, the default value for the process is used. The MBF= option (multibuffer count) is used for both input and output to control the number of buffers allocated for a particular file. If you want to control the number of buffers allocated for all the external files used during the SAS session, you can use the MBF= option in every FILE, FILENAME, or INFILE statement. The DCL SET RMS_DEFAULT command can be used to specify a process default. Then, you can let the SAS values default to the process's default values.","type":"value"},{"name":"MESSAGE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"MISSOVER","optional":true,"description":"Prevents an INPUT statement from reading a new input data record if it does not find values in the current input line for all the variables in the statement.","type":"standalone"},{"name":"MOD","optional":true,"description":"Indicates that data written to the file should be appended to the file","type":"standalone"},{"name":"MVS","optional":true,"description":"[type] For z/OS data sets.","type":"standalone"},{"name":"N=","optional":true,"description":"Specifies the number of lines that are available to the input pointer at one time.","type":"value"},{"name":"NBYTE=","optional":true,"description":"Specifies the StatementOptionName of a variable that contains the number of bytes to read from a file when you are reading data in stream record format (RECFM=S in the FILENAME statement).","type":"value"},{"name":"NEW","optional":true,"description":"Indicates that a new file is to be opened for output. If the file already exists, then it is deleted and re-created.","type":"standalone"},{"name":"NOBLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"NOEXPANDTABS","optional":true,"description":"Specifies not to expand tab characters to the standard tab setting, which is set at 8-column intervals that start at column 9.","type":"standalone"},{"name":"NOPAD","optional":true,"description":"SAS does not pad the records that are read from an external file with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Specifies that the input file does not contain carriage-control characters.","type":"standalone"},{"name":"NOTAB","optional":true,"description":"[Windows Host Option] Instructs SAS to ignore tab characters between variables.","type":"standalone"},{"name":"NRLS","optional":true,"description":"[VSAM Option] Specifies not to use record-level sharing (RLS) to open an RLS-eligible data set (INFILE only).","type":"standalone"},{"name":"OBS=","optional":true,"description":"Use OBS= with FIRSTOBS= to read a range of records from the middle of a file.","help":"OBS=*record-number* | MAX","type":"choice","arguments":[{"name":"record-number","placeholder":true,"description":"Specifies the record number of the last record to read in an input file that is read sequentially.","type":"value"},{"name":"MAX","description":"Specifies the maximum number of observations to process, which will be at least as large as the largest signed, 32-bit integer.","type":"standalone"}]},{"name":"OLD","optional":true,"description":"Indicates that a new file is to be opened for output. If the file already exists, then the previous contents of the file are replaced.","type":"standalone"},{"name":"PAD","optional":true,"description":"SAS pads the records that are read from an external file with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"PASSWD=","optional":true,"description":"Gives the appropriate password for a VSAM data set that has password protection.","help":"PASSWD=*value*","type":"value"},{"name":"PIPE","optional":true,"description":"[device-type] Specifies an unnamed pipe. Note: Some operating environments do not support pipes.","type":"standalone"},{"name":"PLOTTER","optional":true,"description":"[device-type] Specifies an unbuffered graphics output device.","type":"standalone"},{"name":"PRINT","optional":true,"description":"Specifies that the input file contains carriage-control characters.","type":"standalone"},{"name":"PRINTER","optional":true,"description":"[device-type] Specifies a printer or printer spool file.","type":"standalone"},{"name":"RBA=","optional":true,"description":"Specifies a numeric variable that you set to the relative byte address (RBA) of the data record that you want to read. The RBA= option indicates that addressed direct access is being used; it is appropriate for KSDS and ESDS. If you specify the CONTROLINTERVAL option, you can use the RBA= option to access control records in an RRDS (INFILE only).","help":"RBA=*variable*","type":"value"},{"name":"RC4STOP","optional":true,"description":"[VSAM Option] Stops the DATA step from executing if a return code greater than 4 is returned by the operating environment when the VSAM data set is opened.","type":"standalone"},{"name":"RECFM=","optional":true,"description":"[Windows/UNIX Host Option] Specifies the record format of the external file.","help":"RECFM=F | P | S | V | N | s370V | S370VB | S370VBS | STREAMLF","type":"choice","arguments":[{"name":"F","description":"Fixed-record format","type":"standalone"},{"name":"P","description":"Print format.","type":"standalone"},{"name":"S","description":"Stream-record format.","type":"standalone"},{"name":"V","aliases":["D"],"description":"Variable-record format (the default)","type":"standalone"},{"name":"N","description":"Indicates binary format and causes the file to be treated as a byte stream. If LRECL is not specified, by default SAS reads 256 bytes at a time from the file.","type":"standalone"},{"name":"s370V","description":"Indicates the variable S370 record format (V).","type":"standalone"},{"name":"S370VB","description":"Indicates the variable block S370 record format (VB).","type":"standalone"},{"name":"S370VBS","description":"Indicates the variable block with spanned records S370 record format (VBS).","type":"standalone"},{"name":"STREAMLF","description":"[For OpenVMS] Specifies StreamLF record format. Records are delimited by LF.","type":"standalone"}]},{"name":"RECORDS=","optional":true,"description":"Defines a numeric variable that SAS sets to the number of logical records in a VSAM data set that has been opened for input.","help":"RECORDS=*variable*","type":"value"},{"name":"RECORG=","optional":true,"description":"[z/OS Host Option] Specifies the organization of records in a new VSAM data set. Use this option only if SMS is active.","help":"RECORG=KS | ES | RR | LS","type":"choice","arguments":[{"name":"KS","description":"Specifies a VSAM key-sequenced data set.","type":"standalone"},{"name":"ES","description":"Specifies a VSAM entry-sequenced data set.","type":"standalone"},{"name":"RR","description":"Specifies a VSAM relative-record data set.","type":"standalone"},{"name":"LS","description":"Specifies a VSAM linear-space data set.","type":"standalone"}]},{"name":"RESET","optional":true,"description":"[VSAM Option] Indicates that the VSAM file is reset to empty (no records) when it is opened. This option applies only to loading a VSAM data set that has been marked REUSE. You cannot use this option if the data set contains an alternate index.","type":"standalone"},{"name":"RETRY=","optional":true,"description":"[Windows Host Option]","help":"RETRY=*seconds*","type":"value"},{"name":"RRN=","optional":true,"description":"Defines a numeric variable that you set to the relative record number (RRN) of the record that you want to read or write. This option indicates that keyed direct access is being used; it is appropriate for RRDS only.","help":"RRN=*variable*","type":"value"},{"name":"SCANOVER","optional":true,"description":"Causes the INPUT statement to scan the input data records until the character string that is specified in the @'character-string' expression is found.","type":"standalone"},{"name":"SEQUENTIAL","optional":true,"description":"[VSAM Option] Specifies sequential VSAM record retrieval when either the RBA= (for an ESDS) or the RRN= option (for an RRDS) is specified (INFILE only).","type":"standalone"},{"name":"SERVER","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"SHAREBUFFERS","optional":true,"aliases":["SHAREBUFS"],"description":"Specifies that the FILE statement and the INFILE statement share the same buffer.","type":"standalone"},{"name":"SHR=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file-sharing attributes used for external files. With this option, you can indicate the access level you want to give other users. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow shared read access, and files opened for output or UPDATE do not allow shared access. However, you can allow other users to have READ and WRITE access to a file that you are opening for input only. To accomplish this, use the SHR= option. The syntax of the SHR= option is SHR=share-option-list where share-option-list can be one of the following: DEL specifies DELETE access. GET specifies shared READ access. NONE specifies no shared access. PUT specifies shared WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want shared DELETE, READ, and WRITE access:","type":"value"},{"name":"SKIP","optional":true,"description":"[VSAM Option] Indicates skip-sequential processing of VSAM files. Skip-sequential processing finds the first record whose value is the same as the value specified by the KEY= option; records are read sequentially thereafter (INFILE only).","type":"standalone"},{"name":"START=","optional":true,"description":"Specifies a variable whose value SAS uses as the first column number of the record that the PUT _INFILE_ statement writes. Like automatic variables, the START variable is not written to the data set.","type":"value"},{"name":"STOPOVER","optional":true,"description":"Causes the DATA step to stop processing if an INPUT statement reaches the end of the current record without finding values for all variables in the statement.","type":"standalone"},{"name":"TAPE","optional":true,"description":"[device-type] Specifies a tape drive.","type":"standalone"},{"name":"TEMP","optional":true,"description":"[device-type] Creates a temporary file that exists only as long as the filename is assigned.","type":"standalone"},{"name":"TERMINAL","optional":true,"description":"[device-type] Specifies the user's terminal.","type":"standalone"},{"name":"TERMSTR=","optional":true,"description":"[Windows/UNIX Host Option] Specifies the end-of-line character for the file. Use this option to share files between the UNIX and Windows operating environments.","help":"TERMSTR=CR | CRLF | LF | NULL | NONE | NL | LFCR | CRNL","type":"choice","arguments":[{"name":"CR","description":"Carriage return (CR).","type":"standalone"},{"name":"CRLF","description":"Carriage return (CR) followed by line feed (LF).","type":"standalone"},{"name":"LF","description":"Line feed only (the default).","type":"standalone"},{"name":"NULL","description":"NULL character (0x00).","type":"standalone"},{"name":"NONE","description":"Record terminators are not used. This parameter provides the same function as FILEDATA=BINARY.","type":"standalone"},{"name":"NL","description":"The newline character (x'15') is used as the record terminator. This parameter provides the same function as FILEDATA=TEXT.","type":"standalone"},{"name":"LFCR","description":"The sequence LF followed by CR is used as the record terminator.","type":"standalone"},{"name":"CRNL","description":"The sequence CR followed by NL is used as the record terminator.","type":"standalone"}]},{"name":"TRUNCOVER","optional":true,"description":"Overrides the default behavior of the INPUT statement when an input data record is shorter than the INPUT statement expects. By default, the INPUT statement automatically reads the next input data record. TRUNCOVER enables you to read variable-length records when some records are shorter than the INPUT statement expects. Variables without any values assigned are set to missing.","type":"standalone"},{"name":"UNBUFFERED","optional":true,"aliases":["UNBUF"],"description":"Tells SAS not to perform a buffered (\"look ahead\") read.","type":"standalone"},{"name":"UPDATE=","optional":true,"description":"Defines a numeric SAS variable that indicates that not every record that it reads is to be updated. Use this option when you are updating records in a VSAM data set (INFILE only). When an INFILE and a FILE statement reference the same VSAM data set, records are retrieved for update by default.","help":"UPDATE=*variable*","type":"value"},{"name":"UPRINTER","optional":true,"description":"[device-type] Specifies a Universal Printing printer definition StatementOptionName.","type":"standalone"},{"name":"VSAM","optional":true,"description":"[type] For VSAM files.","type":"standalone"},{"name":"VTOC","optional":true,"description":"[type] For a Volume Table of Contents (VTOC).","type":"standalone"},{"name":"_INFILE_=","optional":true,"description":"Specifies a character variable that references the contents of the current input buffer for this INFILE statement.","type":"value"}]},{"name":"INFORMAT","description":"Associates informats with variables.","help":"INFORMAT &lt;DEFAULT= default-informat&gt; ","arguments":[{"name":"DEFAULT=","optional":true,"description":"Specifies a temporary default informat for reading values of the variables that are listed in the INFORMAT statement. If no variable is specified, then the DEFAULT= informat specification applies a temporary default informat for reading values of all the variables of that type included in the DATA step. Numeric informats are applied to numeric variables, and character informats are applied to character variables. These default informats apply only to the current DATA step. A DEFAULT= informat specification applies to o variables that are not named in an INFORMAT or ATTRIB statement o variables that are not permanently associated with an informat within a SAS data set o variables that are not read with an explicit informat in the current DATA step. Default: If you omit DEFAULT=, SAS uses w.d as the default numeric informat and $w. as the default character informat. Restriction: Use this argument only in a DATA step.","type":"value"}]},{"name":"INPUT","description":"Describes the arrangement of values in the input data record and assigns input values to the corresponding SAS variables.","help":"INPUT &lt;specification(s)&gt;&lt;@|@@&gt;"},{"name":"KEEP","description":"Specifies the variables to include in output SAS data sets.","help":"KEEP variable-list"},{"name":"LABEL","description":"Identifies a statement that is referred to by another statement.","help":""},{"name":"LEAVE","description":"Stops processing the current loop and resumes with the next statement in the sequence.","help":"LEAVE"},{"name":"LENGTH","description":"Specifies the number of bytes for storing variables.","help":"LENGTH &lt;DEFAULT=n&gt; ","arguments":[{"name":"DEFAULT=","optional":true,"description":"Changes the default number of bytes that SAS uses to store the values of any newly created numeric variables.","help":"DEFAULT=*n*","type":"value"}]},{"name":"LINK","description":"Directs program execution immediately to the statement label that is specified and, if followed by a RETURN statement, returns execution to the statement that follows the LINK statement.","help":"LINK label"},{"name":"LIST","description":"Writes to the SAS log the input data record for the observation that is being processed.","help":"LIST"},{"name":"MERGE","description":"Joins observations from two or more SAS data sets into a single observation.","help":"MERGE &lt;ALTER=&gt; &lt;BUFNO=&lt;n | nK | hexX&gt;... &gt; &lt;END=variable&gt; ...","arguments":[{"name":"ALTER=","optional":true,"description":"","type":"value"},{"name":"BUFNO=","optional":true,"description":"","help":"BUFNO=n | nK | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"BUFSIZE=","optional":true,"description":"","help":"BUFSIZE=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"CNTLLEV=","optional":true,"description":"","help":"CNTLLEV=LIB | MEM | REC","type":"choice","arguments":[{"name":"LIB","description":"","type":"standalone"},{"name":"MEM","description":"","type":"standalone"},{"name":"REC","description":"","type":"standalone"}]},{"name":"COMPRESS=","optional":true,"description":"","help":"COMPRESS=NO | YES | CHAR | BINARY","type":"choice","arguments":[{"name":"NO","description":"","type":"standalone"},{"name":"YES","description":"","type":"standalone"},{"name":"CHAR","description":"","type":"standalone"},{"name":"BINARY","description":"","type":"standalone"}]},{"name":"DLDMGACTION=","optional":true,"description":"","help":"DLDMGACTION=FAIL | ABORT | REPAIR | NOINDEX | PROMPT","type":"choice","arguments":[{"name":"FAIL","description":"","type":"standalone"},{"name":"ABORT","description":"","type":"standalone"},{"name":"REPAIR","description":"","type":"standalone"},{"name":"NOINDEX","description":"","type":"standalone"},{"name":"PROMPT","description":"","type":"standalone"}]},{"name":"DROP=","optional":true,"description":"","type":"value"},{"name":"ENCRYPT=","optional":true,"description":"","help":"ENCRYPT=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"ENCRYPTKEY=","optional":true,"description":"","type":"value"},{"name":"END=","optional":true,"description":"Names and creates a temporary variable that contains an end-of-file indicator.","help":"END=*variable*","type":"value"},{"name":"EXTENDOBSCOUNTER=","optional":true,"description":"","type":"value"},{"name":"FILECLOSE=","optional":true,"description":"","help":"FILECLOSE=DISP | LEAVE | REREAD | REWIND","type":"choice","arguments":[{"name":"DISP","description":"","type":"standalone"},{"name":"LEAVE","description":"","type":"standalone"},{"name":"REREAD","description":"","type":"standalone"},{"name":"REWIND","description":"","type":"standalone"}]},{"name":"FIRSTOBS=","optional":true,"description":"","help":"FIRSTOBS=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"GENMAX=","optional":true,"description":"","type":"value"},{"name":"GENNUM=","optional":true,"description":"","type":"value"},{"name":"IDXNAME=","optional":true,"description":"","type":"value"},{"name":"IDXWHERE=","optional":true,"description":"","help":"IDXWHERE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"IN=","optional":true,"description":"","type":"value"},{"name":"INDEX=","optional":true,"description":"","type":"value"},{"name":"KEEP=","optional":true,"description":"","type":"value"},{"name":"LABEL=","optional":true,"description":"","type":"value"},{"name":"OBS=","optional":true,"description":"","help":"OBS=n | nK | nM | nG | nT | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"nT","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"OUTREP=","optional":true,"description":"","type":"value"},{"name":"POINTOBS=","optional":true,"description":"","help":"POINTOBS=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"PW=","optional":true,"description":"","type":"value"},{"name":"PWREQ=","optional":true,"description":"","help":"PWREQ=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"READ=","optional":true,"description":"","type":"value"},{"name":"RENAME=","optional":true,"description":"","type":"value"},{"name":"REPEMPTY=","optional":true,"description":"","help":"REPEMPTY=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REPLACE=","optional":true,"description":"","help":"REPLACE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REUSE=","optional":true,"description":"","help":"REUSE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SGIO=","optional":true,"description":"","help":"SGIO=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SORTEDBY=","optional":true,"description":"","help":"SORTEDBY=by-clause &lt; / collate-name&gt; | _NULL_","type":"choice","arguments":[{"name":"by-clause","description":"","help":"by-clause &lt; / collate-name&gt;","type":"standalone"},{"name":"_NULL_","description":"","type":"standalone"}]},{"name":"SPILL=","optional":true,"description":"","help":"SPILL=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"TOBSNO=","optional":true,"description":"","type":"value"},{"name":"TRANTAB=","optional":true,"description":"","type":"value"},{"name":"TYPE=","optional":true,"description":"","type":"value"},{"name":"WHERE=","optional":true,"description":"","type":"value"},{"name":"WHEREUP=","optional":true,"description":"","help":"WHEREUP=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"WRITE=","optional":true,"description":"","type":"value"}]},{"name":"MODIFY","description":"Replaces, deletes, and appends observations in an existing SAS data set in place but does not create an additional copy.","help":"MODIFY &lt;END=variable&gt; &lt;KEY=index&gt; &lt;NOBS=variable&gt; ...","arguments":[{"name":"CUREOBS=","optional":true,"description":"Creates and names a variable that contains the observation number that was just read from the data set.","type":"value"},{"name":"END=","optional":true,"description":"Creates and names a temporary variable that contains an end-of-file indicator.","help":"END=*variable*","type":"value"},{"name":"KEY=","optional":true,"description":"Specifies a simple or composite index of the SAS data file that is being modified. The KEY= argument retrieves observations from that SAS data file based on index values that are supplied by like-named variables in another source of information.","help":"KEY=*index*","type":"value"},{"name":"KEYRESET=","optional":true,"description":"Controls whether a KEY= search should begin at the top of the index for the data set that is being read. When the value of the KEYRESET variable is 1, the index lookup begins at the top of the index. When the value of the KEYRESET variable is 0, the index lookup is not reset and the lookup continues where the prior lookup ended.","help":"KEYRESET=*variable*","type":"value"},{"name":"NOBS=","optional":true,"description":"Creates and names a temporary variable whose value is usually the total number of observations in the input data set. For certain SAS views, SAS cannot determine the number of observations. In these cases, SAS sets the value of the NOBS= variable to the largest positive integer value available in the operating environment.","help":"NOBS=*variable*","type":"value"},{"name":"POINT=","optional":true,"description":"Reads SAS data sets using random (direct) access by observation number. variable names a variable whose value is the number of the observation to read. The POINT= variable is available anywhere in the DATA step, but it is not added to any SAS data set.","help":"POINT=*variable*","type":"value"},{"name":"UNIQUE","optional":true,"description":"Causes a KEY= search always to begin at the top of the index for the data file being modified.","type":"standalone"},{"name":"UPDATEMODE=","optional":true,"description":"Specifies whether missing variable values in a transaction data set are to be allowed to replace existing variable values in a master data set.","help":"UPDATEMODE=MISSINGCHECK | NOMISSINGCHECK","type":"choice","arguments":[{"name":"MISSINGCHECK","description":"Prevents missing variable values in a transaction data set from replacing values in a master data set.","type":"standalone"},{"name":"NOMISSINGCHECK","description":"Allows missing variable values in a transaction data set to replace values in a master data set by preventing the check from being performed.","type":"standalone"}]}]},{"name":"OTHERWISE","description":"Specifies a statement to be executed if no WHEN condition is met.","help":"OTHERWISE &lt;DO&gt; ","arguments":[{"name":"DO","optional":true,"description":"Action statement.","type":"standalone"}]},{"name":"OUTPUT","description":"The OUTPUT statement enables you to specify the data table to output the generated compound distribution sample.","help":"OUTPUT ADJSAMPLEVAR=variable-name | ADJSAMPLEVAR=(variable-name &lt;…variable-name&gt;) OUT=CAS-libref.data-table | OUTSAMPLE=CAS-libref.data-table SAMPLEVAR=variable-name ...","arguments":[{"name":"ADJSAMPLEVAR=","description":"Specifies the names of the variables to contain the adjusted compound distribution sample in the OUT= data table.","type":"value"},{"name":"OUT=","aliases":["OUTSAMPLE="],"description":"Specifies the output data table to contain the simulated compound distribution sample. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","type":"value"},{"name":"SAMPLEVAR=","description":"Specifies the name of the variable to contain the simulated sample in the OUT= data table. If you do not specify the SAMPLEVAR= option, then \"_AGGSEV_\" is used by default.","help":"SAMPLEVAR=*variable-name*","type":"value"},{"name":"PERTURBOUT","optional":true,"followsDelimiter":"/","description":"Specifies that all the perturbed samples be written to the OUT= data table. Each perturbed sample is identified by the _DRAWID_ variable in the OUT= data table. A value of 0 for the _DRAWID_ variable indicates an unperturbed sample.","type":"standalone"}]},{"name":"OUTSUM","description":"The OUTSUM statement enables you to specify the data table in which PROC CCDM writes the summary statistics of the compound distribution samples.","help":"OUTSUM &lt;KURTOSIS|KURT &lt; =variable-name &gt;&gt; &lt;MEAN &lt; =variable-name &gt;&gt; &lt;OUT=CAS-libref.data-table | OUTSUM=CAS-libref.data-table&gt; ...","arguments":[{"name":"KURTOSIS","optional":true,"aliases":["KURT"],"description":"Specifies the kurtosis of the compound distribution sample.","type":"standalone"},{"name":"MEAN","optional":true,"description":"Specifies the mean of the compound distribution sample.","type":"standalone"},{"name":"MEDIAN","optional":true,"aliases":["Q2","P50"],"description":"Specifies the median (the 50th percentile) of the compound distribution sample.","type":"standalone"},{"name":"OUT=","optional":true,"aliases":["OUTSUM="],"description":"Specifies the output data table that contains the summary statistics of each of the simulated compound distribution samples. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","type":"value"},{"name":"P01","optional":true,"description":"Specifies the 1st percentile of the compound distribution sample.","type":"standalone"},{"name":"P05","optional":true,"description":"Specifies the 5th percentile of the compound distribution sample","type":"standalone"},{"name":"P95","optional":true,"description":"Specifies the 95th percentile of the compound distribution sample.","type":"standalone"},{"name":"P99","optional":true,"description":"Specifies the 99th percentile of the compound distribution sample.","type":"standalone"},{"name":"P99_5","optional":true,"aliases":["P995"],"description":"Specifies the 99.5th percentile of the compound distribution sample.","type":"standalone"},{"name":"PCTLNAME=","optional":true,"description":"Specifies the names of the variables that contain the estimates of the percentiles that you request by using the PCTLPTS= option.","help":"PCTLNAME=*percentile-variable-name-list*","type":"value"},{"name":"PCTLNDEC=","optional":true,"description":"Specifies the maximum number of decimal places to use while creating the names of the variables for the percentile values in the PCTLPTS= option. The default value is 3. For example, for a percentile value of 99.9995, PROC HPCDM creates a variable named P99_999 by default, but if you specify PCTLNDEC=4, then the variable is named P99_9995.","help":"PCTLNDEC=*integer-value*","type":"value"},{"name":"PCTLPTS=","optional":true,"description":"Specifies one or more percentiles that you want to be computed and written to the OUTSUM= data set. This option is useful if you need to request percentiles that are not available in the preceding list of statistic-keyword values.","help":"PCTLPTS=*percentile-list*","type":"value"},{"name":"Q1","optional":true,"aliases":["P25"],"description":"Specifies the lower or 1st quartile (the 25th percentile) of the compound distribution sample.","type":"standalone"},{"name":"Q3","optional":true,"aliases":["P75"],"description":"Specifies the upper or 3rd quartile (the 75th percentile) of the compound distribution sample.","type":"standalone"},{"name":"QRANGE","optional":true,"description":"Specifies the interquartile range (Q3–Q1) of the compound distribution sample.","type":"standalone"},{"name":"SKEWNESS","optional":true,"aliases":["SKEW"],"description":"Specifies the skewness of the compound distribution sample.","type":"standalone"},{"name":"STDDEV","optional":true,"aliases":["STD"],"description":"Specifies the standard deviation of the compound distribution sample.","type":"standalone"}]},{"name":"PAGE","description":"Skips to a new page in the SAS log.","help":"PAGE"},{"name":"PUT","description":"Writes lines to the SAS log, to the SAS output window, or to an external location that is specified in the most recent FILE statement.","help":"PUT &lt;_ALL_&gt; &lt;_INFILE_&gt; &lt;_ODS_&gt; ...","arguments":[{"name":"OVERPRINT","optional":true,"description":"Causes the values that follow the keyword OVERPRINT to print on the most recently written output line.","type":"standalone"},{"name":"_ALL_","optional":true,"description":"Writes the values of all variables, which includes automatic variables, that are defined in the current DATA step by using named output.","type":"standalone"},{"name":"_BLANKPAGE_","optional":true,"description":"Advances the pointer to the first line of a new page, even when the pointer is positioned on the first line and the first column of a new page.","type":"standalone"},{"name":"_INFILE_","optional":true,"description":"Writes the last input data record that is read either from the current input file or from the data lines that follow a DATELINES statement.","type":"standalone"},{"name":"_ODS_","optional":true,"description":"Moves data values for all columns (as defined by the ODS option in the FILE statement) into a special buffer, from which it is eventually written to the data component. The ODS option in the FILE statement defines the structure of the data component that holds the results of the DATA step.","type":"standalone"},{"name":"_PAGE_","optional":true,"description":"Advances the pointer to the first line of a new page. SAS automatically begins a new page when a line exceeds the current PAGESIZE= value.","type":"standalone"}]},{"name":"PUTLOG","description":"Writes a message to the SAS log.","help":"PUTLOG 'message'"},{"name":"RENAME","description":"Specifies new names for variables in output SAS data sets.","help":"RENAME old-name-1=new-name-1 ... &lt;old-name-n=new-name-n&gt;"},{"name":"REPLACE","description":"Replaces an observation in the same location.","help":"REPLACE &lt;data-set-name-1&gt;&lt;...data-set-name-n&gt;"},{"name":"RETAIN","description":"Causes a variable that is created by an INPUT or assignment statement to retain its value from one iteration of the DATA step to the next.","help":"RETAIN &lt;element-list(s) &lt;initial-value(s) |"},{"name":"RETURN","description":"Stops executing statements at the current point in the DATA step and returns to a predetermined point in the step.","help":"RETURN"},{"name":"RSUBMIT","description":"Marks the beginning of a block of statements that a client session submits to a server session for execution.","help":"RSUBMIT &lt;options&gt;; ENDRSUBMIT &lt;CANCEL&gt;"},{"name":"SELECT","description":"Executes one of several statements or groups of statements.","help":""},{"name":"SET","description":"Reads an observation from one or more SAS data sets.","help":"SET &lt;END=variable&gt; &lt;INDSNAME=variable&gt; &lt;KEY=index&lt;/UNIQUE&gt;&gt; ...","arguments":[{"name":"ALTER=","optional":true,"description":"","type":"value"},{"name":"BUFNO=","optional":true,"description":"","help":"BUFNO=n | nK | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"BUFSIZE=","optional":true,"description":"","help":"BUFSIZE=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"CNTLLEV=","optional":true,"description":"","help":"CNTLLEV=LIB | MEM | REC","type":"choice","arguments":[{"name":"LIB","description":"","type":"standalone"},{"name":"MEM","description":"","type":"standalone"},{"name":"REC","description":"","type":"standalone"}]},{"name":"COMPRESS=","optional":true,"description":"","help":"COMPRESS=NO | YES | CHAR | BINARY","type":"choice","arguments":[{"name":"NO","description":"","type":"standalone"},{"name":"YES","description":"","type":"standalone"},{"name":"CHAR","description":"","type":"standalone"},{"name":"BINARY","description":"","type":"standalone"}]},{"name":"CUREOBS=","optional":true,"description":"Creates and names a variable that contains the observation number that was just read from the data set.","type":"value"},{"name":"DLDMGACTION=","optional":true,"description":"","help":"DLDMGACTION=FAIL | ABORT | REPAIR | NOINDEX | PROMPT","type":"choice","arguments":[{"name":"FAIL","description":"","type":"standalone"},{"name":"ABORT","description":"","type":"standalone"},{"name":"REPAIR","description":"","type":"standalone"},{"name":"NOINDEX","description":"","type":"standalone"},{"name":"PROMPT","description":"","type":"standalone"}]},{"name":"DROP=","optional":true,"description":"","type":"value"},{"name":"ENCRYPT=","optional":true,"description":"","help":"ENCRYPT=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"ENCRYPTKEY=","optional":true,"description":"","type":"value"},{"name":"END=","optional":true,"description":"Creates and names a temporary variable that contains an end-of-file indicator. The variable, which is initialized to zero, is set to 1 when SET reads the last observation of the last data set listed. This variable is not added to any new data set.","help":"END=*variable*","type":"value"},{"name":"EXTENDOBSCOUNTER=","optional":true,"description":"","type":"value"},{"name":"FILECLOSE=","optional":true,"description":"","help":"FILECLOSE=DISP | LEAVE | REREAD | REWIND","type":"choice","arguments":[{"name":"DISP","description":"","type":"standalone"},{"name":"LEAVE","description":"","type":"standalone"},{"name":"REREAD","description":"","type":"standalone"},{"name":"REWIND","description":"","type":"standalone"}]},{"name":"FIRSTOBS=","optional":true,"description":"","help":"FIRSTOBS=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"GENMAX=","optional":true,"description":"Requests generations for a data set and specifies the maximum number of versions.","type":"value"},{"name":"GENNUM=","optional":true,"description":"","type":"value"},{"name":"IDXNAME=","optional":true,"description":"","type":"value"},{"name":"IDXWHERE=","optional":true,"description":"","help":"IDXWHERE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"IN=","optional":true,"description":"","type":"value"},{"name":"INDEX=","optional":true,"description":"","type":"value"},{"name":"INDSNAME=","optional":true,"description":"Creates and names a variable that stores the name of the SAS data set from which the current observation is read. The stored name can be a data set name or a physical name. The physical name is the name by which the operating environment recognizes the file.","help":"INDSNAME=*variable*","type":"value"},{"name":"KEEP=","optional":true,"description":"","type":"value"},{"name":"KEY=","optional":true,"description":"Provides nonsequential access to observations in a SAS data set, which are based on the value of an index variable or a key.","type":"value"},{"name":"KEYRESET=","optional":true,"description":"Controls whether a KEY= search should begin at the top of the index for the data set that is being read. When the value of the KEYRESET variable is 1, the index lookup begins at the top of the index. When the value of the KEYRESET variable is 0, the index lookup is not reset and the lookup continues where the prior lookup ended.","help":"KEYRESET=*variable*","type":"value"},{"name":"LABEL=","optional":true,"description":"","type":"value"},{"name":"NOBS=","optional":true,"description":"Creates and names a temporary variable whose value is usually the total number of observations in the input data set or data sets. If more than one data set is listed in the SET statement, NOBS= the total number of observations in the data sets that are listed. The number of observations includes those observations that are marked for deletion but are not yet deleted.","help":"NOBS=*variable*","type":"value"},{"name":"NOMISS","optional":true,"description":"","type":"standalone"},{"name":"OBS=","optional":true,"description":"","help":"OBS=n | nK | nM | nG | nT | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"nT","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"OPEN=","optional":true,"description":"Allows you to delay the opening of any concatenated SAS data sets until they are ready to be processed.","help":"OPEN=IMMEDIATE | DEFER","type":"choice","arguments":[{"name":"IMMEDIATE","description":"During the compilation phase, opens all data sets that are listed in the SET statement.","type":"standalone"},{"name":"DEFER","description":"Opens the first data set during the compilation phase, and opens subsequent data sets during the execution phase. When the DATA step reads and processes all observations in a data set, it closes the data set and opens the next data set in the list.","type":"standalone"}]},{"name":"OUTREP=","optional":true,"description":"","type":"value"},{"name":"POINT=","optional":true,"description":"Specifies a temporary variable whose numeric value determines which observation is read. POINT= causes the SET statement to use random (direct) access to read a SAS data set.","help":"POINT=*variable*","type":"value"},{"name":"POINTOBS=","optional":true,"description":"","help":"POINTOBS=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"PW=","optional":true,"description":"","type":"value"},{"name":"PWREQ=","optional":true,"description":"","help":"PWREQ=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"READ=","optional":true,"description":"Assigns a read password to a SAS file and enables access to a read-protected SAS file.","type":"value"},{"name":"RENAME=","optional":true,"description":"","type":"value"},{"name":"REPEMPTY=","optional":true,"description":"","help":"REPEMPTY=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REPLACE=","optional":true,"description":"","help":"REPLACE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REUSE=","optional":true,"description":"","help":"REUSE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SGIO=","optional":true,"description":"","help":"SGIO=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SORTEDBY=","optional":true,"description":"","help":"SORTEDBY=by-clause &lt; / collate-name&gt; | _NULL_","type":"choice","arguments":[{"name":"by-clause","description":"","help":"by-clause &lt; / collate-name&gt;","type":"standalone"},{"name":"_NULL_","description":"","type":"standalone"}]},{"name":"SPILL=","optional":true,"description":"","help":"SPILL=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"TOBSNO=","optional":true,"description":"","type":"value"},{"name":"TRANTAB=","optional":true,"description":"","type":"value"},{"name":"TYPE=","optional":true,"description":"","type":"value"},{"name":"UNIQUE","optional":true,"description":"","type":"standalone"},{"name":"WHERE=","optional":true,"description":"","type":"value"},{"name":"WHEREUP=","optional":true,"description":"","help":"WHEREUP=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"WRITE=","optional":true,"description":"","type":"value"}]},{"name":"SEVERITYMODEL","description":"The SEVERITYMODEL statement specifies one or more severity distribution models that you want to use in simulating a compound distribution sample. The severity-model-list is a space-separated list of names of severity models that you would use with PROC SEVERITY’s DIST statement. The SEVERITYEST= data set or the SEVERITYSTORE= item store must contain all the severity models in the list. If you specify the SEVERITYEST= data set and if you specify a name that does not appear in the _MODEL_ column of the SEVERITYEST= data set, then that name is ignored. Similarly, if you specify the SEVERITYSTORE= item store and if a severity model by that name does not appear in the item store, then that name is ignored.","help":"SEVERITYMODEL &lt;DEFINITIONSTABLE=\"CAS-table-name\" &lt;(CASLIB=\"caslib\")&gt; | SEVDEF=\"CAS-table-name\" &lt;(CASLIB=\"caslib\")&gt;&gt; ","arguments":[{"name":"DEFINITIONSTABLE=","optional":true,"followsDelimiter":"/","aliases":["SEVDEF="],"description":"Specifies a data table on the CAS server that contains the severity distribution function definitions. If you do not specify the CASLIB= option, then PROC CCDM assumes that the table is in the caslib that is active in the current CAS session. To specify a different caslib, use the CASLIB= option.","type":"value"}]},{"name":"STOP","description":"Stops execution of the current DATA step.","help":"STOP"},{"name":"WHEN","description":"Identifies SAS statements that are executed when a particular condition is true.","help":"WHEN &lt;DO&gt; ","arguments":[{"name":"DO","optional":true,"description":"Action statement.","type":"standalone"}]},{"name":"WHERE","description":"Selects observations from SAS data sets that meet a particular condition.","help":"WHERE where-expression-1"}],"supportSiteInformation":{"docsetId":"casecon","docsetVersion":"v_024","docsetTargetFile":"casecon_ccdm_toc.htm"}}