{"name":"CCOPULA","statements":[{"name":"PROC CCOPULA","description":"A multivariate distribution for a random vector contains a description of both the marginal distributions and their dependence structure. A copula approach to formulating a multivariate distribution provides a way to isolate the description of the dependence structure from the marginal distributions. A copula is a function that combines marginal distributions of variables into a specific multivariate distribution. All of the one-dimensional marginals in the multivariate distribution are the cumulative distribution functions of the factors. Copulas help perform large-scale multivariate simulation from separate models, each of which can be fitted using different, even nonnormal, distributional specifications. † The CCOPULA procedure enables you to fit multivariate distributions or copulas from a given sample data set. You can do the following: † o estimate the parameters for a specified copula type † o simulate a given copula","help":"PROC CCOPULA <DATA=SAS-data-set> <PRINTTIMING>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tDEFINE <CLAYTON> <NORMAL> <T> ...;\n    \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...;\n    \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...;\n    \n\tFIT CLAYTON NORMAL T ...;\n    \n\tSIMULATE <NDRAWS=integer> <OUTUNIFORM=SAS-data-set> <RESTORE=SAS-item-store> ...;\n    \n\tVAR variables;\n    \n\tVIEWSTORE <ALL> <BYVARVALUES> <CORRELATIONS> ...;\n","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the input data set used to estimate parameters for the FIT statement. When the procedure is used for simulation only, the input data set is not required to run the procedure.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"PRINTTIMING","optional":true,"description":"Prints a timing report.","type":"standalone"}]},{"name":"BY","description":"The BY statement specifies groups in which separate FIT analyses for copula are performed. The variables must be present in the input data set and are excluded from the model fitting. The BY statement requires the VAR statement to be present.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"DEFINE","description":"The DEFINE statement specifies the relevant information about the copula that is used for the simulation. name specifies the name of the copula definition. You can be use this name later in the SIMULATE statement. copula-type specifies the type of copula. You must specify one of the following copula types: NORMAL fits the normal copula. T fits the t copula. CLAYTON fits the Clayton copula. FRANK fits the Frank copula. GUMBEL fits the Gumbel copula. parameter-value-options specify the input parameters that are used to simulate the specified copula.","help":"DEFINE &lt;CLAYTON&gt; &lt;NORMAL&gt; &lt;T&gt; ...","arguments":[{"name":"CLAYTON","optional":true,"description":"[copula-type] Fits the Clayton copula.","type":"standalone"},{"name":"CORR=","optional":true,"description":"Specifies the data set that contains the correlation matrix to use for elliptical copulas. If the correlation matrix is valid but its elements are not submitted in order, then you must provide the variable names in the first column of the matrix, and these names must match the variable names in the VAR statement.","help":"CORR=*SAS-data-set*","type":"dataSet"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom. You can use this option for t copulas.","help":"DF=*value*","type":"value"},{"name":"FRANK","optional":true,"description":"[copula-type] Fits the Frank copula.","type":"standalone"},{"name":"GUMBEL","optional":true,"description":"[copula-type] Fits the Gumbel copula.","type":"standalone"},{"name":"NORMAL","optional":true,"description":"[copula-type] Fits the normal copula.","type":"standalone"},{"name":"T","optional":true,"description":"[copula-type] Fits the t copula.","type":"standalone"},{"name":"THETA=","optional":true,"description":"Specifies the parameter value for the Archimedean copulas.","help":"THETA=*value*","type":"value"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates the CAS output tables on all nodes.","type":"standalone"}]},{"name":"FIT","description":"The FIT statement estimates the parameters for a specified copula type. type specifies the type of the copula to be estimated, which is one of the following: CLAYTON fits the Clayton copula. FRANK fits the Frank copula. GUMBEL fits the Gumbel copula. NORMAL fits the normal copula. T fits the t copula.","help":"FIT CLAYTON NORMAL T ...","arguments":[{"name":"CLAYTON","description":"[copula-type] Fits the Clayton copula.","type":"standalone"},{"name":"FRANK","description":"[copula-type] Fits the Frank copula.","type":"standalone"},{"name":"GUMBEL","description":"[copula-type] Fits the Gumbel copula.","type":"standalone"},{"name":"INIT=","description":"Provides the initial values for the numerical optimization. [parameter-value-options] specify the input parameters that are used to initialize the specified copula. These options must be appropriate for the type of copula that you specify. You can specify the following options:","help":"INIT=CORR= | DF= | THETA=","type":"choice","arguments":[{"name":"CORR=","type":"value"},{"name":"DF=","type":"value"},{"name":"THETA=","type":"value"}]},{"name":"NAME=","description":"Specifies an identifier for the fit.","help":"NAME=*name*","type":"value"},{"name":"NORMAL","description":"[copula-type] Fits the normal copula.","type":"standalone"},{"name":"T","description":"[copula-type] Fits the t copula.","type":"standalone"},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"Prints a summary iteration listing.","type":"standalone"},{"name":"MARGINALS=","optional":true,"followsDelimiter":"/","description":"Specifies the marginal distribution of the individual variables.","help":"MARGINALS=UNIFORM | EMPIRICAL","type":"choice","arguments":[{"name":"UNIFORM","followsDelimiter":"/","description":"Uses the marginal empirical CDF to transform the data and uses the transformed data to fit the copula.","type":"standalone"},{"name":"EMPIRICAL","followsDelimiter":"/","description":"Uses the input data without transformation to fit the copula.","type":"standalone"}]},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"Specifies the method used to estimate parameters.","help":"METHOD=MLE | CAL","type":"choice","arguments":[{"name":"MLE","followsDelimiter":"/","description":"Represents canonical maximum likelihood estimation (CMLE) or maximum likelihood estimation (MLE).","type":"standalone"},{"name":"CAL","followsDelimiter":"/","description":"Specifies the calibration method that uses the correlation matrix (only Kendall’s tau is implemented in this procedure).","type":"standalone"}]},{"name":"NOCORR","optional":true,"followsDelimiter":"/","description":"Suppresses the correlation matrix.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses all output.","type":"standalone"},{"name":"OUTPSEUDO=","optional":true,"followsDelimiter":"/","description":"Specifies the output data set for saving the pseudo-samples with uniform marginal distributions. The pseudo-samples are obtained by transforming the individual variables of the original data with the empirical cumulative distribution functions (CDFs). The data set is not created if this option is not specified.","help":"OUTPSEUDO=*SAS-data-set*","type":"dataSet"},{"name":"PRINTALL","optional":true,"followsDelimiter":"/","description":"Prints all output (default option).","type":"standalone"},{"name":"STORE=","optional":true,"followsDelimiter":"/","description":"Specifies the item store that preserves the properties of the model and the fit results.","help":"STORE=*SAS-item-store*","type":"value"}]},{"name":"SIMULATE","description":"The SIMULATE statement simulates data from a specified copula model. The copula name specification is the name of a defined copula as specified by name in the DEFINE statement.","help":"SIMULATE &lt;NDRAWS=integer&gt; &lt;OUTUNIFORM=SAS-data-set&gt; &lt;RESTORE=SAS-item-store&gt; ...","arguments":[{"name":"NDRAWS=","optional":true,"followsDelimiter":"/","description":"Specifies the number of draws to generate for this simulation. By default, NDRAWS=100.","help":"NDRAWS=*integer*","type":"value"},{"name":"OUTUNIFORM=","optional":true,"followsDelimiter":"/","description":"Specifies the output data set to contain the result of the simulation in uniform margins. The data are not created if you do not specify this option.","help":"OUTUNIFORM=*SAS-data-set*","type":"dataSet"},{"name":"RESTORE=","optional":true,"followsDelimiter":"/","description":"Specifies the input item store that contains the results of fitting a copula. The final estimates, correlations, and other properties of the model that are preserved in the RESTORE= item store are used to define the simulation. The DEFINE and VAR statements are ignored if this option is specified.","help":"RESTORE=*SAS-item-store*","type":"value"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for generating random numbers for the simulation. If you do not provide the seed, a random number is used as the seed.","help":"SEED=*integer*","type":"value"},{"name":"TOLERANCE=","optional":true,"followsDelimiter":"/","description":"Specifies the tolerance allowed for the simulation.","help":"TOLERANCE=*value*","type":"value"}]},{"name":"VAR","description":"The VAR statement specifies the variable names in the input data set that is specified by the DATA= option in the PROC CCOPULA statement. The subset of variables in the data set is used for the copula models in the FIT statement. If there is no input data set, the VAR statement creates the list of variable names for the SIMULATE statement.","help":"VAR variables"},{"name":"VIEWSTORE","description":"The VIEWSTORE statement allows you to print various reports that describe the model fitting information which is preserved in an item store. The item store must have been created using the STORE= option in the FIT statement.","help":"VIEWSTORE &lt;ALL&gt; &lt;BYVARVALUES&gt; &lt;CORRELATIONS&gt; ...","arguments":[{"name":"ALL","optional":true,"followsDelimiter":"/","description":"When this option is provided, the entire contents of the item store are printed.","type":"standalone"},{"name":"BYVARVALUES","optional":true,"followsDelimiter":"/","description":"When this option is provided, the values of the BY-Group variables that were used to fit the model are printed.","type":"standalone"},{"name":"CORRELATIONS","optional":true,"followsDelimiter":"/","description":"When this option is provided, the correlation matrices are printed.","type":"standalone"},{"name":"FINALESTIMATES","optional":true,"followsDelimiter":"/","description":"When this option is provided, the Final Parameter Estimates are printed.","type":"standalone"},{"name":"FITMODELSUMMARY","optional":true,"followsDelimiter":"/","description":"When this option is provided, the Fit Model Summary is printed.","type":"standalone"},{"name":"INITIALESTIMATES","optional":true,"followsDelimiter":"/","description":"When this option is provided, the Initial Parameter Estimates are printed.","type":"standalone"},{"name":"INSTORE=","optional":true,"followsDelimiter":"/","description":"Specifies the item store that you want to view. If the INSTORE= option is not specified, and if a FIT statement is provided that specifies a STORE= item store, then the STORE= item store specified in the FIT statement will be used as the INSTORE= item store.","help":"INSTORE=*SAS-item-store*","type":"value"},{"name":"MINIMAL","optional":true,"followsDelimiter":"/","description":"When this option is provided, only the Fit Model Summary and Final Parameter Estimates are printed.","type":"standalone"},{"name":"MODELDEFINITION","optional":true,"followsDelimiter":"/","description":"When this option is provided, the statements that defined the model are printed.","type":"standalone"},{"name":"NONE","optional":true,"followsDelimiter":"/","description":"When this option is provided, no reports are printed.","type":"standalone"},{"name":"OPTIMIZERSETTINGS","optional":true,"followsDelimiter":"/","description":"When this option is provided, the optimizer settings that were used to fit the model are printed.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"casecon","docsetVersion":"v_041","docsetTargetFile":"casecon_ccopula_toc.htm"}}