{"name":"CESM","statements":[{"name":"PROC CESM","description":"The CESM procedure generates forecasts by using exponential smoothing models with optimized smoothing weights for one or more time series. Time series data have observations that are equally spaced by a specific time interval (for example, monthly or weekly). PROC CESM can also generate these forecasts for transactional data, whose observations are not spaced with respect to any particular time interval. The procedure accumulates transactional data on the basis of a specified (or default) time interval to form a time series prior to modeling and forecasting. Typical examples of transactional data are internet, inventory, sales, and other similar data. For typical time series, you can use the following smoothing models: simple, double, linear, damped trend, seasonal, and Winters method (additive or multiplicative). In addition, transformed versions of the following models are provided: log, square root, logistic, and Box-Cox. The CESM procedure writes the following to output data tables: the time series that are extrapolated by the forecasts, the series summary statistics, the forecasts and confidence limits, and the parameter estimates. PROC CESM requires SAS Cloud Analytic Services (CAS) in order to run, and it does the following: it enables you to run on a cluster of machines that distribute the data and the computations, and it exploits all the available cores and concurrent threads","help":"PROC CESM options; \n\tBY variables;\n\tID variableINTERVAL=interval<options>;\n\tFORCAST variable-list / <options>;"},{"name":"BY","description":"You can use a BY statement to obtain separate dummy variable definitions for groups of observations that are defined by the BY variables.","help":"BY *variables*;"},{"name":"ID","description":"The ID statement names a numeric variable that identifies observations in the input and output data tables. The values of the ID variable are assumed to be SAS date or datetime values. In addition, the ID statement specifies (in the INTERVAL= option) the frequency that is associated with the time series. The options also specify how to accumulate the observations and how to align the time ID values to form the time series to be forecast. The specified information affects all variables that are specified in subsequent FORECAST statements. If an ID statement is not specified, the observation number (with respect to the BY group) is used as the time ID.","help":"ID *variable**INTERVAL=interval*&lt;options&gt;;","arguments":[{"name":"INTERVAL=","description":"specifies the frequency of the input time series or of the time series to be accumulated from the input data. For example, if the input data table consists of quarterly observations, then INTERVAL=QTR should be used. If the SEASONALITY= option is not specified, the length of the seasonal cycle is implied by the INTERVAL= option. For example, INTERVAL=QTR implies a seasonal cycle of length 4. If the ACCUMULATE= option is also specified, the INTERVAL= option determines the time periods for the accumulation of observations. The basic intervals are YEAR, SEMIYEAR, QTR, MONTH, SEMIMONTH, TENDAY, WEEK, WEEKDAY, DAY, HOUR, MINUTE, and SECOND. For more information about the intervals that can be specified, see the chapter \"Date Intervals, Formats, and Functions\" in SAS/ETS User's Guide.","help":"INTERVAL= *interval*","type":"value"},{"name":"ACCUMULATE=","optional":true,"description":"specifies how to accumulate the data table observations within each time period. The frequency (width of each time interval) is specified in the INTERVAL= option. The ID variable contains the time ID values. Each value of the time ID variable value corresponds to a specific time period. The accumulated values form the time series, which is used in subsequent model fitting and forecasting. The ACCUMULATE= option is particularly useful when there are gaps in the input data or when there are multiple input observations that coincide with a particular time period (for example, transactional data). The EXPAND procedure in SAS/ETS User's Guide offers additional frequency conversions and transformations that can also be useful in creating a time series. By default, ACCUMULATE=TOTAL. If the ACCUMULATE= option is specified, the SETMISSING= option is useful for specifying how to treat accumulated missing values. If missing values should be interpreted as 0, then you should specify SETMISSING=0. For more information about accumulation, see the section Accumulation. You can specify the following options to determine how to accumulate the observations within each time period based on the ID variable and the frequency that is specified in the INTERVAL= option:","help":"ACCUMULATE= *option*","type":"value"},{"name":"ALIGN=","optional":true,"description":"controls the alignment of SAS date or datetime values that are used to identify the time period of output observations. Although any date or datetime value within the time period can identify the time period, this option requests that the representative date or datetime for the time period be calculated as the beginning date or datetime of the time period, the ending date or datetime of the time period, or the middle date or datetime of the time period. In addition to aligning the time ID values consistently for observations that are supplied by the user, this option specifies the method for calculating the time ID values for observations in the forecast and backcast time periods, which often are not supplied by the user. By default, ALIGN=BEGINNING. You can specify the following options:","help":"ALIGN=*option*","type":"value"},{"name":"END=","optional":true,"description":"specifies a SAS date or datetime literal value that represents the end of the data. If the value of the last time ID variable is less than the END= value, the series is extended with missing values. If the value of the last time ID variable is greater than the END= value, the series is truncated. For example, END='1jan2008'D requests that data for time periods after the first of January 2008 not be used. The option END=\"&sysdate\"D uses the automatic macro variable SYSDATE to extend or truncate the series to the current date. You can use this option and the START= option to ensure that data that are associated with each BY group contain the same number of observations.","help":"END= *date | datetime*","type":"value"},{"name":"FORMAT=","optional":true,"description":"specifies the SAS format for the time ID values. If the FORMAT= option is not specified, the default format is implied by the INTERVAL= option.","help":"FORMAT= *format*","type":"value"},{"name":"SETMISSING=","optional":true,"description":"specifies how to interpret missing values (either actual or accumulated) in the accumulated time series. By default, SETMISSING=MISSING. You can specify either a number (n) or an option to determine how to interpret missing values:","help":"SETMISSING= *n | option*","type":"value"},{"name":"START=","optional":true,"description":"specifies a SAS date or datetime literal value that represents the beginning of the data. If the value of the first time ID variable is greater than the START= value, the series is prefixed with missing values. If the value of the first time ID variable is less than the START= value, the series is truncated. You can use this option and the END= option to ensure that data that are associated with each BY group contain the same number of observations.","help":"START= *date | datetime*","type":"value"},{"name":"TRIMID=","optional":true,"description":"specifies the method for trimming the data in the BY groups. The output time ID variable span that is calculated by the method is dependent on the input time ID variable span, irrespective of missing values of the time series variables. Depending on the method and the input time ID variable data, leading or trailing missing values can be added to the time series variables. After the output time ID variable span is calculated by the method, the ending value of the output time ID variable is recalculated according to the value of the LEAD= option in the FORECAST statement (if the LEAD= option is specified). By default, TRIMID=NONE. You can specify one of the following methods:","help":"TRIMID= *method*","type":"value"}]},{"name":"FORECAST","description":"The FORECAST statement lists the numeric variables in the input data table whose accumulated values represent time series to be modeled and forecast. (The input data table is specified in the DATA= option in the PROC CESM statement.) You must specify a variable-list that contains one or more numeric variables. For more information about the variable-list, see the section \"SAS Variable Lists\" in SAS Programmers Guide: Essentials. You can specify any number of FORECAST statements, but you cannot specify the same variable in more than one of them.","help":"FORECAST *variable-list* / &lt;options&gt;;","arguments":[{"name":"ACCUMULATE=","optional":true,"followsDelimiter":"/","description":"specifies how to accumulate the data table observations within each time period for the variables in the variable-list. If the ACCUMULATE= option is not specified in the FORECAST statement, accumulation is determined by the ACCUMULATE= option in the ID statement. Use the ACCUMULATE= option with multiple FORECAST statements when you want different accumulation specifications for different variables. For more information, see the ACCUMULATE= option in the ID statement.","help":"ACCUMULATE=*option*","type":"value"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"specifies the significance level to use in computing the confidence limits of the forecast, where number must be between 0 and 1. By default, ALPHA=0.05, which produces 95% confidence intervals.","help":"ALPHA=*number*","type":"value"},{"name":"BACK=","optional":true,"followsDelimiter":"/","description":"specifies the number of observations before the end of the data where the multistep forecasts are to begin. By default, BACK=0.","help":"BACK=*n*","type":"value"},{"name":"CRITERION=","optional":true,"followsDelimiter":"/","description":"specifies the model selection criterion (statistic of fit) to use to select from several candidate models. The default is CRITERION=RMSE. The following statistics of fit are provided:","help":"CRITERION=*criterion*","type":"value"},{"name":"LEAD=","optional":true,"followsDelimiter":"/","description":"specifies the number of periods ahead to forecast (the forecast lead or horizon). The value n is not relative to the last nonmissing observation of a particular series, but is instead relative to the BACK= option specification to the last observation in the input data table or the accumulated series. Thus, if a series has missing values at the end, the actual number of forecasts computed for that series is greater than n. By default, LEAD=0.","help":"LEAD=*n*","type":"value"},{"name":"MEDIAN","optional":true,"followsDelimiter":"/","description":"estimates the median forecast values and uses those values for forecasting. (By default, PROC CESM uses mean values for forecasting.) If you do not specify the TRANSFORM= option, no transformation is applied to the time series, so the mean and median forecast values are identical.","type":"standalone"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"specifies the forecasting model to use to forecast the time series. By default, METHOD=BEST. You can specify the following forecasting model-names:","help":"METHOD=*model-name*","type":"value"},{"name":"SETMISSING=","optional":true,"followsDelimiter":"/","description":"specifies how to assign missing values (either input or accumulated) in the accumulated time series for variables in the variable-list. If the SETMISSING= option is not specified in the FORECAST statement, missing values are set according to the value of the SETMISSING= option in the ID statement. For more information, see the SETMISSING= option in the ID statement.","help":"SETMISSING=*option* | *number*","type":"value"},{"name":"TRANSFORM=","optional":true,"followsDelimiter":"/","description":"specifies the time series transformation to be applied to the input or accumulated time series. By default, TRANSFORM=NONE. When the TRANSFORM= option is specified, the time series must be strictly positive. After the time series is transformed, the model parameters are estimated by using the transformed series. The forecasts of the transformed series are then computed, and finally the transformed series forecasts are inverse-transformed. The inverse transform produces either mean or median forecasts depending on whether the MEDIAN option is specified. For more information, see the sections Transformations and Inverse Transformations. You can specify the following values for option:","help":"TRANSFORM=*option*","type":"value"}]}],"supportSiteInformation":{"docsetId":"casecon","docsetVersion":"latest","docsetTargetFile":"casecon_cesm_toc.htm"}}