{"name":"CONDENSEIMAGES","statements":[{"name":"PROC CONDENSEIMAGES","description":"The CONDENSEIMAGES procedure converts a wide table that contains one pixel per variable to an image table so that other image-related procedures can use it. In essence, PROC CONDENSEIMAGES provides the opposite functionality of the FLATTENIMAGES procedure.","help":"PROC CONDENSEIMAGES *DATA=libref.data-table**HEIGHT=number**NUMCHANNELS=COLOR|GRAYSCALE**WIDTH=number*&lt;&lt;options&gt;&gt;","arguments":[{"name":"DATA=","description":"names the input data table for PROC CONDENSEIMAGES to use. The default is the most recently created data table. libref.data-table is a two-level name, where libref refers to a collection of information that is defined in the LIBNAME statement and includes the library, which includes a path to the data, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"HEIGHT=","description":"specifies the height of the output images in pixels, where number is a positive integer.","help":"HEIGHT=*number*","type":"value"},{"name":"NUMCHANNELS=","description":"specifies whether the output images are in gray scale or color. Gray-scale images have one channel, and color images have three channels.","help":"NUMCHANNELS=COLOR | GRAYSCALE","type":"choice","arguments":[{"name":"COLOR","type":"standalone"},{"name":"GRAYSCALE","type":"standalone"}]},{"name":"WIDTH=","description":"specifies the width of the output images in pixels, where number is a positive integer.","help":"WIDTH=*number*","type":"value"},{"name":"GROUPEDCHANNELS","optional":true,"description":"specifies that the pixels of images in the input table are currently grouped by color (all the blue pixels, then all the green pixels, and then all the red pixels). If you omit this option, this means that the pixels in the input table are not currently grouped by color (that is, there is one blue pixel, one green pixel, and one red pixel; then another blue pixel, green pixel, and red pixel; and so on).","type":"standalone"}]},{"name":"INPUT","description":"The INPUT statement specifies one or more variables as input variables to use in constructing the images. If you omit this statement, then all numeric variables are used. You can specify the individual variables, a range of variables, or a combination of both.","help":"INPUT *&lt;variables&gt;*;","arguments":[{"name":"variables","placeholder":true,"description":"names the INPUT variable.","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates an output data table that contains the results of PROC CONDENSEIMAGES.","help":"OUTPUT  OUT=libref.data-table  &lt;COPYVARS=(variables)&gt;&lt;DEPTH=BIT8 | BIT32 | BIT64&gt; ...&lt;ENCODING=BMP | JPG | PIXEL | PNG | TIF&gt;;                     ","arguments":[{"name":"OUT=","description":"names the output data table for PROC CONDENSEIMAGES to use. You must specify this option before any other options. libref.data-table is a two-level name, where libref refers to a collection of information that is defined in the LIBNAME statement and includes the library, which includes a path to where the data table is to be stored, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement; and data-table specifies the name of the output data table.","help":"OUT=*libref.data-table*","type":"dataSet"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS"],"description":"lists one or more variables from the input data table to be transferred to the output data table.","help":"COPYVAR=*variable*","type":"value"},{"name":"DEPTH=","optional":true,"description":"specifies the depth of a pixel in the output images","help":"DEPTH=BIT8 | BIT32 | BIT64","type":"choice","arguments":[{"name":"BIT8","type":"standalone"},{"name":"BIT32","type":"standalone"},{"name":"BIT64","type":"standalone"}]},{"name":"ENCODING=","optional":true,"description":"specifies the encoding of the output image","help":"ENCODING=BMP | JPG | PIXEL | PNG | TIF","type":"choice","arguments":[{"name":"BMP","type":"standalone"},{"name":"JPG","type":"standalone"},{"name":"PIXEL","type":"standalone"},{"name":"PNG","type":"standalone"},{"name":"TIF","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"cascv","docsetVersion":"latest","docsetTargetFile":"cascv_condenseimages_toc.htm"}}