{"name":"COPULA","statements":[{"name":"PROC COPULA","description":"A multivariate distribution for a random vector contains a description of both the marginal distributions and their dependence structure. A copula approach to formulating a multivariate distribution provides a way to isolate the description of the dependence structure from the marginal distributions. A copula is a function that combines marginal distributions of variables into a specific multivariate distribution. All of the one-dimensional marginals in the multivariate distribution are the cumulative distribution functions of the factors. Copulas help perform large-scale multivariate simulation from separate models, each of which can be fitted using different, even nonnormal, distributional specifications. The COPULA procedure enables you to fit multivariate distributions or copulas from a given sample data set","help":"PROC COPULA <DATA= SAS-data-set>;\n\tVAR variables;\n\tDEFINE namecopula-type<( parameter-value-options ...)>;\n\tFIT type<NAME= name><INIT=  (parameter-value-options)> / options;\n\tBOUNDS bound1<, bound2 ...>;\n\tSIMULATE <copula-name-list> / options;\n\tBY variables;","arguments":[{"name":"DATA=","optional":true,"description":"specifies the input data set used to estimate parameters for the FIT statement. When the procedure is used for simulation only, the input data set is not required to run the procedure. If you do not specify libref, then the Work library is used. Work is the default temporary library that is automatically defined by SAS at the beginning of each SAS session or job.","help":"DATA=*&lt;libref.&gt;SAS-data-set*","type":"dataSet"}]},{"name":"BOUNDS","description":"The BOUNDS statement specifies the lower and upper bounds for the parameters. You can use this statement only when maximum likelihood estimation is used for the specified copula.","help":"BOUNDS *bound1*&lt;, *bound2 ...*&gt;;","arguments":[{"name":"bound1","placeholder":true,"description":"Each bound is composed of parameters, constants, and inequality operators in the following format:","help":"*bound1* &lt;, *bound2* ...&gt;","type":"value"}]},{"name":"BY","description":"The BY statement specifies groups in which separate FIT analyses for copula are performed. The variables must be present in the input data set and are excluded from the model fitting. The BY statement requires the VAR statement to be present. A SIMULATE statement can also be used with a BY statement, provided that a FIT statement precedes the SIMULATE statement. Multiple FIT and SIMULATE statements can be used with a BY statement. If a FIT statement and a SIMULATE statement both specify the same name, then the fitting results of the FIT statement with that name are used to initialize the simulation of the same name. If no names are specified in a sequence of FIT and SIMULATE statements, then the simulation requested by a particular SIMULATE statement is initialized using the fitting results from the FIT statement that immediately precedes the SIMULATE statement.","help":"BY *variables;*","arguments":[{"name":"variables","placeholder":true,"description":"The BY statement specifies groups in which separate FIT analyses for copula are performed. The variables must be present in the input data set and are excluded from the model fitting. The BY statement requires the VAR statement to be present.","type":"value"}]},{"name":"DEFINE","description":"The DEFINE statement specifies the relevant information of copula used for the simulation. The DEFINE statement is used with the SIMULATE statement. The FIT statement can also be used with the SIMULATE statement. The results of the FIT statement can be the input of the SIMULATE statement. Therefore, the SIMULATE statement can follow the FIT statement. If there is no FIT statement, then the DEFINE statement must precede the SIMULATE statement. However, you cannot use both the FIT and DEFINE statements in the same procedure.","help":"DEFINE *name**copula-type*&lt;( *parameter-value-options ...*)&gt;;","arguments":[{"name":"name","placeholder":true,"description":"specifies the name of the copula definition, which can be used later in the SIMULATE statement.","type":"value"},{"name":"copula-type","placeholder":true,"description":"specifies one of the following types of copula:","type":"value"},{"name":"CORR=","optional":true,"description":"specifies the data set that contains the correlation matrix to use for elliptical copulas. If the correlation matrix is valid but its elements are not submitted in order, then you must provide the variable names in the first column of the matrix, and these names must match the variable names in the VAR statement. For an example of a correlation matrix input in this form, see Output 11.2.1. If the correlation matrix elements are submitted in order, the first column of variable names is not required. You can use this option for normal and t copulas.","help":"CORR=*SAS-data-set*","type":"dataSet"},{"name":"DF=","optional":true,"description":"specifies the degrees of freedom. You can use this option for t copulas.","help":"DF=*value*","type":"value"},{"name":"HIERARCHY=","optional":true,"description":"specifies the hierarchy for hierarchical Archimedean copulas. The argument usually consists of multiple specification lines, where each line specifies one copula in the hierarchy. The name can be user-defined symbols, with the exception of the copula at the top of the hierarchy, which must be named ROOT. The HAC-specification is a list of symbols that can be either defined copula names or variable names from the VAR statement, depending on whether the element of the copula is a variable or an inner copula in the hierarchy.","help":"HIERARCHY=(*name*=(*HAC-specification*)(THETA=*value*))","type":"value"},{"name":"KENDALL=","optional":true,"description":"specifies the data set that contains the correlation matrix defined in Kendall’s tau. If the correlation matrix is valid but its elements are not submitted in order, then you must provide the variable names in the first column of the matrix, and these names must match the variable names in the VAR statement. If the correlation matrix elements are submitted in order, the first column of variable names is not required. You can use this option for normal and t copulas.","help":"KENDALL=*SAS-data-set*","type":"dataSet"},{"name":"SPEARMAN=","optional":true,"description":"specifies the data set that contains the correlation matrix defined in Spearman’s rho. If the correlation matrix is valid but its elements are not submitted in order, then you must provide the variable names in the first column of the matrix, and these names must match the variable names in the VAR statement. If the correlation matrix elements are submitted in order, the first column of variable names is not required. You can use this option for normal copulas.","help":"SPEARMAN=*SAS-data-set*","type":"dataSet"},{"name":"THETA=","optional":true,"description":"specifies the parameter value for Archimedean copulas.","help":"THETA=*value*","type":"value"}]},{"name":"FIT","description":"The FIT statement estimates the parameters for a specified copula type.","help":"FIT *type*&lt;NAME= *name*&gt;&lt;INIT=  (*parameter-value-options*)&gt; / *options*;","arguments":[{"name":"type","placeholder":true,"description":"specifies the type of the copula to be estimated, which is one of the following:","type":"value"},{"name":"NAME=","optional":true,"description":"specifies an identifier for the fit, which is stored as an ID variable in the OUTCOPULA= data set.","help":"NAME=*name*","type":"value"},{"name":"INIT=","optional":true,"description":"provides the initial values for the numerical optimization. [parameter-value-options] specify the input parameters that are used to initialize the specified copula. These options must be appropriate for the type of copula that you specify. You can specify the following options:","help":"INIT=(*parameter-value-options*)","type":"value"},{"name":"MARGINALS=","optional":true,"followsDelimiter":"/","description":"specifies the marginal distribution of the individual variables. You can specify the following values:","help":"MARGINALS=UNIFORM | EMPERICAL","type":"choice","arguments":[{"name":"UNIFORM","type":"standalone"},{"name":"EMPERICAL","type":"standalone"}]},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"specifies the method used to estimate parameters. You can specify the following values:","help":"METHOD=MLE | CAL","type":"choice","arguments":[{"name":"MLE","type":"standalone"},{"name":"CAL","type":"standalone"}]},{"name":"OUTCOPULA","optional":true,"followsDelimiter":"/","description":"specifies the name of the output data set. Each fitted copula is written to the specified SAS-data-set. The data set is not created if this option is not specified. You can specify one of the following options, which must be appropriate for the type of copula that you specify:","help":"OUTCOPULA &lt;(KENDALL | SPEARMAN)&gt;=*SAS-data-set*","type":"dataSet"},{"name":"OUTPSEUDO=","optional":true,"followsDelimiter":"/","description":"specifies the output data set for saving the pseudo-samples with uniform marginal distributions. The pseudo-samples are obtained by transforming the individual variables of the original data with the empirical cumulative distribution functions (CDFs). The data set is not created if this option is not specified.","help":"OUTPSEUDO=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS","optional":true,"followsDelimiter":"/","description":"controls the plots that are produced by the COPULA procedure. By default, PROC COPULA produces a scatter plot matrix for variables (that is, it displays a symmetric matrix plot with the variables that are specified in the VAR statement). You can specify the following global-plot-options:","help":"PLOTS&lt;(*global-plot-options*)&gt;&lt;=(*specific-plot-options*)&gt;","type":"standaloneOrValue"},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"prints a summary iteration listing.","type":"standalone"},{"name":"NOCORR","optional":true,"followsDelimiter":"/","description":"suppresses the correlation matrix.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","description":"suppresses all output.","type":"standalone"},{"name":"PRINTALL","optional":true,"followsDelimiter":"/","description":"default option.","type":"standalone"}]},{"name":"SIMULATE","description":"The SIMULATE statement simulates data from a specified copula model.","help":"SIMULATE &lt;*copula-name-list*&gt; / *options*;","arguments":[{"name":"copula-name-list","optional":true,"placeholder":true,"description":"The copula name specification can be either the name of a defined copula as specified by name in the DEFINE statement or the name of a fitted copula specified in the NAME= option in the FIT statement copula specification.","type":"value"},{"name":"MARGINALS=","optional":true,"followsDelimiter":"/","description":"specifies how the marginal distributions are computed. If MARGINALS=UNIFORM, then the samples are drawn from the copula distribution and marginal distributions are uniform. MARGINALS=EMPIRICAL can be used to explicitly specify that the marginal distributions are empirical CDF computed from the DATA= option in the PROC COPULA statement. If the MARGINALS= option is not specified in the SIMULATE statement, then the marginal distributions used in the simulation depend on whether a preceding FIT statement was used: If there is no FIT statement, the marginal distributions depend on whether the PROC COPULA statement includes a DATA= option. If there is a preceding FIT statement, then the marginal distributions from that fit are used. If there is no FIT statement and there is no DATA= option, then MARGINALS=UNIFORM.","help":"MARGINALS=UNIFORM | EMPIRICAL","type":"choice","arguments":[{"name":"UNIFORM","type":"standalone"},{"name":"EMPIRICAL","type":"standalone"}]},{"name":"NDRAWS=","optional":true,"followsDelimiter":"/","description":"specifies the number of draws to generate for this simulation. The default is 100.","help":"NDRAWS=*integer*","type":"value"},{"name":"OUT=","optional":true,"followsDelimiter":"/","description":"specifies the output data set for the random samples from the simulation. This data set is the SAS data set in the OUTUNIFORM= option transformed by the inverse empirical CDF. This option is useful only when an input data exists and MARGINALS=EMPIRICAL. The data set is not created if this option is not specified.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTUNIFORM=","optional":true,"followsDelimiter":"/","description":"specifies the output data set for the result of the simulation in uniforms. This option can be used when MARGINALS=UNIFORM or when MARGINALS=EMPIRICAL. If MARGINALS=EMPIRICAL, then this option enables you to obtain the samples simulated from the joint distribution specified by the copula, with all marginal distributions being uniform. The data are not created if this option is not specified.","help":"OUTUNIFORM=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS","optional":true,"followsDelimiter":"/","description":"controls the plots that are produced by the COPULA procedure. By default, the PROC COPULA produces a scatter plot matrix for variables. You can specify any of the following global-plot-options:","help":"PLOTS&lt;(*global-plot-options*)&gt;&lt;=(*specific-plot-options*)&gt;","type":"standaloneOrValue"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"specifies the seed for generating random numbers for the simulation. If the seed is not provided, a random number is used as the seed.","help":"SEED=*integer*","type":"value"}]},{"name":"VAR","description":"The VAR statement specifies the variable names in the input data set specified by the DATA= option in the PROC COPULA statement.","help":"VAR *variables*;","arguments":[{"name":"variables","placeholder":true,"description":"The subset of variables in the data set is used for the copula models in the FIT statement. When there is no input data set, the VAR statement creates the names of the list of variables for the SIMULATE statement.","type":"value"}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"latest","docsetTargetFile":"etsug_copula_toc.htm"}}