{"name":"CORRELATION","statements":[{"name":"PROC CORRELATION","description":"The CORRELATION procedure computes Pearson correlation coefficients and the probabilities associated with these statistics in SAS Viya. † The Pearson product-moment correlation is a parametric measure of a linear relationship between two variables. When only one set of analysis variables is specified, the default correlation analysis includes descriptive statistics for each analysis variable and pairwise Pearson correlation statistics for these variables. When two sets of analysis variables are specified, the default correlation analysis includes descriptive statistics for each analysis variable and pairwise Pearson correlation statistics between the two sets of variables. When the relationship between two variables is nonlinear or when outliers are present, the correlation coefficient might incorrectly estimate the strength of the relationship.","help":"PROC CORRELATION <ALPHA> <BEST=n> <COV> <CSSCP> <DATA=CAS-libref.data-table> <EXCLNPWGT> <NOCORR> <NOMISS> <NOPROB> <NOSIMPLE> <OUTP=CAS-libref.data-table> <RANK> <SSCP> <VARDEF=DF | N | WDF... >;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...; \n   \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...; \n   \n\tFREQ variable;     \n\tVAR variables;     \n\tWEIGHT variable; \n   \n\tWITH variables; ","arguments":[{"name":"ALPHA","optional":true,"description":"Calculates and prints Cronbach’s coefficient alpha. PROC CORRELATION computes separate coefficients using raw and standardized values (scaling the variables to a unit variance of 1). For each VAR statement variable, PROC CORRELATION computes the correlation between the variable and the total of the remaining variables. It also computes Cronbach’s coefficient alpha by using only the remaining variables.","type":"standalone"},{"name":"BEST=","optional":true,"description":"Prints the n highest correlation coefficients for each variable, n ≥ 1. Correlations are ordered from highest to lowest in absolute value. Otherwise, PROC CORRELATION prints correlations in a rectangular table, using the variable names as row and column labels.","help":"BEST=*n*","type":"value"},{"name":"COV","optional":true,"description":"Displays the variance and covariance matrix. When you specify the COV option, the Pearson correlations will also be displayed. If you specify the OUTP= option, the output data table also contains the covariance matrix with the corresponding _TYPE_ variable value 'COV.'","type":"standalone"},{"name":"CSSCP","optional":true,"description":"Displays a table of the corrected sums of squares and crossproducts.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC CORRELATION to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where CAS-libref refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, which includes a path to the data, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement.","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"EXCLNPWGT","optional":true,"aliases":["EXCLNPWGTS"],"description":"Excludes observations with nonpositive weight values from the analysis. By default, PROC CORRELATION treats observations with negative weights like those with zero weights and counts them in the total number of observations.","type":"standalone"},{"name":"NOCORR","optional":true,"description":"Suppresses displaying of Pearson correlations.","type":"standalone"},{"name":"NOMISS","optional":true,"description":"Excludes observations with missing values from the analysis.","type":"standalone"},{"name":"NOPROB","optional":true,"description":"Suppresses displaying the probabilities associated with each correlation coefficient.","type":"standalone"},{"name":"NOSIMPLE","optional":true,"description":"Suppresses printing simple descriptive statistics for each variable.","type":"standalone"},{"name":"OUTP=","optional":true,"description":"Creates an output data table that contains Pearson correlation statistics. CAS-libref specifies the CAS library where the output data table is to be created, and data-table specifies the name of the output data table. This data table also includes means, standard deviations, and the number of observations. If you specify the ALPHA option, the output data table also contains six observations with Cronbach’s coefficient alpha.","help":"OUTP=*CAS-libref.data-table*","type":"dataSet"},{"name":"RANK","optional":true,"description":"Displays the ordered correlation coefficients for each variable. Correlations are ordered from highest to lowest in absolute value.","type":"standalone"},{"name":"SSCP","optional":true,"description":"Displays a table of the sums of squares and crossproducts.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the variance divisor in the calculation of variances and covariances. The default is VARDEF=DF.","help":"VARDEF=DF | N | WDF | WEIGHT","type":"choice","arguments":[{"name":"DF","description":"Degrees of freedom","type":"standalone"},{"name":"N","description":"Number of observations","type":"standalone"},{"name":"WDF","description":"Sum of weights minus one","type":"standalone"},{"name":"WEIGHT","aliases":["WGT"],"description":"Sum of weights","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement in PROC CORRELATION to obtain separate analyses of observations in groups that are defined by the values of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates the CAS output tables on all nodes.","type":"standalone"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. PROC CORRELATION treats each observation as if it appears f times, where f is the value of the FREQ variable for the observation. If f is not an integer, it is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable"},{"name":"VAR","description":"The VAR statement lists variables for which to compute correlation coefficients. If the VAR statement is not specified, PROC CORRELATION computes correlations for all numeric variables not listed in other statements.","help":"VAR variables"},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used in the calculation of Pearson weighted product-moment correlations. The observations with missing weights are excluded from the analysis. By default, for observations with nonpositive weights, weights are set to zero and the observations are included in the analysis. You can use the EXCLNPWGT option to exclude observations with negative or zero weights from the analysis. If a WEIGHT statement is not included, all observations that are used in the analysis are assigned a weight of 1.","help":"WEIGHT variable"},{"name":"WITH","description":"The WITH statement lists variables with which correlations of the VAR statement variables are to be computed.","help":"WITH variables"}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"v_019","docsetTargetFile":"casstat_corr_toc.htm"}}