{"name":"DQMATCH","statements":[{"name":"PROC DQMATCH","description":"The DQMATCH procedure creates match codes in an output data set for specified input character variables. The procedure can also generate cluster numbers for input values that generate identical match codes. Cluster numbers are not assigned to input values that generate unique match codes. Input values that generate a unique match code (no cluster number) can be excluded from the output data set. Blank values can be retained in the output data set. Blank values can receive a cluster number. † Match codes are created based on a specified match definition in a specified locale. † A specified sensitivity level determines the amount of information in the match codes. The amount of information in the match codes determines the number of clusters and the number of members in each cluster. Higher sensitivity levels produce fewer clusters, with fewer members per cluster. Use higher sensitivities when you need matches that are more exact. Use lower sensitivity levels to sort data into general categories or to capture all values that use different spellings to convey the same information.","help":"PROC DQMATCH <CLUSTER=output-variable-name> <CLUSTERS_ONLY> <CLUSTER_BLANKS> <DATA=input-data-set> <DELIMITER> <LOCALE=locale-name> <MATCHCODE=output-variable> <NOCLUSTER_BLANKS> <NODELIMITER> <OUT=data-set-name>;     \n\tCRITERIA <DELIMSTR= parsed-input-variable> <MATCHDEF=match-definition> <VAR=input-variable> ...; ","arguments":[{"name":"CLUSTER=","optional":true,"description":"Specifies the name of the numeric variable in the output data set that contains the cluster number. If the CLUSTER= option is not specified and if the CLUSTERS_ONLY option is specified, then an output variable named CLUSTER is created.","help":"CLUSTER=*output-variable-name*","type":"value"},{"name":"CLUSTERS_ONLY","optional":true,"description":"Excludes from the output data set any input character values that are not found to be part of a cluster. A cluster number is assigned only when two or more input values produce the same match code. Specifying CLUSTERS_ONLY excludes input character values that have unique match codes and are not blank. This option is not asserted by default. Normally, all input values are included in the output data set.","type":"standalone"},{"name":"CLUSTER_BLANKS","optional":true,"description":"Writes blank values into the output data set, without an accompanying match code.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Identifies the input SAS data set. The default input data set is the most recently created data set in the current SAS session.","help":"DATA=*input-data-set*","type":"dataSet"},{"name":"DELIMITER","optional":true,"description":"Specifies that exclamation points (!) separate the individual match codes that make up the concatenated match code.","type":"standalone"},{"name":"LOCALE=","optional":true,"description":"Specifies the locale that will be used to create match codes. The value can be a locale name in quotation marks or the name of a variable whose value is a locale name or is an expression that evaluates to a locale name.","help":"LOCALE=*locale-name*","type":"value"},{"name":"MATCHCODE=","optional":true,"description":"Specifies a name for the output character variable that stores the match codes. The DQMATCH procedure defines a sufficient length for this variable, even if a variable with the same name already exists in the input data set. A default match code variable named MATCH_CD is generated if the following statements are all true: o No value is specified for the MATCHCODE= option in the PROC DQMATCH statement, and no values are specified for the MATCHCODE= option in subsequent CRITERIA statements. o No value is specified for the CLUSTER= option. o No value is specified for the CLUSTERS_ONLY option.","help":"MATCHCODE=*output-variable*","type":"value"},{"name":"NOCLUSTER_BLANKS","optional":true,"description":"Removes blank values from the output data set.","type":"standalone"},{"name":"NODELIMITER","optional":true,"description":"Specifies that multiple match codes are concatenated without the exclamation points.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies the name of the output data set. If the specified data set does not exist, PROC DQMATCH creates it. The default output data set is the input data set.","help":"OUT=*data-set-name*","type":"dataSet"}]},{"name":"CRITERIA","description":"Creates match codes and optional cluster numbers for an input variable. Requirement: At least one CRITERIA statement is required in a DQMATCH procedure step.","help":"CRITERIA &lt;DELIMSTR= parsed-input-variable&gt; &lt;MATCHDEF=match-definition&gt; &lt;VAR=input-variable&gt; ...","arguments":[{"name":"CONDITION=","optional":true,"description":"(Optional) Groups CRITERIA statements to constrain the assignment of cluster numbers. Multiple CRITERIA statements with the same CONDITION= value are all required to match the values of an existing cluster to receive the number of that cluster. The CRITERIA statements are applied as a logical AND. If more than one CONDITION= number is defined in a series of CRITERIA statements, then a logical OR is applied across all CONDITION= values. For example, in a table of customer information, you could assign cluster numbers based on matches between the customer name AND the home address OR the customer name and organization address. The default value of CONDITION= is 1. All CRITERIA statements that lack a CONDITION= value receive a cluster number based on a logical AND of all such CRITERIA statements. If you have not assigned a value to the CLUSTER= option in the DQMATCH procedure, then cluster numbers are assigned to a variable named CLUSTER by default.","help":"CONDITION=*integer*","type":"value"},{"name":"DELIMSTR=","optional":true,"description":"Specifies the name of a variable that has been parsed by the DQPARSE function, or contains tokens that were added with the DQPARSETOKENPUT function.","type":"value"},{"name":"EXACT","optional":true,"description":"Assigns a cluster number based on an exact character match between values rather than a match between match codes. If you have not assigned a value to the CLUSTER= option in the DQMATCH procedure, then cluster numbers will be assigned to a variable named CLUSTER by default. If you specify EXACT, you cannot specify MATCHDEF=, MATCHCODE=, or SENSITIVITY= in that CRITERIA statement. If you specify MATCHCODE= in PROC DQMATCH, the match code is a composite of the exact character value and the match code that is generated by the match definition.","type":"standalone"},{"name":"MATCHCODE=","optional":true,"description":"(Optional) Specifies the name of the variable that receives the match codes for the character variable that is specified in the VAR= or DELIMSTR= option. In the CRITERIA statement, the value of the MATCHCODE= option is not valid if you also specify the MATCHCODE= option in the PROC DQMATCH statement.","help":"MATCHCODE=*output-variable*","type":"value"},{"name":"MATCHDEF=","optional":true,"description":"Defines the match definition that is used to create the match code for the specified variable. The match definition must exist in the locale that is specified in the LOCALE=option of the PROC DQMATCH statement.","help":"MATCHDEF=*match-definition*","type":"value"},{"name":"SENSITIVITY=","optional":true,"description":"(Optional) Determines the amount of information in the resulting match codes. Higher sensitivity values create match codes that contain more information about the input values. Higher sensitivity levels result in a greater number of clusters, with fewer values in each cluster. Valid values range from 50 to 95. The default value is 85.","help":"SENSITIVITY=*information-value*","type":"value"},{"name":"VAR=","optional":true,"description":"Specifies the name of the character variable that is used to create match codes. The values of this variable cannot contain delimiters that were added with the functions DQPARSE or DQPARSETOKENPUT. If the variable contains delimited values, use the DELIMSTR= option instead of the VAR= option.","help":"VAR=*input-variable*","type":"value"}]}],"supportSiteInformation":{"docsetId":"dqclref","docsetVersion":"v_001","docsetTargetFile":"n1qx8v350g506kn1j1xlnm0v303h.htm"}}