{"name":"DQSCHEME","statements":[{"name":"PROC DQSCHEME","description":"The DQSCHEME procedure creates scheme data sets and analysis data sets and applies schemes to input data sets. You can also apply schemes with the DQSCHEMEAPPLY function or CALL routine.","help":"PROC DQSCHEME <BFD> <DATA=input-SAS-data-set> <NOBFD> <OUT=output-data-set>;     \n\tAPPLY <LOCALE=locale-name> <MATCHDEF=match-definition> <MODE=<PHRASE | ELEMENT>> ...; \n   \n\tCONVERT <BFDTOSAS> <IN=file-specification> <SASTOBFD> ...; \n   \n\tCREATE <ANALYSIS=output-data-set> <INCLUDE_ALL> <LOCALE=locale-name> ...; ","arguments":[{"name":"BFD","optional":true,"description":"Indicates that all Blue Fusion Data that are created or applied in the current procedure step are in BFD format. This is the default.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Identifies the SAS data set from which one or more schemes are built, when you use the CREATE statement. When you use the APPLY statement to apply existing schemes, the DATA= option specifies the data set against which the schemes are applied.","help":"DATA=*input-SAS-data-set*","type":"dataSet"},{"name":"NOBFD","optional":true,"description":"Indicates that all schemes are in SAS format.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies the name of the output data set. If the specified data set does not exist, PROC DQSCHEME creates it. The default output data set is the input data set.","help":"OUT=*output-data-set*","type":"dataSet"}]},{"name":"APPLY","description":"Applies a scheme to transform the values of a single variable.","help":"APPLY &lt;LOCALE=locale-name&gt; &lt;MATCHDEF=match-definition&gt; &lt;MODE=&lt;PHRASE | ELEMENT&gt;&gt; ...","arguments":[{"name":"LOCALE=","optional":true,"description":"Specifies the locale that contains the match definition that is specified in the MATCHDEF= option. Note: This option is valid only when SCHEME_LOOKUP= USE_MATCHDEF. If USE_MATCHDEF is specified and LOCALE= is not specified, the locale that is used is the default locale, which is the first locale in the locale list. If you do not specify USE_MATCHDEF, then the locale that is used is the locale that is stored in the scheme. The default locale is used if a locale is not stored in the scheme.","help":"LOCALE=*locale-name*","type":"value"},{"name":"MATCHDEF=","optional":true,"description":"Specifies the name of the match definition in the specified locale that will be used to create match codes during the application of the scheme. Note: This option is valid only when SCHEME_LOOKUP= USE_MATCHDEF.","help":"MATCHDEF=*match-definition*","type":"value"},{"name":"MODE=","optional":true,"description":"Specifies how the scheme is to be applied. The default value is the mode that is stored in the scheme. If no mode is stored in the scheme, then PHRASE is the default mode.","help":"MODE=PHRASE | ELEMENT","type":"choice","arguments":[{"name":"PHRASE","description":"Specifies that the entirety of each value of the input character variable is compared to the data values in the scheme. When SCHEME_LOOKUP=USE_MATCHDEF, the match code for the entire input value is compared to the match codes that are generated for each DATA value in the scheme.","type":"standalone"},{"name":"ELEMENT","description":"Specifies that each element in each value of the input character variable is compared to the DATA values in the scheme. When SCHEME_LOOKUP=USE_MATCHDEF, the match code for each element is compared to the match codes that are generated for each element in each data value in the scheme.","type":"standalone"}]},{"name":"SCHEME=","optional":true,"description":"Identifies the scheme to apply to the input data set. In all operating environments other than z/OS, schemes using BFD format are identified by specifying a fileref for a fully-qualified filename that ends in .sch.bfd. In the z/OS operating environment, no special naming conventions are required. For schemes with SAS format, specify a one-level or two-level SAS data set name.","help":"SCHEME=*scheme-name*","type":"value"},{"name":"SCHEME_LOOKUP=","optional":true,"description":"Specifies one of three mutually exclusive methods of applying the scheme to the values of the input character variable.","help":"SCHEME_LOOKUP=EXACT | IGNORE_CASE | USE_MATCHDEF","type":"choice","arguments":[{"name":"EXACT","description":"This default value specifies that the values of the input variable are to be compared to the DATA values in the scheme without changing the input values in any way.","type":"standalone"},{"name":"IGNORE_CASE","description":"Specifies that capitalization is to be ignored when input values are compared to the DATA values in the scheme. Any adjacent blank spaces in the input values are replaced with single blank spaces before comparison.","type":"standalone"},{"name":"USE_MATCHDEF","description":"Specifies that comparisons are to be made between the match codes of the input values and the match codes of the DATA values in the scheme. A transformation occurs when the match code of an input value is identical to the match code of a DATA value in the scheme.","type":"standalone"}]},{"name":"SENSITIVITY=","optional":true,"description":"Specifies the amount of information in the match codes that are created during the application of the scheme. With higher sensitivity values, two values must be increasingly similar to create the same match code. At lower sensitivity values, two values can receive the same match code despite dissimilarities. Note: The SENSITIVITY= option is valid only when SCHEME_LOOKUP= USE_MATCHDEF. If USE_MATCHDEF is specified and SENSITIVITY= is not specified, the sensitivity value is 85. If USE_MATCHDEF is not specified, the sensitivity value is the value that is stored in the scheme. If USE_MATCHDEF is not specified and if a sensitivity value is not stored in the scheme, the sensitivity value is 85.","help":"SENSITIVITY=*complexity-factor*","type":"value"},{"name":"VAR=","optional":true,"description":"Identifies the character variable in the input data set that is to be transformed. The maximum length of input values is 1024 bytes.","help":"VAR=*variable-name*","type":"value"}]},{"name":"CONVERT","description":"Converts schemes between SAS and BFD formats. Required: All options are required (IN and OUT, BFDTOSAS or SASTOBFD).","help":"CONVERT &lt;BFDTOSAS&gt; &lt;IN=file-specification&gt; &lt;SASTOBFD&gt; ...","arguments":[{"name":"BFDTOSAS","optional":true,"description":"Converts a scheme in Blue Fusion Data format to SAS format.","type":"standalone"},{"name":"IN=","optional":true,"description":"Identifies the existing scheme that is to be converted. If BFDTOSAS is specified, then the value must be the name of a fileref that references a fully-qualified path in lowercase that ends in .sch.bfd. (In the z/OS operating environment, the PDS specification has no special naming requirements.) If SASTOBFD is specified, then the value must be a one-level or two-level SAS data set name.","help":"IN=*file-specification*","type":"value"},{"name":"OUT=","optional":true,"description":"Specifies the name of the converted scheme. If BFDTOSAS is specified, then the value must be a one-level or two-level SAS data set name. If SASTOBFD is specified, then the value must be the name of a fileref that references a fully-qualified path in lowercase that ends in .sch.bfd. (In the z/OS operating environment, the PDS specification has no special naming requirements.)","help":"OUT=*file-specification*","type":"value"},{"name":"SASTOBFD","optional":true,"description":"Convert a scheme in SAS format to Blue Fusion Data format.","type":"standalone"}]},{"name":"CREATE","description":"Creates a scheme or an analysis data set.","help":"CREATE &lt;ANALYSIS=output-data-set&gt; &lt;INCLUDE_ALL&gt; &lt;LOCALE=locale-name&gt; ...","arguments":[{"name":"ANALYSIS=","optional":true,"description":"Names the output data set that will store analytical data.","help":"ANALYSIS=*output-data-set*","type":"dataSet"},{"name":"INCLUDE_ALL","optional":true,"description":"Specifies that the scheme is to contain all of the values of the input variable, including those with unique match codes that were not transformed and that did not receive a cluster number. INCLUDE_ALL is not specified by default.","type":"standalone"},{"name":"LOCALE=","optional":true,"description":"(Optional) Specifies the locale that contains the specified match definition. The value can be a locale name in quotation marks or the name of a variable whose value is a locale name or is an expression that evaluates to a locale name.","help":"LOCALE=*locale-name*","type":"value"},{"name":"MATCHDEF=","optional":true,"description":"Specifies the match definition in the specified locale that is used to establish cluster numbers. Although you can specify any valid match definition, you are strongly encouraged to use definitions whose names end in (SCHEME BUILD) when using the ENUSA locale. These match definitions yield optimal results in the DQSCHEME procedure, as discussed in About the Scheme Build Match Definitions.","help":"MATCHDEF=*match-definition*","type":"value"},{"name":"MODE=","optional":true,"description":"Specifies a default mode of scheme application. This information is stored in the scheme as metadata. The default mode that you specify here can be superseded when the scheme is applied.","help":"MODE=PHRASE | ELEMENT","type":"choice","arguments":[{"name":"PHRASE","description":"This default value specifies that the entirety of each value of the input character variable is compared to the data values in the scheme.","type":"standalone"},{"name":"ELEMENT","description":"Specifies that each element in each value of the input character variable is compared to the data values in the scheme.","type":"standalone"}]},{"name":"SCHEME=","optional":true,"description":"Specifies the name of the scheme that will be created. To create a scheme data set in Blue Fusion Data format, specify the BFD option in the PROC DQSCHEME statement (see DQSCHEME Procedure Syntax), and specify an existing fileref as the value of the SCHEME= option. The fileref must reference a fully qualified path with a filename that ends in .sch.bfd. Lowercase letters are required. CAUTION: In the z/OS operating environment, specify only schemes using SAS format. BFD schemes can be applied but not created in the z/OS operating environment. To create a scheme in SAS format, specify the NOBFD option in the PROC DQSCHEME statement and specify a one-level or two-level SAS data set name.","help":"SCHEME=*scheme-name*","type":"value"},{"name":"SCHEME_LOOKUP=","optional":true,"description":"Specifies one of three mutually exclusive methods of applying the scheme to the values of the input character variable.","help":"SCHEME_LOOKUP=EXACT | IGNORE_CASE | USE_MATCHDEF","type":"choice","arguments":[{"name":"EXACT","description":"This default value specifies that the values of the input variable are to be compared to the DATA values in the scheme without changing the input values in any way.","type":"standalone"},{"name":"IGNORE_CASE","description":"Specifies that capitalization is to be ignored when input values are compared to the DATA values in the scheme. Any adjacent blank spaces in the input values are replaced with single blank spaces before comparison.","type":"standalone"},{"name":"USE_MATCHDEF","description":"Specifies that comparisons are to be made between the match codes of the input values and the match codes of the DATA values in the scheme. A transformation occurs when the match code of an input value is identical to the match code of a DATA value in the scheme.","type":"standalone"}]},{"name":"SENSITIVITY=","optional":true,"description":"(Optional) Determines the amount of information that will be included in the match codes that are generated during the creation and perhaps the application of the scheme. Higher-sensitivity values generate match codes that contain more information, which generally results in fewer matches, a greater number of clusters, and fewer values in each cluster. Valid values range from 50 to 95. The default value is 85.","help":"SENSITIVITY=*information-factor*","type":"value"},{"name":"VAR=","optional":true,"description":"Identifies the input character variable that is analyzed and transformed. The maximum length of input values is 1024 bytes.","help":"VAR=*variable-name*","type":"value"}]}],"supportSiteInformation":{"docsetId":"dqclref","docsetVersion":"v_001","docsetTargetFile":"n1ix4dy79b76brn1jca5jxbaexen.htm"}}