{"name":"ENTROPY","statements":[{"name":"PROC ENTROPY","description":"The ENTROPY procedure implements a parametric method of linear estimation based on generalized maximum entropy. The ENTROPY procedure is suitable when there are outliers in the data and robustness is required, when the model is ill-posed or under-determined for the observed data, or for regressions that involve small data sets. † The main features of the ENTROPY procedure are as follows: † o estimation of simultaneous systems of linear regression models o estimation of Markov models o estimation of seemingly unrelated regression (SUR) models o estimation of unordered multinomial discrete Choice models o solution of pure inverse problems o allowance of bounds and restrictions on parameters o performance of tests on parameters o allowance of data and moment constrained generalized cross entropy","help":"PROC ENTROPY <COLLIN><CONVERGE=value><COVBEST=CROSS | GME | GMENM><DATA=SAS-data-set><DUAL><GMED><GMENM><GME><ITPRINT><MARKOV><MAXITER=n><MAXSUBITER=n><METHOD=TR | NEWRAP | NRR... ><NOPRINT><OUT=SAS-data-set><OUTCOV><OUTEST=SAS-data-set><OUTL=SAS-data-set><OUTP=SAS-data-set><OUTS=SAS-data-set><OUTSUSED=SAS-data-set><PDATA=SAS-data-set><PLOTS=ALL | FITPLOT | COOKSD... ><PURE><SDATA=SAS-data-set><SUR><VARDEF=N | WGT | DF... >;     \n\tBOUNDS bound1 <, bound2 ...> ;\n\tBY variables ;\n\tID variables ;\n\tMODEL <ESUPPORTS=( support (prior) ... )><MARGINALS = ( variable = value, ..., variable = value)><NOINT> ...;\n\tPRIORS variable <support points < (priors) >> variable <support points < (priors) >> ... ;\n\tRESTRICT restriction1 < , restriction2 ...> ;\n\tTEST <LM><RAO><WALD> ...;\n\tWEIGHT variable ;","arguments":[{"name":"COLLIN","optional":true,"description":"Requests that the collinearity diagnostics of the X'X matrix be printed.","type":"standalone"},{"name":"CONVERGE=","optional":true,"aliases":["GCONV="],"description":"Specifies the convergence criteria for S-iterated methods. The convergence measure computed during model estimation must be less than value before convergence is assumed. The default value is CONVERGE=0.001.","help":"CONVERGE=*value*","type":"value"},{"name":"COVBEST=","optional":true,"description":"Specifies the method for producing the covariance matrix of parameters for output and for standard error calculations.","help":"COVBEST=CROSS | GME | GMENM","type":"choice","arguments":[{"name":"CROSS","description":"Requests generalized cross entropy.","type":"standalone"},{"name":"GME","description":"Requests generalized maximum entropy. This is the default estimation method.","type":"standalone"},{"name":"GMENM","description":"Requests normed moment maximum entropy.","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Specifies the input data set. Values for the variables in the model are read from this data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DUAL","optional":true,"aliases":["PRIMAL"],"description":"Specifies whether the optimization problem is solved using the dual or primal form. The dual form is the default.","type":"standalone"},{"name":"GMED","optional":true,"description":"Requests a variant of GME suitable for multinomial discrete choice models.","type":"standalone"},{"name":"GMENM","optional":true,"aliases":["GCENM"],"description":"Requests normed moment maximum entropy or the normed moment cross entropy.","type":"standalone"},{"name":"GME","optional":true,"aliases":["GCE"],"description":"Requests generalized maximum entropy or generalized cross entropy. This is the default estimation method.","type":"standalone"},{"name":"ITPRINT","optional":true,"description":"Prints the parameter estimates, objective function value, and convergence criteria at each iteration.","type":"standalone"},{"name":"MARKOV","optional":true,"description":"Specifies that the model is a first-order Markov model.","type":"standalone"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations allowed. The default is MAXITER=100.","help":"MAXITER=*n*","type":"value"},{"name":"MAXSUBITER=","optional":true,"description":"Specifies the maximum number of subiterations allowed for an iteration. The MAXSUBITER= option limits the number of step halvings. The default is MAXSUBITER=30.","help":"MAXSUBITER=*n*","type":"value"},{"name":"METHOD=","optional":true,"aliases":["TECHNIQUE=","TECH="],"description":"Specifies the iterative minimization method to use.","help":"METHOD=TR | NEWRAP | NRR | QN | CONGR | NSIMP | DBLDOG | LEVMAR","type":"choice","arguments":[{"name":"TR","description":"Specifies the trust region method.","type":"standalone"},{"name":"NEWRAP","description":"Specifies the Newton-Raphson method.","type":"standalone"},{"name":"NRR","description":"Specifies the Newton-Raphson ridge method.","type":"standalone"},{"name":"QN","description":"Specifies the quasi-Newton method.","type":"standalone"},{"name":"CONGR","description":"Specifies the Conjugate gradient optimization method.","type":"standalone"},{"name":"NSIMP","description":"Specifies the Nelder-Mead simplex method.","type":"standalone"},{"name":"DBLDOG","description":"Specifies the double-dogleg optimization method.","type":"standalone"},{"name":"LEVMAR","description":"Specifies the Levenberg-Marquardt optimization method.","type":"standalone"}]},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal printed output but does not suppress error listings. Using any other print option turns the NOPRINT option off.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Names the SAS data set to contain the residuals from each estimation.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTCOV","optional":true,"aliases":["COVOUT"],"description":"Writes the covariance matrix of the estimates to the OUTEST= data set in addition to the parameter estimates. The OUTCOV option is applicable only if the OUTEST= option is also specified.","type":"standalone"},{"name":"OUTEST=","optional":true,"description":"Names the SAS data set to contain the parameter estimates and optionally the covariance of the estimates.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"OUTL=","optional":true,"description":"Names the SAS data set to contain the estimated Lagrange multipliers for the models.","help":"OUTL=*SAS-data-set*","type":"dataSet"},{"name":"OUTP=","optional":true,"description":"Names the SAS data set to contain the support points and estimated probabilities.","help":"OUTP=*SAS-data-set*","type":"dataSet"},{"name":"OUTS=","optional":true,"description":"Names the SAS data set to contain the estimated covariance matrix of the equation errors. This is the covariance of the residuals computed from the parameter estimates.","help":"OUTS=*SAS-data-set*","type":"dataSet"},{"name":"OUTSUSED=","optional":true,"description":"Names the SAS data set to contain the S matrix used in the objective function definition. The OUTSUSED= data set is the same as the OUTS= data set for the methods that iterate the S matrix.","help":"OUTSUSED=*SAS-data-set*","type":"dataSet"},{"name":"PDATA=","optional":true,"description":"Names the SAS data set that contains the data about priors and supports.","help":"PDATA=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Requests that the ENTROPY procedure produce statistical graphics via the Output Delivery System, provided that the ODS GRAPHICS statement has been specified. The following global-plot-options apply to all relevant plots generated by the ENTROPY procedure. The global-plot-options supported by the ENTROPY procedure are as follows: ONLY suppresses the default plots. Only the plots specifically requested are produced.","help":"PLOTS=ALL | FITPLOT | COOKSD | QQ | STUDENTRESIDUAL | RESIDUALHISTOGRAM | NONE","type":"choice","arguments":[{"name":"ALL","description":"Requests that all plots appropriate for the particular analysis be produced.","type":"standalone"},{"name":"FITPLOT","description":"Plots the predicted and actual values.","type":"standalone"},{"name":"COOKSD","description":"Produces the Cook’s D plot.","type":"standalone"},{"name":"QQ","description":"Q-Q plot of residuals.","type":"standalone"},{"name":"STUDENTRESIDUAL","description":"Plots the studentized residuals.","type":"standalone"},{"name":"RESIDUALHISTOGRAM","description":"Plots the histogram of residuals.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"}]},{"name":"PURE","optional":true,"description":"Specifies a regression without an error term.","type":"standalone"},{"name":"SDATA=","optional":true,"description":"Specifies a data set that provides the covariance matrix of the equation errors.","help":"SDATA=*SAS-data-set*","type":"dataSet"},{"name":"SUR","optional":true,"aliases":["ITSUR"],"description":"Specifies seemingly unrelated regression or iterated seemingly unrelated regression.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the denominator to be used in computing variances and covariances. The default is VARDEF=DF.","help":"VARDEF=N | WGT | DF | WDF","type":"choice","arguments":[{"name":"N","description":"Specifies that the number of nonmissing observations be used.","type":"standalone"},{"name":"WGT","description":"Specifies that the sum of the weights be used.","type":"standalone"},{"name":"DF","description":"Specifies that the number of nonmissing observations minus the model degrees of freedom (number of parameters) be used.","type":"standalone"},{"name":"WDF","description":"Specifies that the sum of the weights minus the model degrees of freedom be used.","type":"standalone"}]}]},{"name":"BOUNDS","description":"The BOUNDS statement imposes simple boundary constraints on the parameter estimates. BOUNDS statement constraints refer to the parameters estimated by the ENTROPY procedure. You can specify any number of BOUNDS statements. Each boundary constraint is composed of variables, constants, and inequality operators in the following form: item operator item <,operator item <,operator item ...> > Each item is a constant, the name of a regressor variable, or a list of regressor names. Each operator is <, >, ≤, or ≥ .","help":"BOUNDS bound1 &lt;, bound2 ...&gt; "},{"name":"BY","description":"A BY statement is used to obtain separate estimates for observations in groups defined by the BY variables. To save parameter estimates for each BY group, use the OUTEST= option.","help":"BY variables "},{"name":"ID","description":"The ID statement specifies variables to identify observations in error messages or other listings and in the OUT= data set. The ID variables are normally SAS date or datetime variables. If more than one ID variable is used, the first variable is used to identify the observations and the remaining variables are added to the OUT= data set.","help":"ID variables "},{"name":"MODEL","description":"The MODEL statement specifies the dependent variable and independent regressor variables for the regression model. If no independent variables are specified in the MODEL statement, only the mean (intercept) is estimated. To model a system of equations, specify more than one MODEL statement.","help":"MODEL &lt;ESUPPORTS=( support (prior) ... )&gt;&lt;MARGINALS = ( variable = value, ..., variable = value)&gt;&lt;NOINT&gt; ...","arguments":[{"name":"CATEGORY=","optional":true,"followsDelimiter":"/","description":"Specifies the variable that keeps track of the categories the dependent variable is in when there is range censoring. When the actual value is observed, this variable should be set to MISSING.","type":"value"},{"name":"CENSORED=","optional":true,"followsDelimiter":"/","description":"Specifies that the dependent variable be observed with censoring and specifies the censoring thresholds and the supports of the censored observations.","help":"CENSORED=UB= | LB= | ESUPPORTS=","type":"choice","arguments":[{"name":"UB=","type":"value"},{"name":"LB=","type":"value"},{"name":"ESUPPORTS=","type":"value"}]},{"name":"ESUPPORTS=","optional":true,"followsDelimiter":"/","description":"Specifies the support points and prior weights on the residuals for the specified equation.","type":"value"},{"name":"MARGINALS=","optional":true,"followsDelimiter":"/","description":"Requests that the marginal effects of each variable be calculated for GME-D. Specifying the MARGINALS option with an optional list of values calculates the marginals at that vector of values. For example, if x1–x4 are explanatory variables, then including MARGINALS = ( x1 = 2, x2 = 4, x3 = –1, x4 = 5)","type":"value"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Suppresses the intercept parameter.","type":"standalone"},{"name":"RANGE=","optional":true,"followsDelimiter":"/","description":"Specifies that the dependent variable be range bound. The RANGE option defines the range and the key ( RANGE ) that is used to identify the observation as being range bound. The RANGE = value should be some value in the CATEGORY= variable. The L and R define, respectively, the left endpoint of the range and the right endpoint of the range. ESUPPORTS sets the error supports on the variable.","help":"RANGE=ID= | L= | R= | ESUPPORTS=","type":"choice","arguments":[{"name":"ID=","type":"value"},{"name":"L=","type":"value"},{"name":"R=","type":"value"},{"name":"ESUPPORTS=","type":"value"}]}]},{"name":"PRIORS","description":"The PRIORS statement specifies the support points and prior weights for the coefficients on the variables. Support points for coefficients default to five points, determined as follows: -2*value,-value,0,value*value where value is computed as value=(||mean||+3*sderr)*multiplier where the mean and the stderr are obtained from OLS and the multiplier depends on the MULTIPLIER= option. The MULTIPLIER= option defaults to 2 for unrestricted models and to 4 for restricted models. The prior probabilities for each support point default to the uniform distribution.","help":"PRIORS variable &lt;support points &lt; (priors) &gt;&gt; variable &lt;support points &lt; (priors) &gt;&gt; ... "},{"name":"RESTRICT","description":"The RESTRICT statement is used to impose linear restrictions on the parameter estimates. You can specify any number of RESTRICT statements. Each restriction is written as an optional name, followed by an expression, followed by an equality operator (=) or an inequality operator (<, >, ≤, ≥), followed by a second expression: <\"name\" > expression operator expression The optional \"name\" is a string used to identify the restriction in the printed output and in the OUTEST= data set. The operator can be =, <, >, ≤ , or ≥. The operator and second expression are optional, as in the TEST statement, where they default to 0. Restriction expressions can be composed of variable names, multiplication (*), and addition (+) operators, and constants. Variable names in restriction expressions must be among the variables whose coefficients are estimated by the model. The restriction expressions must be a linear function of the variables.","help":"RESTRICT restriction1 &lt; , restriction2 ...&gt; "},{"name":"TEST","description":"The TEST statement performs tests of linear hypotheses on the model parameters. The TEST statement applies only to parameters estimated in the model. You can specify any number of TEST statements. Each test is written as an expression optionally followed by an equal sign (=) and a second expression: expression ≤ expression> Test expressions can be composed of variable names, multiplication (*), addition (+), and subtraction (-) operators, and constants. Variables named in test expressions must be among the variables estimated by the model.","help":"TEST &lt;LM&gt;&lt;RAO&gt;&lt;WALD&gt; ...","arguments":[{"name":"ALL","optional":true,"followsDelimiter":"/","description":"Requests all three types of tests.","type":"standalone"},{"name":"LAGRANGE","optional":true,"followsDelimiter":"/","description":"Specifies that a Lagrange multiplier test be computed.","type":"standalone"},{"name":"LIKE","optional":true,"followsDelimiter":"/","description":"Specifies that a pseudo-likelihood ratio test be computed.","type":"standalone"},{"name":"LM","optional":true,"followsDelimiter":"/","description":"Specifies that a Lagrange multiplier test be computed.","type":"standalone"},{"name":"LR","optional":true,"followsDelimiter":"/","description":"Specifies that a pseudo-likelihood ratio test be computed.","type":"standalone"},{"name":"OUT=","optional":true,"followsDelimiter":"/","description":"Specifies the name of an output SAS data set that contains the test results. The format of the OUT= data set produced by the TEST statement is similar to that of the OUTEST= data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"RAO","optional":true,"followsDelimiter":"/","description":"Specifies that a Lagrange multiplier test be computed.","type":"standalone"},{"name":"WALD","optional":true,"followsDelimiter":"/","description":"Specifies that a Wald test be computed. WALD is the default.","type":"standalone"}]},{"name":"WEIGHT","description":"The WEIGHT statement specifies a variable to supply weighting values to use for each observation in estimating parameters. If the weight of an observation is nonpositive, that observation is not used for the estimation. Variable must be a numeric variable in the input data set. The regressors and the dependent variables are multiplied by the square root of the weight variable to form the weighted X matrix and the weighted dependent variable. The same weight is used for all MODEL statements.","help":"WEIGHT variable "}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"latest","docsetTargetFile":"etsug_entropy_toc.htm"}}