{"name":"FASTCLUS","statements":[{"name":"PROC FASTCLUS","description":"The FASTCLUS procedure performs a disjoint cluster analysis on the basis of distances computed from one or more quantitative variables. The observations are divided into clusters such that every observation belongs to one and only one cluster; the clusters do not form a tree structure as they do in the CLUSTER procedure. If you want separate analysis for different numbers of clusters, you can run PROC FASTCLUS once for each analysis. Alternatively, to do hierarchical clustering on a large data set, use PROC FASTCLUS to find initial clusters, and then use those initial clusters as input to PROC CLUSTER.","help":"PROC FASTCLUS <BINS=n> <CLUSTER=name> <CLUSTERLABEL=name> <CONVERGE=c> <DATA=SAS-data-set> <DELETE=n> <DISTANCE> <DRIFT> <HC=c> <HP=p1 <p2>> <IMPUTE> <INSTAT=SAS-data-set> <IRLS> <LEAST=1 | 2 | MAX... > <LIST> MAXCLUSTERS=n <MAXITER=n> <MEAN=SAS-data-set> <NOMISS> <NOPRINT> <OUT=SAS-data-set> <OUTITER> <OUTSEED=SAS-data-set> <OUTSTAT=SAS-data-set> RADIUS=t <RANDOM=n> <REPLACE=FULL | PART | NONE... > <SEED=SAS-data-set> <SHORT> <STRICT=s> <SUMMARY> <VARDEF=DF | N | WDF... >;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tFREQ variable;     \n\tID variable ;     \n\tVAR variable(s);  \n  \n\tWEIGHT variable; ","arguments":[{"name":"MAXCLUSTERS=","aliases":["MAXC="],"description":"Specifies the maximum number of clusters permitted. If you omit the MAXCLUSTERS= option, a value of 100 is assumed.","help":"MAXCLUSTERS=*n*","type":"value"},{"name":"RADIUS=","aliases":["R="],"description":"Establishes the minimum distance criterion for selecting new seeds.","help":"RADIUS=*t*","type":"value"},{"name":"BINS=","optional":true,"description":"Specifies the number of bins used in the bin-sort algorithm for computing medians for LEAST=1.","help":"BINS=*n*","type":"value"},{"name":"CLUSTER=","optional":true,"description":"Specifies a name for the variable in the OUTSEED= and OUT= data sets that indicates cluster membership.","help":"CLUSTER=*name*","type":"value"},{"name":"CLUSTERLABEL=","optional":true,"description":"Specifies a label for the variable CLUSTER in the OUTSEED= and OUT= data sets. By default this variable has no label.","help":"CLUSTERLABEL=*name*","type":"value"},{"name":"CONVERGE=","optional":true,"aliases":["CONV="],"description":"Specifies the convergence criterion. Any nonnegative value is permitted. The default value is 0.0001 for all values of P if LEAST=P is explicitly specified; otherwise, the default value is 0.02.","help":"CONVERGE=*c*","type":"value"},{"name":"DATA=","optional":true,"description":"Specifies the input data set containing observations to be clustered. If you omit the DATA= option, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DELETE=","optional":true,"description":"Deletes cluster seeds to which n or fewer observations are assigned.","help":"DELETE=*n*","type":"value"},{"name":"DISTANCE","optional":true,"aliases":["DIST"],"description":"Computes distances between the cluster means.","type":"standalone"},{"name":"DRIFT","optional":true,"description":"Executes the second of the four steps in which the FASTCLUS procedure operates. After initial seed selection, each observation is assigned to the cluster with the nearest seed.","type":"standalone"},{"name":"HC=","optional":true,"description":"Pertains to the homotopy parameter for LEAST=P, where 1<p<2. You should specify these options only if you encounter convergence problems when you use the default values.","help":"HC=*c*","type":"value"},{"name":"HP=","optional":true,"description":"Pertains to the homotopy parameter for LEAST=P, where 1<p<2. You should specify these options only if you encounter convergence problems when you use the default values.","type":"value"},{"name":"IMPUTE","optional":true,"description":"Requests imputation of missing values after the final assignment of observations to clusters.","type":"standalone"},{"name":"INSTAT=","optional":true,"description":"Reads a SAS data set previously created with the FASTCLUS procedure by using the OUTSTAT= option.","help":"INSTAT=*SAS-data-set*","type":"dataSet"},{"name":"IRLS","optional":true,"description":"Causes PROC FASTCLUS to use an iteratively reweighted least squares method instead of the modified Ekblom-Newton method.","type":"standalone"},{"name":"LEAST=","optional":true,"aliases":["L="],"description":"Causes PROC FASTCLUS to optimize an Lp criterion, where 1<=P<=infinity.","help":"LEAST=1 | 2 | MAX | *p*","type":"choice","arguments":[{"name":"1","description":"PROC FASTCLUS tries to minimize the mean absolute difference between the data and the corresponding cluster medians.","type":"standalone"},{"name":"2","description":"PROC FASTCLUS tries to minimize the root mean squared difference between the data and the corresponding cluster means.","type":"standalone"},{"name":"MAX","description":"PROC FASTCLUS tries to minimize the maximum absolute difference between the data and the corresponding cluster midranges.","type":"standalone"},{"name":"<p>","placeholder":true,"description":"PROC FASTCLUS tries to minimize the pth root of the mean of the pth powers of the absolute differences between the data and the corresponding cluster seeds.","type":"value"}]},{"name":"LIST","optional":true,"description":"Lists all observations, giving the value of the ID variable (if any), the number of the cluster to which the observation is assigned, and the distance between the observation and the final cluster seed.","type":"standalone"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations for recomputing cluster seeds.","help":"MAXITER=*n*","type":"value"},{"name":"MEAN=","optional":true,"description":"Creates an output data set to contain the cluster means and other statistics for each cluster.","help":"MEAN=*SAS-data-set*","type":"dataSet"},{"name":"NOMISS","optional":true,"description":"Excludes observations with missing values from the analysis. However, if you also specify the IMPUTE option, observations with missing values are included in the final cluster assignments.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output. Note that this option temporarily disables the Output Delivery System (ODS).","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output data set to contain all the original data, plus the new variables CLUSTER and DISTANCE.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTITER","optional":true,"description":"Outputs information from the iteration history to the OUTSEED= data set, including the cluster seeds at each iteration.","type":"standalone"},{"name":"OUTSEED=","optional":true,"aliases":["OUTS="],"description":"Is another name for the MEAN= data set, provided because the data set can contain location estimates other than means. The MEAN= option is still accepted.","help":"OUTSEED=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Creates an output data set to contain various statistics, especially those not included in the OUTSEED= data set.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"RANDOM=","optional":true,"description":"Specifies a positive integer as a starting value for the pseudo-random number generator for use with REPLACE=RANDOM.","help":"RANDOM=*n*","type":"value"},{"name":"REPLACE=","optional":true,"description":"Specifies how seed replacement is performed.","help":"REPLACE=FULL | PART | NONE | RANDOM","type":"choice","arguments":[{"name":"FULL","description":"Requests default seed replacement","type":"standalone"},{"name":"PART","description":"Requests seed replacement only when the distance between the observation and the closest seed is greater than the minimum distance between seeds.","type":"standalone"},{"name":"NONE","description":"Suppresses seed replacement.","type":"standalone"},{"name":"RANDOM","description":"Selects a simple pseudo-random sample of complete observations as initial cluster seeds.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies an input data set from which initial cluster seeds are to be selected.","help":"SEED=*SAS-data-set*","type":"dataSet"},{"name":"SHORT","optional":true,"description":"Suppresses the display of the initial cluster seeds, cluster means, and standard deviations.","type":"standalone"},{"name":"STRICT=","optional":true,"description":"Prevents an observation from being assigned to a cluster if its distance to the nearest cluster seed exceeds the value of the STRICT= option. If you specify the STRICT option without a numeric value, you must also specify the RADIUS= option, and its value is used instead.","help":"STRICT=*s*","type":"value"},{"name":"SUMMARY","optional":true,"description":"Suppresses the display of the initial cluster seeds, statistics for variables, cluster means, and standard deviations.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the divisor to use in the calculation of variances and covariances. The default value is VARDEF=DF.","help":"VARDEF=DF | N | WDF | WEIGHT","type":"choice","arguments":[{"name":"DF","description":"Degrees of freedom","type":"standalone"},{"name":"N","description":"Number of observations","type":"standalone"},{"name":"WDF","description":"Sum of weights minus one","type":"standalone"},{"name":"WEIGHT","aliases":["WGT"],"description":"Sum of weights","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC FASTCLUS to obtain separate analysis on observations in groups defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"If one variable in your data set represents the frequency of occurrence for the other values in the observation, specify the variable’s name in a FREQ statement. The procedure then treats the data set as if each observation appears ni times, where ni is the value of the FREQ variable for observation i.","help":"FREQ variable"},{"name":"ID","description":"The ID variable, which can be character or numeric, identifies observations on the output when you specify the LIST option.","help":"ID variable "},{"name":"VAR","aliases":["VARIABLES"],"description":"The VAR statement lists the numeric variables to be used in the cluster analysis. If you omit the VAR statement, all numeric variables not listed in other statements are used.","help":"VAR variable(s)"},{"name":"WEIGHT","aliases":["WEIGHTS"],"description":"The values of the WEIGHT variable are used to compute weighted cluster means. The WEIGHT and FREQ statements have a similar effect, except the WEIGHT statement does not alter the degrees of freedom or the number of observations.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_023","docsetTargetFile":"statug_fastclus_toc.htm"}}