{"name":"FASTKNN","statements":[{"name":"PROC FASTKNN","description":"The FASTKNN procedure implements the k-nearest neighbor (k-NN) search algorithm in SAS Viya. The k-NN algorithm has numerous applications, including recommendation systems, image search, fingerprint recognition, and clustering. You can use the FASTKNN procedure to read and write data in distributed form, and to perform search in parallel by making full use of multicore computers or distributed computing environments.","help":"PROC FASTKNN <DATA=CAS-libref.data-table> <K=number> <NOPRINT> <NTHREADS=number-of-threads> <OUTDIST=CAS-libref.data-table> <PARALLELIZATION=INPUT | QUERY> <QUERY=CAS-libref.data-table> <THRESHDIST=number>;     \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...;\n    \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...;\n    \n\tID variable;\n    \n\tINPUT variables;\n    \n\tOUTPUT <COPYVAR=variable | COPYVARS=(variables)> <OUT=CAS-libref.data-table> ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC FASTKNN to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"K=","optional":true,"description":"Specifies the number of neighbors to return, where number is a positive real number.","help":"K=*number*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses ODS output.","type":"standalone"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads to use for the computation, where number-of-threads is an integer from 1 to 64, inclusive. The default value is the maximum number of available threads per computer.","help":"NTHREADS=*number-of-threads*","type":"value"},{"name":"OUTDIST=","optional":true,"description":"Specifies the output model data table to contain the computed pairwise distances between query and input observations. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTDIST=*CAS-libref.data-table*","type":"dataSet"},{"name":"PARALLELIZATION=","optional":true,"description":"Specifies which data table to distribute among worker nodes.","help":"PARALLELIZATION=INPUT | QUERY","type":"choice","arguments":[{"name":"INPUT","description":"Distributes the input data table among worker nodes. Specify this value only when the input data table is much larger than the query data table.","type":"standalone"},{"name":"QUERY","description":"Distributes the query data table among worker nodes.","type":"standalone"}]},{"name":"QUERY=","optional":true,"description":"Specifies the input data table that contains the query observations. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"QUERY=*CAS-libref.data-table*","type":"dataSet"},{"name":"THRESHDIST=","optional":true,"description":"Specifies the distance threshold for the model, where number is an integer greater than 0. PROC FASTKNN excludes from the computation distances greater than number.","help":"THRESHDIST=*number*","type":"value"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"ID","description":"The ID statement lists one variable to be copied from the input data table to the output data tables that are specified in the OUT= option in the OUTPUT statement and in the OUTDIST= option in the PROC FASTKNN statement. You must specify one variable, which must be numeric.","help":"ID variable"},{"name":"INPUT","description":"The INPUT statement specifies the variables to be used in the nearest neighbor search. The variables must be of interval type. You must specify at least one input variable.","help":"INPUT variables"},{"name":"OUTPUT","description":"The OUTPUT statement creates an output data table to contain the results of the procedure run.","help":"OUTPUT &lt;COPYVAR=variable | COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; ","arguments":[{"name":"COPYVAR=","optional":true,"description":"Lists one or more variables from the input data table to be transferred to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC FASTKNN to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where CAS-libref refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, which includes a path to where the data table is to be stored, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement.","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"v_018","docsetTargetFile":"casml_fastknn_toc.htm"}}