{"name":"FISM","statements":[{"name":"PROC FISM","description":"The FISM procedure performs frequent item set mining, which looks for frequent patterns in a large database. The FISM procedure finds frequent patterns by using the FP-growth (frequent-pattern growth) algorithm of Han, Pei, and Yin (2000). The FP-growth algorithm uses a special data structure called the frequent-pattern tree (FP-tree), which retains the item set association information. † The FISM procedure is used by other procedures such as the MBANALYSIS procedure for association rule mining.","help":"PROC FISM <DATA=CAS-libref.data-table><ITEMS=number><NFIS_RANGE=(number, number)><PCTSUP=number | SUPPCT=number | SUP_PCT=number | PCTSUPPORT=number><SUPPORT=number>;     \n\tCUSTOMER variable;\n\tOUTPUT <OUT=CAS-libref.data-table><OUTFREQ=CAS-libref.data-table> ;\n\tTARGET variable;","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC FISM to use. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"ITEMS=","optional":true,"description":"Specifies the number of items in a frequent item set, where number must be an integer between 1 and 1,000. By default, ITEMS=2 when you specify the OUT= option in the OUTPUT statement; otherwise, ITEMS=1 by default. This option is ignored if you specify the NFIS_RANGE= option.","help":"ITEMS=*number*","type":"value"},{"name":"NFIS_RANGE=","optional":true,"description":"Specifies the range of number of items in the frequent item sets, where number must be an integer between 1 and 1,000.","type":"value"},{"name":"PCTSUP=","optional":true,"aliases":["SUPPCT=","SUP_PCT=","PCTSUPPORT="],"description":"Specifies the minimum level of support for a rule as a percentage of the number of baskets in the input data table, where number must be a real number between 0 and 100, inclusive. This option is ignored if the SUPPORT= option is specified.","type":"value"},{"name":"SUPPORT=","optional":true,"description":"Specifies the minimum level of support (minimum frequency of an item) for a rule, where number must be an integer greater than or equal to 0. This option overrides the specification of the PCTSUP= option.","help":"SUPPORT=*number*","type":"value"}]},{"name":"CUSTOMER","description":"The CUSTOMER statement groups one or more specified target variables into a basket. You can also specify this statement as ID variables.","help":"CUSTOMER variable"},{"name":"OUTPUT","description":"The OUTPUT statement specifies output tables that contain result of FISM procedure.","help":"OUTPUT &lt;OUT=CAS-libref.data-table&gt;&lt;OUTFREQ=CAS-libref.data-table&gt;","arguments":[{"name":"OUT=","optional":true,"description":"The OUTPUT statement creates a data table to contain the predicted target values of the input table CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"OUTFREQ=","optional":true,"description":"Creates a data table that contains information about the unique frequent items with their transaction counts and support. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTFREQ=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"TARGET","description":"The TARGET statement specifies a single nominal variable to use as the target variable. If this variable is not present in the input data table, then PROC FISM exits with an error.","help":"TARGET variable"}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"latest","docsetTargetFile":"casml_fism_toc.htm"}}