{"name":"FOREST","statements":[{"name":"PROC FOREST","description":"The FOREST procedure creates a predictive model called a forest (which consists of several decision trees) in SAS Viya. A predictive model defines a relationship between input variables and a target variable. The purpose of a predictive model is to predict a target value from inputs. The FOREST procedure trains the model; that is, it creates the model by using training data in which the target values are known. The model can then be applied to observations in which the target is unknown. If the predictions fit the new data well, the model is said to generalize well. Good generalization is the primary goal for predictive tasks. A predictive model might fit the training data well but generalize poorly.","help":"PROC FOREST <ASSIGNMISSING=USEINSEARCH | MACSMALL | NONE> <BINMETHOD=BUCKET | QUANTILE> DATA=CAS-libref.data-table <INBAGFRACTION=number> <INMODEL=< CAS-libref. >data-table> <ISOLATION <(SAMPLEN=number)>> <LOH=L> <MAXBRANCH=b> <MAXDEPTH=number> <MINLEAFSIZE=number> <MINUSEINSEARCH=number> <NOPRINT> <NTREES=number> <NUMBIN=number> <OUTMODEL=<CAS-libref. >data-table> <PRINTTARGET> <RBAIMP> <SEED=number> <VARS_TO_TRY=m | M=m> <VII=2 | 3> <VOTE=MAJORITY | PROBABILITY>;     \n\tAUTOTUNE <EVALHISTORY=<ALL | LOG | NOE>... > <FRACTION=number> <KFOLD=number> ...;\n    \n\tCODE <COMMENT> <FILE=filename> <FORMATWIDTH=width> ...;\n    \n\tCROSSVALIDATION <KFOLD=number> ;\n    \n\tGROW <CHAID < (options) >> <CHISQUARE < (options) >> <ENTROPY (<options>) | GAIN < option >> ...;\n    \n\tID variables;\n    \n\tINPUT <LEVEL=<NOMINAL | INTERVAL>> ;\n    \n\tOUTPUT <COPYVAR=variable | COPYVARS=(variables)> <OUT=CAS-libref.data-table> ;\n    \n\tPARTITION <FRACTION(< TEST=fraction > < VALIDATE=fraction > < SEED=number >)> <ROLE=|ROLEVAR=variable (< TEST='value' > < TRAIN='value' > < VALIDATE='value' >)> ;\n    \n\tSAVESTATE <RSTORE=CAS-libref.data-table> ;\n    \n\tTARGET <LEVEL=<NOMINAL | INTERVAL>> ;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"DATA=","description":"Names the input data table for PROC FOREST to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"ASSIGNMISSING=","optional":true,"description":"Specifies how PROC FOREST creates a default splitting rule that is used to handle missing values and unknown levels. An unknown level is a level of a categorical predictor that does not exist in the training data but is encountered during scoring. This option controls how missing values are used in model training, and controls the creation of the default splitting rule.","help":"ASSIGNMISSING=USEINSEARCH | MACSMALL | NONE","type":"choice","arguments":[{"name":"USEINSEARCH","description":"Treats a missing value as a separate, legitimate value in the search for a split for the primary splitting rule. Missing values in interval inputs are treated as a special level that is used during the split process. In the scoring phase, this default rule assigns missing interval inputs to the branch determined during forest growing, and unknown nominal levels to the largest branch in the split.","type":"standalone"},{"name":"MACSMALL","description":"Treats a missing value as a separate, legitimate value in the search for a split for the primary splitting rule. Missing values in interval inputs are treated as less than any other number. In the scoring phase, this default rule assigns missing interval inputs to the leftmost branch of the split, and unknown nominal levels to the largest branch in the split.","type":"standalone"},{"name":"NONE","description":"Excludes observations that have any missing variables from training the forest model. In the scoring phase, this default rule assigns missing interval inputs to the leftmost branch of the split, and unknown and missing nominal levels to the largest branch in the split.","type":"standalone"}]},{"name":"BINMETHOD=","optional":true,"description":"Specifies how to bin interval input variables prior to growing the forest model. The number of bins that are created is determined by the NUMBIN= option.","help":"BINMETHOD=BUCKET | QUANTILE","type":"choice","arguments":[{"name":"BUCKET","description":"Bins interval input variables into fixed-width bins.","type":"standalone"},{"name":"QUANTILE","description":"Bins interval input variables into bins according to their quantile.","type":"standalone"}]},{"name":"INBAGFRACTION=","optional":true,"description":"Specifies the fraction of the random bootstrap sample of the training data to be used for growing each tree in the forest, where number is a value between 0 and 1.","help":"INBAGFRACTION=*number*","type":"value"},{"name":"INMODEL=","optional":true,"description":"Specifies the data table that you have previously saved as a forest model by using the OUTMODEL= option in a previous run of PROC FOREST. CAS-libref.data-table is a two-level name, where CASlibref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","type":"value"},{"name":"ISOLATION","optional":true,"description":"Creates an isolation forest for anomaly detection instead of creating a forest for target prediction.","type":"standalone"},{"name":"LOH=","optional":true,"description":"Syntax: LOH=L Specifies a number of variables (L) that are preselected to consider for candidate splits for each node. The variables are selected using the Loh method.","help":"LOH=*L*","type":"value"},{"name":"MAXBRANCH=","optional":true,"description":"Specifies the maximum number of children per node in the tree. PROC FOREST tries to create this number of children unless it is impossible (for example, if a split variable does not have enough levels). By default, MAXBRANCH=2.","help":"MAXBRANCH=*b*","type":"value"},{"name":"MAXDEPTH=","optional":true,"description":"Specifies the maximum depth of the tree to be grown.","help":"MAXDEPTH=*number*","type":"value"},{"name":"MINLEAFSIZE=","optional":true,"description":"Specifies the minimum number of observations that each child of a split must contain in the training data table in order for the split to be considered. By default, MINLEAFSIZE=1.","help":"MINLEAFSIZE=*number*","type":"value"},{"name":"MINUSEINSEARCH=","optional":true,"description":"Specifies a threshold for using missing values in the split search when ASSIGNMISSING= USEINSEARCH. If the number of observations in which the splitting variable has missing values is greater than or equal to number, then PROC FOREST uses the USEINSEARCH policy to handle missing values for that variable.","help":"MINUSEINSEARCH=*number*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses ODS output.","type":"standalone"},{"name":"NTREES=","optional":true,"description":"Specifies the number of trees to grow in the forest model.","help":"NTREES=*number*","type":"value"},{"name":"NUMBIN=","optional":true,"description":"Specifies the number of bins in which to bin the interval input variables. PROC FOREST bins continuous predictors to a fixed bin size. This option controls the number of bins and thereby also the size of the bins.","help":"NUMBIN=*number*","type":"value"},{"name":"OUTMODEL=","optional":true,"description":"Specifies the data table to which you want to save the forest model. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","type":"value"},{"name":"PRINTTARGET","optional":true,"description":"Outputs tables that indicate generated columns in the OUT= table from the OUTPUT statement.","type":"standalone"},{"name":"RBAIMP","optional":true,"description":"Creates a variable importance table by using random branch assignment (RBA). This table is created in addition to the normal variable importance table that is calculated using the residual sum of squares (RSS) error.","type":"standalone"},{"name":"SEED=","optional":true,"description":"Specifies the initial seed for random number generation for model building. The value of number must be an integer. If you do not specify a seed or you specify a value less than or equal to 0, the seed is generated from reading the time of day from the computer’s clock.","help":"SEED=*number*","type":"value"},{"name":"VARS_TO_TRY=","optional":true,"aliases":["M="],"description":"Specifies the number of input variables to consider splitting on in a node, where m ranges from 1 to the number of input variables.","type":"value"},{"name":"VII=","optional":true,"aliases":["INTERACTIONIMP="],"description":"Calculates the variable interaction importance, which is described in the section Variable nteraction Importance.","help":"VII=2 | 3","type":"choice","arguments":[{"name":"2","description":"Calculates the importance of all two-way variable interactions.","type":"standalone"},{"name":"3","description":"Calculates the importance of all three-way and all two-way variable interactions.","type":"standalone"}]},{"name":"VOTE=","optional":true,"description":"Specifies how to calculate the predicted probability of the target levels for a nominal target. The predicted level is the level that has the highest predicted probability. This option affects the scoring and fit statistics of the forest model.","help":"VOTE=MAJORITY | PROBABILITY","type":"choice","arguments":[{"name":"MAJORITY","description":"Specifies that the predicted probability of each target level is equal to the number of trees in the forest that predicted that level as the target, divided by the total number of trees in the forest.","type":"standalone"},{"name":"PROBABILITY","description":"Specifies that the predicted probability of each target level is equal to the probability of that level averaged over each tree in the forest.","type":"standalone"}]}]},{"name":"AUTOTUNE","description":"The AUTOTUNE statement searches for the best combination of values of the NTREES=, VARS_TO_TRY=, and INBAGFRACTION= options in the PROC FOREST statement. (If you specify values for these options, they are ignored.) You cannot specify the AUTOTUNE statement in the same procedure run with either the CROSSVALIDATION statement or the PARTITION statement.","help":"AUTOTUNE &lt;EVALHISTORY=&lt;ALL | LOG | NOE&gt;... &gt; &lt;FRACTION=number&gt; &lt;KFOLD=number&gt; ...","arguments":[{"name":"EVALHISTORY=","optional":true,"description":"Specifies how to report the evaluation history of the tuner.","help":"EVALHISTORY=ALL | LOG | NOE | TABLE","type":"choice","arguments":[{"name":"ALL","description":"Reports each evaluation in the log and creates the EvaluationHistory ODS table.","type":"standalone"},{"name":"LOG","description":"Prints the following information to the log for each evaluation: evaluation number, objective value, best objective value up to that point, evaluation time, and elapsed time since the beginning of the tuning process.","type":"standalone"},{"name":"NOE","description":"Suppresses reporting of evaluations in the log and does not create the EvaluationHistory ODS table.","type":"standalone"},{"name":"TABLE","description":"Creates the EvaluationHistory ODS table, which contains all evaluated points. The table contains columns for the evaluation number, all tuning parameters, and the objective function value.","type":"standalone"}]},{"name":"FRACTION=","optional":true,"description":"Specifies the fraction of all data to be used for validation, where number must be between 0.01 and 0.99, inclusive. If you specify this option, the tuner uses a single partition validation for finding the objective value (validation error estimate). This option might not be advisable for small or unbalanced data tables where the random assignment of the validation subset might not provide a good estimate of error. For large, balanced data tables, a single validation partition is usually sufficient for estimating error; a single partition is more efficient than cross validation in terms of the total execution time. By default, FRACTION=0.3. You cannot specify this option in combination with the KFOLD= option.","help":"FRACTION=*number*","type":"value"},{"name":"KFOLD=","optional":true,"description":"Specifies the number of partition folds in the cross validation process, where number must be between 2 and 20, inclusive. If you specify this option, the tuner uses cross validation to find the objective value. In cross validation, each model evaluation requires number of training executions (on number–1 data folds) and number of scoring executions (on 1 hold-out fold). Thus, the evaluation time is increased by approximately number. For small to medium data tables or for unbalanced data tables, cross validation provides on average a better representation of error across the entire data table (a better generalization error). By default, KFOLD=5. You cannot specify this option in combination with the FRACTION= option.","help":"KFOLD=*number*","type":"value"},{"name":"MAXEVALS=","optional":true,"description":"Specifies the maximum number of configuration evaluations allowed for the tuner, where number must be an integer greater than or equal to 3. When the number of evaluations is reached, the tuner terminates the search and returns the results. To produce a single objective function value (validation error estimate), each configuration evaluation requires either a single model training and scoring execution on a validation partition, or a number of training and scoring executions equal to the value of the KFOLD= option for cross validation. The MAXEVALS= option might lead to termination before the value of the MAXITER= option or the MAXTIME= option is reached. By default, MAXEVALS=50.","help":"MAXEVALS=*number*","type":"value"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations of the optimization tuner, where number must be greater than or equal to 1. Each iteration normally involves a number of objective evaluations up to the value of the POPSIZE= option. The MAXITER= option might lead to termination before the value of the MAXEVALS= option or the MAXTIME= option is reached. By default, MAXITER=5.","help":"MAXITER=*number*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies the maximum time (in seconds) allowed for the tuner, where number must be greater than or equal to 1. When this value is reached, the tuner terminates the search and returns results. The actual run time for optimization might be longer because it includes the remaining time needed to finish the current evaluation. For long-running model training (large data tables), the actual run time might significantly exceed number. The MAXTIME= option might lead to termination before the value of the MAXEVALS= option or the MAXITER= option is reached. By default, MAXTIME=36000.","help":"MAXTIME=*number*","type":"value"},{"name":"NPARALLEL=","optional":true,"description":"Specifies the number of evaluations to be performed in parallel, where number must be greater than or equal to 0. When SEARCHMETHOD=GA is specified, the value of number is equal to the value of the POPSIZE= option minus one. When SEARCHMETHOD=LHS or SEARCHMETHOD=RANDOM is specified, the value of number is equal to the value of SAMPLESIZE= option.","help":"NPARALLEL=*number*","type":"value"},{"name":"OBJECTIVE=","optional":true,"description":"Specifies which measure of model performance the tuner uses as the objective function.","help":"OBJECTIVE=ASE | AUC | F05 | F1 | GAMMA | GINI | KS | MAE | MCE | MCLL | MISC | MSE | MSLE | RASE | RMAE | RMSLE | TAU*function*","type":"value","arguments":[{"name":"ASE","description":"Uses average squared error as the objective function.","type":"standalone"},{"name":"AUC","description":"Uses area under the curve as the objective function (nominal type only).","type":"standalone"},{"name":"F05","description":"Uses the F0.5 coefficient as the objective function (nominal type only).","type":"standalone"},{"name":"F1","description":"Uses the F1 coefficient as the objective function (nominal type only).","type":"standalone"},{"name":"GAMMA","description":"Uses the gamma coefficient as the objective function (nominal type only).","type":"standalone"},{"name":"GINI","description":"Uses the Gini coefficient as the objective function (nominal type only).","type":"standalone"},{"name":"KS","description":"Uses the Kolmogorov-Smirnov coefficient as the objective function (nominal type only).","type":"standalone"},{"name":"MAE","description":"Uses the mean absolute error as the objective function (interval type only).","type":"standalone"},{"name":"MCE","description":"Uses the misclassification rate as the objective function (nominal type only).","type":"standalone"},{"name":"MCLL","description":"Uses the multiclass log loss as the objective function (nominal type only).","type":"standalone"},{"name":"MISC","description":"Uses the misclassification error percentage as the objective function (nominal type only).","type":"standalone"},{"name":"MSE","description":"Uses the mean squared error as the objective function (interval type only).","type":"standalone"},{"name":"MSLE","description":"Uses the mean squared logarithmic error as the objective function (interval type only).","type":"standalone"},{"name":"RASE","description":"Uses the root average squared error as the objective function.","type":"standalone"},{"name":"RMAE","description":"Uses the root mean absolute error as the objective function (interval type only).","type":"standalone"},{"name":"RMSLE","description":"Uses the root mean squared logarithmic error as the objective function (interval type only).","type":"standalone"},{"name":"TAU","description":"Uses the tau coefficient as the objective function (nominal type only).","type":"standalone"}]},{"name":"POPSIZE=","optional":true,"description":"Specifies the maximum number of evaluations in one iteration (population), where number must be greater than or equal to 1. In some cases, the tuner algorithm might generate a number of new configurations smaller than number. By default, POPSIZE=10.","help":"POPSIZE=*number*","type":"value"},{"name":"SAMPLESIZE=","optional":true,"description":"Specifies the total number of evaluations, where number must be greater than or equal to 1. You can specify this option when SEARCHMETHOD=RANDOM or SEARCHMETHOD=LHS. This option is ignored when SEARCHMETHOD=GA.","help":"SAMPLESIZE=*number*","type":"value"},{"name":"SEARCHMETHOD=","optional":true,"description":"Specifies the search method to use for tuning.","help":"SEARCHMETHOD=GA | LHS | RANDOM","type":"choice","arguments":[{"name":"GA","description":"Uses an initial Latin hypercube sample that seeds a genetic algorithm to generate a new population of alternative configurations at each iteration.","type":"standalone"},{"name":"LHS","description":"Uses a Latin hypercube to generate a single sample of configurations that is uniform in each tuning parameter, but random in combinations.","type":"standalone"},{"name":"RANDOM","description":"Generates a single sample of purely random configurations.","type":"standalone"}]},{"name":"TARGETEVENT=","optional":true,"description":"Specifies the target event to use for calculating the selected objective function. This option is ignored when the value of the OBJECTIVE= option is not AUC, F1, F05, GINI, GAMMA, TAU, or KS.","help":"TARGETEVENT=*string*","type":"value"},{"name":"TUNINGPARAMETERS=","optional":true,"description":"Specifies which parameters to tune and which ranges to tune over. If USEPARAMETERS=STANDARD, this option is ignored.","help":"TUNINGPARAMETERS=NFACTORS | LB= | UB= | VALUES= | INIT= | EXCLUDE | LEARNSTEP | MAXITER","type":"choice","arguments":[{"name":"NFACTORS","type":"standalone"},{"name":"LB=","type":"value"},{"name":"UB=","type":"value"},{"name":"VALUES=","type":"value"},{"name":"INIT=","type":"value"},{"name":"EXCLUDE","type":"standalone"},{"name":"LEARNSTEP","type":"standalone"},{"name":"MAXITER","type":"standalone"}]},{"name":"USEPARAMETERS=","optional":true,"description":"Specifies how to handle the TUNINGPARAMETERS= option.","help":"USEPARAMETERS=STANDARD | CUSTOM | COMBINED*tuning-parameter-option*","type":"value","arguments":[{"name":"STANDARD","description":"Tunes using the default bounds and initial values for all parameters.","type":"standalone"},{"name":"CUSTOM","description":"Tunes only the parameters that are specified in the TUNINGPARAMETERS= option.","type":"standalone"},{"name":"COMBINED","description":"Tunes the parameters that are specified in the TUNINGPARAMETERS= option and uses default bounds and initial values to tune all other parameters.","type":"standalone"}]}]},{"name":"CODE","description":"The CODE statement writes SAS DATA step code for computing predicted values of the fitted model either to a file or to a catalog entry. This code can then be included in a DATA step to score new data.","help":"CODE &lt;COMMENT&gt; &lt;FILE=filename&gt; &lt;FORMATWIDTH=width&gt; ...","arguments":[{"name":"COMMENT","optional":true,"description":"Adds comments to the generated code.","type":"standalone"},{"name":"FILE=","optional":true,"description":"Names the external file that saves the generated code. When enclosed in a quoted string (for example, FILE=\"c:nmydirnscorecode.sas\"), this option specifies the path and filename for writing the code to an external file. If you do not specify a path but your SAS client has a default path, then the code is written to an external file named filename at that location. You can also specify an unquoted filename of no more than eight characters. If the filename is assigned as a fileref in a Base SAS FILENAME statement, the file specified in the FILENAME statement is opened; otherwise, if your SAS client has a default path, an external file named filename is created..","help":"FILE=*filename*","type":"value"},{"name":"FORMATWIDTH=","optional":true,"description":"Specifies the width to use in formatting derived numbers such as parameter estimates. You can specify a value in the range 4 to 32; the default is 20.","help":"FORMATWIDTH=*width*","type":"value"},{"name":"INDENTSIZE=","optional":true,"description":"Specifies the number of spaces to indent the generated code. You can specify a value in the range 0 to 10; the default is 3.","help":"INDENTSIZE=*n*","type":"value"},{"name":"LABELID=","optional":true,"description":"Specifies a number used to construct array names and statement labels in the generated code. You can specify a value in the range 0 to 1024; the default is randomly chosen.","help":"LABELID=*value*","type":"value"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the line size for the generated code. You can specify a value in the range 64 to 254; the default is 120.","type":"value"},{"name":"NOTRIM","optional":true,"description":"Bases comparisons of formatted values on the full format width, including blank padding. By default, blanks at the beginning and end of strings are ignored.","type":"standalone"},{"name":"PCATALL","optional":true,"description":"Generates probabilities for all levels of categorical response variables.","type":"standalone"}]},{"name":"CROSSVALIDATION","description":"The CROSSVALIDATION statement performs a k-fold cross validation process to find the average estimated validation error. You cannot specify the CROSSVALIDATION statement if you specify either the AUTOTUNE statement or the PARTITION statement.","help":"CROSSVALIDATION &lt;KFOLD=number&gt; ","arguments":[{"name":"KFOLD=","optional":true,"description":"Specifies the number of partition folds in the cross validation process, where number must be between 2 and 20, inclusive.","help":"KFOLD=*number*","type":"value"}]},{"name":"GROW","description":"The GROW statement specifies the criterion by which to split a parent node into child nodes. As it grows the tree, PROC FOREST calculates the specified criterion for each predictor variable and then splits on the predictor variable whose criterion is closest to the value specified for that criterion.","help":"GROW &lt;CHAID &lt; (options) &gt;&gt; &lt;CHISQUARE &lt; (options) &gt;&gt; &lt;ENTROPY (&lt;options&gt;) | GAIN &lt; option &gt;&gt; ...","arguments":[{"name":"CHAID=","optional":true,"description":"For categorical predictor variables, CHAID uses the value (as specified in the ALPHA= option) of a chi-square statistic (for a classification tree) or an F statistic (for a regression tree) to merge similar levels of the predictor variable until the number of children in the proposed split reaches the number that you specify in the MAXBRANCH= option. The p-values for the final split determine the variable on which to split. For continuous predictor variables, CHAID chooses the best single split until the number of children in the proposed split reaches the value that you specify in the MAXBRANCH= option.","help":"CHAID=ALPHA= | BONFERRONI","type":"choice","arguments":[{"name":"ALPHA=","type":"value"},{"name":"BONFERRONI","type":"standalone"}]},{"name":"CHISQUARE=","optional":true,"description":"Uses a chi-square statistic to split each variable and then uses the p-values that correspond to the resulting splits to determine the splitting variable.","help":"CHISQUARE=ALPHA= | BONFERRONI","type":"choice","arguments":[{"name":"ALPHA=","type":"value"},{"name":"BONFERRONI","type":"standalone"}]},{"name":"ENTROPY=","optional":true,"aliases":["GAIN"],"description":"Uses the gain in information (decrease in entropy) to split each variable and then to determine the split.","help":"ENTROPY=MINENTROPY= | MINGAIN=","type":"choice","arguments":[{"name":"MINENTROPY=","type":"value"},{"name":"MINGAIN=","type":"value"}]},{"name":"FTEST=","optional":true,"description":"Uses an F statistic to split each variable and then uses the resulting p-value to determine the split variable.","help":"FTEST=ALPHA= | BONFERRONI","type":"choice","arguments":[{"name":"ALPHA=","type":"value"},{"name":"BONFERRONI","type":"standalone"}]},{"name":"GINI","optional":true,"description":"Uses the decrease in the Gini index to split each variable and then to determine the split.","type":"standalone"},{"name":"IGR","optional":true,"description":"Uses the entropy metric to split each variable and then uses the information gain ratio to determine the split.","type":"standalone"},{"name":"RSS","optional":true,"aliases":["VARIANCE"],"description":"Uses the change in response variance to split each variable and then to determine the split.","type":"standalone"}]},{"name":"ID","description":"The ID statement lists one or more variables that are to be copied from the input data table to the output data tables that are specified in the OUT= option in the OUTPUT statement and the RSTORE= option in the SAVESTATE statement.","help":"ID variables"},{"name":"INPUT","description":"The INPUT statement names input variables that share common options. The INPUT statement can be repeated.","help":"INPUT &lt;LEVEL=&lt;NOMINAL | INTERVAL&gt;&gt; ","arguments":[{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"Specifies the level of measurement of the variables. By default, LEVEL=INTERVAL for numeric variables, and LEVEL=NOMINAL for categorical character variables. Binary variables are considered to be nominal variables.","help":"LEVEL=NOMINAL | INTERVAL","type":"choice","arguments":[{"name":"NOMINAL","followsDelimiter":"/","description":"Specifies that the level of measurement of the variables is nominal.","type":"standalone"},{"name":"INTERVAL","followsDelimiter":"/","description":"","type":"standalone"}]}]},{"name":"OUTPUT","description":"The OUTPUT statement creates an output data table that contains the results of PROC FOREST.","help":"OUTPUT &lt;COPYVAR=variable | COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; ","arguments":[{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Lists one or more variables from the input data table to be transferred to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"Syntax: OUT=CAS-libref.data-table Names the output data table for PROC FOREST to use. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"PARTITION","description":"The PARTITION statement specifies how observations in the input data set are logically partitioned into disjoint subsets for model training, validation, and testing.","help":"PARTITION &lt;FRACTION(&lt; TEST=fraction &gt; &lt; VALIDATE=fraction &gt; &lt; SEED=number &gt;)&gt; &lt;ROLE=|ROLEVAR=variable (&lt; TEST='value' &gt; &lt; TRAIN='value' &gt; &lt; VALIDATE='value' &gt;)&gt; ","arguments":[{"name":"FRACTION=","optional":true,"description":"Randomly assigns specified proportions of the observations in the input data table to the roles. You specify the proportions for testing and validation by using the TEST= and VALIDATE= suboptions. If you specify both the TEST= and VALIDATE= suboptions, then the sum of the specified fractions must be less than 1 and the remaining fraction of the observations are assigned to the training role. The SEED= option specifies an integer that is used to start the pseudorandom number generator for random partitioning of data for training, testing, and validation. If you do not specify SEED=number or if number is less than or equal to 0, the seed is generated by reading the time of day from the computer’s clock.","help":"FRACTION=VALIDATE= | TEST= | SEED=","type":"choice","arguments":[{"name":"VALIDATE=","type":"value"},{"name":"TEST=","type":"value"},{"name":"SEED=","type":"value"}]},{"name":"ROLE=","optional":true,"aliases":["ROLEVAR="],"description":"Names the variable in the input data table whose values are used to assign roles to each observation. This variable cannot also appear as an analysis variable in other statements or options. The TEST=, TRAIN=, and VALIDATE= suboptions specify the formatted values of this variable that are used to assign observation roles. If you do not specify the TRAIN= suboption, then all observations whose role is not determined by the TEST= or VALIDATE= suboption are assigned to the training role.","help":"ROLE=TRAIN= | VALIDATE= | TEST=","type":"choice","arguments":[{"name":"TRAIN=","type":"value"},{"name":"VALIDATE=","type":"value"},{"name":"TEST=","type":"value"}]}]},{"name":"SAVESTATE","description":"The SAVESTATE statement creates an analytic store for the model and saves it as a binary object in a data table. You can use the analytic store in the ASTORE procedure to score new data.","help":"SAVESTATE &lt;RSTORE=CAS-libref.data-table&gt; ","arguments":[{"name":"RSTORE=","optional":true,"description":"Specifies a data table in which to save the analytic store for the model. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"RSTORE=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"TARGET","description":"The TARGET statement names the variable whose values PROC FOREST tries to predict. By default, LEVEL=INTERVAL for numeric variables and LEVEL=NOMINAL for categorical variables.","help":"TARGET &lt;LEVEL=&lt;NOMINAL | INTERVAL&gt;&gt; ","arguments":[{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"Specifies the level of measurement.","help":"LEVEL=NOMINAL | INTERVAL","type":"choice","arguments":[{"name":"NOMINAL","followsDelimiter":"/","description":"Specifies that the level of measurement of the variables is nominal.","type":"standalone"},{"name":"INTERVAL","followsDelimiter":"/","description":"Specifies that the level of measurement of the variables is interval.","type":"standalone"}]}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations that have nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, all observations that are used in the analysis are assigned a weight of 1.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"v_033","docsetTargetFile":"casml_forest_toc.htm"}}