{"name":"FREQ","statements":[{"name":"PROC FREQ","description":"The FREQ procedure produces one-way to n-way frequency and contingency (crosstabulation) tables. For two-way tables, PROC FREQ computes tests and measures of association. For n-way tables, PROC FREQ provides stratified analysis by computing statistics across, as well as within, strata. † For one-way frequency tables, PROC FREQ computes goodness-of-fit tests for equal proportions or specified null proportions. For one-way tables, PROC FREQ also provides confidence limits and tests for binomial proportions, including tests for noninferiority and equivalence. † For contingency tables, PROC FREQ can compute various statistics to examine the relationships between two classification variables. For some pairs of variables, you might want to examine the existence or strength of any association between the variables. To determine if an association exists, chi-square tests are computed. To estimate the strength of an association, PROC FREQ computes measures of association that tend to be close to zero when there is no association and close to the maximum (or minimum) value when there is perfect association. The statistics for contingency tables include the following: † o chi-square tests and measures o measures of association o risks (binomial proportions) and risk differences for 2 x 2 tables o odds ratios and relative risks for 2 x 2 tables o tests for trend o tests and measures of agreement o Cochran-Mantel-Haenszel statistics","help":"PROC FREQ <COMPRESS> <DATA=SAS-data-set> <FORMCHAR(1,2,7)='formchar-string'> <FORMCHAR(1,2,7)='formchar-string'> <NLEVELS> <NOPRINT> <ORDER=DATA | FORMATTED | FREQ... > <PAGE>;     \n\tBY variables;\n    \n\tEXACT AGREE BARNARD BINOMIAL ...;\n    \n\tOUTPUT <AGREE <(WT=FC)>> <ALL> OUT=SAS-data-set ...;\n    \n\tTABLES <AGREE < (agree-options)>> <ALL> <ALPHA=α> ...;\n    \n\tTEST AGREE GAMMA KAPPA ...;\n    \n\tWEIGHT <ZEROS> ;\n","arguments":[{"name":"COMPRESS","optional":true,"description":"Begins display of the next one-way frequency table on the same page as the preceding one-way table if there is enough space to begin the table.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be analyzed by PROC FREQ.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"FORMCHAR","optional":true,"description":"Defines the characters to be used for constructing the outlines and dividers for the cells of crosstabulation table displays.","help":"FORMCHAR(1,2,7)='*formchar-string*'","type":"value"},{"name":"FORMCHAR=","optional":true,"description":"Defines the characters to be used for constructing the outlines and dividers for the cells of crosstabulation table displays.","type":"value"},{"name":"NLEVELS","optional":true,"description":"Displays the \"Number of Variable Levels\" table, which provides the number of levels for each variable named in the TABLES statements.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the order of the variable levels in the frequency and crosstabulation tables, which you request in the TABLES statement.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels are sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels are sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels are sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels are sorted by the unformatted value.","type":"standalone"}]},{"name":"PAGE","optional":true,"description":"Displays only one table per page. Otherwise, PROC FREQ displays multiple tables per page as space permits. The PAGE option is not valid with the COMPRESS option.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC FREQ to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY variables"},{"name":"EXACT","description":"The EXACT statement requests exact tests or confidence limits for the specified statistics. Optionally, PROC FREQ computes Monte Carlo estimates of the exact p-values. The statistic-options specify the statistics to provide exact tests or confidence limits for. The computation-options specify options for the computation of exact statistics.","help":"EXACT AGREE BARNARD BINOMIAL ...","arguments":[{"name":"AGREE","description":"Requests McNemar's exact test, an exact test for the simple kappa coefficient, and an exact test for the weighted kappa coefficient. New in SAS 9.3: The FREQ procedure now produces agreement plots when the AGREE option is specified and ODS Graphics is enabled. It also offers a number of alternative confidence limits for the proportion difference, and it provides exact unconditional confidence limits for the proportion difference that are based on the Farrington-Manning score statistic.","type":"standalone"},{"name":"BARNARD","description":"Requests Barnard's exact unconditional test for the risk (proportion) difference for 2x2 tables.","type":"standalone"},{"name":"BINOMIAL","aliases":["BIN"],"description":"Requests an exact test for the binomial proportion (for one-way tables).","type":"standalone"},{"name":"CHISQ","description":"Requests the following exact chi-square tests for two-way tables: Pearson chi-square, likelihood ratio chi-square, and Mantel-Haenszel chi-square.","type":"standalone"},{"name":"COMOR","description":"Requests an exact test and exact confidence limits for the common odds ratio for multiway 2x2 tables.","type":"standalone"},{"name":"EQOR","aliases":["ZELEN"],"description":"Requests Zelen's exact test for equal odds ratios for multiway 2x2 tables.","type":"standalone"},{"name":"FISHER","description":"Requests Fisher's exact test.","type":"standalone"},{"name":"JT","description":"Requests an exact Jonckheere-Terpstra test.","type":"standalone"},{"name":"KAPPA","description":"Requests an exact test for the simple kappa coefficient.","type":"standalone"},{"name":"KENTB","aliases":["TAUB"],"description":"Requests an exact test for Kendall's tau-b","type":"standalone"},{"name":"LRCHI","description":"Requests an exact test for the likelihood ratio chi-square for two-way tables.","type":"standalone"},{"name":"MCNEM","description":"Requests an exact McNemar's test.","type":"standalone"},{"name":"MEASURES","description":"Requests exact tests for the Pearson and Spearman correlations.","type":"standalone"},{"name":"MHCHI","description":"Requests an exact test for the Mantel-Haenszel chi-square.","type":"standalone"},{"name":"OR","aliases":["ODDSRATIO"],"description":"Requests exact confidence limits for the odds ratio for 2x2 tables. You can request exact mid-p confidence limits for the odds ratio by specifying the OR(CL=MIDP) option in the TABLES statement. The OR(CL=) option in the TABLES statement also provides other types of confidence limits for the odds ratio.","type":"standalone"},{"name":"PCHI","description":"Requests an exact test for the Pearson chi-square for two-way tables.","type":"standalone"},{"name":"PCORR","description":"Requests an exact test for the Pearson correlation coefficient.","type":"standalone"},{"name":"RELRISK=","description":"Requests exact unconditional confidence limits for the relative risk for 2x2 tables. You can specify the following options:","help":"RELRISK=COLUMN= | METHOD=","type":"choice","arguments":[{"name":"COLUMN=","type":"value"},{"name":"METHOD=","type":"value"}]},{"name":"RISKDIFF=","description":"Requests exact unconditional confidence limits for the risk difference for 2x2 tables. You can specify the following options:","help":"RISKDIFF=COLUMN= | METHOD=","type":"choice","arguments":[{"name":"COLUMN=","type":"value"},{"name":"METHOD=","type":"value"}]},{"name":"SCORR","description":"Requests an exact test for the Spearman correlation coefficient.","type":"standalone"},{"name":"SMDCR","description":"Requests an exact test for Sommers' D(C|R)","type":"standalone"},{"name":"SMDRC","description":"Test for Somers' D(R|C)","type":"standalone"},{"name":"STUTC","aliases":["TAUC"],"description":"Requests an exact test for Stuart's tau-c.","type":"standalone"},{"name":"TREND","description":"Requests the exact Cochran-Armitage test for trend.","type":"standalone"},{"name":"WTKAP","aliases":["WTKAPPA"],"description":"Requests an exact test for the weighted kappa coefficient.","type":"standalone"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the level of the confidence limits for Monte Carlo p-value estimates.","type":"value"},{"name":"MAXTIME=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum clock time (in seconds) that PROC FREQ can use to compute an exact p-value.","help":"MAXTIME=*value*","type":"value"},{"name":"MC","optional":true,"followsDelimiter":"/","description":"[Requests Monte Carlo estimation of exact p-values instead of direct exact p-value computation.","type":"standalone"},{"name":"MIDP","optional":true,"followsDelimiter":"/","description":"Requests exact mid p-values for the exact tests. The exact mid p-value is defined as the exact p-value minus half the exact point probability.","type":"standalone"},{"name":"N=","optional":true,"followsDelimiter":"/","description":"Specifies the number of samples for Monte Carlo estimation.","help":"N=*n*","type":"value"},{"name":"PFORMAT=","optional":true,"followsDelimiter":"/","description":"Specifies the display format for exact p-values. PROC FREQ applies this format to one- and two-sided exact p-values, exact point probabilities, and exact mid p-values. By default, PROC FREQ displays exact p-values in the PVALUE6.4 format. You can provide a format-name or you can specify PFORMAT=EXACT to control the format of exact p-values. The value of format-name can be any standard SAS numeric format or a user-defined format. The format length must not exceed 24.","type":"value"},{"name":"POINT","optional":true,"followsDelimiter":"/","description":"Requests exact point probabilities for the exact tests. The exact point probability is the exact probability that the test statistic equals the observed value.","type":"standalone"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the initial seed for random number generation for Monte Carlo estimation. The value of the SEED= option must be an integer. If you do not specify the SEED= option or if the SEED= value is negative or zero, PROC FREQ uses the time of day from the computer's clock to obtain the initial seed.","help":"SEED=*number*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a SAS data set that contains statistics computed by PROC FREQ. You specify which statistics to store in the output data set with the OUTPUT statement options. The output data set contains one observation for each two-way table or stratum, and one observation for summary statistics across all strata.","help":"OUTPUT &lt;AGREE &lt;(WT=FC)&gt;&gt; &lt;ALL&gt; OUT=SAS-data-set ...","arguments":[{"name":"OUT=","description":"Names the output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"AGREE=","optional":true,"description":"Requests tests and measures of classification agreement for square tables.","help":"AGREE=WT=","type":"choice","arguments":[{"name":"WT=","type":"value"}]},{"name":"AJCHI","optional":true,"description":"Includes the continuity-adjusted chi-square in the output data set. The continuity-adjusted chi-square is available for 2X2 tables and is provided by the CHISQ option in the TABLES statement.","type":"standalone"},{"name":"ALL","optional":true,"description":"Includes all statistics that are requested by the CHISQ , MEASURES , and CMH output-options in the output data set. ALL also includes the number of nonmissing observations, which you can request individually by specifying the N output-option.","type":"standalone"},{"name":"BDCHI","optional":true,"description":"Includes the Breslow-Day test in the output data set. The Breslow-Day test for homogeneity of odds ratios is computed for multiway 2x2 tables and is provided by the CMH , CMH1 , and CMH2 options in the TABLES statement.","type":"standalone"},{"name":"BINOMIAL","optional":true,"aliases":["BIN"],"description":"Includes the binomial proportion estimate, confidence limits, and tests in the output data set. The BINOMIAL option in the TABLES statement requests computation of binomial statistics, which are available for one-way tables.","type":"standalone"},{"name":"CHISQ","optional":true,"description":"Includes the following chi-square tests and measures in the output data set for two-way tables: Pearson chi-square, likelihood ratio chi-square, Mantel-Haenszel chi-square, phi coefficient, contingency coefficient, and Cramér's V. For 2x2 tables, CHISQ also includes Fisher's exact test and the continuity-adjusted chi-square in the output data set.","type":"standalone"},{"name":"CMH","optional":true,"description":"Includes the following Cochran-Mantel-Haenszel statistics in the output data set: correlation, row mean scores (ANOVA), and general association. For 2X2 tables, the CMH option also includes the Mantel-Haenszel and logit estimates of the common odds ratio and relative risks. For multiway (stratified) 2x2 tables, the CMH option includes the Breslow-Day test for homogeneity of odds ratios. The CMH option in the TABLES statement requests computation of these statistics.","type":"standalone"},{"name":"CMH1","optional":true,"description":"Includes the CMH statistics in the output data set, with the exception of the row mean scores (ANOVA) statistic and the general association statistic. The CMH1 option in the TABLES statement requests computation of these statistics.","type":"standalone"},{"name":"CMH2","optional":true,"description":"Includes the CMH statistics in the output data set, with the exception of the general association statistic. The CMH2 option in the TABLES statement requests computation of these statistics.","type":"standalone"},{"name":"CMHCOR","optional":true,"description":"Includes the Cochran-Mantel-Haenszel correlation statistic in the output data set. The CMH option in the TABLES statement requests computation of this statistic.","type":"standalone"},{"name":"CMHGA","optional":true,"description":"Includes the Cochran-Mantel-Haenszel general association statistic in the output data set. The CMH option in the TABLES statement requests computation of this statistic.","type":"standalone"},{"name":"CMHRMS","optional":true,"description":"Includes the Cochran-Mantel-Haenszel row mean scores (ANOVA) statistic in the output data set. The CMH option in the TABLES statement requests computation of this statistic.","type":"standalone"},{"name":"COCHQ","optional":true,"description":"Includes Cochran's Q test in the output data set. The AGREE option in the TABLES statement requests computation of this test, which is available for multiway 2x2 tables.","type":"standalone"},{"name":"CONTGY","optional":true,"description":"Includes the contingency coefficient in the output data set. The CHISQ option in the TABLES statement requests computation of the contingency coefficient.","type":"standalone"},{"name":"CRAMV","optional":true,"description":"Includes Cramér's V in the output data set. The CHISQ option in the TABLES statement requests computation of Cramér's V.","type":"standalone"},{"name":"EQKAP","optional":true,"description":"Includes the test for equal simple kappa coefficients in the output data set. The AGREE option in the TABLES statement requests computation of this test, which is available for multiway, square (h x r x r) tables.","type":"standalone"},{"name":"EQOR","optional":true,"aliases":["ZELEN"],"description":"Includes Zelen's exact test for equal odds ratios in the output data set. The EQOR option in the EXACT statement requests computation of this test, which is available for multiway 2x2 tables.","type":"standalone"},{"name":"EQWKP","optional":true,"description":"Includes the test for equal weighted kappa coefficients in the output data set. The AGREE option in the TABLES statement requests computation of this test. The test for equal weighted kappas is available for multiway, square (h x r x r) tables where r > 2.","type":"standalone"},{"name":"FISHER","optional":true,"description":"Includes Fisher's exact test in the output data set. For 2x2 tables, the CHISQ option in the TABLES statement provides Fisher's exact test. For tables larger than 2x2, the FISHER option in the EXACT statement provides Fisher's exact test.","type":"standalone"},{"name":"GAILSIMON","optional":true,"aliases":["GS"],"description":"Includes the Gail-Simon test for qualitative interaction in the output data set. The CMH(GAILSIMON) option in the TABLES statement requests computation of this test.","type":"standalone"},{"name":"GAMMA","optional":true,"description":"Includes the gamma statistic in the output data set. The MEASURES option in the TABLES statement requests computation of the gamma statistic.","type":"standalone"},{"name":"JT","optional":true,"description":"Includes the Jonckheere-Terpstra test in the output data set. The JT option in the TABLES statement requests the Jonckheere-Terpstra test.","type":"standalone"},{"name":"KAPPA","optional":true,"description":"Includes the simple kappa coefficient in the output data set. The AGREE option in the TABLES statement requests computation of kappa, which is available for square tables (where the number of rows equals the number of columns). For multiway square tables, the KAPPA option also includes the overall kappa coefficient in the output data set.","type":"standalone"},{"name":"KENTB","optional":true,"aliases":["TAUB"],"description":"Includes Kendall's tau-b in the output data set. The MEASURES option in the TABLES statement requests computation of Kendall's tau-b.","type":"standalone"},{"name":"LAMCR","optional":true,"description":"Includes the asymmetric lambda in the output data set. The MEASURES option in the TABLES statement requests computation of lambda.","type":"standalone"},{"name":"LAMDAS","optional":true,"description":"Includes the symmetric lambda in the output data set. The MEASURES option in the TABLES statement requests computation of lambda.","type":"standalone"},{"name":"LAMRC","optional":true,"description":"Includes the asymmetric lambda in the output data set. The MEASURES option in the TABLES statement requests computation of lambda.","type":"standalone"},{"name":"LGOR","optional":true,"description":"Includes the logit estimate of the common odds ratio in the output data set. The CMH option in the TABLES statement requests computation of this statistic, which is available for 2x2 tables.","type":"standalone"},{"name":"LGRRC1","optional":true,"description":"Includes the logit estimate of the common relative risk (column 1) in the output data set. The CMH option in the TABLES statement requests computation of this statistic, which is available for 2x2 tables.","type":"standalone"},{"name":"LGRRC2","optional":true,"description":"Includes the logit estimate of the common relative risk (column 2) in the output data set. The CMH option in the TABLES statement requests computation of this statistic, which is available for 2x2 tables.","type":"standalone"},{"name":"LRCHI","optional":true,"description":"Includes the likelihood ratio chi-square in the output data set. The CHISQ option in the TABLES statement requests computation of the likelihood ratio chi-square.","type":"standalone"},{"name":"MCNEM","optional":true,"description":"Includes McNemar's test (for 2x2 tables) in the output data set. The AGREE option in the TABLES statement requests computation of McNemar's test.","type":"standalone"},{"name":"MEASURES","optional":true,"description":"Includes the following measures of association in the output data set: gamma, Kendall's tau-b, Stuart's tau-c, Somers' D(C|R), Somers' D(R|C)), Pearson and Spearman correlation coefficients, lambda (symmetric and asymmetric), and uncertainty coefficients (symmetric and asymmetric). For 2x2 tables, the MEASURES option also includes the odds ratio, column 1 relative risk, and column 2 relative risk. The MEASURES option in the TABLES statement requests computation of these statistics.","type":"standalone"},{"name":"MHCHI","optional":true,"description":"Includes the Mantel-Haenszel chi-square in the output data set. The CHISQ option in the TABLES statement requests computation of the Mantel-Haenszel chi-square.","type":"standalone"},{"name":"MHOR","optional":true,"aliases":["COMOR"],"description":"Includes the Mantel-Haenszel estimate of the common odds ratio in the output data set. The CMH option in the TABLES statement requests computation of this statistic, which is available for 2x2 tables.","type":"standalone"},{"name":"MHRRC1","optional":true,"description":"Includes the Mantel-Haenszel estimate of the common relative risk (column 1) in the output data set. The CMH option in the TABLES statement requests computation of this statistic, which is available for 2x2 tables.","type":"standalone"},{"name":"MHRRC2","optional":true,"description":"Includes the Mantel-Haenszel estimate of the common relative risk (column 2) in the output data set. The CMH option in the TABLES statement requests computation of this statistic, which is available for 2x2 tables.","type":"standalone"},{"name":"N","optional":true,"description":"Includes the number of nonmissing observations in the output data set.","type":"standalone"},{"name":"NMISS","optional":true,"description":"Includes the number of missing observations in the output data set.","type":"standalone"},{"name":"OR","optional":true,"aliases":["ODDSRATIO","RROR"],"description":"Includes the odds ratio (for 2x2 tables) in the output data set. The MEASURES, OR, and RELRISK options in the TABLES statement request this statistic.","type":"standalone"},{"name":"PCHI","optional":true,"description":"Includes the Pearson chi-square in the output data set for two-way tables.","type":"standalone"},{"name":"PCORR","optional":true,"description":"Includes the Pearson correlation coefficient in the output data set. The MEASURES option in the TABLES statement requests computation of the Pearson correlation.","type":"standalone"},{"name":"PHI","optional":true,"description":"Includes the phi coefficient in the output data set. The CHISQ option in the TABLES statement requests computation of the phi coefficient.","type":"standalone"},{"name":"PLCORR","optional":true,"description":"Includes the polychoric correlation coefficient in the output data set. For 2x2 tables, this statistic is known as the tetrachoric correlation coefficient. The PLCORR option in the TABLES statement requests computation of the polychoric correlation.","type":"standalone"},{"name":"RDIF1","optional":true,"description":"Includes the column 1 risk difference (row 1 – row 2) in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences, which are available for 2x2 tables.","type":"standalone"},{"name":"RDIF2","optional":true,"description":"Includes the column 2 risk difference (row 1 – row 2) in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences, which are available for 2x2 tables.","type":"standalone"},{"name":"RELRISK","optional":true,"description":"Includes the column 1 and column 2 relative risks (for 2x2 tables) in the output data set. The MEASURES and RELRISK options in the TABLES statement request these statistics.","type":"standalone"},{"name":"RISKDIFF","optional":true,"description":"Includes risks (binomial proportions) and risk differences for 2x2 tables in the output data set. These statistics include the row 1 risk, row 2 risk, total (overall) risk, and risk difference (row 1 – row 2) for column 1 and column 2. The RISKDIFF option in the TABLES statement requests computation of these statistics","type":"standalone"},{"name":"RISKDIFF1","optional":true,"description":"Includes column 1 risks (binomial proportions) and risk differences for 2x2 tables in the output data set. These statistics include the row 1 risk, row 2 risk, total (overall) risk, and risk difference (row 1 – row 2). The RISKDIFF option in the TABLES statement requests computation of these statistics.","type":"standalone"},{"name":"RISKDIFF2","optional":true,"description":"Includes column 2 risks (binomial proportions) and risk differences for 2x2 tables in the output data set. These statistics include the row 1 risk, row 2 risk, total (overall) risk, and risk difference (row 1 – row 2). The RISKDIFF option in the TABLES statement requests computation of these statistics.","type":"standalone"},{"name":"RRC1","optional":true,"aliases":["RELRISK1"],"description":"Includes the column 1 relative risk in the output data set. The MEASURES and RELRISK options in the TABLES statement request relative risks, which are available for 2x2 tables.","type":"standalone"},{"name":"RRC2","optional":true,"aliases":["RELRISK2"],"description":"Includes the column 2 relative risk in the output data set. The MEASURES and RELRISK options in the TABLES statement request relative risks, which are available for 2x2 tables.","type":"standalone"},{"name":"RSK11","optional":true,"aliases":["RISK11"],"description":"Includes the column 1 risk for row 1 in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences, which are available for 2x2 tables.","type":"standalone"},{"name":"RSK12","optional":true,"aliases":["RISK12"],"description":"Includes the column 2 risk for row 1 in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences, which are available for 2x2 tables.","type":"standalone"},{"name":"RSK1","optional":true,"aliases":["RISK1"],"description":"Includes the overall column 1 risk in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences, which are available for 2x2 tables.","type":"standalone"},{"name":"RSK21","optional":true,"aliases":["RISK21"],"description":"Includes the column 1 risk for row 2 in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences, which are available for 2x2 tables.","type":"standalone"},{"name":"RSK22","optional":true,"description":"Includes the column 2 risk for row 2 in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences, which are available for 2x2 tables.","type":"standalone"},{"name":"RSK2","optional":true,"aliases":["RISK2"],"description":"Includes the overall column 2 risk in the output data set. The RISKDIFF option in the TABLES statement requests computation of risks and risk differences.","type":"standalone"},{"name":"SCORR","optional":true,"description":"Includes the Spearman correlation coefficient in the output data set. The MEASURES option in the TABLES statement requests computation of the Spearman correlation.","type":"standalone"},{"name":"SMDCR","optional":true,"description":"includes Somers' D(C|R) in the output data set. The MEASURES option in the TABLES statement requests computation of Somers' D.","type":"standalone"},{"name":"SMDRC","optional":true,"description":"includes Somers' D(R|C) in the output data set. The MEASURES option in the TABLES statement requests computation of Somers' D","type":"standalone"},{"name":"STUTC","optional":true,"aliases":["TAUC"],"description":"Includes Stuart's tau-c in the output data set. The MEASURES option in the TABLES statement requests computation of tau-c.","type":"standalone"},{"name":"TREND","optional":true,"description":"Includes the Cochran-Armitage test for trend in the output data set. The TREND option in the TABLES statement requests computation of the trend test. This test is available for tables of dimension 2 x C or R x 2.","type":"standalone"},{"name":"TSYMM","optional":true,"aliases":["BOWKER"],"description":"Includes Bowker's test of symmetry in the output data set. The AGREE option in the TABLES statement requests computation of Bowker's test.","type":"standalone"},{"name":"U","optional":true,"description":"Includes the uncertainty coefficient (symmetric) in the output data set. The MEASURES option in the TABLES statement requests computation of the uncertainty coefficient.","type":"standalone"},{"name":"UCR","optional":true,"description":"Includes the asymmetric uncertainty coefficient U(C|R) in the output data set. The MEASURES option in the TABLES statement requests computation of the uncertainty coefficient.","type":"standalone"},{"name":"URC","optional":true,"description":"Includes the asymmetric uncertainty coefficient U(R|C) in the output data set. The MEASURES option in the TABLES statement requests computation of the uncertainty coefficient.","type":"standalone"},{"name":"WTKAP","optional":true,"aliases":["WTKAPPA"],"description":"Includes the weighted kappa coefficient in the output data set. The AGREE option in the TABLES statement requests computation of weighted kappa, which is available for square tables larger than 2 x 2. For multiway tables, the WTKAP option also includes the overall weighted kappa coefficient in the output data set.","type":"standalone"}]},{"name":"TABLES","aliases":["TABLE"],"description":"The TABLES statement requests one-way to n-way frequency and crosstabulation tables and statistics for those tables. If you omit the TABLES statement, PROC FREQ generates one-way frequency tables for all data set variables that are not listed in the other statements.","help":"TABLES &lt;AGREE &lt; (agree-options)&gt;&gt; &lt;ALL&gt; &lt;ALPHA=α&gt; ...","arguments":[{"name":"AGREE=","optional":true,"followsDelimiter":"/","description":"Requests tests and measures of classification agreement for square tables. You can specify the following agree-options:","help":"AGREE=WT | MNULLRATIO= | PRINTKWTS","type":"choice","arguments":[{"name":"WT","type":"standalone"},{"name":"MNULLRATIO=","type":"value"},{"name":"PRINTKWTS","type":"standalone"}]},{"name":"ALL","optional":true,"followsDelimiter":"/","description":"Requests all of the tests and measures that are computed by the CHISQ, MEASURES, and CMH options.","type":"standalone"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the level of confidence limits. The value of α must be between 0 and 1, and the default is 0.05.","type":"value"},{"name":"BINOMIAL=","optional":true,"followsDelimiter":"/","aliases":["BIN"],"description":"Requests the binomial proportion for one-way tables. BINOMIAL Options:","help":"BINOMIAL=CORRECT | EQUIV | EQUIVALENCE | LEVEL= | MARGIN= | NONINF | NONINFERIORITY | OUTLEVEL | P= | SUP | SUPERIORITY | CL= | VAR=","type":"choice","arguments":[{"name":"CORRECT","type":"standalone"},{"name":"EQUIV","type":"standalone"},{"name":"EQUIVALENCE","type":"standalone"},{"name":"LEVEL=","type":"value"},{"name":"MARGIN=","type":"value"},{"name":"NONINF","type":"standalone"},{"name":"NONINFERIORITY","type":"standalone"},{"name":"OUTLEVEL","type":"standalone"},{"name":"P=","type":"value"},{"name":"SUP","type":"standalone"},{"name":"SUPERIORITY","type":"standalone"},{"name":"CL=","type":"value"},{"name":"VAR=","type":"value"}]},{"name":"CELLCHI2","optional":true,"followsDelimiter":"/","description":"Displays each crosstabulation table cell's contribution to the total Pearson chi-square statistic in the crosstabulation table.","type":"standalone"},{"name":"CHISQ=","optional":true,"followsDelimiter":"/","description":"Requests chi-square tests of homogeneity or independence and measures of association that are based on the chi-square statistic. For two-way tables, the chi-square tests include the Pearson chi-square, likelihood ratio chi-square, and Mantel-Haenszel chi-square tests. The chi-square measures include the phi coefficient, contingency coefficient, and Cramér's V. For tables, the CHISQ option also provides Fisher's exact test and the continuity-adjusted chi-square test. For one-way tables, the CHISQ option provides the Pearson chi-square goodness-of-fit test. You can also request the likelihood ratio goodness-of-fit test for one-way tables by specifying the LRCHISQ chisq-option in parentheses after the CHISQ option. By default, the one-way chi-square tests are based on the null hypothesis of equal proportions. Alternatively, you can provide null hypothesis proportions or frequencies by specifying the TESTP= or TESTF= chisq-option, respectively. You can specify the following chisq-options in parentheses after the CHISQ option:","help":"CHISQ=DF= | LRCHI | TESTF= | TESTP= | WARN=","type":"choice","arguments":[{"name":"DF=","type":"value"},{"name":"LRCHI","type":"standalone"},{"name":"TESTF=","type":"value"},{"name":"TESTP=","type":"value"},{"name":"WARN=","type":"value"}]},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests confidence limits for the measures of association, which you can request by specifying the MEASURES option.","type":"standalone"},{"name":"CMH=","optional":true,"followsDelimiter":"/","description":"Requests Cochran-Mantel-Haenszel statistics, which test for association between the row and column variables after adjusting for the remaining variables in a multiway table. The Cochran-Mantel-Haenszel statistics include the nonzero correlation statistic, the row mean scores (ANOVA) statistic, and the general association statistic. In addition, for $2 \\times 2$ tables, the CMH option provides the adjusted Mantel-Haenszel and logit estimates of the odds ratio and relative risks, together with their confidence limits. For stratified 2x2 tables, the CMH option provides the Breslow-Day test for homogeneity of odds ratios. (To request Tarone's adjustment for the Breslow-Day test, specify the BDT cmh-option.) You can specify the following cmh-options in parentheses after the CMH option.","help":"CMH=BDT | GAILSIMON | GS | MANTELFLEISS | MF","type":"choice","arguments":[{"name":"BDT","type":"standalone"},{"name":"GAILSIMON","type":"standalone"},{"name":"GS","type":"standalone"},{"name":"MANTELFLEISS","type":"standalone"},{"name":"MF","type":"standalone"}]},{"name":"CMH1=","optional":true,"followsDelimiter":"/","description":"Requests the Cochran-Mantel-Haenszel correlation statistic. This option does not provide the CMH row mean scores (ANOVA) statistic or the general association statistic, which are provided by the CMH option. You can specify the following cmh-options in parentheses after the CMH option.","help":"CMH1=BDT | GAILSIMON | GS | MANTELFLEISS | MF","type":"choice","arguments":[{"name":"BDT","type":"standalone"},{"name":"GAILSIMON","type":"standalone"},{"name":"GS","type":"standalone"},{"name":"MANTELFLEISS","type":"standalone"},{"name":"MF","type":"standalone"}]},{"name":"CMH2=","optional":true,"followsDelimiter":"/","description":"Requests the Cochran-Mantel-Haenszel correlation statistic and the row mean scores (ANOVA) statistic. This option does not provide the CMH general association statistic, which is provided by the CMH option. You can specify the following cmh-options in parentheses after the CMH option.","help":"CMH2=BDT | GAILSIMON | GS | MANTELFLEISS | MF","type":"choice","arguments":[{"name":"BDT","type":"standalone"},{"name":"GAILSIMON","type":"standalone"},{"name":"GS","type":"standalone"},{"name":"MANTELFLEISS","type":"standalone"},{"name":"MF","type":"standalone"}]},{"name":"CONTENTS=","optional":true,"followsDelimiter":"/","description":"Specifies the label to use for crosstabulation tables in the contents file, the Results window, and the trace record.","help":"CONTENTS='*string*'","type":"value"},{"name":"CROSSLIST=","optional":true,"followsDelimiter":"/","description":"Displays crosstabulation tables in ODS column format instead of the default crosstabulation cell format. You can specify the following options:","help":"CROSSLIST=STDRES | PEARSONRES","type":"choice","arguments":[{"name":"STDRES","type":"standalone"},{"name":"PEARSONRES","type":"standalone"}]},{"name":"CUMCOL","optional":true,"followsDelimiter":"/","description":"Displays the cumulative column percentages in the cells of the crosstabulation table.","type":"standalone"},{"name":"DEVIATION","optional":true,"followsDelimiter":"/","description":"Displays the deviations of the frequencies from the expected frequencies (frequency – expected) in the crosstabulation table.","type":"standalone"},{"name":"EXPECTED","optional":true,"followsDelimiter":"/","description":"Displays the expected cell frequencies in the crosstabulation table. The expected frequencies are computed under the null hypothesis that the row and column variables are independent.","type":"standalone"},{"name":"FISHER","optional":true,"followsDelimiter":"/","description":"Requests Fisher's exact test for tables that are larger than 2x2.","type":"standalone"},{"name":"FORMAT=","optional":true,"followsDelimiter":"/","description":"Specifies a format for the following crosstabulation table cell values: frequency, expected frequency, and deviation.","help":"FORMAT=*format-name*","type":"value"},{"name":"GAILSIMON","optional":true,"followsDelimiter":"/","aliases":["GS"],"description":"Syntax: GAILSIMON < (COLUMN=1 | 2)> GS < (COLUMN=1 | 2)> Requests the Gail-Simon test for qualitative interaction, which applies to stratified 2x2 tables.","type":"standalone"},{"name":"JT","optional":true,"followsDelimiter":"/","description":"Requests the Jonckheere-Terpstra test.","type":"standalone"},{"name":"LIST","optional":true,"followsDelimiter":"/","description":"Displays two-way and multiway tables by using a list format instead of the default crosstabulation cell format. This option displays an entire multiway table in one table, instead of displaying a separate two-way table for each stratum.","type":"standalone"},{"name":"MAXITER=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of iterations for computing the polychoric correlation, which you request with the PLCORR option.","type":"value"},{"name":"MAXLEVELS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of variable levels to display in one-way frequency tables. The value of n must be a positive integer. PROC FREQ displays the first n variable levels, matching the order in which the levels appear in the one-way frequency table.","type":"value"},{"name":"MEASURES","optional":true,"followsDelimiter":"/","description":"Requests measures of association and their asymptotic standard errors. This option provides the following measures: gamma, Kendall's tau-b, Stuart's tau-c, Somers' D(C|R), Somers' D(R|C), Pearson and Spearman correlation coefficients, lambda (symmetric and asymmetric), and uncertainty coefficients (symmetric and asymmetric). If you specify the CL option in parentheses after the MEASURES option, PROC FREQ provides confidence limits for the measures of association.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values as a valid nonmissing level for all TABLES variables.","type":"standalone"},{"name":"MISSPRINT","optional":true,"followsDelimiter":"/","description":"Displays missing value frequencies in frequency and crosstabulation tables but does not include the missing value frequencies in any computations of percentages, tests, or measures","type":"standalone"},{"name":"NOCOL","optional":true,"followsDelimiter":"/","description":"Suppresses the display of column percentages in crosstabulation table.","type":"standalone"},{"name":"NOCUM","optional":true,"followsDelimiter":"/","description":"Suppresses the display of cumulative frequencies and percentages in one-way frequency tables.","type":"standalone"},{"name":"NOFREQ","optional":true,"followsDelimiter":"/","description":"Suppresses the display of cell frequencies in crosstabulation tables.","type":"standalone"},{"name":"NOPERCENT","optional":true,"followsDelimiter":"/","description":"Suppresses the display of overall percentages in crosstabulation tables.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses the display of frequency and crosstabulation tables but displays all requested tests and statistics.","type":"standalone"},{"name":"NOROW","optional":true,"followsDelimiter":"/","description":"suppresses the display of row percentages in crosstabulation table cells.","type":"standalone"},{"name":"NOSPARSE","optional":true,"followsDelimiter":"/","description":"Suppresses zero-frequency cells in the LIST table, CROSSLIST table, and OUT= data set.","type":"standalone"},{"name":"NOWARN","optional":true,"followsDelimiter":"/","description":"Suppresses the log warning message for the validity of the asymptotic Pearson chi-square test. By default, PROC FREQ provides a validity warning for the asymptotic Pearson chi-square test when more than 20cells have expected frequencies that are less than 5. This warning message appears in the log if you specify the NOPRINT option in the PROC FREQ statement.","type":"standalone"},{"name":"ODDSRATIO=","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests the odds ratio and confidence limits for 2x2 tables. Specifying the OR option without the CL= option is equivalent to specifying the RELRISK option, which produces the \"Odds Ratio and Relative Risks\" table. When you specify the OR(CL=) option, PROC FREQ does not produce the \"Odds Ratio and Relative Risks\" table unless you also specify the RELRISK or MEASURES option. You can specify the following types:","help":"ODDSRATIO=CL= | EXACT | LR | MIDP | SCORE | CORRECT= | WALD | WALDMODIFIED","type":"choice","arguments":[{"name":"CL=","type":"value"},{"name":"EXACT","type":"standalone"},{"name":"LR","type":"standalone"},{"name":"MIDP","type":"standalone"},{"name":"SCORE","type":"standalone"},{"name":"CORRECT=","type":"value"},{"name":"WALD","type":"standalone"},{"name":"WALDMODIFIED","type":"standalone"}]},{"name":"OUT=","optional":true,"followsDelimiter":"/","description":"Names an output data set that contains frequency or crosstabulation table counts and percentages.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTCUM","optional":true,"followsDelimiter":"/","description":"Includes cumulative frequencies and cumulative percentages in the OUT= data set for one-way tables.","type":"standalone"},{"name":"OUTEXPECT","optional":true,"followsDelimiter":"/","description":"Includes expected cell frequencies in the OUT= data set for crosstabulation tables.","type":"standalone"},{"name":"OUTPCT","optional":true,"followsDelimiter":"/","description":"Includes the following additional variables in the OUT= data set for crosstabulation tables: PCT_COL percentage of column frequency PCT_ROW percentage of row frequency","type":"standalone"},{"name":"PLCORR=","optional":true,"followsDelimiter":"/","description":"Requests the polychoric correlation coefficient and its asymptotic standard error. For 2x2 tables, this statistic is more commonly known as the tetrachoric correlation coefficient, and it is labeled as such in the displayed output. You can specify the following options:","help":"PLCORR=CONVERGE= | MAXITER=","type":"choice","arguments":[{"name":"CONVERGE=","type":"value"},{"name":"MAXITER=","type":"value"}]},{"name":"PLOTS=","optional":true,"followsDelimiter":"/","description":"Requests plots for PROC FREQ to produce by using ODS Graphics. Syntax: PLOTS < ( global-plot-options ) > < = plot-request < ( plot-options ) > PLOTS < ( global-plot-options ) > < = ( plot-request < (plot-options) > <...plot-request < (plot-options ) >> )> You can specify the following global-plot-option:","help":"PLOTS=ALL | AGREEPLOT | CUMFREQPLOT | DEVIATIONPLOT | FREQPLOT | KAPPAPLOT | MOSAICPLOT | NONE | ODDSRATIOPLOT | RELRISKPLOT | RISKDIFFPLOT | WTKAPPAPLOT","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all plots associated with the specified analyses. If you specify the PLOTS=ALL option, PROC FREQ produces the frequency, cumulative frequency, and mosaic plots that are associated with the tables that you request. (These plots are not produced by default when ODS Graphics is enabled.)","type":"standalone"},{"name":"AGREEPLOT","followsDelimiter":"/","description":"Syntax: AGREEPLOT < (plot-options)> Requests an agreement plot (Bangdiwala and Bryan 1987), An agreement plot displays the strength of agreement in a two-way table, where the row and column variables represent two independent ratings of n subjects. The following plot-options that are available for agreement plots: LEGEND= NO | YES legend PARTIAL= NO | YES partial agreement SHOWSCALE= NO | YES Frequency scale STATS Statistics","type":"standalone"},{"name":"CUMFREQPLOT","followsDelimiter":"/","description":"Syntax: CUMFREQPLOT <(plot-options)> Requests a plot of cumulative frequencies. Cumulative frequency plots are available for one-way frequency tables. The following plot-options are available for CUMFREQPLOT: ORIENT=, SCALE=, and TYPE=.","type":"standalone"},{"name":"DEVIATIONPLOT","followsDelimiter":"/","description":"Syntax: DEVIATIONPLOT <(plot-options)> Requests a plot of relative deviations from expected frequencies. Deviation plots are available for chi-square analysis of one-way frequency tables. The following plot-options are available for DEVIATIONPLOT: NOSTAT, ORIENT=, and TYPE=.","type":"standalone"},{"name":"FREQPLOT","followsDelimiter":"/","description":"Syntax: FREQPLOT <(plot-options)> Requests a frequency plot. Frequency plots are available for frequency and crosstabulation tables. For multiway tables, PROC FREQ provides a two-way frequency plot for each stratum. You can specify the following plot-options for all frequency plots: ORIENT= HORIZONTAL | VERTICAL SCALE= FREQ | GROUPPERCENT | LOG | PERCENT | SQRT TYPE= BARCHART | DOTPLOT You can specify the following plot-options for frequency plots of two-way (and multiway) tables: GROUPBY= COLUMN | ROW NPANELPOS= number TWOWAY= CLUSTER | GROUPHORIZONTAL | GROUPVERTICAL","type":"standalone"},{"name":"KAPPAPLOT","followsDelimiter":"/","description":"Syntax: KAPPAPLOT <(plot-options)> Requests a plot of kappa statistics along with confidence limits. Kappa plots are available for multiway square tables and display the kappa statistic (with confidence limits) for each two-way table (stratum). The following plot-options are available for KAPPAPLOT: CLDISPLAY= BAR | LINE | LINEARROW | SERIF | SERIFARROW Error bar type COMMON= NO | YES Overall kappa NPANELPOS= number Statistics per graphic ORDER= ASCENDING | DESCENDING Order of two-way levels RANGE= values | CLIP Range to display STATS Statistic values","type":"standalone"},{"name":"MOSAICPLOT","followsDelimiter":"/","description":"Syntax: MOSAICPLOT <(plot-option)> Requests a mosaic plot. Mosaic plots are available for two-way and multiway crosstabulation tables; for multiway tables, PROC FREQ provides a mosaic plot for each two-way table (stratum). You can specify the following plot-options: COLORSTAT < =PEARSONRES | STDRES> colors the mosaic plot tiles according to the values of residuals. If you specify COLORSTAT=PEARSONRES, the tiles are colored according to the Pearson residuals of the corresponding table cells. If you specify COLORSTAT=STDRES, the tiles are colored according to the standardized residuals of the corresponding table cells. SQUARE produces a square mosaic plot, where the height of the Y axis equals the width of the X axis.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Suppresses all plots.","type":"standalone"},{"name":"ODDSRATIOPLOT","followsDelimiter":"/","description":"Syntax: ODDSRATIOPLOT <(plot-options)> Requests a plot of odds ratios and confidence limits for a multiway table. Odds ratio plots are available for multiway 2x2 tables and display the odds ratio (with confidence limits) for each 2x2 table (stratum). To produce an odds ratio plot, you must also specify the MEASURES , OR , or RELRISK option in the TABLES statement to compute the odds ratios. The following plot-options are available: CL=EXACT | LR | MIDP | SCORE | WALD | WALDMODIFIED Confidence limit CLDISPLAY= BAR | LINE | LINEARROW | SERIF | SERIFARROW Error bar type COLUMN= 1 | 2 Risk column COMMON= NO | YES Common value LOGBASE= 2 | E | 10 Axis scale NPANELPOS= number Statistics per graphic ORDER= ASCENDING | DESCENDING Order of two-way levels RANGE=values | CLIP Range to display STATS Statistic values","type":"standalone"},{"name":"RELRISKPLOT","followsDelimiter":"/","description":"Syntax: RELRISKPLOT < (plot-options)> Requests a plot of relative risks along with confidence limits. Relative risk plots are available for multiway 2x2 tables and display the relative risk (with confidence limits) for each 2x2 table (stratum). The following plot-options are available: CL=EXACT | LR | MIDP | SCORE | WALD | WALDMODIFIED Confidence limit CLDISPLAY= BAR | LINE | LINEARROW | SERIF | SERIFARROW Error bar type COLUMN= 1 | 2 Risk column COMMON= NO | YES Common value LOGBASE= 2 | E | 10 Axis scale NPANELPOS= number Statistics per graphic ORDER= ASCENDING | DESCENDING Order of two-way levels RANGE=values | CLIP Range to display STATS Statistic values","type":"standalone"},{"name":"RISKDIFFPLOT","followsDelimiter":"/","description":"Syntax: RISKDIFFPLOT < (plot-options)> Requests a plot of risk (proportion) differences along with confidence limits. Risk difference plots are available for multiway 2x2tables and display the risk difference (with confidence limits) for each 2x2 table (stratum). To produce a risk difference plot, you must also specify the RISKDIFF option in the TABLES statement to compute risk differences. The following plot-options are available: CL=EXACT | LR | MIDP | SCORE | WALD | WALDMODIFIED Confidence limit CLDISPLAY= BAR | LINE | LINEARROW | SERIF | SERIFARROW Error bar type COLUMN= 1 | 2 Risk column COMMON= NO | YES Common value LOGBASE= 2 | E | 10 Axis scale NPANELPOS= number Statistics per graphic ORDER= ASCENDING | DESCENDING Order of two-way levels RANGE=values | CLIP Range to display STATS Statistic values","type":"standalone"},{"name":"WTKAPPAPLOT","followsDelimiter":"/","description":"Syntax: WTKAPPAPLOT <(plot-options)> Requests a plot of weighted kappa coefficients along with confidence limits. Weighted kappa plots are available for multiway square tables and display the weighted kappa coefficient (with confidence limits) for each two-way table (stratum). Weighted kappa plots also display the overall weighted kappa coefficient unless you specify the COMMON=NO plot-option. The following plot-options are available: CLDISPLAY= BAR | LINE | LINEARROW | SERIF | SERIFARROW Error bar type COMMON= NO | YES Overall kappa NPANELPOS= number Statistics per graphic ORDER= ASCENDING | DESCENDING Order of two-way levels RANGE= values | CLIP Range to display STATS Statistic values","type":"standalone"}]},{"name":"PRINTKWTS","optional":true,"followsDelimiter":"/","description":"Displays the agreement weights that PROC FREQ uses to compute the weighted kappa coefficient. Agreement weights reflect the relative agreement between pairs of variable levels.","type":"standalone"},{"name":"RELRISK=","optional":true,"followsDelimiter":"/","description":"Requests relative risk measures and their confidence limits for 2x2 tables. These measures include the odds ratio, the column 1 relative risk, and the column 2 relative risk.","help":"RELRISK=COLUMN= | PRINTALL | CL= | EQUAL | EQUIV | EQUIVALENCE | MARGIN= | METHOD= | NONINF | NONINFERIORITY | SUP | SUPERIORITY","type":"choice","arguments":[{"name":"COLUMN=","type":"value"},{"name":"PRINTALL","type":"standalone"},{"name":"CL=","type":"value"},{"name":"EQUAL","type":"standalone"},{"name":"EQUIV","type":"standalone"},{"name":"EQUIVALENCE","type":"standalone"},{"name":"MARGIN=","type":"value"},{"name":"METHOD=","type":"value"},{"name":"NONINF","type":"standalone"},{"name":"NONINFERIORITY","type":"standalone"},{"name":"SUP","type":"standalone"},{"name":"SUPERIORITY","type":"standalone"}]},{"name":"RISKDIFF=","optional":true,"followsDelimiter":"/","description":"Requests risks (binomial proportions) and risk differences for 2x2 tables. By default, this option provides the row 1 risk, row 2 risk, total (overall) risk, and risk difference (row 1 – row 2), together with their asymptotic standard errors and Wald confidence limits; by default, this option also provides exact (Clopper-Pearson) confidence limits for the row 1, row 2, and total risks.","help":"RISKDIFF=COLUMN= | COMMON | CORRECT | NORISKS | CL= | EQUAL | EQUIV | EQUIVALENCE | MARGIN= | METHOD= | NONINF | NONINFERIORITY | SUP | SUPERIORITY | VAR=","type":"choice","arguments":[{"name":"COLUMN=","type":"value"},{"name":"COMMON","type":"standalone"},{"name":"CORRECT","type":"standalone"},{"name":"NORISKS","type":"standalone"},{"name":"CL=","type":"value"},{"name":"EQUAL","type":"standalone"},{"name":"EQUIV","type":"standalone"},{"name":"EQUIVALENCE","type":"standalone"},{"name":"MARGIN=","type":"value"},{"name":"METHOD=","type":"value"},{"name":"NONINF","type":"standalone"},{"name":"NONINFERIORITY","type":"standalone"},{"name":"SUP","type":"standalone"},{"name":"SUPERIORITY","type":"standalone"},{"name":"VAR=","type":"value"}]},{"name":"SCORES=","optional":true,"followsDelimiter":"/","description":"Specifies the type of row and column scores that PROC FREQ uses to compute the following statistics: Mantel-Haenszel chi-square, Pearson correlation, Cochran-Armitage test for trend, weighted kappa coefficient, and Cochran-Mantel-Haenszel statistics","help":"SCORES=MODRIDIT | RANK | RIDIT | TABLE","type":"choice","arguments":[{"name":"MODRIDIT","followsDelimiter":"/","description":"Modified ridit scores represent the expected values of the order statistics of the uniform distribution on (0,1).","type":"standalone"},{"name":"RANK","followsDelimiter":"/","description":"Rank scores yield midranks for tied values.","type":"standalone"},{"name":"RIDIT","followsDelimiter":"/","description":"Rank scores standardized by the sample size.","type":"standalone"},{"name":"TABLE","followsDelimiter":"/","description":"Table scores are the values of the row and column levels.","type":"standalone"}]},{"name":"SCOROUT","optional":true,"followsDelimiter":"/","description":"Displays the row and column scores that PROC FREQ uses to compute score-based tests and statistics.","type":"standalone"},{"name":"SPARSE","optional":true,"followsDelimiter":"/","description":"Reports all possible combinations of the variable values for an n-way table when n > 1, even if a combination does not occur in the data.","type":"standalone"},{"name":"TOTPCT","optional":true,"followsDelimiter":"/","description":"Displays the percentage of the total multiway table frequency in crosstabulation tables for n-way tables, where n > 2. By default, PROC FREQ displays the percentage of the individual two-way table frequency but does not display the percentage of the total frequency for multiway crosstabulation tables.","type":"standalone"},{"name":"TREND","optional":true,"followsDelimiter":"/","description":"Requests the Cochran-Armitage test for trend. The table must be 2 x C or R x 2 to compute the trend test.","type":"standalone"}]},{"name":"TEST","description":"The TEST statement requests asymptotic tests for measures of association and measures of agreement. You must use a TABLES statement with the TEST.","help":"TEST AGREE GAMMA KAPPA ...","arguments":[{"name":"AGREE","description":"Requests an asymptotic test for the simple kappa coefficient and weighted kappa coefficient.","type":"standalone"},{"name":"GAMMA","description":"Requests an asymptotic test for the gamma statistic.","type":"standalone"},{"name":"KAPPA","description":"Requests an asymptotic test for the simple kappa coefficient.","type":"standalone"},{"name":"KENTB","aliases":["TAUB"],"description":"Requests an asymptotic test for Kendall's τ-b","type":"standalone"},{"name":"MEASURES","description":"Requests asymptotic tests for the following measures of association: gamma, Kendall's tau-b, Pearson correlation coefficient, Somers' D(C|R), Somers' D(R|C), Spearman correlation coefficient, and Stuart's tau-c.","type":"standalone"},{"name":"PCORR","description":"Requests an asymptotic test for the Pearson correlation coefficient.","type":"standalone"},{"name":"PLCORR","description":"Requests Wald and likelihood ratio tests for the polychoric correlation coefficient.","type":"standalone"},{"name":"SCORR","description":"Requests an asymptotic test for the Spearman correlation coefficient","type":"standalone"},{"name":"SMDCR","description":"Requests an asymptotic test for Somer's D(C|R)","type":"standalone"},{"name":"SMDRC","description":"Requests an asymptotic test for Somer's D(R|C)","type":"standalone"},{"name":"WTKAP","aliases":["WTKAPPA"],"description":"Requests an asymptotic test for the weighted kappa coefficient.","type":"standalone"},{"name":"STUTC","optional":true,"aliases":["TAUC"],"description":"Requests an asymptotic test for Stuart's τ-c","type":"standalone"}]},{"name":"WEIGHT","description":"The WEIGHT statement names a numeric variable that provides a weight for each observation in the input data set. The WEIGHT statement is most commonly used to input cell count data. If you use a WEIGHT statement, PROC FREQ assumes that an observation represents n observations, where n is the value of variable. The value of the WEIGHT variable is not required to be an integer.","help":"WEIGHT &lt;ZEROS&gt; ","arguments":[{"name":"ZEROS","optional":true,"followsDelimiter":"/","description":"Includes observations with weights of 0. By default, PROC FREQ ignores observations that have weights of 0.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_019","docsetTargetFile":"statug_freq_toc.htm"}}