{"name":"GAMMOD","statements":[{"name":"PROC GAMMOD","description":"The GAMMOD procedure fits generalized additive models that are based on low-rank regression splines (Wood 2006) in SAS Viya. † Generalized additive models are extensions of generalized linear models. They relax the generalized linear models’ assumption of linearity by allowing spline terms that characterize nonlinear dependency structures. Each spline term is constructed by the thin-plate regression spline technique (Wood 2003). A roughness penalty is applied to each spline term by a smoothing parameter that controls the balance between goodness of fit and the roughness of the spline curve. PROC GAMMOD fits models for standard distributions in the exponential family, such as the normal, Poisson, gamma and Tweedie distributions.","help":"PROC GAMMOD <ALPHA=number> <DATA=CAS-libref.data-table> <ITDETAILS> <NOCLPRINT<=number>> <NOPRINT> <PLIKEOPTIONS(optimization-parameters)> <PLOTS=ALL | NONE | COMPONENTS> <SEED=number> <SINGCHOL=number> <SINGULAR=number> <SMOOTHOPTIONS(optimization-parameters)>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCLASS <DESCENDING> <MISSING> <ORDER=<FORMATTED | FREQ | INTERNAL>> ...;\n    \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...;\n    \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...;\n    \n\tFREQ variable;\n    \n\tMODEL DESCENDING EVENT='<category>'|FIRST|LAST  ORDER=FORMATTED|FREQ|INTERNAL  ...;\n    \n\tOUTPUT LINP LOWER OUT=CAS-libref.data-table ...;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies a global significance level for the hypothesis testing of smoothing components and the construction of Bayesian confidence bands of predictions. The confidence level is 1 – number. The value of number must be between 0 and 1; the default is 0.05. You can override this global significance level for Bayesian confidence bands of predictions by specifying the ALPHA= option in the OUTPUT statement.","help":"ALPHA=*number*","type":"value"},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC GAMMOD to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"ITDETAILS","optional":true,"description":"Adds to the \"Iteration History\" table the current values of the parameter estimates and their gradients. If the optimization algorithm is used to determine at least one smoothing parameter, the table lists values for smoothing parameters. If all smoothing parameters are fixed or a parametric generalized linear model is specified, the table lists values for regression parameters. These quantities are reported only for parameters that participate in the optimization.","type":"standalone"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the \"Class Level Information\" table if you do not specify number. If you specify number, the values of the classification variables are displayed for only those variables whose number of levels is less than number. Specifying a number helps reduce the size of the \"Class Level Information\" table if some classification variables have a large number of levels.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the generation of ODS output.","type":"standalone"},{"name":"PLIKEOPTIONS=","optional":true,"description":"Specifies optimization parameters for either maximum or penalized likelihood estimation. You can specify the following optimization-parameters:","help":"PLIKEOPTIONS=ABSCONV= | ABSFCONV= | ABSGCONV= | FCONV= | GCONV= | MAXFUNC= | MAXITER= | MAXTIME= | MINITER= | TECHNIQUE=","type":"choice","arguments":[{"name":"ABSCONV=","type":"value"},{"name":"ABSFCONV=","type":"value"},{"name":"ABSGCONV=","type":"value"},{"name":"FCONV=","type":"value"},{"name":"GCONV=","type":"value"},{"name":"MAXFUNC=","type":"value"},{"name":"MAXITER=","type":"value"},{"name":"MAXTIME=","type":"value"},{"name":"MINITER=","type":"value"},{"name":"TECHNIQUE=","type":"value"}]},{"name":"PLOTS=","optional":true,"description":"Controls the plots that are produced through ODS Graphics. You can specify the following global-plot-option, which applies to the smoothing component plots that the GAMMOD procedure generates: UNPACK | UNPACKPANEL suppresses paneling. By default, multiple smoothing component plots can appear in some output panels. Specify UNPACK to get each plot individually. The following listing describes the specific plots and their options. ALL requests that all default plots be produced.","help":"PLOTS=ALL | NONE | COMPONENTS","type":"choice","arguments":[{"name":"ALL","description":"Requests that all default plots be produced.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"COMPONENTS","description":"Plots a panel of smoothing components of the fitted model. Syntax: COMPONENTS<(component-option)> You can specify the following component-option: COMMONAXES requests that the smoothing component plots use a common vertical axis except for bivariate contour plots. This option enables you to visually judge the relative effect size.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies an integer that is used to start the pseudorandom number generator for subset sampling from observations to form knots if necessary and for truncated eigendecomposition. If you do not specify this option, or if number ≤ 0, the seed is generated from the time of day, which is read from the computer's clock.","help":"SEED=*number*","type":"value"},{"name":"SINGCHOL=","optional":true,"description":"Tunes the singularity criterion in Cholesky decompositions. The default is 1E4 times the machine epsilon; this product is approximately 1E–12 on most computers.","help":"SINGCHOL=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Tunes the singularity criterion in truncated eigendecomposition to determine its convergence. The default is 1E4 times the machine epsilon; this product is approximately 1E–12 on most computers.","help":"SINGULAR=*number*","type":"value"},{"name":"SMOOTHOPTIONS=","optional":true,"description":"Specifies optimization parameters for smoothing parameter estimation. You can specify the following optimization-parameters:","help":"SMOOTHOPTIONS=ABSCONV= | ABSFCONV= | ABSGCONV= | FCONV= | GCONV= | MAXFUNC= | MAXITER= | MAXTIME= | MINITER= | TECHNIQUE=","type":"choice","arguments":[{"name":"ABSCONV=","type":"value"},{"name":"ABSFCONV=","type":"value"},{"name":"ABSGCONV=","type":"value"},{"name":"FCONV=","type":"value"},{"name":"GCONV=","type":"value"},{"name":"MAXFUNC=","type":"value"},{"name":"MAXITER=","type":"value"},{"name":"MAXTIME=","type":"value"},{"name":"MINITER=","type":"value"},{"name":"TECHNIQUE=","type":"value"}]}]},{"name":"BY","description":"You can specify a BY statement in PROC GAMMOD to obtain separate analyses of observations in groups that are defined by the values of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis. The CLASS statement must precede the MODEL statement. You can list the response variable for binary models in the CLASS statement, but this is not necessary.","help":"CLASS &lt;DESCENDING&gt; &lt;MISSING&gt; &lt;ORDER=&lt;FORMATTED | FREQ | INTERNAL&gt;&gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sorting order of the classification variable. If both the DESCENDING and ORDER= options are specified, high-performance statistical procedures order the categories according to the ORDER= option and then reverse that order.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (\".\", \".A\", …, \".Z\" for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sort order for the levels of classification variables. This ordering determines which parameters in the model correspond to each level in the data.","help":"ORDER=FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"FORMATTED","followsDelimiter":"/","description":"Levels sorted by their external formatted values, except for numeric variables that have no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Levels sorted by their descending frequency count (levels that have more observations come earlier in the order).","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Levels sorted by theeir unformatted value. The sort order is machine-dependent.","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | GLM | ORDINAL|THERMOMETER | POLYNOMIAL|POLY | REFERENCE|REF | ORTHEFFECT | ORTHORDINAL|ORTHOTHERM | ORTHPOLY | ORTHREF","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Specifies effect coding.","type":"standalone"},{"name":"GLM","followsDelimiter":"/","description":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","type":"standalone"},{"name":"ORDINAL","followsDelimiter":"/","description":"Specifies the cumulative parameterization for an ordinal CLASS variable.","help":"ORDINAL|THERMOMETER","type":"choice"},{"name":"POLYNOMIAL","followsDelimiter":"/","description":"Specifies polynomial coding.","help":"POLYNOMIAL|POLY","type":"choice"},{"name":"REFERENCE","followsDelimiter":"/","description":"Specifies reference-cell coding.","help":"REFERENCE|REF","type":"choice"},{"name":"ORTHEFFECT","followsDelimiter":"/","description":"Orthogonalizes PARAM=EFFECT coding.","type":"standalone"},{"name":"ORTHORDINAL","followsDelimiter":"/","description":"Orthogonalizes PARAM=ORDINAL coding.","help":"ORTHORDINAL|ORTHOTHERM","type":"choice"},{"name":"ORTHPOLY","followsDelimiter":"/","description":"Orthogonalizes PARAM=POLYNOMIAL coding.","type":"standalone"},{"name":"ORTHREF","followsDelimiter":"/","description":"Orthogonalizes PARAM=REFERENCE coding.","type":"standalone"}]},{"name":"REFERENCE=","optional":true,"followsDelimiter":"/","aliases":["REF="],"description":"Syntax: REF='level' | keyword REFERENCE='level' | keyword","help":"REFERENCE='&lt;level&gt;' | FIRST | LAST","type":"choice","arguments":[{"name":"'","followsDelimiter":"/","description":"The level of the variable to use as the reference level. Specify the formatted value of the variable if a format is assigned. Replace <level> with an actual value.","help":"'&lt;level&gt;'","type":"standalone"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first ordered level as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last ordered level as reference.","type":"standalone"}]}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates the CAS output tables on all nodes.","type":"standalone"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. PROC GAMMOD treats each observation as if it appeared f times, where the frequency value f is the value of the FREQ variable for the observation. If f is not an integer, then f is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When you do not specify the FREQ statement, each observation is assigned a frequency of 1.","help":"FREQ variable"},{"name":"MODEL","description":"","help":"MODEL DESCENDING EVENT='&lt;category&gt;'|FIRST|LAST  ORDER=FORMATTED|FREQ|INTERNAL  ...","arguments":[{"name":"DESCENDING","aliases":["DESC"],"description":"Reverses the order of the response categories. If you specify both the DESCENDING and ORDER= options, PROC GAMPL orders the response categories according to the ORDER= option and then reverses that order.","type":"standalone"},{"name":"DETAILS","description":"Requests a detailed spline specification information table.","type":"standalone"},{"name":"DF=","description":"Specifies a fixed degrees of freedom. When you specify this option, no smoothing parameter selection is performed on the spline term. If number is not an integer, then number is truncated to an integer.","help":"DF=*number*","type":"value"},{"name":"EVENT=","description":"Specifies the event category for the binary response model. PROC GAMPL models the probability of the event category. The EVENT= option has no effect when there are more than two response categories.","help":"EVENT='&lt;category&gt;' | FIRST | LAST","type":"choice","arguments":[{"name":"'","description":"Event category for the binary response model","help":"'&lt;category&gt;'","type":"standalone"},{"name":"FIRST","description":"Designates the first ordered category as the event.","type":"standalone"},{"name":"LAST","description":"Designates the last ordered category as the event.","type":"standalone"}]},{"name":"INITSMOOTH=","description":"specifies the starting value for a smoothing parameter. The number must be nonnegative.","help":"INITSMOOTH=*number*","type":"value"},{"name":"KNOTS=","description":"Specifies the method for supplying user-defined knot values instead of using data values for constructing basis expansions.","help":"KNOTS=LIST | EQUAL*method*","type":"value","arguments":[{"name":"LIST","description":"Syntax: LIST(list-of-values) Specifies a list of values as knots for the spline construction. For a multivariate spline term, the listed values are taken as multiple row vectors, where each vector has values that are ordered by specified variables. If the last row vector of knots contains fewer values than the number of variables, then the last row vector is ignored.","type":"standalone"},{"name":"EQUAL","description":"Syntax: EQUAL(n) Specifies the number of equally spaced interior knots for every variable in a spline term. Two boundary knots are automatically added to the knot list for each variable such that the total number of knots is (n+2)^d, where d is the number of variables in the spline term. For a multivariate spline term, knot values for each variable are determined independently from the corresponding boundary values.","type":"standalone"}]},{"name":"M=","description":"Specifies the order of the derivative in the penalty term. The number must be a positive integer. The default is max(2, int(d/2)+1), where d is the number of variables in the spline term.","help":"M=*number*","type":"value"},{"name":"MAXDF=","description":"Specifies the maximum number of degrees of freedom. When a thin-plate regression spline is formed, the specified number is used for constructing a low-rank penalty matrix to approximate the penalty matrix via the truncated eigendecomposition.","help":"MAXDF=*number*","type":"value"},{"name":"MAXKNOTS=","description":"Specifies the maximum number of knots if data points are used to form knots. If KNOTS=LIST(list-of-values) is not specified, PROC GAMPL forms knots from unique data points. If the number of unique data points is greater than number, a subset of size number is formed by random sampling from all unique data points. The number cannot exceed the largest integer that can be stored on the given machine.","help":"MAXKNOTS=*number*","type":"value"},{"name":"MAXSMOOTH=","description":"Specifies the upper bound for the smoothing parameter. The default is the largest double-precision value.","help":"MAXSMOOTH=*number*","type":"value"},{"name":"MINSMOOTH=","description":"Specifies the lower bound for the smoothing parameter. By default, MINSMOOTH=0.","help":"MINSMOOTH=*number*","type":"value"},{"name":"ORDER=","description":"Specifies the sort order for the levels of the response variable.","help":"ORDER=FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"FORMATTED","description":"Sorts the levels by external formatted value.","type":"standalone"},{"name":"FREQ","description":"Sorts the levels by descending frequency count (levels that have the most observations come first in the order).","type":"standalone"},{"name":"INTERNAL","description":"Sorts the levels by unformatted value. The sort order is machine-dependent.","type":"standalone"}]},{"name":"REF=","description":"Specifies the reference category for the binary response model. Specifying one response category as the reference is the same as specifying the other response category as the event category.","help":"REF='&lt;category&gt;' | FIRST | LAST","type":"choice","arguments":[{"name":"'","description":"Specifies that observations whose value matches category (formatted, if a format is applied) are designated as the reference. Replace <category> with an actual value.","help":"'&lt;category&gt;'","type":"standalone"},{"name":"FIRST","description":"Designates the first ordered category as reference.","type":"standalone"},{"name":"LAST","description":"Designates the last ordered category as reference.","type":"standalone"}]},{"name":"SMOOTH=","description":"Specifies a fixed smoothing parameter. When you specify this option, no smoothing parameter selection is performed on the spline term.","help":"SMOOTH=*number*","type":"value"},{"name":"ALLOBS","optional":true,"followsDelimiter":"/","description":"Requests that all nonmissing values of the variables be specified in a spline term for constructing the spline basis functions, regardless of whether other model variables are missing.","type":"standalone"},{"name":"CRITERION=","optional":true,"followsDelimiter":"/","description":"Specifies the model evaluation criterion for selecting smoothing parameters for spline-effects.","help":"CRITERION=GACV | GCV | UBRE*criterion*","type":"value","arguments":[{"name":"GACV","followsDelimiter":"/","description":"Syntax: GACV<(FACTOR=number | GAMMA=number)> Uses the generalized approximate cross validation (GACV) criterion to evaluate models.","type":"standalone"},{"name":"GCV","followsDelimiter":"/","description":"Syntax: GCV<(FACTOR=number | GAMMA=number)> Uses the generalized cross validation (GCV) criterion to evaluate models.","type":"standalone"},{"name":"UBRE","followsDelimiter":"/","description":"Syntax: UBRE<(FACTOR=number | GAMMA=number)> Uses the unbiased risk estimator (UBRE) criterion to evaluate models.","type":"standalone"}]},{"name":"DISPERSION=","optional":true,"followsDelimiter":"/","aliases":["PHI="],"description":"Specifies a fixed dispersion parameter for distributions that have a dispersion parameter. The dispersion parameter that is used in all computations is fixed at number; it is not estimated.","type":"value"},{"name":"DISTRIBUTION=","optional":true,"followsDelimiter":"/","description":"Specifies the response distribution for the model.","help":"DISTRIBUTION=BINARY | BINOMIAL | GAMMA | INVERSEGAUSSIAN|IG | NEGATIVEBINOMIAL|NB | NORMAL|GAUSSIAN | POISSON | TWEEDIE","type":"choice","arguments":[{"name":"BINARY","followsDelimiter":"/","description":"Binary distribution","type":"standalone"},{"name":"BINOMIAL","followsDelimiter":"/","description":"Binomial distribution","type":"standalone"},{"name":"GAMMA","followsDelimiter":"/","description":"Gamma distribution","type":"standalone"},{"name":"INVERSEGAUSSIAN","followsDelimiter":"/","description":"Inverse Gaussian distribution","help":"INVERSEGAUSSIAN|IG","type":"choice"},{"name":"NEGATIVEBINOMIAL","followsDelimiter":"/","description":"Negative binomial distribution","help":"NEGATIVEBINOMIAL|NB","type":"choice"},{"name":"NORMAL","followsDelimiter":"/","description":"Normal distribution","help":"NORMAL|GAUSSIAN","type":"choice"},{"name":"POISSON","followsDelimiter":"/","description":"Poisson distribution","type":"standalone"},{"name":"TWEEDIE","followsDelimiter":"/","description":"Tweedie distribution","type":"standalone"}]},{"name":"FDHESSIAN","optional":true,"followsDelimiter":"/","description":"Requests that the second-order derivatives (Hessian) be computed using finite-difference approximations based on evaluation of the first-order derivatives (gradient). This option might be useful if the analytical Hessian takes a long time to compute.","type":"standalone"},{"name":"INITIALPHI=","optional":true,"followsDelimiter":"/","description":"Specifies a starting value for iterative maximum likelihood estimation of the dispersion parameter for distributions that have a dispersion parameter.","help":"INITIALPHI=*number*","type":"value"},{"name":"LINK=","optional":true,"followsDelimiter":"/","description":"Specifies the link function for the model.","help":"LINK=CLOGLOG|CLL | IDENTITY|ID | INV|RECIP | INV2 | LOG | LOGIT | LOGLOG | PROBIT","type":"choice","arguments":[{"name":"CLOGLOG","followsDelimiter":"/","description":"Complementary log-log function","help":"CLOGLOG|CLL","type":"choice"},{"name":"IDENTITY","followsDelimiter":"/","description":"Identity function","help":"IDENTITY|ID","type":"choice"},{"name":"INV","followsDelimiter":"/","description":"Reciprocal function","help":"INV|RECIP","type":"choice"},{"name":"INV2","followsDelimiter":"/","description":"Reciprocal square function","type":"standalone"},{"name":"LOG","followsDelimiter":"/","description":"Log function","type":"standalone"},{"name":"LOGIT","followsDelimiter":"/","description":"Logit function","type":"standalone"},{"name":"LOGLOG","followsDelimiter":"/","description":"Log-log function","type":"standalone"},{"name":"PROBIT","followsDelimiter":"/","description":"Probit function","type":"standalone"}]},{"name":"MAXPHI=","optional":true,"followsDelimiter":"/","description":"Specifies an upper bound for maximum likelihood estimation of the dispersion parameter for distributions that have a dispersion parameter.","help":"MAXPHI=*number*","type":"value"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"Specifies the algorithm for selecting smoothing parameters for spline-effects.","help":"METHOD=OUTER | PERFORMANCE","type":"choice","arguments":[{"name":"OUTER","followsDelimiter":"/","description":"Specifies the outer iteration method for selecting smoothing parameters. Note: The outer iteration method is experimental in this release.","type":"standalone"},{"name":"PERFORMANCE","followsDelimiter":"/","description":"Specifies the performance iteration method for selecting smoothing parameters.","type":"standalone"}]},{"name":"MINPHI=","optional":true,"followsDelimiter":"/","description":"Specifies a lower bound for maximum likelihood estimation of the dispersion parameter for distributions that have a dispersion parameter.","help":"MINPHI=*number*","type":"value"},{"name":"NORMALIZE","optional":true,"followsDelimiter":"/","description":"Requests normalized spline basis functions for model fitting. After the regression spline basis functions are computed, each column is standardized to have a unit standard error. The corresponding penalty matrix is also scaled accordingly. This option might be helpful when you have badly scaled data.","type":"standalone"},{"name":"OFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies a variable to be used as an offset to the linear predictor. An offset plays the role of an effect whose coefficient is known to be 1. The offset variable cannot appear in the CLASS statement or elsewhere in the MODEL statement. Observations that have missing values for the offset variable are excluded from the analysis.","help":"OFFSET=*variable*","type":"value"},{"name":"RIDGE=","optional":true,"followsDelimiter":"/","description":"Allows a ridge parameter such that a diagonal matrix H : Hij number is added to the optimization problem with respect to regression parameters.","help":"RIDGE=*number*","type":"value"},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Specifies the method for estimating the scale and dispersion parameters.","help":"SCALE=DEVIANCE | MLE | PEARSON","type":"choice","arguments":[{"name":"DEVIANCE","followsDelimiter":"/","description":"Estimates the dispersion parameter by using the deviance statistic.","type":"standalone"},{"name":"MLE","followsDelimiter":"/","description":"Computes the dispersion parameter by maximizing the likelihood or penalized likelihood.","type":"standalone"},{"name":"PEARSON","followsDelimiter":"/","description":"Estimates the dispersion parameter by using Pearson's statistic.","type":"standalone"}]}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a data table that contains observationwise statistics that PROC GAMMOD computes after fitting the model. In order to avoid data duplication for large data tables, the variables in the input data table are not included in the output data table unless you specify them in the COPYVARS= option.","help":"OUTPUT LINP LOWER OUT=CAS-libref.data-table ...","arguments":[{"name":"LINP","aliases":["XBETA"],"description":"Linear prediction values on the link scale at design points.","type":"standalone"},{"name":"LOWER","description":"Requests a lower Bayesian confidence band value for the predicted value. The default name is Lower.","type":"standalone"},{"name":"OUT=","description":"[Syntax: OUT=CAS-libref.data-table names the output data table for PROC GAMMOD to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"PEARSON","aliases":["PEARS","RESCHI"],"description":"Requests the Pearson residual. The default name is Pearson.","type":"standalone"},{"name":"PREDICTED","aliases":["PRED"],"description":"Requests predicted values for the response variable. For observations in which only the response variable is missing, the predicted values are computed even though these observations do not affect the model fit. The default name is Pred.","type":"standalone"},{"name":"RESIDUAL","aliases":["RESID"],"description":"Requests the raw residual. The default name is Residual.","type":"standalone"},{"name":"STD","description":"Requests a standard error for the linear predictor. The default name is Std.","type":"standalone"},{"name":"UPPER","description":"Requests an upper Bayesian confidence band value for the predicted value. The default name is Upper.","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Specifies the significance level for the construction of Bayesian confidence bands in the OUTPUT data set. The confidence level is 1- number.","help":"ALPHA=*number*","type":"value"},{"name":"COMPONENT","optional":true,"description":"Requests componentwise statistics for all spline terms if LINP, LOWER, STD, or UPPER is specified as a keyword.","type":"standalone"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Transfers one or more variables from the input data table to the output data table.","type":"value"}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations that have nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, then all observations that are used in the analysis are assigned a weight of 1.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"v_024","docsetTargetFile":"casstat_gammod_toc.htm"}}