{"name":"GANTT","statements":[{"name":"PROC GANTT","description":"The GANTT procedure produces a Gantt chart that is a graphical scheduling tool for the planning and control of a project. In its most basic form, a Gantt chart is a bar chart that plots the tasks of a project versus time. PROC GANTT displays a Gantt chart corresponding to a project schedule such as that produced by the CPM procedure or one that is input directly to the procedure, and it offers several options and statements for tailoring the chart to your needs. † Using PROC GANTT, you can plot the predicted early and late schedules and identify critical, supercritical, and slack activities. In addition, you can visually monitor a project in progress with the actual schedule and compare the actual schedule against a target baseline schedule. You can also graphically view the effects of scheduling a project subject to resource limitations. Any combination of these schedules can be viewed simultaneously (provided the relevant data exist) together with any user-specified variables of interest, such as project deadlines and other important dates. PROC GANTT enables you to display the early, late, and actual schedules in a single bar to produce a more meaningful schedule for tracking an activity in progress.","help":"PROC GANTT <ANNOTATE=SAS-data-set> <CALEDATA=SAS-data-set> <DATA=SAS-data-set> <FULLSCREEN> <GOUT=graphics catalog> <GRAPHICS> <HOLIDATA=SAS-data-set> <IMAGEMAP=SAS-data-set> <LABDATA= | LABELDATA= | LABEL= SAS-data-set> <LABMAXINT=n> <LINEPRINTER> <MAXDEC=n> <PRECDATA=SAS-data-set> <SPLIT='character'> <WORKDATA= | WORKDAY= SAS-data-set>;     \n\tBY variables ;\n    \n\tCHART <A_FINISH=variable> <A_START=variable> <B_FINISH=variable> ...;\n    \n\tID variables ;\n","arguments":[{"name":"ANNOTATE=","optional":true,"aliases":["ANNO="],"description":"Specifies the input data set that contains the appropriate Annotate variables for the purpose of adding text and graphics to the Gantt chart.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"CALEDATA=","optional":true,"aliases":["CALENDAR="],"description":"Identifies a SAS data set that specifies the work pattern during a standard week for each of the calendars that is to be used in the project.","help":"CALEDATA=*SAS-data-set*","type":"dataSet"},{"name":"DATA=","optional":true,"description":"Names the SAS data set that carries the schedule information to be used by PROC GANTT.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"FULLSCREEN","optional":true,"aliases":["FS"],"description":"Indicates that the Gantt chart be drawn in full-screen mode. This mode enables you to scroll horizontally and vertically through the output using commands, pull-down menus, or function keys.","type":"standalone"},{"name":"GOUT=","optional":true,"description":"Specifies the name of the graphics catalog used to save the output produced by PROC GANTT for later replay.","type":"value"},{"name":"GRAPHICS","optional":true,"description":"Indicates that the Gantt chart produced be of high-resolution quality. This is the default mode of display.","type":"standalone"},{"name":"HOLIDATA=","optional":true,"description":"Names the SAS data set that specifies holidays.","help":"HOLIDATA=*SAS-data-set*","type":"dataSet"},{"name":"IMAGEMAP=","optional":true,"description":"Names the SAS data set that receives a description of the areas of a graph and a link for each area.","help":"IMAGEMAP=*SAS-data-set*","type":"dataSet"},{"name":"LABDATA=","optional":true,"aliases":["LABELDATA=","LABEL="],"description":"Specifies the input data set that contains the label specific information. This option is required to initiate the automatic text annotation of the Gantt chart.","type":"value"},{"name":"LABMAXINT=","optional":true,"aliases":["LMI="],"description":"Specifies the maximum number of digits in the integer part when displaying an unformatted numeric as a string. The default value is 16.","help":"LABMAXINT=*n*","type":"value"},{"name":"LINEPRINTER","optional":true,"aliases":["LP"],"description":"Indicates that the Gantt chart be drawn in line-printer mode.","type":"standalone"},{"name":"MAXDEC=","optional":true,"aliases":["M="],"description":"Indicates the maximum number of decimal positions displayed for a number. A decimal specification in a format overrides a MAXDEC= specification. The default value of MAXDEC= is 2.","help":"MAXDEC=*n*","type":"value"},{"name":"PRECDATA=","optional":true,"description":"Names the SAS data set that contains the variables that define the precedence constraints in AON format.","help":"PRECDATA=*SAS-data-set*","type":"dataSet"},{"name":"SPLIT=","optional":true,"aliases":["S="],"description":"Splits labels used as column headings where the split character appears.","help":"SPLIT='*character*'","type":"value"},{"name":"WORKDATA=","optional":true,"aliases":["WORKDAY="],"description":"Identifies a SAS data set that defines the work pattern during a standard working day. Each numeric variable in this data set (also referred to as the Workday data set) is assumed to denote a unique shift pattern during one working day.","type":"value"}]},{"name":"BY","description":"A BY statement can be used with PROC GANTT to obtain separate Gantt charts for observations in groups defined by the BY variables.","help":"BY variables "},{"name":"CHART","description":"A CHART specification can be one of the following types: variable1 ...variablen indicates that each variable is to be plotted using the default symbol, the first character of the variable name. variable1='symbol1' ...variablen='symboln' indicates that each variable is to be plotted using the symbol specified. The symbol must be a single character enclosed in quotes. (variables)='symbol1' ...(variables)='symboln' indicates that each variable within the parentheses is to be plotted using the symbol associated with that group. The symbol must be a single character enclosed in single quotes.","help":"CHART &lt;A_FINISH=variable&gt; &lt;A_START=variable&gt; &lt;B_FINISH=variable&gt; ...","arguments":[{"name":"ABARHT=","optional":true,"followsDelimiter":"/","description":"Specifies that the height of the actual schedule bar be h cellheights. The value of h is restricted to be a positive real number. The default bar height is one cellheight.","help":"ABARHT=*h*","type":"value"},{"name":"ABAROFF=","optional":true,"followsDelimiter":"/","description":"Specifies that the actual schedule bar be offset d cellheights from its default position. A value of zero corresponds to the default position. The direction of increase is from top to bottom.","help":"ABAROFF=*d*","type":"value"},{"name":"ACTIVITY=","optional":true,"followsDelimiter":"/","aliases":["ACT="],"description":"Specifies the variable identifying the names of the nodes representing activities in the Schedule data set.","help":"ACTIVITY=*variable*","type":"value"},{"name":"ANNOTATE=","optional":true,"followsDelimiter":"/","aliases":["ANNO="],"description":"Specifies the input data set that contains the appropriate Annotate variables for the purpose of adding text and graphics to the Gantt chart.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"AOA","optional":true,"followsDelimiter":"/","description":"Causes PROC GANTT to use the specification for the AOA format for producing a Logic Gantt chart when the precedence information has been specified in both AOA format (TAIL= and HEAD= options) and AON format (ACTIVITY=, SUCCESSOR=, and, optionally, LAG= options).","type":"standalone"},{"name":"A_FINISH=","optional":true,"followsDelimiter":"/","aliases":["AF="],"description":"Specifies the variable containing the actual finish time of each activity in the Schedule data set.","help":"A_FINISH=*variable*","type":"value"},{"name":"A_START=","optional":true,"followsDelimiter":"/","aliases":["AS="],"description":"Specifies the variable containing the actual start time of each activity in the Schedule data set.","help":"A_START=*variable*","type":"value"},{"name":"BARHT=","optional":true,"followsDelimiter":"/","description":"Specifies that the height of all the schedule bars be h cellheights. The value of h is restricted to be a positive real number. The default value is one cellheight.","help":"BARHT=*h*","type":"value"},{"name":"BAROFF=","optional":true,"followsDelimiter":"/","description":"Specifies that all the schedule bars be offset d cellheights from their default positions. A value of zero corresponds to the default positions. The direction of increase is from top to bottom.","help":"BAROFF=*d*","type":"value"},{"name":"BBARHT=","optional":true,"followsDelimiter":"/","description":"Specifies that the height of the baseline schedule bar be h cellheights. The value of h is restricted to be a positive real number. The default bar height is one cellheight.","help":"BBARHT=*h*","type":"value"},{"name":"BBAROFF=","optional":true,"followsDelimiter":"/","description":"Specifies that the baseline schedule bar be offset d cellheights from its default position. A value of zero corresponds to the default position. The direction of increase is from top to bottom.","help":"BBAROFF=*d*","type":"value"},{"name":"BETWEEN=","optional":true,"followsDelimiter":"/","description":"Specifies the number of columns between two consecutive ID variable columns. This option gives you greater flexibility in spacing the ID columns. The default value of the BETWEEN= option is 3.","help":"BETWEEN=*number*","type":"value"},{"name":"BOTTOM","optional":true,"followsDelimiter":"/","aliases":["BJUST"],"description":"Positions the bottom of the Gantt chart at the bottom of the page, just above the footnotes.","type":"standalone"},{"name":"B_FINISH=","optional":true,"followsDelimiter":"/","aliases":["BF="],"description":"Specifies the variable containing the baseline finish time of each activity in the Schedule data set.","help":"B_FINISH=*variable*","type":"value"},{"name":"B_START=","optional":true,"followsDelimiter":"/","aliases":["BS="],"description":"Specifies the variable containing the baseline start time of each activity in the Schedule data set.","help":"B_START=*variable*","type":"value"},{"name":"CALID=","optional":true,"followsDelimiter":"/","description":"Specifies the variable in the Schedule, Holiday, and Calendar data sets that is used to identify the name or number of the calendar to which each observation refers. This variable can be either numeric or character depending on whether the different calendars are identified by unique numbers or names, respectively.","help":"CALID=*variable*","type":"value"},{"name":"CAXIS=","optional":true,"followsDelimiter":"/","aliases":["CAXES=","CA="],"description":"Specifies the color to use for displaying axes for the Gantt chart.","help":"CAXIS=*color*","type":"color"},{"name":"CFRAME=","optional":true,"followsDelimiter":"/","aliases":["CFR="],"description":"Specifies the color to use for filling the axis area. If the CFRAME= option is not specified and the GSTYLE system option is not in effect, then the axis area is not filled.","help":"CFRAME=*color*","type":"color"},{"name":"CHARTWIDTH=","optional":true,"followsDelimiter":"/","aliases":["CHARTPCT="],"description":"Specifies the width of the axis area as a percentage of the total Gantt chart width in the chart that would be produced if you had a page large enough to contain the entire chart without compression.","help":"CHARTWIDTH=*p*","type":"value"},{"name":"CHCON=","optional":true,"followsDelimiter":"/","description":"Specifies the color to use for drawing the horizontal connecting lines. The default color depends on the GOPTIONS statement and the GSTYLE system option","help":"CHCON=*color*","type":"color"},{"name":"CMILE=","optional":true,"followsDelimiter":"/","description":"Specifies the color to use for drawing the milestone symbol on the chart. If the CMILE= option is not specified, the default color of the milestones follows the rules for coloring the bars of the relevant schedule.","help":"CMILE=*color*","type":"color"},{"name":"COMBINE","optional":true,"followsDelimiter":"/","description":"Concatenates the early/late and actual schedule bars of an activity into a single bar and draws a timenow line on the Gantt chart.","type":"standalone"},{"name":"COMPRESS","optional":true,"followsDelimiter":"/","description":"Specifies that the Gantt chart be drawn on the number of output pages determined by the HPAGES= and VPAGES= options.","type":"standalone"},{"name":"CPREC=","optional":true,"followsDelimiter":"/","description":"Specifies the color to use for drawing the precedence connections.","help":"CPREC=*color*","type":"color"},{"name":"CREF=","optional":true,"followsDelimiter":"/","description":"Specifies the color to use for drawing the precedence connections.","help":"CREF=*color*","type":"color"},{"name":"CRITFLAG","optional":true,"followsDelimiter":"/","aliases":["FLAG"],"description":"Indicates that critical jobs be flagged as being critical or super-critical. An activity is critical if its total float is zero. If the total float is negative, the activity is super-critical. Critical activities are marked 'CR,' and super-critical activities are marked 'SC' on the left side of the chart.","type":"standalone"},{"name":"CTEXT=","optional":true,"followsDelimiter":"/","aliases":["CT="],"description":"Specifies the color to use for displaying text that appears on the chart, including variable names or labels, tickmark values, values of ID variables, and so on.","help":"CTEXT=*color*","type":"color"},{"name":"CTEXTCOLS=","optional":true,"followsDelimiter":"/","aliases":["CPATTEXT=","CACTTEXT="],"description":"Names the columns of activity text to be displayed using the color of the PATTERN variable when one exists or from the fill pattern from a particular schedule bar.","help":"CTEXTCOLS=ZONE | JOBNUM | ID | FLAG | ALL","type":"choice","arguments":[{"name":"ZONE","followsDelimiter":"/","description":"ZONE variable column","type":"standalone"},{"name":"JOBNUM","followsDelimiter":"/","description":"Job number column","type":"standalone"},{"name":"ID","followsDelimiter":"/","description":"ID variable columns","type":"standalone"},{"name":"FLAG","followsDelimiter":"/","description":"Status flag column","type":"standalone"},{"name":"ALL","followsDelimiter":"/","description":"All of the above (default)","type":"standalone"}]},{"name":"CTNOW=","optional":true,"followsDelimiter":"/","description":"Specifies the color to use for drawing the timenow line on the chart.","help":"CTNOW=*color*","type":"color"},{"name":"CZONE=","optional":true,"followsDelimiter":"/","aliases":["CZLINE="],"description":"Specifies the color to use for drawing the horizontal zone lines that demarcate the different zones on the chart.","help":"CZONE=*color*","type":"color"},{"name":"DAYLENGTH=","optional":true,"followsDelimiter":"/","description":"Specifies the length of the workday.","help":"DAYLENGTH=*daylength*","type":"value"},{"name":"DAYSTART=","optional":true,"followsDelimiter":"/","description":"Specifies the start of the workday. The default value of daystart is 9:00 a.m. if INTERVAL=WORKDAY or INTERVAL=DTWRKDAY, and midnight otherwise.","help":"DAYSTART=*daystart*","type":"value"},{"name":"DESCRIPTION=","optional":true,"followsDelimiter":"/","aliases":["DES="],"description":"Specifies a descriptive string, up to 40 characters in length, that appears in the description field of the master menu of PROC GREPLAY.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"DUPOK","optional":true,"followsDelimiter":"/","description":"Causes duplicate values of ID variables not to be skipped.","type":"standalone"},{"name":"DURATION=","optional":true,"followsDelimiter":"/","aliases":["DUR="],"description":"Identifies a variable in the Schedule data set that determines whether or not an activity is to be regarded as a milestone with respect to a specific schedule.","help":"DURATION=*variable*","type":"value"},{"name":"EBARHT=","optional":true,"followsDelimiter":"/","aliases":["LBARHT="],"description":"Specifies that the height of the early/late schedule bar be h cellheights. The value of h is restricted to be a positive real number. The default bar height is one cellheight.","help":"EBARHT=*h*","type":"value"},{"name":"EBAROFF=","optional":true,"followsDelimiter":"/","aliases":["LBAROFF="],"description":"Specifies that the early/late schedule bar be offset d cellheights from its default position. A value of zero corresponds to the default position. The direction of increase is from top to bottom.","help":"EBAROFF=*d*","type":"value"},{"name":"E_FINISH=","optional":true,"followsDelimiter":"/","aliases":["EF="],"description":"Specifies the variable containing the early finish time of each activity in the Schedule data set.","help":"E_FINISH=*variable*","type":"value"},{"name":"E_START=","optional":true,"followsDelimiter":"/","aliases":["ES="],"description":"Specifies the variable containing the early start time of each activity in the Schedule data set.","help":"E_START=*variable*","type":"value"},{"name":"FILL","optional":true,"followsDelimiter":"/","description":"Causes each page of the Gantt chart to be filled as completely as possible before a new page is started (when the size of the project requires the Gantt chart to be split across several pages).","type":"standalone"},{"name":"FMILE=","optional":true,"followsDelimiter":"/","description":"Specifies the font to use for drawing the milestone symbol on the chart.","help":"FMILE=*font*","type":"value"},{"name":"FONT=","optional":true,"followsDelimiter":"/","description":"Specifies the font to use for displaying job numbers, ID variables, legend, labels on the time axis, and so forth.","help":"FONT=*font*","type":"value"},{"name":"FORMCHAR=","optional":true,"followsDelimiter":"/","description":"Defines the characters to be used for constructing the chart outlines and dividers.","type":"value"},{"name":"HBARHT=","optional":true,"followsDelimiter":"/","description":"Specifies that all non-working days be displayed with a bar which is h cellheights high. The default behavior is to use the same height as that of the schedule bar.","help":"HBARHT=*h*","type":"value"},{"name":"HBAROFF=","optional":true,"followsDelimiter":"/","description":"Specifies that the bars which represent non-working days be offset d cellheights from their default positions. The default behavior is to use the same offset as that of the schedule bar.","help":"HBAROFF=*d*","type":"value"},{"name":"HCONCHAR=","optional":true,"followsDelimiter":"/","description":"Specifies the symbol to be used for drawing the connecting line described in the HCONNECT option. The default character is -.","help":"HCONCHAR='*character*'","type":"value"},{"name":"HCONNECT","optional":true,"followsDelimiter":"/","description":"Causes a line to be drawn for each activity from the left boundary of the chart to the beginning of the bar for the activity.","type":"standalone"},{"name":"HEAD=","optional":true,"followsDelimiter":"/","aliases":["HEADNODE="],"description":"Specifies the variable (either character or numeric) in the Schedule data set that contains the name of the node that represents the finish of the activity. This option is required when the precedence information is specified using the AOA format.","type":"value"},{"name":"HEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies that the height for all text in PROC GANTT, excluding TITLE and FOOTNOTE statements, be h times the value of HTEXT=, the default text height specified in the GOPTIONS statement of SAS/GRAPH. The value of h is a positive real number; the default value is 1.0.","help":"HEIGHT=*h*","type":"value"},{"name":"HMILE=","optional":true,"followsDelimiter":"/","description":"Specifies the height in cells of the milestone symbol. The height is a positive real number; the default value is 1.0.","help":"HMILE=*height*","type":"value"},{"name":"HOLICHAR=","optional":true,"followsDelimiter":"/","description":"Indicates the character to display for holidays. Note that PROC GANTT displays only those holidays that fall within the duration or the slack time of an activity. The default character used for representing holidays is !.","help":"HOLICHAR='*character*'","type":"value"},{"name":"HOLIDAY=","optional":true,"followsDelimiter":"/","aliases":["HOLIDAYS="],"description":"Specifies the date or datetime variable in the Holiday data set that identifies holidays to be marked on the schedule.","type":"value"},{"name":"HOLIDUR=","optional":true,"followsDelimiter":"/","aliases":["HDURATION="],"description":"Specifies the variable in the Holiday data set that identifies the durations of the holidays that are to be marked on the schedule.","type":"value"},{"name":"HOLIFIN=","optional":true,"followsDelimiter":"/","aliases":["HOLIEND="],"description":"Specifies the date or datetime variable in the Holiday data set that identifies the finish times of the holidays that are to be marked on the schedule.","type":"value"},{"name":"HPAGES=","optional":true,"followsDelimiter":"/","description":"Specifies that the Gantt chart is to be produced using h horizontal pages.","help":"HPAGES=*h*","type":"value"},{"name":"HTOFF=","optional":true,"followsDelimiter":"/","description":"Specifies that the line upon which all activity text rests, also referred to as the font baseline, is positioned at a depth of d cells below the top of the first bar. The default value of d is 1.0.","help":"HTOFF=*d*","type":"value"},{"name":"IDPAGES","optional":true,"followsDelimiter":"/","description":"Displays ID variables on every page. By default, the ID variables are displayed only on the first page.","type":"standalone"},{"name":"INCREMENT=","optional":true,"followsDelimiter":"/","description":"Specifies the number of minintervals between time axis labels on the Gantt chart.","help":"INCREMENT=*increment*","type":"value"},{"name":"INTERVAL=","optional":true,"followsDelimiter":"/","aliases":["HOLINTERVAL="],"description":"Specifies the units for the values of the HOLIDUR variables.","help":"INTERVAL=DAY | DTDAY | DTHOUR | DTMINUTE | DTSECOND | WEEKDAY | WORKDAY | DTWRKDAY","type":"choice","arguments":[{"name":"DAY","followsDelimiter":"/","description":"DAY","type":"standalone"},{"name":"DTDAY","followsDelimiter":"/","description":"DATETIME DAY","type":"standalone"},{"name":"DTHOUR","followsDelimiter":"/","description":"DATETIME HOUR","type":"standalone"},{"name":"DTMINUTE","followsDelimiter":"/","description":"DATETIME MINUTE","type":"standalone"},{"name":"DTSECOND","followsDelimiter":"/","description":"DATETIME SECOND","type":"standalone"},{"name":"WEEKDAY","followsDelimiter":"/","description":"WEEKDAY","type":"standalone"},{"name":"WORKDAY","followsDelimiter":"/","description":"WORKDAY","type":"standalone"},{"name":"DTWRKDAY","followsDelimiter":"/","description":"DATETIME WORKDAY","type":"standalone"}]},{"name":"JOINCHAR=","optional":true,"followsDelimiter":"/","description":"Defines a string eight characters long that identifies nonblank characters to be used for drawing the schedule.","help":"JOINCHAR='*string*'","type":"value"},{"name":"LABRULE=","optional":true,"followsDelimiter":"/","aliases":["LABFMT="],"description":"Specifies the rule to use for laying out labels that are defined in the Label data set.","help":"LABRULE=PAGECLIP | FRAMCLIP","type":"choice","arguments":[{"name":"PAGECLIP","followsDelimiter":"/","description":"Displays a label at the specified location and clips any part of the label that runs off the page.","type":"standalone"},{"name":"FRAMCLIP","followsDelimiter":"/","description":"Clips all labels with data value coordinates that run off the frame of the Gantt chart.","type":"standalone"}]},{"name":"LABSPLIT=","optional":true,"followsDelimiter":"/","aliases":["LABELSPLIT="],"description":"Splits labels that are defined in the Label data set wherever the split character appears.","type":"value"},{"name":"LABVAR=","optional":true,"followsDelimiter":"/","description":"Specifies the variable that links observations in the Label data set (label definitions) to observations in the Schedule data set (activities). This variable must exist in both the Schedule data set and the Label data set and be identical in type and length. The variable can be either numeric or character in type.","help":"LABVAR=*variable*","type":"value"},{"name":"LAG=","optional":true,"followsDelimiter":"/","description":"Specifies the variables identifying the lag types of the precedence relationships between an activity and its successors.","help":"LAG=*variable*","type":"value"},{"name":"LEFT","optional":true,"followsDelimiter":"/","aliases":["LJUST"],"description":"Displays the Gantt chart left-justified with the left edge of the page. This option has priority over the RIGHT or RJUST option.","type":"standalone"},{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"Specifies the schedule bar to use for drawing the precedence connections. The default value of LEVEL= is 1, which corresponds to the topmost bar.","help":"LEVEL=*number*","type":"value"},{"name":"LHCON=","optional":true,"followsDelimiter":"/","description":"Specifies the line style (1 - 46) to be used for drawing the horizontal connecting line produced by the HCONNECT option.","help":"LHCON=*linetype*","type":"value"},{"name":"LPREC=","optional":true,"followsDelimiter":"/","description":"Specifies the line style (1 - 46) to use for drawing the precedence connections. The default line style is 1, a solid line.","help":"LPREC=*linetype*","type":"value"},{"name":"LREF=","optional":true,"followsDelimiter":"/","description":"Specifies the line style (1 - 46) to use for drawing the reference lines. The default line style is 1, a solid line.","help":"LREF=*linetype*","type":"value"},{"name":"LTNOW=","optional":true,"followsDelimiter":"/","description":"Specifies the line style (1 - 46) to use for drawing the timenow line. The default line style is 1, a solid line.","help":"LTNOW=*linetype*","type":"value"},{"name":"LWIDTH=","optional":true,"followsDelimiter":"/","description":"Specifies the line width to be used for drawing lines, other than the timenow line and precedence connection lines, used in the Gantt chart. The default width is 1.","help":"LWIDTH=*linewidth*","type":"value"},{"name":"LZONE=","optional":true,"followsDelimiter":"/","aliases":["LZLINE="],"description":"Specifies the line style (1 - 46) to use for drawing the horizontal zone lines which demarcate the different zones on the chart. The default line style is 1, a solid line.","type":"value"},{"name":"L_FINISH=","optional":true,"followsDelimiter":"/","aliases":["LF="],"description":"Specifies the variable containing the late finish time of each activity in the Schedule data set.","help":"L_FINISH=*variable*","type":"value"},{"name":"L_START=","optional":true,"followsDelimiter":"/","aliases":["LS="],"description":"Specifies the variable containing the late start time of each activity in the Schedule data set.","help":"L_START=*variable*","type":"value"},{"name":"MARKBREAK","optional":true,"followsDelimiter":"/","description":"Causes all breaks (non-worked periods) during a day to be marked on the Gantt chart. The symbol used for marking the breaks is the same as the HOLICHAR= symbol.","type":"standalone"},{"name":"MARKWKND","optional":true,"followsDelimiter":"/","description":"Causes all weekends (or non-worked days during a week) to be marked on the Gantt chart. The symbol used for marking weekends is the same as the HOLICHAR= symbol.","type":"standalone"},{"name":"MAXDATE=","optional":true,"followsDelimiter":"/","description":"Specifies the end time for the time axis of the chart. The default value is the largest value of the times being plotted unless the logic options are invoked without the NOEXTRANGE option in the CHART statement.","help":"MAXDATE=*maxdate*","type":"value"},{"name":"MAXDISLV=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum allowable distance, in number of columns, that a local vertical can be positioned from its minimum offset to avoid overlap with a global vertical.","help":"MAXDISLV=*columns*","type":"value"},{"name":"MAXIDS","optional":true,"followsDelimiter":"/","description":"Displays as many consecutive ID variables as possible in the presence of an ID statement.","type":"standalone"},{"name":"MILECHAR=","optional":true,"followsDelimiter":"/","description":"Indicates the character to display for the milestone symbol.","help":"MILECHAR='*character*'","type":"value"},{"name":"MINDATE=","optional":true,"followsDelimiter":"/","description":"Specifies the starting time for the time axis of the chart. The default value is the smallest value of the times being plotted unless the logic options are invoked without the NOEXTRANGE option in the CHART statement.","help":"MINDATE=*mindate*","type":"value"},{"name":"MININTERVAL=","optional":true,"followsDelimiter":"/","description":"Specifies the smallest interval to be identified on the chart. For example, if MININTERVAL=DAY, then one day is represented on the chart by scale (see the SCALE= option) number of columns.","help":"MININTERVAL=DAY | DTDAY | HOUR | DTHOUR | MONTH | DTMONTH | SECOND | DTSECOND | MINUTE | DTMINUTE | QTR | DTQTR | YEAR | DTYEAR | WEEK | DTWEEK","type":"choice","arguments":[{"name":"DAY","followsDelimiter":"/","description":"DAY","type":"standalone"},{"name":"DTDAY","followsDelimiter":"/","description":"DATETIME DAY","type":"standalone"},{"name":"HOUR","followsDelimiter":"/","description":"HOUR","type":"standalone"},{"name":"DTHOUR","followsDelimiter":"/","description":"DATETIME HOUR","type":"standalone"},{"name":"MONTH","followsDelimiter":"/","description":"MONTH","type":"standalone"},{"name":"DTMONTH","followsDelimiter":"/","description":"DATETIME MONTH","type":"standalone"},{"name":"SECOND","followsDelimiter":"/","description":"SECOND","type":"standalone"},{"name":"DTSECOND","followsDelimiter":"/","description":"DATETIME SECOND","type":"standalone"},{"name":"MINUTE","followsDelimiter":"/","description":"MINUTE","type":"standalone"},{"name":"DTMINUTE","followsDelimiter":"/","description":"DATETIME MINUTE","type":"standalone"},{"name":"QTR","followsDelimiter":"/","description":"QUARTER","type":"standalone"},{"name":"DTQTR","followsDelimiter":"/","description":"DATETIME QUARTER","type":"standalone"},{"name":"YEAR","followsDelimiter":"/","description":"YEAR","type":"standalone"},{"name":"DTYEAR","followsDelimiter":"/","description":"DATETIME YEAR","type":"standalone"},{"name":"WEEK","followsDelimiter":"/","description":"WEEK","type":"standalone"},{"name":"DTWEEK","followsDelimiter":"/","description":"DATETIME WEEK","type":"standalone"}]},{"name":"MININTGV=","optional":true,"followsDelimiter":"/","description":"Specifies the minimum inter-distance, in number of columns, of any two global verticals to prevent overlap. The value of the MININTGV= option must be greater than or equal to 0.1; the default value is 0.75.","help":"MININTGV=*columns*","type":"value"},{"name":"MINOFFGV=","optional":true,"followsDelimiter":"/","description":"Specifies the minimum offset, in number of columns, of a global vertical from the end of the bar with which it is associated. The value of the MINOFFGV= option must be greater than or equal to 0.1; the default value is 1.","help":"MINOFFGV=*columns*","type":"value"},{"name":"MINOFFLV=","optional":true,"followsDelimiter":"/","description":"Specifies the minimum offset, in number of columns, of a local vertical from the end of the bar with which it is associated. The value of the MINOFFLV= option must be greater than or equal to 0.1; the default value is 1.","help":"MINOFFLV=*columns*","type":"value"},{"name":"NAME=","optional":true,"followsDelimiter":"/","description":"Where 'string' specifies a descriptive string, up to eight characters long, that appears in the name field of the master menu of the GREPLAY procedure.","help":"NAME='*string*'","type":"value"},{"name":"NJOBS=","optional":true,"followsDelimiter":"/","aliases":["NACTS="],"description":"Specifies the number of jobs that should be displayed on a single page. This option overrides the VPAGES= option.","type":"value"},{"name":"NOARROWHEAD","optional":true,"followsDelimiter":"/","aliases":["NOARRHD"],"description":"Suppresses the arrowhead when drawing the precedence connections.","type":"standalone"},{"name":"NOEXTRANGE","optional":true,"followsDelimiter":"/","aliases":["NOXTRNG"],"description":"Suppresses the automatic extension of the chart axis range when drawing a Logic Gantt chart and neither the MINDATE= nor MAXDATE= option is specified.","type":"standalone"},{"name":"NOFRAME","optional":true,"followsDelimiter":"/","aliases":["NOFR"],"description":"Suppresses drawing the vertical boundaries to the left and right of the Gantt chart; only the top axis and a parallel line at the bottom are drawn. If this option is not specified, the entire chart area is framed.","type":"standalone"},{"name":"NOJOBNUM","optional":true,"followsDelimiter":"/","description":"Suppresses displaying an identifying job number for each activity.","type":"standalone"},{"name":"NOLEGEND","optional":true,"followsDelimiter":"/","description":"Suppresses displaying the concise default legend at the bottom of each page of the Gantt chart.","type":"standalone"},{"name":"NOPAGENUM","optional":true,"followsDelimiter":"/","description":"Suppresses numbering the pages of a multipage Gantt chart. This is the default behavior.","type":"standalone"},{"name":"NOPATBAR","optional":true,"followsDelimiter":"/","description":"Suppresses the use of the PATTERN variable for filling the schedule bars.","type":"standalone"},{"name":"NOTMTIME","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the time portion of the axis tickmark label when the value of MININTERVAL is DTDAY.","type":"standalone"},{"name":"NOTNLABEL","optional":true,"followsDelimiter":"/","description":"Suppresses displaying the timenow label. By default, the label is displayed on the bottom border of the chart.","type":"standalone"},{"name":"NOZONECOL","optional":true,"followsDelimiter":"/","description":"Suppresses displaying the ZONE variable column that is automatically done in the presence of a zone variable.","type":"standalone"},{"name":"NTICKS=","optional":true,"followsDelimiter":"/","aliases":["NINCRS="],"description":"Specifies the number of tickmarks that should be displayed on the first horizontal page of the Gantt chart.","type":"value"},{"name":"ONEZONEVAL","optional":true,"followsDelimiter":"/","description":"Displays the value of the ZONE variable in the ZONE variable column only for activities that begin a new zone. A blank string is displayed for all other activities.","type":"standalone"},{"name":"OVERLAPCH=","optional":true,"followsDelimiter":"/","aliases":["OVLPCHAR="],"description":"Indicates the overprint character to be displayed when more than one of the symbols in SYMCHAR='string' or MILECHAR='character' are to be plotted in the same column. The default character is *.","help":"OVERLAPCH='*character*'","type":"value"},{"name":"OVPCHAR=","optional":true,"followsDelimiter":"/","description":"Indicates the character to be displayed if one of the variables specified in the CHART statement is to be plotted in the same column as one of the start or finish times.","help":"OVPCHAR='*character*'","type":"value"},{"name":"PADDING=","optional":true,"followsDelimiter":"/","aliases":["FINPAD="],"description":"Requests that finish times on the chart be increased by one padding unit.","help":"PADDING=*padding*","type":"value"},{"name":"PAGELIMIT=","optional":true,"followsDelimiter":"/","aliases":["PAGES="],"description":"Specifies an upper limit on the number of pages allowed for the Gantt chart. The default value of pages is 100.","help":"PAGELIMIT=*pages*","type":"value"},{"name":"PAGENUM","optional":true,"followsDelimiter":"/","description":"Numbers the pages of the Gantt chart on the top right-hand corner of the page if the chart exceeds one page. The numbering scheme is from left to right, top to bottom.","type":"standalone"},{"name":"PATLEVEL=","optional":true,"followsDelimiter":"/","description":"Specifies the different schedule bar levels to fill using the pattern variable. By default, all of the schedule bar levels for an activity are filled using the pattern defined by the PATTERN variable. Note that holiday and non-working days are not filled with this pattern.","help":"PATLEVEL=EARLY | LATE | ACTUAL | RESOURCE | BASELINE | ALL","type":"choice","arguments":[{"name":"EARLY","followsDelimiter":"/","description":"Early/Late schedule durations","type":"standalone"},{"name":"LATE","followsDelimiter":"/","description":"Early/Late schedule durations","type":"standalone"},{"name":"ACTUAL","followsDelimiter":"/","description":"Actual schedule durations","type":"standalone"},{"name":"RESOURCE","followsDelimiter":"/","description":"Resource schedule duration","type":"standalone"},{"name":"BASELINE","followsDelimiter":"/","description":"Baseline schedule duration","type":"standalone"},{"name":"ALL","followsDelimiter":"/","description":"All of the above (default)","type":"standalone"}]},{"name":"PATTERN=","optional":true,"followsDelimiter":"/","aliases":["PATVAR="],"description":"Specifies an integer variable in the Schedule data set that identifies the pattern for filling the schedule bars and coloring the milestones. The default PATTERN variable name is _PATTERN.","type":"value"},{"name":"PCOMPRESS","optional":true,"followsDelimiter":"/","description":"Specifies that every output page of the Gantt chart is to be produced maintaining the original aspect ratio of the Gantt chart.","type":"standalone"},{"name":"RBARHT=","optional":true,"followsDelimiter":"/","aliases":["SBARHT="],"description":"Specifies that the height of the resource-constrained schedule bar be h cellheights. The value of h is restricted to be a positive real number. The default bar height is one cellheight.","type":"value"},{"name":"RBAROFF=","optional":true,"followsDelimiter":"/","aliases":["SBAROFF="],"description":"Specifies that the resource-constrained schedule bar be offset d cellheights from its default position. A value of zero corresponds to the default position. The direction of increase is from top to bottom.","type":"value"},{"name":"REF=","optional":true,"followsDelimiter":"/","description":"Indicates the position of one or more vertical reference lines on the Gantt chart. The values allowed are constant values.","help":"REF=*values*","type":"value"},{"name":"REFCHAR=","optional":true,"followsDelimiter":"/","description":"Indicates the character to display for reference lines.","help":"REFCHAR='*character*'","type":"value"},{"name":"REFLABEL","optional":true,"followsDelimiter":"/","description":"Specifies that the reference lines are to be labeled. The labels are formatted in the same way as the time axis labels and are placed along the bottom border of the Gantt chart at the appropriate points.","type":"standalone"},{"name":"RIGHT","optional":true,"followsDelimiter":"/","aliases":["RJUST"],"description":"Displays the Gantt chart right-justified with the right edge of the page. This option is ignored in the presence of the LEFT or LJUST option.","type":"standalone"},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Requests that scale number of columns on the chart represent one unit of mininterval where mininterval is the value of the MININTERVAL= option.","help":"SCALE=*scale*","type":"value"},{"name":"SHOWPREC","optional":true,"followsDelimiter":"/","description":"Causes PROC GANTT to terminate in the event that a valid AOA or AON specification exists, and an error occurs either in the logic system (memory allocation, data structure creation, and so on) or simply due to bad data (missing values for the ACTIVITY, TAIL, HEAD variables, and so on).","type":"standalone"},{"name":"SKIP=","optional":true,"followsDelimiter":"/","aliases":["S="],"description":"Requests that skip number of lines be skipped between the plots of the schedules of two activities. The SKIP= option can take integer values between 0 and 4, inclusive.","help":"SKIP=*skip*","type":"value"},{"name":"STRIPIDBLANKS","optional":true,"followsDelimiter":"/","aliases":["STRIPID"],"description":"Strips all leading blanks from character ID variables. The default behavior is to preserve any leading blanks.","type":"standalone"},{"name":"SUCCESSOR=","optional":true,"followsDelimiter":"/","aliases":["SUCC="],"description":"Specifies the variables identifying the names of the immediate successors of the node specified by the ACTIVITY variable.","type":"value"},{"name":"SUMMARY","optional":true,"followsDelimiter":"/","description":"Requests that a detailed description of all symbols and patterns used in the Gantt chart be displayed before the first page of the chart.","type":"standalone"},{"name":"SYMCHAR=","optional":true,"followsDelimiter":"/","description":"Defines the symbols to be used for plotting the early start, late start, early finish, late finish, actual start and finish, resource-constrained start and finish, and baseline start and finish times, in that order.","help":"SYMCHAR='*string*'","type":"value"},{"name":"S_FINISH=","optional":true,"followsDelimiter":"/","aliases":["SF="],"description":"Specifies the variable containing the resource-constrained finish time of each activity in the Schedule data set.","help":"S_FINISH=*variable*","type":"value"},{"name":"S_START=","optional":true,"followsDelimiter":"/","aliases":["SS="],"description":"Specifies the variable containing the resource-constrained start time of each activity in the Schedule data set.","help":"S_START=*variable*","type":"value"},{"name":"TAIL=","optional":true,"followsDelimiter":"/","aliases":["TAILNODE="],"description":"Specifies the variable in the Schedule data set that contains the name of the node that represents the start of the activity. This option is required when the precedence information is specified using the AOA format. The variable can be either numeric or character in type.","help":"TAIL=*variable*","type":"value"},{"name":"TIMEAXISFORMAT=","optional":true,"followsDelimiter":"/","aliases":["TAFORMAT="],"description":"Specifies formats for up to three rows of time-axis labeling. One time-axis row is displayed for each format specified. The formats control the rows of the time-axis from top to bottom. Missing formats yield a blank row.","type":"value"},{"name":"TIMENOW=","optional":true,"followsDelimiter":"/","description":"Specifies the position for the timenow line on the chart.","help":"TIMENOW=*value*","type":"value"},{"name":"TNCHAR=","optional":true,"followsDelimiter":"/","description":"Indicates the character to display for the timenow line. If this option is not used, the letter T is used.","help":"TNCHAR='*character*'","type":"value"},{"name":"TOP","optional":true,"followsDelimiter":"/","aliases":["TJUST"],"description":"Positions the top of the Gantt chart at the top of the page, just below the titles. This option has priority over the BOTTOM or BJUST option.","type":"standalone"},{"name":"USEFORMAT","optional":true,"followsDelimiter":"/","description":"Specifies that the tickmark labels of the Gantt chart axis are to be displayed using the format associated with the first plot variable appearing in the order E_START=, E_FINISH=, L_START=, L_FINISH=, A_START=, A_FINISH=, S_START=, S_FINISH=, B_START=, B_FINISH=.","type":"standalone"},{"name":"VMILE=","optional":true,"followsDelimiter":"/","description":"Specifies a plot symbol from the font specified in the FMILE= option to be used as the milestone symbol on the chart.","help":"VMILE=*value*","type":"value"},{"name":"VPAGES=","optional":true,"followsDelimiter":"/","description":"Specifies that the Gantt chart is to be produced using v vertical pages.","help":"VPAGES=*v*","type":"value"},{"name":"WEB=","optional":true,"followsDelimiter":"/","aliases":["HTML="],"description":"Specifies the character variable in the schedule data set that identifies an HTML page for each activity.","help":"WEB=*variable*","type":"value"},{"name":"WPREC=","optional":true,"followsDelimiter":"/","description":"Specifies the line width to use for drawing the precedence connections. The default width is 1.","help":"WPREC=*linewidth*","type":"value"},{"name":"WTNOW=","optional":true,"followsDelimiter":"/","description":"Specifies the line width to use for drawing the timenow line. The default width is 4.","help":"WTNOW=*linewidth*","type":"value"},{"name":"WZONE=","optional":true,"followsDelimiter":"/","aliases":["WZLINE="],"description":"Specifies the line width to use for drawing the horizontal zone lines which demarcate the different zones on the chart. The default linewidth is 1.","type":"value"},{"name":"ZONE=","optional":true,"followsDelimiter":"/","aliases":["ZONEVAR="],"description":"Names the variable in the Schedule data set that is used to separate the Gantt chart into zones.","type":"value"},{"name":"ZONEOFF=","optional":true,"followsDelimiter":"/","aliases":["ZONEOFFSET="],"description":"Specifies the offset in cellheights of the zone line from its default position of 0.5 cell height above the top of the first schedule bar for the first activity in the zone. The default value of d is 0. The direction of increase is from top to bottom.","type":"value"},{"name":"ZONESPAN=","optional":true,"followsDelimiter":"/","aliases":["ZONELINE="],"description":"Specifies the span of the horizontal zone line that is drawn at the beginning of each new zone.","help":"ZONESPAN=LEFT | RIGHT | ALL | NONE","type":"choice","arguments":[{"name":"LEFT","followsDelimiter":"/","description":"Draws a line that spans the width of the columns of text that appear on the left hand side of the Gantt chart.","type":"standalone"},{"name":"RIGHT","followsDelimiter":"/","description":"Draws a line that spans the width of the axis area which appears on the right-hand side of the chart.","type":"standalone"},{"name":"ALL","followsDelimiter":"/","description":"Draws a line spanning both the preceding regions.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Suppresses the line altogether.","type":"standalone"}]}]},{"name":"ID","description":"The ID statement specifies the variables to be displayed that further identify each activity. If two or more consecutive observations have the same combination of values for all the ID variables, only the first of these observations is plotted unless the DUPOK option is specified in the CHART statement.","help":"ID variables "}],"supportSiteInformation":{"docsetId":"orpmug","docsetVersion":"v_007","docsetTargetFile":"orpmug_gantt_toc.htm"}}