{"name":"GENMOD","statements":[{"name":"PROC GENMOD","description":"The GENMOD procedure fits generalized linear models, as defined by Nelder and Wedderburn (1972). The class of generalized linear models is an extension of traditional linear models that allows the mean of a population to depend on a linear predictor through a nonlinear link function and allows the response probability distribution to be any member of an exponential family of distributions. Many widely used statistical models are generalized linear models. These include classical linear models with normal errors, logistic and probit models for binary data, and log-linear models for multinomial data. Many other useful statistical models can be formulated as generalized linear models by the selection of an appropriate link function and response probability distribution.","help":"PROC GENMOD <DATA=SAS-data-set> <DESCENDING> <NAMELEN=n> <ORDER=DATA | FORMATTED | FREQ... > <PLOTS=ALL | COOKSD | DFBETA... > <RORDER=DATA | FORMATTED | FREQ... >;     \n\tASSESS <CRPANEL> LINK VAR=(effect) ...;     \n\tBAYES <COEFFPRIOR=<JEFFREYS | NORMAL | UNIFORM>> <DIAGNOSTICS=<ALL | NONE | <(keyword-list)>>> <DISPERSIONPRIOR=<GAMMA | IGAMMA | IMPROPER>> ...; \n   \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <DESCENDING> <ORDER=<DATA | FORMATTED | FREQ>... > <TRUNCATE<=n>> ...; \n   \n\tCONTRAST <E> <SINGULAR=number> <WALD> ...; \n   \n\tDEVIANCE variable = expression ;   \n \n\tEFFECTPLOT BOX CONTOUR FIT ...;     \n\tELSE <DO> <IF> <THEN> ...; \n   \n\tESTIMATE <ALPHA=number> <E> <SINGULAR=number> ...; \n   \n\tEXACT <ALPHA=number> <CLTYPE=<EXACT | MIDP>> <ESTIMATE=<PARM | ODDS | BOTH>> ...; \n   \n\tEXACTOPTIONS <ABSFCONV=value> <ADDTOBS> <BUILDSUBSETS> ...; \n   \n\tFREQ | FREQUENCY variable;     \n\tFWDLINK variable = expression ;     \n\tIF <DO> <THEN> <WHEN> ...; \n   \n\tINVLINK variable = expression ;     \n\tLSMEANS <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tLSMESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tMODEL <AGGREGATE= (variable-list) | AGGREGATE= variable | AGGREGATE> <ALPHA=number> <CICONV=number> ...; \n   \n\tOUTPUT <DFBETA=> <DFBETAS=> OUT=SAS-data-set ...;     \n\tREPEATED <ALPHAINIT=numbers> <CONVERGE=number> SUBJECT=subject-effect ...;     \n\tSLICE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tSTORE <LABEL='label'> ; \n   \n\tSTRATA <MISSING> ; \n   \n\tVARIANCE variable = expression ;   \n \n\tWEIGHT | SCWGT variable;     \n\tZEROMODEL <LINK=<CLOGLOG | LOGIT | PROBIT>> ; ","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the SAS data set containing the data to be analyzed. If you omit the DATA= option, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DESCENDING","optional":true,"aliases":["DESCEND","DESC"],"description":"Specifies that the levels of the response variable for the ordinal multinomial model and the binomial model with single variable response syntax be sorted in the reverse of the default order.","type":"standalone"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length of effect names in tables and output data sets to be n characters long, where n is a value between 20 and 200 characters. The default length is 20 characters.","help":"NAMELEN=*n*","type":"value"},{"name":"ORDER=","optional":true,"description":"Specifies the sorting order for the levels of all classification variables (specified in the CLASS statement). This ordering determines which parameters in the model correspond to each level in the data.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]},{"name":"PLOTS=","optional":true,"description":"Specifies plots to be created using ODS Graphics. Syntax: (1) PLOTS <(global-plot-options)> = plot-request <(options)> (2) PLOTS <(global-plot-options)> = (plot-request <(options)> <...plot-request <(options)> > ) The following global plot options are available: CLUSTERLABEL displays formatted levels of the SUBJECT= effect instead of plot symbols.","help":"PLOTS=ALL | COOKSD | DFBETA | DFBETAS | LEVERAGE | PREDICTED&lt;(CLM)&gt; | RESCHI&lt;(options)&gt; | RESDEV&lt;(options)&gt; | RESLIK&lt;(options)&gt; | RESRAW&lt;(options)&gt; | STDRESCHI&lt;(options)&gt; | STDRESDEV&lt;(options)&gt; | CLEVERAGE | CLUSTERCOOKSD | CLUSTERDFIT | DFBETAC | DFBETACS","type":"choice","arguments":[{"name":"ALL","description":"Produces all available plots.","type":"standalone"},{"name":"COOKSD","description":"Plots the Cook’s distance statistic as a function of observation number.","type":"standalone"},{"name":"DFBETA","description":"Plots the β deletion statistic as a function of observation number for each regression parameter in the model.","type":"standalone"},{"name":"DFBETAS","description":"Plots the standardized β deletion statistic as a function of observation number for each regression parameter in the model.","type":"standalone"},{"name":"LEVERAGE","description":"Plots the leverage as a function of observation number.","type":"standalone"},{"name":"PREDICTED","description":"Plots predicted values with confidence limits as a function of observation number. The CLM option includes confidence limits in the predicted value plot.","help":"PREDICTED&lt;(CLM)&gt;","type":"standalone"},{"name":"RESCHI","description":"Plots Pearson residuals.The RESCHI plot request has the following options: INDEX plots as a function of observation number. XBETA plots as a function of linear predictor.","help":"RESCHI&lt;(options)&gt;","type":"standalone"},{"name":"RESDEV","description":"Plots deviance residuals. The RESDEV plot request has the following options: INDEX plots as a function of observation number. XBETA plots as a function of linear predictor.","help":"RESDEV&lt;(options)&gt;","type":"standalone"},{"name":"RESLIK","description":"Plots likelihood residuals. The RESLIK plot request has the following options: INDEX plots as a function of observation number. XBETA plots as a function of linear predictor.","help":"RESLIK&lt;(options)&gt;","type":"standalone"},{"name":"RESRAW","description":"Plots raw residuals. The RESRAW plot request has the following options: INDEX plots as a function of observation number. XBETA plots as a function of linear predictor.","help":"RESRAW&lt;(options)&gt;","type":"standalone"},{"name":"STDRESCHI","description":"Plots standardized Pearson residuals. The STDRESCHI plot request has the following options: INDEX plots as a function of observation number. XBETA plots as a function of linear predictor.","help":"STDRESCHI&lt;(options)&gt;","type":"standalone"},{"name":"STDRESDEV","description":"Plots standardized deviance residuals. The STDRESDEV plot request has the following options: INDEX plots as a function of observation number. XBETA plots as a function of linear predictor.","help":"STDRESDEV&lt;(options)&gt;","type":"standalone"},{"name":"CLEVERAGE","description":"Plots the cluster leverage as a function of ordered cluster.","type":"standalone"},{"name":"CLUSTERCOOKSD","description":"Plots the cluster Cook’s distance statistic as a function of ordered cluster.","type":"standalone"},{"name":"CLUSTERDFIT","description":"Plots the studentized cluster Cook’s distance statistic as a function of ordered cluster.","type":"standalone"},{"name":"DFBETAC","description":"Plots the cluster deletion statistic as a function of ordered cluster for each regression parameter in the model.","type":"standalone"},{"name":"DFBETACS","description":"Plots the standardized cluster deletion statistic as a function of ordered cluster for each regression parameter in the model.","type":"standalone"}]},{"name":"RORDER=","optional":true,"description":"Specifies the sorting order for the levels of the response variable.","help":"RORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]}]},{"name":"ASSESS","aliases":["ASSESSMENT"],"description":"The ASSESS statement computes and plots, using ODS Graphics, model-checking statistics based on aggregates of residuals. The types of aggregates available are cumulative residuals, moving sums of residuals, and loess smoothed residuals. If you do not specify which aggregate to use, the assessments are based on cumulative sums. PROC GENMOD uses ODS Graphics for graphical displays. You must specify either LINK or VAR= in order to create an analysis.","help":"ASSESS &lt;CRPANEL&gt; LINK VAR=(effect) ...","arguments":[{"name":"LINK","description":"Requests the assessment of the link function by performing the analysis with respect to the linear predictor.","type":"standalone"},{"name":"VAR=","description":"Specifies that the functional form of a covariate be checked by performing the analysis with respect to the variable identified by the effect. The effect must be specified in the MODEL statement and must contain only continuous variables variables not listed in a CLASS statement).","type":"value"},{"name":"CRPANEL","optional":true,"followsDelimiter":"/","description":"Requests that a plot with four panels showing just a few of the paths from the default aggregate plot to make it easier to compare simulated and observed paths.","type":"standalone"},{"name":"LOESS","optional":true,"followsDelimiter":"/","aliases":["LOWESS"],"description":"Requests model assessment based on loess smoothed residuals with optional number the fraction of data used; number must be between zero and one.","type":"standalone"},{"name":"NPATHS=","optional":true,"followsDelimiter":"/","aliases":["NPATH=","PATHS=","PATH="],"description":"Specifies the number of simulated paths to plot in the default aggregate residuals plot. The default value of number is 20.","help":"NPATHS=*number*","type":"value"},{"name":"RESAMPLE=","optional":true,"followsDelimiter":"/","aliases":["RESAMPLES="],"description":"Specifies that a p-value be computed based on 1,000 simulated paths, or number paths, if number is specified.","type":"value"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies a seed (number) for the normal random number generator used in creating simulated realizations of aggregates of residuals for plots and estimating p-values. Specifying a seed enables you to produce identical graphs and p-values from one run of the procedure to the next run. If a seed is not specified, or if number is negative or zero, a random number seed is derived from the time of day.","type":"value"},{"name":"WINDOW","optional":true,"followsDelimiter":"/","description":"Requests assessment based on a moving sum window of width number. If number is not specified, a value of one-half of the range of the x-coordinate is used.","type":"standalone"}]},{"name":"BAYES","description":"The BAYES statement requests a Bayesian analysis of the regression model by using Gibbs sampling. The Bayesian posterior samples (also known as the chain) for the regression parameters are not tabulated. The Bayesian posterior samples (also known as the chain) for the regression parameters can be output to a SAS data set.","help":"BAYES &lt;COEFFPRIOR=&lt;JEFFREYS | NORMAL | UNIFORM&gt;&gt; &lt;DIAGNOSTICS=&lt;ALL | NONE | &lt;(keyword-list)&gt;&gt;&gt; &lt;DISPERSIONPRIOR=&lt;GAMMA | IGAMMA | IMPROPER&gt;&gt; ...","arguments":[{"name":"COEFFPRIOR=","optional":true,"aliases":["COEFF=","CPRIOR="],"description":"Specifies the prior distribution for the regression coefficients.","help":"COEFFPRIOR=JEFFREYS | NORMAL | UNIFORM","type":"choice","arguments":[{"name":"JEFFREYS","description":"Syntax: JEFFREYS<(option)> Jeffreys’ prior is specified by COEFFPRIOR=JEFFREYS, which can be followed by the following option in parentheses: CONDITIONAL specifies that the Jeffreys’ prior, conditional on the current Markov chain value of the generalized linear model precision parameter τ, is proportional to |tauI(β)|^(1/2).","type":"standalone"},{"name":"NORMAL","description":"Syntax: NORMAL<(options)> The normal prior is specified by COEFFPRIOR=NORMAL, which can be followed by one of the following options enclosed in parentheses: CONDITIONAL specifies that the normal prior, conditional on the current Markov chain value of the generalized linear model precision parameter τ, is N(µ,τ⁻¹Z), where µ and Z are the mean and covariance of the normal prior specified by other normal options. INPUT=SAS-data-set specifies a SAS data set containing the mean and covariance information of the normal prior. The data set must have a _TYPE_ variable to represent the type of each observation and a variable for each regression coefficient. RELVAR<=c> Specifies the normal prior N(0, cJ), where J is a diagonal matrix with diagonal elements equal to the variances of the corresponding ML estimator. By default, C=10⁶. VAR<=c> Specifies the normal prior N(0,cI), where I is the identity matrix.","type":"standalone"},{"name":"UNIFORM","description":"Specifies the noninformative and improper prior of a constant.","type":"standalone"}]},{"name":"DIAGNOSTICS=","optional":true,"description":"Controls the number of diagnostics produced.","help":"DIAGNOSTICS=ALL | NONE | &lt;(keyword-list)&gt;","type":"choice","arguments":[{"name":"ALL","description":"Requests all diagnostics","type":"standalone"},{"name":"NONE","description":"Requests no diagnostics","type":"standalone"},{"name":"<(keyword-list)>","description":"If you want some but not all of the diagnostics, or if you want to change certain settings of these diagnostics, specify a subset of the following keywords: AUTOCORR<(LAGS= numeric-list)> -- Computes the autocorrelations of lags given by LAGS= list for each parameter. ESS -- Computes Carlin’s estimate of the effective sample size, the correlation time, and the efficiency of the chain for each parameter. GELMAN<(gelman-options)> -- Computes the Gelman and Rubin convergence diagnostics, with the following gelman-options: NCHAIN | N=number -- Specifies the number of parallel chains used to compute the diagnostic, and must be ≥ 2. Default: NCHAIN=3. ALPHA=value -- Specifies the significance level for the upper bound. The default is ALPHA=0.05, resulting in a 97.5% bound. GEWEKE<(geweke-options)>-- Computes the Geweke spectral density diagnostics, which are essentially a two-sample t test between the first f1 portion and the last f2 portion of the chain. The default is f1=0.1 and f2=0.5. The geweke-options are: FRAC1=value -- Specifies the fraction f1 for the first window. FRAC2=value -- Specifies the fraction f2 for the second window. HEIDELBERGER<(heidel-options)> -- Computes the Heidelberger and Welch diagnostic for each variable. The heidel-options are: SALPHA=value -- Specifies the α level for the stationarity test. HALPHA=value -- Specifies the α level for the halfwidth test. EPS=value -- Specifies a positive number ε such that if the halfwidth is less than ε times the sample mean of the retained iterates, the halfwidth test is passed. MCERROR | MCSE --Computes an estimate of the Monte Carlo standard error for each parameter. RAFTERY<(raftery-options)> -- Computes Raftery and Lewis diagnostics that evaluate accuracy of the estimated quantile of a chain. raftery-options are: QUANTILE= | Q=value -- Specifies the order (a value between 0 and 1) of the quantile of interest. The default is 0.025. ACCURACY= | R=value -- Specifies a small positive number as the margin of error for measuring the accuracy of estimation of the quantile. The default is 0.005. PROBABILITY= | S=value -- Specifies the probability of attaining the accuracy of the estimation of the quantile. The default is 0.95. EPSILON= | EPS=value -- Specifies the tolerance level (a small positive number) for the stationary test. The default is 0.001.","type":"standalone"}]},{"name":"DISPERSIONPRIOR=","optional":true,"aliases":["DPRIOR="],"description":"Specifies that Gibbs sampling be performed on the generalized linear model dispersion parameter and the prior distribution for the dispersion parameter, if there is a dispersion parameter in the model.","help":"DISPERSIONPRIOR=GAMMA | IGAMMA | IMPROPER","type":"choice","arguments":[{"name":"GAMMA","description":"Syntax: GAMMA<(options)> Specifies that Gibbs sampling be performed on the generalized linear model dispersion parameter and the gamma prior distribution for the dispersion parameter, if one exists in the model. A gamma prior G(a,b) is specified by DISPERSIONPRIOR=GAMMA, which can be followed by one of the following gamma-options enclosed in parentheses: RELSHAPE<=c> specifies independent G(c Φ-hat,c) distribution, where Φ-hat is the MLE of the dispersion parameter. With this choice of hyperparameters, the mean of the prior distribution is Φ-hat and the variance is Φ-hat/c. By default, c=10⁻⁴. SHAPE=α and ISCALE=b specify the G(a,b) prior. SHAPE=c specifies the G(c,c) prior. ISCALE=c specifies the G(c,c) prior.","type":"standalone"},{"name":"IGAMMA","description":"Syntax: IGAMMA<(options)> Specifies that Gibbs sampling be performed on the generalized linear model dispersion parameter and the inverse gamma prior distribution for the dispersion parameter, if one exists in the model. An inverse gamma prior IG(a,b) is specified by DISPERSIONPRIOR=IGAMMA, which can be followed by one of the following inverse gamma-options enclosed in parentheses. The hyperparameters a and b are the shape and scale parameters of the inverse gamma distribution, respectively. The default is IG(2.001,0.001). RELSHAPE<=c> specifies independent IG((c+Φ-hat)/Φ-hat,c) distribution, where p-hat is the MLE of the dispersion parameter. With this choice of hyperparameters, the mean of the prior distribution is Φ-hat. By default, c=10⁻⁴. SHAPE=α and SCALE=b specify the IG(a,b) prior. SHAPE=c specifies the IG(c,c) prior. SCALE=c specifies the IG(c,c) prior.","type":"standalone"},{"name":"IMPROPER","description":"Specifies that Gibbs sampling be performed on the generalized linear model dispersion parameter and the improper prior distribution for the dispersion parameter, if one exists in the model.","type":"standalone"}]},{"name":"INITIAL=","optional":true,"description":"Specifies the SAS data set that contains the initial values of the Markov chains. The INITIAL= data set must contain all the variables of the model. You can specify multiple rows as the initial values of the parallel chains for the Gelman-Rubin statistics, but posterior summaries, diagnostics, and plots are computed only for the first chain. If the data set also contains the variable _SEED_, the value of the _SEED_ variable is used as the seed of the random number generator for the corresponding chain.","help":"INITIAL=*SAS-data-set*","type":"dataSet"},{"name":"INITIALMLE","optional":true,"description":"Specifies that maximum likelihood estimates of the model parameters be used as initial values of the Markov chain. If this option is not specified, estimates of the mode of the posterior distribution obtained by optimization are used as initial values.","type":"standalone"},{"name":"METROPOLIS=","optional":true,"description":"Specifies whether to use a Metropolis step to generate Gibbs samples for posterior distributions that are not log concave. The default value is METROPOLIS=YES.","help":"METROPOLIS=YES | NO","type":"choice","arguments":[{"name":"YES","description":"Specifies to use a Metropolis step to generate Gibbs samples for posterior distributions that are not log concave.","type":"standalone"},{"name":"NO","description":"Specifies not to use a Metropolis step to generate Gibbs samples for posterior distributions that are not log concave.","type":"standalone"}]},{"name":"NBI=","optional":true,"description":"Specifies the number of burn-in iterations before the chains are saved. The default is 2000.","help":"NBI=*number*","type":"value"},{"name":"NMC=","optional":true,"description":"Specifies the number of iterations after the burn-in. The default is 10000.","help":"NMC=*number*","type":"value"},{"name":"OUTPOST=","optional":true,"aliases":["OUT="],"description":"Names the SAS data set that contains the posterior samples.","help":"OUTPOST=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Controls the display of diagnostic plots. Syntax: (1) PLOTS<(global-plot-options)>= plot-request (2) PLOTS<(global-plot-options)>= (plot-request < ...plot-request>) The global plot options are as follows: FRINGE creates a fringe plot on the X axis of the density plot. GROUPBY=TYPE | PARAMETER specifies that the plots be grouped by type or parameter. LAGS=n specifies that autocorrelations be plotted up to lag n. If this option is not specified, autocorrelations are plotted up to lag 50. SMOOTH displays a fitted penalized β-spline curve for each trace plot. UNPACKPANEL | UNPACK specifies that all paneled plots be unpacked, meaning that each plot in a panel is displayed separately. The plot requests include the following: ALL specifies all types of plots. PLOTS=ALL is equivalent to specifying PLOTS=(TRACE AUTOCORR DENSITY). AUTOCORR displays the autocorrelation function plots for the parameters. DENSITY displays the kernel density plots for the parameters. NONE suppresses all diagnostic plots.","help":"PLOTS=ALL | AUTOCORR | DENSITY | NONE | TRACE","type":"choice","arguments":[{"name":"ALL","description":"Specifies all types of plots.","type":"standalone"},{"name":"AUTOCORR","description":"Displays the autocorrelation function plots for the parameters.","type":"standalone"},{"name":"DENSITY","description":"Displays the kernel density plots for the parameters.","type":"standalone"},{"name":"NONE","description":"Suppresses all diagnostic plots.","type":"standalone"},{"name":"TRACE","description":"Displays the trace plots for the parameters.","type":"standalone"}]},{"name":"PRECISIONPRIOR=","optional":true,"aliases":["PPRIOR="],"description":"Specifies that Gibbs sampling be performed on the generalized linear model precision parameter and the prior distribution for the precision parameter, if there is a precision parameter in the model.","help":"PRECISIONPRIOR=GAMMA | IMPROPER","type":"choice","arguments":[{"name":"GAMMA","description":"Syntax: GAMMA<(options)> Specifies that Gibbs sampling be performed on the generalized linear model precision parameter and the gamma prior distribution for the precision parameter, if one exists in the model. A gamma prior G(a,b) is specified by DISPERSIONPRIOR=GAMMA, which can be followed by one of the following gamma-options enclosed in parentheses: RELSHAPE<=c> specifies independent G(c τ-hat,c) distribution, where τ-hat is the MLE of the dispersion parameter. With this choice of hyperparameters, the mean of the prior distribution is τ-hat and the variance is τ-hat/c. By default, c=10⁻⁴. SHAPE=α and ISCALE=b specify the G(a,b) prior. SHAPE=c specifies the G(c,c) prior. ISCALE=c specifies the G(c,c) prior.","type":"standalone"},{"name":"IMPROPER","description":"Specifies that Gibbs sampling be performed on the generalized linear model precision parameter and the improper prior distribution for the precision parameter, if one exists in the model.","type":"standalone"}]},{"name":"SCALEPRIOR=","optional":true,"description":"Specifies that Gibbs sampling be performed on the generalized linear model scale parameter and the prior distribution for the scale parameter, if there is a precision parameter in the model.","help":"SCALEPRIOR=GAMMA | IMPROPER","type":"choice","arguments":[{"name":"GAMMA","description":"Syntax: GAMMA<(options)> Specifies that Gibbs sampling be performed on the generalized linear model scale parameter and the gamma prior distribution for the scale parameter, if one exists in the model. A gamma prior G(a,b) is specified by DISPERSIONPRIOR=GAMMA, which can be followed by one of the following gamma-options enclosed in parentheses: RELSHAPE<=c> specifies independent G(c σ-hat,c) distribution, where σ-hat is the MLE of the dispersion parameter. With this choice of hyperparameters, the mean of the prior distribution is σ-hat and the variance is σ-hat/c. By default, c=10⁻⁴. SHAPE=α and ISCALE=b specify the G(a,b) prior. SHAPE=c specifies the G(c,c) prior. ISCALE=c specifies the G(c,c) prior.","type":"standalone"},{"name":"IMPROPER","description":"Specifies that Gibbs sampling be performed on the generalized linear model scale parameter and the improper prior distribution for the scale parameter, if one exists in the model.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies an integer seed in the range 1 to 2³¹-1 for the random number generator in the simulation.","help":"SEED=*number*","type":"value"},{"name":"STATISTICS=","optional":true,"aliases":["STATS="],"description":"The global-options include the following: ALPHA=numeric-list controls the probabilities of the credible intervals. The ALPHA= values must be between 0 and 1.","help":"STATISTICS=ALL | NONE | CORR | COV | SUMMARY | INTERVAL | (CORR COV SUMMARY INTERVAL)","type":"choice","arguments":[{"name":"ALL","description":"Requests all posterior statistics. Equivalent to specifying STATISTICS=(CORR COV SUMMARY INTERVAL).","type":"standalone"},{"name":"NONE","description":"Requests no posterior statistics","type":"standalone"},{"name":"CORR","description":"Requests the posterior correlation matrix.","type":"standalone"},{"name":"COV","description":"Requests the posterior covariance matrix.","type":"standalone"},{"name":"SUMMARY","description":"Requests the means, standard deviations, and percentile points for the posterior samples. The default is to produce the 25th, 50th, and 75th percentile points, but you can use the global PERCENT= option to request specific percentile points.","type":"standalone"},{"name":"INTERVAL","description":"Requests equal-tail credible intervals and HPD intervals. The defult is to produce the 95% equal-tail credible intervals and 95% HPD intervals, but you can use the global ALPHA= option to request intervals of any probabilities.","type":"standalone"},{"name":"(CORR COV SUMMARY INTERVAL)","description":"If you want some but not all of the posterior statistics, specify a subset of the following keywords: CORR COV SUMMARY INTERVAL","type":"standalone"}]},{"name":"THINNING=","optional":true,"aliases":["THIN="],"description":"Controls the thinning of the Markov chain.","help":"THINNING=*number*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC GENMOD to obtain separate analyses on observations in groups defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. The CLASS statement must precede the MODEL statement. You can specify various v-options for each variable by enclosing them in parentheses after the variable name. You can also specify global v-options for the CLASS statement by placing them after a slash (/). Global v-options are applied to all the variables specified in the CLASS statement. If you specify more than one CLASS statement, the global v-options specified in any one CLASS statement apply to all CLASS statements. However, individual CLASS variable v-options override the global v-options.","help":"CLASS &lt;DESCENDING&gt; &lt;ORDER=&lt;DATA | FORMATTED | FREQ&gt;... &gt; &lt;TRUNCATE&lt;=n&gt;&gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sorting order of the classification variable.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Allows missing value (’.’ for a numeric variable and blank for a character variable) as a valid value for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sorting order for the levels of classification variables.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | GLM | ORDINAL | POLYNOMIAL | REFERENCE | ORTHEFFECT | ORTHORDINAL | ORTHPOLY | ORTHREF","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Specifies effect coding.","type":"standalone"},{"name":"GLM","followsDelimiter":"/","description":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","type":"standalone"},{"name":"ORDINAL","followsDelimiter":"/","aliases":["THERMOMETER"],"description":"Specifies the cumulative parameterization for an ordinal CLASS variable.","type":"standalone"},{"name":"POLYNOMIAL","followsDelimiter":"/","aliases":["POLY"],"description":"Specifies polynomial coding.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","aliases":["REF"],"description":"Specifies reference-cell coding.","type":"standalone"},{"name":"ORTHEFFECT","followsDelimiter":"/","description":"Orthogonalizes PARAM=EFFECT.","type":"standalone"},{"name":"ORTHORDINAL","followsDelimiter":"/","aliases":["ORTHOTHERM"],"description":"Orthogonalizes PARAM=ORDINAL.","type":"standalone"},{"name":"ORTHPOLY","followsDelimiter":"/","description":"Orthogonalizes PARAM=POLYNOMIAL.","type":"standalone"},{"name":"ORTHREF","followsDelimiter":"/","description":"Orthogonalizes PARAM=REFERENCE.","type":"standalone"}]},{"name":"REF=","optional":true,"followsDelimiter":"/","description":"Specifies the reference level for PARAM=EFFECT, PARAM=REFERENCE, and their orthogonalizations.","help":"REF=&lt;*level*&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"level","placeholder":true,"followsDelimiter":"/","description":"Specifies the level of the variable to use as the reference level. Replace <level> with an actual value.","type":"value"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first ordered level as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last ordered level as reference.","type":"standalone"}]},{"name":"TRUNCATE=","optional":true,"followsDelimiter":"/","description":"Specifies the length n of CLASS variable values to use in determining CLASS variable levels. If you specify TRUNCATE without the length n, the first 16 characters of the formatted values are used.","type":"value"}]},{"name":"CONTRAST","description":"The CONTRAST statement provides a means of obtaining a test of a specified hypothesis concerning the model parameters. This is accomplished by specifying a matrix L for testing the hypothesis L'β=0. You must be familiar with the details of the model parameterization that PROC GENMOD uses. There is no limit to the number of CONTRAST statements that you can specify, but they must appear after the MODEL statement and after the ZEROMODEL statement for zero-inflated Poisson models. Statistics for multiple CONTRAST statements are displayed in a single table. The elements of the CONTRAST statement are as follows: label identifies the contrast on the output. A label is required for every contrast specified. Labels can be up to 20 characters and must be enclosed in single quotes. contrast-specification identifies the effects and their coefficients from which the L matrix is formed. The contrast-specification can be specified in two different ways. The first method applies to all models except the zero-inflated Poisson (ZIP) distribution, and the syntax is: effect values <,...effect values> The second method of specifying a contrast applies only to ZIP models, and the syntax is: effect values <,...effect values> @zero effect values <,...effect values>","help":"CONTRAST &lt;E&gt; &lt;SINGULAR=number&gt; &lt;WALD&gt; ...","arguments":[{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix be displayed.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","aliases":["EPSILON="],"description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"},{"name":"WALD","optional":true,"followsDelimiter":"/","description":"Requests that a Wald chi-square statistic be computed for the contrast rather than the default likelihood ratio or score statistic.","type":"standalone"}]},{"name":"DEVIANCE","description":"You can specify a probability distribution other than those available in PROC GENMOD by using the DEVIANCE and VARIANCE statements. You do not need to specify the DEVIANCE or VARIANCE statement if you use the DIST= MODEL statement option to specify a probability distribution. The variable identifies the deviance contribution from a single observation to the procedure, and it must be a valid SAS variable name that does not appear in the input data set. The expression can be any arithmetic expression supported by the DATA step language, and it is used to define the functional dependence of the deviance on the mean and the response. You use the automatic variables _MEAN_ and _RESP_ to represent the mean and response in the expression. Alternatively, the deviance function can be defined using programming statements and assigned to a variable, which is then listed as the expression. This form is convenient for using complex statements such as IF-THEN/ELSE clauses. The DEVIANCE statement is ignored unless the VARIANCE statement is also specified.","help":"DEVIANCE variable = expression "},{"name":"EFFECTPLOT","description":"The EFFECTPLOT statement produces a display of the fitted model and provides options for changing and enhancing the displays.","help":"EFFECTPLOT BOX CONTOUR FIT ...","arguments":[{"name":"BOX=","description":"Displays a box plot of continuous response data at each level of a CLASS effect, with predicted values superimposed and connected by a line. This is an alternative to the INTERACTION plot-type.","help":"BOX=PLOTBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"CONTOUR=","description":"Displays a contour plot of predicted values against two continuous covariates.","help":"CONTOUR=PLOTBY= | X= | Y=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"},{"name":"Y=","type":"value"}]},{"name":"FIT=","description":"Displays a curve of predicted values versus a continuous variable.","help":"FIT=PLOTBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"INTERACTION=","description":"Displays a curve of predicted values versus a continuous variable grouped by the levels of a CLASS effect.","help":"INTERACTION=PLOTBY= | SLICEBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"SLICEBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"SLICEFIT=","description":"","help":"SLICEFIT=PLOTBY= | SLICEBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"SLICEBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the significance level, 0 ≥ value ≥ 1, for producing 100(1-value/2)% prediction and confidence limits. By default, value=0.05.","help":"ALPHA=*value*","type":"value"},{"name":"AT","optional":true,"followsDelimiter":"/","description":"where contopt= MEAN | MIN | MAX | MIDRANGE classopt= ALL | REF varopt= contopts | number-list | classopts | ’class-level’...’class-level’]","type":"standalone"},{"name":"ATLEN=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum length (1 < n < 256) of the levels of the AT variables that are displayed in footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed, and the continuous AT levels are displayed with a BEST format that has a width greater than or equal to 5, which distinguishes each level. Caution:If the levels of your AT variables are not unique when the first n characters are displayed, then the levels are combined in the plots but not in the underlying computations. Also, at most n characters for continuous AT variables are displayed.","help":"ATLEN=*n*","type":"value"},{"name":"ATORDER=","optional":true,"followsDelimiter":"/","description":"Uses the AT values for continuous variables in ascending or descending order as specified. By default, values are used in the order of their first appearance in the AT option.","help":"ATORDER=ASCENDING | DESCENDING","type":"choice","arguments":[{"name":"ASCENDING","followsDelimiter":"/","description":"Uses the AT values for continuous variables in ascending order","type":"standalone"},{"name":"DESCENDING","followsDelimiter":"/","description":"Uses the AT values for continuous variables in descending order","type":"standalone"}]},{"name":"CLI","optional":true,"followsDelimiter":"/","description":"Displays normal (Wald) prediction limits. This option is available only for normal distributions with identity links. If your model is from a Bayesian analysis, then sampling-based intervals are computed.","type":"standalone"},{"name":"CLM","optional":true,"followsDelimiter":"/","description":"Displays confidence limits. These are computed as the normal (Wald) confidence limits for the linear predictor, and if the ILINK option is specified, the limits are also back-transformed by the inverse link function. If your model is from a Bayesian analysis, then sampling-based intervals are computed.","type":"standalone"},{"name":"CLUSTER","optional":true,"followsDelimiter":"/","description":"Modifies the BOX and INTERACTION plot-types by displaying the levels of the SLICEBY= effect in a side-by-side fashion. You can specify percent as a percentage of half the distance between X levels. The percent value must be between 0.1 and 1; the default percent depends on the number of X levels, the number of SLICEBY levels, and the number of PLOTBY levels for INTERACTION plot-types. Default clustering can be removed by specifying the NOCLUSTER option.","type":"standalone"},{"name":"CONNECT","optional":true,"followsDelimiter":"/","description":"Modifies the BOX and INTERACTION plot-types by connecting the predicted values with a line. Default connecting lines can be removed by specifying the NOCONNECT option.","type":"standalone"},{"name":"EXTEND=","optional":true,"followsDelimiter":"/","description":"Extends continuous covariate axes by value x ½range in both directions, where range is the range of the X axis.","help":"EXTEND=DATA | &lt;*value*&gt;","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Displays curves to the range of the data within the appropriate SLICEBY=, PLOTBY=, and AT level.","type":"standalone"},{"name":"value","placeholder":true,"followsDelimiter":"/","description":"Replace <value> with an actual value.","type":"value"}]},{"name":"GRIDSIZE=","optional":true,"followsDelimiter":"/","description":"Specifies the resolution of curves by computing the predicted values at n equally spaced x-values and specifies the resolution of surfaces by computing the predicted values on an nxn grid of points. Default values are n=200 for curves and bands, n=50 for surfaces, and n=2 for lines. If results of a Bayesian or bootstrap analysis are being displayed, then the defaults are n=500000/B, where B is the number of samples, the upper limit is equal to the usual defaults, and the lower limit equal to 20.","help":"GRIDSIZE=*n*","type":"value"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Displays the fit on the scale of the inverse link function. In particular, the results are displayed on the probability scale for logistic regression. By default, a procedure displays the fit on either the link or inverse link scale.","type":"standalone"},{"name":"INDIVIDUAL","optional":true,"followsDelimiter":"/","description":"Displays individual probabilities for polytomous response models with cumulative links on the scale of the inverse link function. This option is not available when the LINK option is specified, and confidence limits are not available with this option.","type":"standalone"},{"name":"LIMITS","optional":true,"followsDelimiter":"/","description":"Invokes the CLI and CLM options.","type":"standalone"},{"name":"LINK","optional":true,"followsDelimiter":"/","description":"Displays the fit on the scale of the link function; that is, the linear predictor. Note that probabilities or observed proportions near 0 and 1 are transformed to . By default, a procedure displays the fit on either the link or inverse link scale.","type":"standalone"},{"name":"MOFF","optional":true,"followsDelimiter":"/","description":"Moves the offset for a Poisson regression model to the response side of the equation. If the ILINK option is also in effect, then the rate is displayed on the Y axis, while the LINK option displays the log of the rate on the Y axis. Without this option, the predicted values are computed and displayed only for the observations.","type":"standalone"},{"name":"NCOLS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of columns in a paneled plot. This option is not available with the BOX plot-type. The default choice of NROWS= and NCOLS= is based on the number of PLOTBY= and AT levels. If there is only one plot being displayed in a panel, then NROWS=1 and NCOLS=1 and the plots are produced as if you specified only the UNPACK option. If only two plots are displayed in a panel, then NROWS=1 and NCOLS=2. For all other cases, a 2x2, 2x3, or 3x3 panel is chosen based on how much of the last panel is used, with ties going to the larger panels. For example, if 14 plots are being created, then this requires either four 2x2 panels with 50% of the last panel filled, three 2x3 panels with 33% of the last panel filled, or two 3x3 panels with 55% of the last panel filled; in this case, the 3x3 panels are chosen.","help":"NCOLS=*n*","type":"value"},{"name":"NOCLI","optional":true,"followsDelimiter":"/","description":"Suppresses the prediction limits.","type":"standalone"},{"name":"NOCLM","optional":true,"followsDelimiter":"/","description":"Suppresses the confidence limits.","type":"standalone"},{"name":"NOLIMITS","optional":true,"followsDelimiter":"/","description":"Invokes the NOCLI and NOCLM options.","type":"standalone"},{"name":"NOOBS","optional":true,"followsDelimiter":"/","description":"Suppresses the display of observations and overrides the specification of the OBS= option.","type":"standalone"},{"name":"NROWS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of rows in a paneled plot. This option is not available with the BOX plot-type. See the NCOLS= option for more details.","help":"NROWS=*n*","type":"value"},{"name":"OBS=","optional":true,"followsDelimiter":"/","description":"Displays observations on the effect plots. An input data set is required; hence the OBS option is not available with PROC PLM. The OBS option is overridden by the NOOBS option. When the ILINK option is specified with binary response variables, then either the observed proportions or a coded value of the response is displayed. For polytomous response variables, the observed values are overlaid onto the fitted curves unless the LOCATION= option is specified. Whether observations are displayed by default or not depends upon the procedure. If the PLOTBY= option is specified, then the observations displayed on each plot are from the corresponding PLOTBY= level for classification effects; for continuous effects, all observations are displayed on every plot. The following options are available: BYAT -- subsets the observations by AT level and by the PLOTBY= level. CDISPLAY=NONE | OUTLINE | GRADIENT | OUTLINEGRADIENT controls the display of observations on contour plots. CGRADIENT=RESIDUAL | DEPENDENT specifies what the gradient-shading of the observed values on the CONTOUR plot-type represents. DEPTH=depth (you can specify 1 ≤ depth ≤ 100. By default, DEPTH=1) specifies the number of overlapping observations that can be distinguished by adjusting their transparency. DISTANCE displays observations on FIT plot-types with a color-gradient that indicates how far the observation is from the AT and PLOTBY= level. FITATCLASS -- computes fitted values only for class levels that are observed in the data set. FRINGE -- displays observations in a fringe (rug) plot at the bottom of the plot. JITTER<(FACTOR=factor SEED=seed X=x-jitter Y=y-jitter)> -- shifts (jitters) the observations. LABEL<=OBS> -- labels markers with their observation number.","help":"OBS=BYAT | CDISPLAY= | CGRADIENT= | DEPTH= | DISTANCE | FITATCLASS | FRINGE | JITTER | FACTOR= | SEED= | X= | Y= | LABEL | LABEL= | LOCATION=","type":"choice","arguments":[{"name":"BYAT","type":"standalone"},{"name":"CDISPLAY=","type":"value"},{"name":"CGRADIENT=","type":"value"},{"name":"DEPTH=","type":"value"},{"name":"DISTANCE","type":"standalone"},{"name":"FITATCLASS","type":"standalone"},{"name":"FRINGE","type":"standalone"},{"name":"JITTER","type":"standalone"},{"name":"FACTOR=","type":"value"},{"name":"SEED=","type":"value"},{"name":"X=","type":"value"},{"name":"Y=","type":"value"},{"name":"LABEL","type":"standalone"},{"name":"LABEL=","type":"value"},{"name":"LOCATION=","type":"value"}]},{"name":"PLOTBY=","optional":true,"followsDelimiter":"/","description":"Specifies a variable or CLASS effect at whose levels the predicted values are computed and the plots are displayed. You can specify the response variable as the effect for polytomous response models. The panel-type argument specifies the method in which the plots are grouped for the display. The following panel-types are available. COLUMNS specifies that the columns within each panel correspond to different levels of the PLOTBY= effect and hence the rows correspond to different AT levels. PACK specifies that plots be displayed in the panels as they are produced with no control over the placement of the PLOTBY= and AT levels. PANELS | LEVELS specifies that each level of the PLOTBY= effect begin a new panel of plots and the AT levels define the plots within the panels. ROWS specifies that the rows within each panel correspond to different levels of the PLOTBY= effect and hence the columns correspond to different AT levels.","help":"PLOTBY=COLUMNS | PACK | PANELS | LEVELS | ROWS","type":"choice","arguments":[{"name":"COLUMNS","type":"standalone"},{"name":"PACK","type":"standalone"},{"name":"PANELS","type":"standalone"},{"name":"LEVELS","type":"standalone"},{"name":"ROWS","type":"standalone"}]},{"name":"PLOTBYLEN=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum length (1 ≤ n ≤ 256) of the levels of the PLOTBY= variables, which are displayed in footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed.","help":"PLOTBYLEN=*n*","type":"value"},{"name":"POLYBAR","optional":true,"followsDelimiter":"/","description":"Displays polytomous response data as a stacked histogram with bar heights defined by the individual predicted value. Your response variable must be the SLICEBY= variable, and the INDIVIDUAL and ILINK options must be in effect; otherwise, the option is ignored. Confidence limits are ignored.","type":"standalone"},{"name":"PREDLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label to be displayed on the Y axis. The default Y axis label is determined by your model. For the CONTOUR plot-type, this option changes the title to \"label for Y.\"","help":"PREDLABEL=*label*","type":"value"},{"name":"SHOWCLEGEND","optional":true,"followsDelimiter":"/","description":"Displays the gradient-legend for the CONTOUR plot-type. This option has no effect when the OBS(CGRADIENT=RESIDUAL) option is also specified.","type":"standalone"},{"name":"SLICEBY=","optional":true,"followsDelimiter":"/","description":"Displays the fitted values at the different levels of the specified variable or CLASS effect.","help":"SLICEBY=NONE | effect&lt;=numeric-list&gt;","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Preventing the INTERACTION plot-type from slicing by a second class covariate. Note that the SLICEBY=NONE option is not available for the SLICEFIT plot-type, since that is the same as the FIT plot-type.","type":"standalone"},{"name":"effect","followsDelimiter":"/","description":"You can specify the response variable as the effect for polytomous response models. Use this option to modify SLICEFIT and INTERACTION plot-types. If you specify a continuous variable as the effect, then you can either specify a numeric-list of values at which to display that variable or, by default, five equally spaced values from the minimum variable value to its maximum are displayed.","help":"effect&lt;=numeric-list&gt;","type":"value"}]},{"name":"SMOOTH","optional":true,"followsDelimiter":"/","description":"Overlays a loess smooth on the FIT plot-type for models that have only one continuous predictor. This option is not available for binary or polytomous response models.","type":"standalone"},{"name":"UNPACK","optional":true,"followsDelimiter":"/","description":"Suppresses paneling. By default, multiple plots can appear in some output panels. Specify UNPACK to display each plot separately.]","type":"standalone"},{"name":"X=","optional":true,"followsDelimiter":"/","description":"Specifies values to display on the X axis. For BOX and INTERACTION plot-types, effect can be a CLASS effect in the MODEL statement. For FIT, SLICEFIT, and CONTOUR plot-types, effect can be any continuous variable in the model.","help":"X=*effect*","type":"value"},{"name":"Y=","optional":true,"followsDelimiter":"/","description":"Specifies values to display on the Y axis for the CONTOUR plot-type. The Y= argument can be any continuous variable in the model.","help":"Y=*args*","type":"value"},{"name":"YRANGE=","optional":true,"followsDelimiter":"/","description":"Displays the predicted values on the Y axis in the range [min,max]. By default, when the Y axis displays predicted probabilities, the entire Y axis, [0,1], is displayed. This option is useful if your predicted probabilities are all contained in some subset of this range. This option is not available with the CONTOUR plot-type.","help":"YRANGE=CLIP | &lt;(&lt;*min*&gt;,&lt;*max*&gt;)&gt;","type":"choice","arguments":[{"name":"CLIP","followsDelimiter":"/","description":"Has the same effect as specifying the minimum predicted value as min and the maximum predicted value as max.","type":"standalone"},{"name":"(min,max)","placeholder":true,"followsDelimiter":"/","description":"Replace min and max with actual values.","type":"standaloneOrValue"}]}]},{"name":"ELSE","description":"If the condition in an IF-THEN statement is false and an ELSE statement is present, then the ELSE action is carried out.","help":"ELSE &lt;DO&gt; &lt;IF&gt; &lt;THEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"IF","optional":true,"description":"Executes a SAS statement for observations that meet specific conditions.","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"}]},{"name":"ESTIMATE","description":"The ESTIMATE statement is similar to a CONTRAST statement, except only one-row L' matrices are permitted.","help":"ESTIMATE &lt;ALPHA=number&gt; &lt;E&gt; &lt;SINGULAR=number&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1; the default value is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests that exp(L'β), its standard error, and its confidence limits be computed. If you specify the EXP option, standard errors and confidence intervals are computed using the delta method.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","aliases":["EPSILON="],"description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"}]},{"name":"EXACT","description":"The EXACT statement performs exact tests of the parameters for the specified effects and optionally estimates the parameters and outputs the exact conditional distributions. You can specify the keyword INTERCEPT and any effects in the MODEL statement. Inference on the parameters of the specified effects is performed by conditioning on the sufficient statistics of all the other model parameters (possibly including the intercept). You can specify several EXACT statements, but they must follow the MODEL statement. Each statement can optionally include an identifying label. If several EXACT statements are specified, any statement without a label is assigned a label of the form \"Exact,\" where n indicates the nth EXACT statement. The label is included in the headers of the displayed exact analysis tables.","help":"EXACT &lt;ALPHA=number&gt; &lt;CLTYPE=&lt;EXACT | MIDP&gt;&gt; &lt;ESTIMATE=&lt;PARM | ODDS | BOTH&gt;&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the level of significance α for 100(1-α)% confidence limits for the parameters or odds ratios. The value of number must be between 0 and 1. By default, number is equal to the value of the ALPHA= option in the MODEL statement, or 0.05 if that option is not specified.","help":"ALPHA=*number*","type":"value"},{"name":"CLTYPE=","optional":true,"followsDelimiter":"/","description":"Requests either the exact or mid-p confidence intervals for the parameter estimates. By default, the exact intervals are produced.","help":"CLTYPE=EXACT | MIDP","type":"choice","arguments":[{"name":"EXACT","followsDelimiter":"/","description":"Requests the exact confidence intervals for the parameter estimates.","type":"standalone"},{"name":"MIDP","followsDelimiter":"/","description":"Requests either the mid-p confidence intervals for the parameter estimates.","type":"standalone"}]},{"name":"ESTIMATE=","optional":true,"followsDelimiter":"/","description":"Estimates the individual parameters (conditioned on all other parameters) for the effects specified in the EXACT statement. For each parameter, a point estimate, a standard error, a confidence interval, and a p-value for a two-sided test that the parameter is zero are displayed. Note that the two-sided p-value is twice the one-sided p-value.","help":"ESTIMATE=PARM | ODDS | BOTH","type":"choice","arguments":[{"name":"PARM","followsDelimiter":"/","description":"Specifies that the parameters be estimated. This is the default.","type":"standalone"},{"name":"ODDS","followsDelimiter":"/","description":"Specifies that the odds ratios be estimated. If you have classification variables, then you must also specify the PARAM=REF option in the CLASS statement.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Specifies that both the parameters and odds ratios be estimated.","type":"standalone"}]},{"name":"JOINT","optional":true,"followsDelimiter":"/","description":"Performs the joint test that all of the parameters are simultaneously equal to zero, performs individual hypothesis tests for the parameter of each continuous variable, and performs joint tests for the parameters of each classification variable. The joint test is indicated in the \"Conditional Exact Tests\" table by the label \"Joint.\"","type":"standalone"},{"name":"JOINTONLY","optional":true,"followsDelimiter":"/","description":"Performs only the joint test of the parameters. The test is indicated in the \"Conditional Exact Tests\" table by the label \"Joint.\" When this option is specified, individual tests for the parameters of each continuous variable and joint tests for the parameters of the classification variables are not performed.","type":"standalone"},{"name":"MIDPFACTOR=","optional":true,"followsDelimiter":"/","description":"Sets the tie factors used to produce the mid-p hypothesis statistics and the mid-p confidence intervals. δ1 modifies both the hypothesis tests and confidence intervals, while δ2 affects only the hypothesis tests. By default, δ1=0.5 and δ2=1.0.","type":"value"},{"name":"ONESIDED","optional":true,"followsDelimiter":"/","description":"Requests one-sided confidence intervals and p-values for the individual parameter estimates and odds ratios. The one-sided p-value is the smaller of the left- and right-tail probabilities for the observed sufficient statistic of the parameter under the null hypothesis that the parameter is zero. The two-sided p-values (default) are twice the one-sided p-values.","type":"standalone"},{"name":"OUTDIST=","optional":true,"followsDelimiter":"/","description":"Names the SAS data set that contains the exact conditional distributions. This data set contains all of the exact conditional distributions that are required to process the corresponding EXACT statement. This data set contains the possible sufficient statistics for the parameters of the effects specified in the EXACT statement, the counts, and, when hypothesis tests are performed on the parameters, the probability of occurrence and the score value for each sufficient statistic. When you request an OUTDIST= data set, the observed sufficient statistics are displayed in the \"Sufficient Statistics\" table.","help":"OUTDIST=*SAS-data-set*","type":"dataSet"}]},{"name":"EXACTOPTIONS","description":"The EXACTOPTIONS statement specifies options that apply to every EXACT statement in the program.","help":"EXACTOPTIONS &lt;ABSFCONV=value&gt; &lt;ADDTOBS&gt; &lt;BUILDSUBSETS&gt; ...","arguments":[{"name":"ABSFCONV=","optional":true,"description":"Specifies the absolute function convergence criterion.","help":"ABSFCONV=*value*","type":"value"},{"name":"ADDTOBS","optional":true,"description":"Adds the observed sufficient statistic to the sampled exact distribution if the statistic was not sampled. This option has no effect unless the METHOD=NETWORKMC option is specified and the ESTIMATE option is specified in the EXACT statement. If the observed statistic has not been sampled, then the parameter estimate does not exist; by specifying this option, you can produce (biased) estimates.","type":"standalone"},{"name":"BUILDSUBSETS","optional":true,"description":"Builds every distribution for sampling. By default, some exact distributions are created by taking a subset of a previously generated exact distribution. When the METHOD=NETWORKMC option is invoked, this subsetting behavior has the effect of using fewer than the desired n samples; see the N= option for more details. Use the BUILDSUBSETS option to suppress this subsetting.","type":"standalone"},{"name":"EPSILON=","optional":true,"description":"Controls how the partial sums ∑ yixi (where i=1 to j) are compared. value must be between 0 and 1; by default, value=1E–8.","help":"EPSILON=*value*","type":"value"},{"name":"FCONV=","optional":true,"description":"Specifies the relative function convergence criterion.","help":"FCONV=*value*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies the maximum clock time (in seconds) that PROC GENMOD can use to calculate the exact distributions. If the limit is exceeded, the procedure halts all computations and prints a note to the LOG. The default maximum clock time is seven days.","help":"MAXTIME=*seconds*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies which exact conditional algorithm to use for every EXACT statement specified.","help":"METHOD=DIRECT | NETWORK | NETWORKMC","type":"choice","arguments":[{"name":"DIRECT","description":"Invokes the multivariate shift algorithm of Hirji, Mehta, and Patel (1987). This method directly builds the exact distribution, but it can require an excessive amount of memory in its intermediate stages. METHOD=DIRECT is invoked by default when you are conditioning out at most the intercept.","type":"standalone"},{"name":"NETWORK","description":"Invokes an algorithm described in Mehta, Patel, and Senchaudhuri (1992). This method builds a network for each parameter that you are conditioning out, combines the networks, then uses the multivariate shift algorithm to create the exact distribution. The NETWORK method can be faster and require less memory than the DIRECT method. The NETWORK method is invoked by default for most analyses.","type":"standalone"},{"name":"NETWORKMC","description":"Invokes the hybrid network and Monte Carlo algorithm of Mehta, Patel, and Senchaudhuri (1992). This method creates a network, then samples from that network; this method does not reject any of the samples at the cost of using a large amount of memory to create the network. METHOD=NETWORKMC is most useful for producing parameter estimates for problems that are too large for the DIRECT and NETWORK methods to handle and for which asymptotic methods are invalid—for example, for sparse data on a large grid.","type":"standalone"}]},{"name":"N=","optional":true,"description":"Specifies the number of Monte Carlo samples to take when the METHOD=NETWORKMC option is specified. By default, n=100,000.","help":"N=*n*","type":"value"},{"name":"NOLOGSCALE","optional":true,"description":"Specifies that computations for the exact conditional models be computed by using normal scaling. Log scaling can handle numerically larger problems than normal scaling; however, computations in the log scale are slower than computations in normal scale.","type":"standalone"},{"name":"ONDISK","optional":true,"description":"Uses disk space instead of random access memory to build the exact conditional distribution. Use this option to handle larger problems at the cost of slower processing.","type":"standalone"},{"name":"SEED=","optional":true,"description":"Specifies the initial seed for the random number generator used to take the Monte Carlo samples when the METHOD=NETWORKMC option is specified. The value of the SEED= option must be an integer. If you do not specify a seed, or if you specify a value less than or equal to zero, then PROC GENMOD uses the time of day from the computer’s clock to generate an initial seed.","help":"SEED=*seed*","type":"value"},{"name":"STATUSN=","optional":true,"description":"Prints a status line in the SAS log after every number of Monte Carlo samples when the METHOD=NETWORKMC option is specified. The number of samples taken and the current exact p-value for testing the significance of the model are displayed. You can use this status line to track the progress of the computation of the exact conditional distributions.","help":"STATUSN=*number*","type":"value"},{"name":"STATUSTIME=","optional":true,"description":"Specifies the time interval (in seconds) for printing a status line in the LOG. You can use this status line to track the progress of the computation of the exact conditional distributions. The time interval you specify is approximate; the actual time interval varies. By default, no status reports are produced.","help":"STATUSTIME=*seconds*","type":"value"},{"name":"XCONV=","optional":true,"description":"Specifies the relative parameter convergence criterion.","help":"XCONV=*value*","type":"value"}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"The variable in the FREQ statement identifies a variable in the input data set containing the frequency of occurrence of each observation. PROC GENMOD treats each observation as if it appears n times, where n is the value of the FREQ variable for the observation. If it is not an integer, the frequency value is truncated to an integer. If it is less than 1 or missing, the observation is not used. In the case of models fit with generalized estimating equations (GEEs), the frequencies apply to the subject/cluster and therefore must be the same for all observations within each subject.","help":"FREQ | FREQUENCY variable"},{"name":"FWDLINK","description":"You can define a link function other than a built-in link function by using the FWDLINK statement. If you use the MODEL statement option LINK= to specify a link function, you do not need to use the FWDLINK statement. The variable identifies the link function to the procedure. The expression can be any arithmetic expression supported by the DATA step language, and it is used to define the functional dependence on the mean.","help":"FWDLINK variable = expression "},{"name":"IF","description":"","help":"IF &lt;DO&gt; &lt;THEN&gt; &lt;WHEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"GO","optional":true,"aliases":["GOTO"],"description":"Jumps to a new statement.","help":"GO TO","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"PUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"SET","optional":true,"description":"Reads an observation from one or more SAS data sets.","type":"standalone"},{"name":"STOP","optional":true,"description":"Action statement in an IF-THEN construct. Stops execution of the current DATA step.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"},{"name":"WHEN","optional":true,"description":"WHEN statement in an IF-THEN-WHEN construct.","type":"standalone"}]},{"name":"INVLINK","description":"If you define a link function in the FWDLINK statement, then you must define the inverse link function by using the INVLINK statement. If you use the MODEL statement option LINK= to specify a link function, you do not need to use the INVLINK statement. The variable identifies the inverse link function to the procedure. The expression can be any arithmetic expression supported by the DATA step language, and it is used to define the functional dependence on the linear predictor.","help":"INVLINK variable = expression "},{"name":"LSMEANS","description":"The LSMEANS statement computes and compares least squares means (LS-means) of fixed effects. LS-means are predicted population margins—that is, they estimate the marginal means over a balanced population. In a sense, LS-means are to unbalanced designs as class and subclass arithmetic means are to balanced designs.","help":"LSMEANS &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the LSMEANS effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified LSMEANS effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the LSMEANS effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the LSMEANS statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the LSMEANS statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"LSMESTIMATE","description":"The LSMESTIMATE statement provides a mechanism for obtaining custom hypothesis tests among least squares means.","help":"LSMESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the LS-mean estimates. The adjusted quantities are produced in addition to the unadjusted p-values and confidence limits. Adjusted confidence limits are produced if the CL or ALPHA= option is in effect.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"description":"Modifies the values of the covariates used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"description":"Requests that the procedure compute separate margins for each level of the LSMEANS effect.","type":"standalone"},{"name":"CATEGORY=","optional":true,"description":"Specifies how to construct estimates and multiplicity corrections for models with multinomial data (ordinal or nominal). This option is also important for constructing sets of estimable functions for F tests with the JOINT option.","help":"CATEGORY=JOINT | SEPARATE | &lt;*quoted-value-list*&gt;","type":"choice","arguments":[{"name":"JOINT","description":"Computes the estimable functions for every nonredundant category and treats them as a set. For example, a three-row LSESTIMATE statement in a model with three response categories leads to six estimable functions.","type":"standalone"},{"name":"SEPARATE","description":"Computes the estimable functions for every nonredundant category in turn. For example, a three-row LSESTIMATE statement in a model with three response categories leads to two sets of three estimable functions.","type":"standalone"},{"name":"quoted-value-list","placeholder":true,"description":"Computes the estimable functions only for the list of values given. The list must consist of formatted values of the response categories.","type":"value"}]},{"name":"CHISQ","optional":true,"description":"Requests that chi-square tests be performed in addition to F tests, when you request an F test with the JOINT option. This option has no effect in procedures that produce chi-square statistics by default.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"description":"Displays the estimated correlation matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"COV","optional":true,"description":"Displays the estimated covariance matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators. If you do not specify value-list, a default value of 1.0 is assumed. Missing values in the value-list are converted to 1.0.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L coefficients of the estimable function be displayed.","type":"standalone"},{"name":"ELSM","optional":true,"description":"Requests that the K matrix coefficients be displayed. These are the coefficients that apply to the LS-means. This option is useful to ensure that you assigned the coefficients correctly to the LS-means.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the least squares means estimate. When you model data with the logit link function and the estimate represents a log odds ratio, the EXP option produces an odds ratio. If you specify the CL or ALPHA= option, the (adjusted) confidence limits for the estimate are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"JOINT=","optional":true,"description":"Requests that a joint F or chi-square test be produced for the rows of the estimate. You can specify the following joint-test-options in parentheses: ACC=γ specifies the accuracy radius for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of γ must be strictly between 0 and 1; the default value is 0.005. EPS=є specifies the accuracy confidence level for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of є must be strictly between 0 and 1; the default value is 0.01. LABEL='label' assigns an identifying label to the joint test. If you do not specify a label, the first non-default label for the ESTIMATE rows is used to label the joint test. NOEST | ONLY performs only the F or chi-square test and suppresses other results from the ESTIMATE statement. This option is useful for emulating the CONTRAST statement that is available in other procedures. NSAMP=n specifies the number of samples for the simulation-based method of Silvapulle and Sen (2004). CHISQ -- adds a chi-square test if the procedure produces an F test by default.","help":"JOINT=ACC= | EPS= | LABEL= | NOEST | ONLY | NSAMP= | CHISQ | BOUNDS=","type":"choice","arguments":[{"name":"ACC=","type":"value"},{"name":"EPS=","type":"value"},{"name":"LABEL=","type":"value"},{"name":"NOEST","type":"standalone"},{"name":"ONLY","type":"standalone"},{"name":"NSAMP=","type":"value"},{"name":"CHISQ","type":"standalone"},{"name":"BOUNDS=","type":"value"}]},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic. A two-tailed test is the default. A lower-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins observed in OM-data-set.","type":"value"},{"name":"PLOTS=","optional":true,"description":"Produces ODS statistical graphics of the distribution of estimable functions if the procedure performs the analysis in a sampling-based mode.","help":"PLOTS=ALL | BOXPLOT | DISTPLOT | NONE*plot-options*","type":"value","arguments":[{"name":"ALL","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"BOXPLOT","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"DISTPLOT","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"NONE","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking as documented for the ESTIMATE statement.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion. Step-down methods increase the power of multiple testing procedures by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down-options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60. ORDER=PVALUE ORDER=ROWS specifies the order in which the step-down tests are performed. ORDER=PVALUE is the default, with LS-mean estimates being declared significant only if all LS-mean estimates with smaller (unadjusted) p-values are significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified. REPORT specifies that a report on the step-down adjustment be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","type":"standalone"},{"name":"TESTVALUE=","optional":true,"aliases":["TESTMEAN="],"description":"Specifies the value under the null hypothesis for testing the estimable functions in the LSMESTIMATE statement. The rules for specifying the value-list are very similar to those for specifying the divisor list in the DIVISOR= option. If no TESTVALUE= is specified, all tests are performed as H: Lβ=0. Missing values in the value-list also are translated to zeros. If you specify fewer values than rows in the ESTIMATE statement, the last value in value-list is carried forward. The TESTVALUE= option affects only p-values from individual, joint, and multiplicity-adjusted tests. It does not affect confidence intervals.","help":"TESTVALUE=*value-list*","type":"value"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic. A two-tailed test is the default. An upper-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"}]},{"name":"MODEL","description":"The MODEL statement specifies the response, or dependent variable, and the effects, or explanatory variables. If you omit the explanatory variables, the procedure fits an intercept-only model. An intercept term is included in the model by default. The intercept can be removed with the NOINT option. You can specify the response in the form of a single variable or in the form of a ratio of two variables denoted events/trials. The first form is applicable to all responses. The second form is applicable only to summarized binomial response data. When each observation in the input data set contains the number of events (for example, successes) and the number of trials from a set of binomial trials, use the events/trials syntax. In the events/trials model syntax, you specify two variables that contain the event and trial counts. These two variables are separated by a slash (/). The values of both events and (trialsevents) must be nonnegative, and the value of the trials variable must be greater than 0 for an observation to be valid. The variable events or trials can take noninteger values.","help":"MODEL &lt;AGGREGATE= (variable-list) | AGGREGATE= variable | AGGREGATE&gt; &lt;ALPHA=number&gt; &lt;CICONV=number&gt; ...","arguments":[{"name":"AGGREGATE=","optional":true,"followsDelimiter":"/","description":"Specifies the subpopulations on which the Pearson chi-square and the deviance are calculated. Specifying the AGGREGATE option is equivalent to specifying the AGGREGATE= option with a variable list that includes all explanatory variables in the MODEL statement.","type":"value"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","aliases":["ALPH=","A="],"description":"Sets the confidence coefficient for parameter confidence intervals to 1-number. The value of number must be between 0 and 1. The default value of number is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CICONV=","optional":true,"followsDelimiter":"/","description":"Sets the convergence criterion for profile likelihood confidence intervals.","help":"CICONV=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that confidence limits for predicted values be displayed (see the OBSTATS option).","type":"standalone"},{"name":"CODING=","optional":true,"followsDelimiter":"/","description":"Specifies that effect coding be used for all classification variables in the model. This is the same as specifying PARAM=EFFECT as a CLASS statement option.","help":"CODING=EFFECT | FULLRANK","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"CODING=EFFECT","type":"standalone"},{"name":"FULLRANK","followsDelimiter":"/","description":"CODING=FULLRANK","type":"standalone"}]},{"name":"CONVERGE=","optional":true,"followsDelimiter":"/","description":"Sets the convergence criterion. The value of number must be between 0 and 1.","help":"CONVERGE=*number*","type":"value"},{"name":"CONVH=","optional":true,"followsDelimiter":"/","description":"Sets the relative Hessian convergence criterion. The value of number must be between 0 and 1.","help":"CONVH=*number*","type":"value"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Requests that the parameter estimate correlation matrix be displayed.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Requests that the parameter estimate covariance matrix be displayed.","type":"standalone"},{"name":"DIAGNOSTICS","optional":true,"followsDelimiter":"/","aliases":["INFLUENCE"],"description":"Requests that case deletion diagnostic statistics be displayed (see the OBSTATS option).","type":"standalone"},{"name":"DIST=","optional":true,"followsDelimiter":"/","aliases":["D=","ERROR=","ERR="],"description":"Specifies the built-in probability distribution to use in the model.","help":"DIST=BINOMIAL | GAMMA | GEOMETRIC | IGAUSSIAN | MULTINOMIAL | NEGBIN | NORMAL | POISSON | ZIP","type":"choice","arguments":[{"name":"BINOMIAL","followsDelimiter":"/","description":"Binomial distribution","type":"standalone"},{"name":"GAMMA","followsDelimiter":"/","description":"Gamma distribution","type":"standalone"},{"name":"GEOMETRIC","followsDelimiter":"/","description":"Geometric distribution","type":"standalone"},{"name":"IGAUSSIAN","followsDelimiter":"/","description":"Inverse Gaussian distribution","type":"standalone"},{"name":"MULTINOMIAL","followsDelimiter":"/","description":"Multinomial distribution","type":"standalone"},{"name":"NEGBIN","followsDelimiter":"/","description":"Negative binomial distribution","type":"standalone"},{"name":"NORMAL","followsDelimiter":"/","description":"Normal distribution","type":"standalone"},{"name":"POISSON","followsDelimiter":"/","description":"Poisson distribution","type":"standalone"},{"name":"ZIP","followsDelimiter":"/","description":"","type":"standalone"}]},{"name":"DSCALE","optional":true,"followsDelimiter":"/","description":"Same as specifying SCALE=DEVIANCE or SCALE=D. This fixes the scale parameter at a value of 1 in the estimation procedure.","type":"standalone"},{"name":"EXACTMAX","optional":true,"followsDelimiter":"/","description":"Names a variable used for performing an exact Poisson regression. For each observation, the integer part of the EXACTMAX value should be nonnegative and at least as large as the response value. If the EXACTMAX option is specified without a variable, then default values are computed.","type":"standalone"},{"name":"EXPECTED","optional":true,"followsDelimiter":"/","description":"Requests that the expected Fisher information matrix be used to compute parameter estimate covariances and the associated statistics.","type":"standalone"},{"name":"INITIAL=","optional":true,"followsDelimiter":"/","description":"Sets initial values for parameter estimates in the model.","help":"INITIAL=*numbers*","type":"value"},{"name":"INTERCEPT=","optional":true,"followsDelimiter":"/","description":"Initializes the intercept term to number for parameter estimation.","help":"INTERCEPT=*number*","type":"value"},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"Displays the iteration history for all iterative processes: parameter estimation, fitting constrained models for contrasts and Type 3 analyses, and profile likelihood confidence intervals.","type":"standalone"},{"name":"LINK=","optional":true,"followsDelimiter":"/","description":"Specifies the link function to use in the model.","help":"LINK=CUMCLL | CUMLOGIT | CUMPROBIT | CLOGLOG | IDENTITY | LOG | LOGIT | PROBIT | POWER(number)","type":"choice","arguments":[{"name":"CUMCLL","followsDelimiter":"/","description":"Cumulative complementary log-log function","type":"standalone"},{"name":"CUMLOGIT","followsDelimiter":"/","description":"Cumulative logit function","type":"standalone"},{"name":"CUMPROBIT","followsDelimiter":"/","description":"Cumulative probit function","type":"standalone"},{"name":"CLOGLOG","followsDelimiter":"/","description":"Complementary log-log function","type":"standalone"},{"name":"IDENTITY","followsDelimiter":"/","description":"Identity function","type":"standalone"},{"name":"LOG","followsDelimiter":"/","description":"Log function","type":"standalone"},{"name":"LOGIT","followsDelimiter":"/","description":"Logit function","type":"standalone"},{"name":"PROBIT","followsDelimiter":"/","description":"Probit function","type":"standalone"},{"name":"POWER","followsDelimiter":"/","description":"Power with λ=number function","help":"POWER(number)","type":"standalone"}]},{"name":"LRCI","optional":true,"followsDelimiter":"/","description":"Requests that two-sided confidence intervals for all model parameters be computed based on the profile likelihood function.","type":"standalone"},{"name":"MAXITER=","optional":true,"followsDelimiter":"/","aliases":["MAXIT="],"description":"Sets the maximum allowable number of iterations for all iterative computation processes in PROC GENMOD. By default, MAXITER=50.","help":"MAXITER=*number*","type":"value"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept term be included in the model. An intercept is included unless this option is specified.","type":"standalone"},{"name":"NOSCALE","optional":true,"followsDelimiter":"/","description":"Holds the scale parameter fixed. Otherwise, for the normal, inverse Gaussian, and gamma distributions, the scale parameter is estimated by maximum likelihood. If you omit the SCALE= option, the scale parameter is fixed at the value 1.","type":"standalone"},{"name":"OBSTATS","optional":true,"followsDelimiter":"/","description":"Specifies that an additional table of statistics be displayed.","type":"standalone"},{"name":"OFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies a variable in the input data set to be used as an offset variable.","help":"OFFSET=*variable*","type":"value"},{"name":"PREDICTED","optional":true,"followsDelimiter":"/","aliases":["PRED"],"description":"Requests that predicted values, the linear predictor, its standard error, and the Hessian weight be displayed (see the OBSTATS option).","type":"standalone"},{"name":"RESIDUALS","optional":true,"followsDelimiter":"/","description":"Requests that residuals and standardized residuals be displayed.","type":"standalone"},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Sets the value used for the scale parameter where the NOSCALE option is used.","help":"SCALE=&lt;*number*&gt; | PEARSON | DEVIANCE","type":"choice","arguments":[{"name":"number","placeholder":true,"followsDelimiter":"/","description":"Replace number with an actual scale parameter value.","type":"value"},{"name":"PEARSON","followsDelimiter":"/","aliases":["P"],"description":"Fixes the scale parameter at the value 1 in the estimation procedure. After the parameter estimates are determined, the exponential family dispersion parameter is assumed to be given by Pearson’s chi-square statistic divided by the degrees of freedom.","type":"standalone"},{"name":"DEVIANCE","followsDelimiter":"/","aliases":["D"],"description":"Fixes the scale parameter at a value of 1 in the estimation procedure. After the parameter estimates are determined, the exponential family dispersion parameter is assumed to be given by the deviance divided by the degrees of freedom.","type":"standalone"}]},{"name":"SCORING=","optional":true,"followsDelimiter":"/","description":"Requests that on iterations up to number, the Hessian matrix be computed using the Fisher scoring method.","help":"SCORING=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Sets the tolerance for testing singularity of the information matrix and the crossproducts matrix.","help":"SINGULAR=*number*","type":"value"},{"name":"TYPE1","optional":true,"followsDelimiter":"/","description":"Requests that a Type 1, or sequential, analysis be performed.","type":"standalone"},{"name":"TYPE3","optional":true,"followsDelimiter":"/","description":"Requests that statistics for Type 3 contrasts be computed for each effect specified in the MODEL statement.","type":"standalone"},{"name":"WALD","optional":true,"followsDelimiter":"/","description":"Requests Wald statistics for Type 3 contrasts. You must also specify the TYPE3 option in order to compute Type 3 Wald statistics.","type":"standalone"},{"name":"WALDCI","optional":true,"followsDelimiter":"/","description":"Requests that two-sided Wald confidence intervals for all model parameters be computed based on the asymptotic normality of the parameter estimators.","type":"standalone"},{"name":"XVARS","optional":true,"followsDelimiter":"/","description":"Requests that the regression variables be included in the OBSTATS table.","type":"standalone"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set that contains all the variables in the input data set and, optionally, the estimated linear predictors (XBETA) and their standard error estimates, the weights for the Hessian matrix, predicted values of the mean, confidence limits for predicted values, residuals, and case deletion diagnostics. Residuals and diagnostic statistics are not computed for multinomial models.","help":"OUTPUT &lt;DFBETA=&gt; &lt;DFBETAS=&gt; OUT=SAS-data-set ...","arguments":[{"name":"OUT=","description":"Specifies the output data set. If you omit the OUT=option, the output data set is created and given a default name that uses the DATA convention.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"CH=","optional":true,"aliases":["CLUSTERH=","CLEVERAGE="],"description":"[Requires REPEATED statement] Represents the leverage of a cluster.","type":"value"},{"name":"CLUSTER","optional":true,"description":"[Requires REPEATED statement] Represents the numerical cluster index, in order of sorted clusters.","type":"standalone"},{"name":"DCLS=","optional":true,"aliases":["CLUSTERCOOKD=","CLUSTERCOOKSD="],"description":"[Requires REPEATED statement] Represents the Cook distance type statistic to measure the influence of deleting an entire cluster on the overall model fit.","type":"value"},{"name":"DFBETA=","optional":true,"aliases":["DBETA="],"description":"Represents the effect of deleting an observation on parameter estimates.","type":"value"},{"name":"DFBETAC=","optional":true,"aliases":["DBETAC="],"description":"[Requires REPEATED statement] Represents the effect of deleting an entire cluster on parameter estimates.","type":"value"},{"name":"DFBETACS=","optional":true,"aliases":["DBETACS="],"description":"[Requires REPEATED statement] Represents the effect of deleting an entire cluster on normalized parameter estimates.","type":"value"},{"name":"DFBETAS=","optional":true,"aliases":["DBETAS="],"description":"Represents the effect of deleting an observation on standardized parameter estimates.","type":"value"},{"name":"DOBS=","optional":true,"aliases":["COOKD=","COOKSD="],"description":"Represents the Cook distance type statistic to measure the influence of deleting a single observation on the overall model fit.","type":"value"},{"name":"HESSWGT=","optional":true,"description":"Represents the diagonal element of the weight matrix used in computing the Hessian matrix.","type":"value"},{"name":"LEVERAGE=","optional":true,"aliases":["H="],"description":"Represents the leverage of a single observation.","type":"value"},{"name":"LOWER=","optional":true,"aliases":["L="],"description":"Represents the lower confidence limit for the predicted value of the mean, or the lower confidence limit for the probability that the response is less than or equal to the value of Level or Value.","type":"value"},{"name":"MCLS=","optional":true,"aliases":["CLUSTERDFIT="],"description":"[Requires REPEATED statement] Represents the studentized Cook distance type statistic to measure the influence of deleting an entire cluster on the overall model fit.","type":"value"},{"name":"PREDICTED=","optional":true,"aliases":["PRED=","PROB=","P="],"description":"Represents the predicted value of the mean of the response or the predicted probability that the response variable is less than or equal to the value of Level or Value if the multinomial model for ordinal data is used.","type":"value"},{"name":"PZERO=","optional":true,"description":"Represents the zero-inflation probability for zero-inflated models.","type":"value"},{"name":"RESCHI=","optional":true,"description":"Represents the Pearson (chi) residual for identifying observations that are poorly accounted for by the model.","type":"value"},{"name":"RESDEV=","optional":true,"description":"Represents the deviance residual for identifying poorly fitted observations.","type":"value"},{"name":"RESLIK=","optional":true,"description":"Represents the likelihood residual for identifying poorly fitted observations.","type":"value"},{"name":"RESRAW=","optional":true,"description":"Represents the raw residual for identifying poorly fitted observations.","type":"value"},{"name":"STDRESCHI=","optional":true,"description":"Represents the standardized Pearson (chi) residual for identifying observations that are poorly accounted for by the model.","type":"value"},{"name":"STDRESDEV=","optional":true,"description":"Represents the standardized deviance residual for identifying poorly fitted observations.","type":"value"},{"name":"STDXBETA=","optional":true,"description":"Represents the standard error estimate of XBETA (see the XBETA keyword).","type":"value"},{"name":"UPPER=","optional":true,"aliases":["U="],"description":"Represents the upper confidence limit for the predicted value of the mean, or the upper confidence limit for the probability that the response is less than or equal to the value of Level or Value.","type":"value"},{"name":"XBETA=","optional":true,"description":"Represents the estimate of the linear predictor x'iB for observation i, or aj + x'iB, where j is the corresponding ordered value of the response variable for the multinomial model with ordinal data.","type":"value"}]},{"name":"REPEATED","description":"The REPEATED statement specifies the covariance structure of multivariate responses for GEE model fitting in the GENMOD procedure.","help":"REPEATED &lt;ALPHAINIT=numbers&gt; &lt;CONVERGE=number&gt; SUBJECT=subject-effect ...","arguments":[{"name":"SUBJECT=","description":"Identifies subjects in the input data set.","help":"SUBJECT=*subject-effect*","type":"value"},{"name":"ALPHAINIT=","optional":true,"followsDelimiter":"/","description":"Specifies initial values for log odds ratio regression parameters if the LOGOR= option is specified for binary data.","help":"ALPHAINIT=*numbers*","type":"value"},{"name":"CONVERGE=","optional":true,"followsDelimiter":"/","description":"Specifies the convergence criterion for GEE parameter estimation.","help":"CONVERGE=*number*","type":"value"},{"name":"CORRW","optional":true,"followsDelimiter":"/","description":"Displays the estimated regression parameter correlation matrix. Both model-based and empirical correlations are displayed.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Displays the estimated regression parameter covariance matrix. Both model-based and empirical covariances are displayed.","type":"standalone"},{"name":"ECORRB","optional":true,"followsDelimiter":"/","description":"Displays the estimated regression parameter empirical correlation matrix.","type":"standalone"},{"name":"ECOVB","optional":true,"followsDelimiter":"/","description":"Displays the estimated regression parameter empirical covariance matrix.","type":"standalone"},{"name":"INITIAL=","optional":true,"followsDelimiter":"/","description":"Specifies initial values of the regression parameters estimation, other than the intercept parameter, for GEE estimation.","help":"INITIAL=*numbers*","type":"value"},{"name":"INTERCEPT=","optional":true,"followsDelimiter":"/","description":"Specifies either an initial or a fixed value of the intercept regression parameter in the GEE model.","help":"INTERCEPT=*number*","type":"value"},{"name":"LOGOR=","optional":true,"followsDelimiter":"/","description":"Specifies the regression structure of the log odds ratio used to model the association of the responses from subjects for binary data.","help":"LOGOR=EXCH | FULLCLUST | LOGORVAR(variable) | NESTK | NEST1 | ZFULL | ZREP&lt;(*matrix*)&gt;","type":"choice","arguments":[{"name":"EXCH","followsDelimiter":"/","description":"Exchangeable","type":"standalone"},{"name":"FULLCLUST","followsDelimiter":"/","description":"Fully parameterized clusters","type":"standalone"},{"name":"LOGORVAR","followsDelimiter":"/","description":"Indicator variable for specifying block effects","help":"LOGORVAR(variable)","type":"standalone"},{"name":"NESTK","followsDelimiter":"/","description":"k-nested","type":"standalone"},{"name":"NEST1","followsDelimiter":"/","description":"1-nested","type":"standalone"},{"name":"ZFULL","followsDelimiter":"/","description":"Fully specified z-matrix specified in ZDATA= data set","type":"standalone"},{"name":"ZREP","followsDelimiter":"/","description":"Single cluster specification for replicated z-matrix specified in ZDATA= data set.","help":"ZREP&lt;(*matrix*)&gt;","type":"standaloneOrValue"}]},{"name":"MAXITER=","optional":true,"followsDelimiter":"/","aliases":["MAXIT="],"description":"Specifies the maximum number of iterations allowed in the iterative GEE estimation process. The default number is 50.","help":"MAXITER=*number*","type":"value"},{"name":"MCORRB","optional":true,"followsDelimiter":"/","description":"Displays the estimated regression parameter model-based correlation matrix.","type":"standalone"},{"name":"MCOVB","optional":true,"followsDelimiter":"/","description":"Displays the estimated regression parameter model-based covariance matrix.","type":"standalone"},{"name":"MODELSE","optional":true,"followsDelimiter":"/","description":"Displays an analysis of parameter estimates table that uses model-based standard errors for inference.","type":"standalone"},{"name":"PRINTMLE","optional":true,"followsDelimiter":"/","description":"Displays an analysis of maximum likelihood parameter estimates table. The maximum likelihood estimates are not displayed unless this option is specified.","type":"standalone"},{"name":"RUPDATE=","optional":true,"followsDelimiter":"/","description":"Specifies the number of iterations between updates of the working correlation matrix.","help":"RUPDATE=*number*","type":"value"},{"name":"SORTED","optional":true,"followsDelimiter":"/","description":"Specifies that the input data are grouped by subject and sorted within subject.","type":"standalone"},{"name":"SUBCLUSTER=","optional":true,"followsDelimiter":"/","aliases":["SUBCLUST="],"description":"Specifies a variable defining subclusters for the 1-nested or k-nested log odds ratio association modeling structures.","help":"SUBCLUSTER=*variable*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","aliases":["CORR="],"description":"Specifies the structure of the working correlation matrix used to model the correlation of the responses from subjects.","help":"TYPE=AR | EXCH | IND | MDEP(number) | UNSTR | USER | FIXED (matrix)","type":"choice","arguments":[{"name":"AR","followsDelimiter":"/","description":"Autoregressive(1)","type":"standalone"},{"name":"EXCH","followsDelimiter":"/","description":"Exchangeable","type":"standalone"},{"name":"IND","followsDelimiter":"/","description":"Independent","type":"standalone"},{"name":"MDEP","followsDelimiter":"/","description":"m-dependent with m=number","help":"MDEP(number)","type":"standalone"},{"name":"UNSTR","followsDelimiter":"/","description":"Unstructured","type":"standalone"},{"name":"USER","followsDelimiter":"/","description":"Fixed, user-specified correlation matrix","type":"standalone"},{"name":"FIXED","followsDelimiter":"/","description":"Fixed, user-specified correlation matrix","help":"FIXED (matrix)","type":"standalone"}]},{"name":"V6CORR","optional":true,"followsDelimiter":"/","description":"Specifies that the SAS ‘Version 6’ method of computing the normalized Pearson chi-square be used for working correlation estimation and for model-based covariance matrix scale factor.","type":"standalone"},{"name":"WITHINSUBJECT=","optional":true,"followsDelimiter":"/","aliases":["WITHIN="],"description":"Defines an effect specifying the order of measurements within subjects.","type":"value"},{"name":"YPAIR=","optional":true,"followsDelimiter":"/","description":"Specifies the variables in the ZDATA= data set corresponding to pairs of responses for log odds ratio association modeling.","help":"YPAIR=*variable-list*","type":"value"},{"name":"ZDATA=","optional":true,"followsDelimiter":"/","description":"Specifies a SAS data set containing either the full z-matrix for log odds ratio association modeling or the z-matrix for a single complete cluster to be replicated for all clusters.","help":"ZDATA=*SAS-data-set*","type":"dataSet"},{"name":"ZROW=","optional":true,"followsDelimiter":"/","description":"Specifies the variables in the ZDATA= data set corresponding to rows of the z-matrix for log odds ratio association modeling.","help":"ZROW=*variable-list*","type":"value"}]},{"name":"SLICE","description":"The SLICE statement provides a general mechanism for performing a partitioned analysis of the LS-means for an interaction. This analysis is also known as an analysis of simple effects. The SLICE statement uses the same options as the LSMEANS statement.","help":"SLICE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the SLICE model-effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified SLICE effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the SLICE effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means.","type":"standalone"},{"name":"NOF","optional":true,"followsDelimiter":"/","description":"Suppresses the F test for testing the mutual equality of the estimable functions in the partition.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the SLICE statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this SLICE statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the SLICE statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"SLICEBY=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"STORE","aliases":["ITEMSTORE"],"description":"The STORE statement requests that the procedure save the context and results of the statistical analysis. The resulting item store is a binary file format that cannot be modified. The contents of the item store can be processed with the PLM procedure. The item-store-name is a usual one- or two-level SAS name, like the names that are used for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session. Since item stores usually are used to perform postprocessing tasks, typical usage specifies a two-level name of the form libname.membername. If an item store by the same name as specified in the STORE statement already exists, the existing store is replaced.","help":"STORE &lt;LABEL='label'&gt; ","arguments":[{"name":"LABEL=","optional":true,"followsDelimiter":"/","description":"Adds a custom label. When the PLM procedure processes an item store, the label appears in the PROC PLM output along with other identifying information.","help":"LABEL='*label*'","type":"value"}]},{"name":"STRATA","aliases":["STRATUM"],"description":"The proportional hazards assumption might not be realistic for all data. If so, it might still be reasonable to perform a stratified analysis. The STRATA statement names the variables that determine the stratification. Strata are formed according to the nonmissing values of the STRATA variables unless the MISSING option is specified. In the STRATA statement, variable is a variable with values that are used to determine the strata levels, and list is an optional list of values for a numeric variable. Multiple variables can appear in the STRATA statement.","help":"STRATA &lt;MISSING&gt; ","arguments":[{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (‘.’,‘.A’,...,‘.Z’ for numeric variables and blanks for character variables) as valid STRATA variable values.","type":"standalone"}]},{"name":"VARIANCE","description":"You can specify a probability distribution other than the built-in distributions by using the VARIANCE and DEVIANCE statements. The variable name variable identifies the variance function to the procedure. The expression is used to define the functional dependence on the mean, and it can be any arithmetic expression supported by the DATA step language. You use the automatic variable _MEAN_ to represent the mean in the expression.","help":"VARIANCE variable = expression "},{"name":"WEIGHT","aliases":["SCWGT"],"description":"The WEIGHT statement identifies a variable in the input data set to be used as the exponential family dispersion parameter weight for each observation. The exponential family dispersion parameter is divided by the WEIGHT variable value for each observation. This is true regardless of whether the parameter is estimated by the procedure or specified in the MODEL statement with the SCALE= option. It is also true for distributions such as the Poisson and binomial that are not usually defined to have a dispersion parameter. For these distributions, a WEIGHT variable weights the overdispersion parameter, which has the default value of 1. The WEIGHT variable does not have to be an integer; if it is less than or equal to 0 or if it is missing, the corresponding observation is not used.","help":"WEIGHT | SCWGT variable"},{"name":"ZEROMODEL","description":"The ZEROMODEL statement enables you to perform zero-inflated Poisson regression or zero-inflated negative binomial regression when those respective distributions are specified by the DIST= option in the MODEL statement. The effects in the ZEROMODEL statement consist of explanatory variables or combinations of variables for the zero-inflation probability regression model in a zero-inflated model.","help":"ZEROMODEL &lt;LINK=&lt;CLOGLOG | LOGIT | PROBIT&gt;&gt; ","arguments":[{"name":"LINK=","optional":true,"followsDelimiter":"/","description":"Specifies the link function to use in the model.","help":"LINK=CLOGLOG | LOGIT | PROBIT","type":"choice","arguments":[{"name":"CLOGLOG","followsDelimiter":"/","description":"Specifies to use the complementary log-log link function in the model.","type":"standalone"},{"name":"LOGIT","followsDelimiter":"/","description":"Specifies to use the logit link function in the model.","type":"standalone"},{"name":"PROBIT","followsDelimiter":"/","description":"Specifies to use the probit link function in the model.","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"latest","docsetTargetFile":"statug_genmod_toc.htm"}}