{"name":"GLMMOD","statements":[{"name":"PROC GLMMOD","description":"The GLMMOD procedure constructs the design matrix for a general linear model; it essentially constitutes the model-building front end for the GLM procedure. You can use the GLMMOD procedure in conjunction with other SAS/STAT software regression procedures or with SAS/IML software to obtain specialized analyses for general linear models that you cannot obtain with the GLM procedure. † While some of the regression procedures in SAS/STAT software provide for general linear effects modeling with classification variables and interaction or polynomial effects, many others do not. For such procedures, you must specify the model directly in terms of distinct variables. For example, if you want to use the REG procedure to fit a polynomial model, you must first create the crossproduct and power terms as new variables, usually in a DATA step. Alternatively, you can use the GLMMOD procedure to create a data set that contains the design matrix for a model as specified using the effects modeling facilities of the GLM procedure.","help":"PROC GLMMOD <DATA=SAS-data-set> <NAMELEN=n> <NOPRINT> <ORDER=DATA | FORMATTED | FREQ... > <OUTDESIGN=SAS-data-set> <OUTPARM=SAS-data-set> <PREFIX=name> <ZEROBASED>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCLASS <TRUNCATE> ;\n    \n\tFREQ variable;\n    \n\tMODEL <NOINT> ;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be used by the GLMMOD procedure.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NAMELEN=","optional":true,"description":"Specifies the maximum length for an effect name.","help":"NAMELEN=*n*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the order in which you want the levels of the classification variables (specified in the CLASS statement) to be sorted.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]},{"name":"OUTDESIGN=","optional":true,"description":"Names an output data set to contain the columns of the design matrix.","help":"OUTDESIGN=*SAS-data-set*","type":"dataSet"},{"name":"OUTPARM=","optional":true,"description":"Names an output data set to contain the information regarding the association between model effects and design matrix columns.","help":"OUTPARM=*SAS-data-set*","type":"dataSet"},{"name":"PREFIX=","optional":true,"description":"Specifies a prefix to use in naming the columns of the design matrix in the OUTDESIGN= data set.","help":"PREFIX=*name*","type":"value"},{"name":"ZEROBASED","optional":true,"description":"Specifies that the numbering for the columns of the design matrix in the OUTDESIGN= data set begin at 0.","type":"standalone"}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. The CLASS statement must precede the MODEL statement.","help":"CLASS &lt;TRUNCATE&gt; ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined by using no more than the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"FREQ","description":"FREQ and WEIGHT variables are transferred to the output data sets without change.","help":"FREQ variable"},{"name":"MODEL","description":"The MODEL statement names the dependent variables and independent effects.","help":"MODEL &lt;NOINT&gt; ","arguments":[{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that the intercept parameter not be included in the model.","type":"standalone"}]},{"name":"WEIGHT","description":"FREQ and WEIGHT variables are transferred to the output data sets without change.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_019","docsetTargetFile":"statug_glmmod_toc.htm"}}