{"name":"GLMPOWER","statements":[{"name":"PROC GLMPOWER","description":"Power and sample size analysis optimizes the resource usage and design of a study, improving chances of conclusive results with maximum efficiency. The GLMPOWER procedure performs prospective power and sample size analysis for linear models, with a variety of goals: † o determining the sample size required to get a significant result with adequate probability (power) † o characterizing the power of a study to detect a meaningful effect † o conducting what-if analyses to assess sensitivity of the power or required sample size to other factors † Here prospective indicates that the analysis pertains to planning for a future study. This is in contrast to retrospective analysis for a past study, which is not supported by this procedure. † The statistical analyses that are covered include Type III tests and contrasts of fixed effects in univariate linear models, optionally with covariates. The covariates can be continuous or categorical. Tests and contrasts involving random effects are not supported.","help":"PROC GLMPOWER <DATA=SAS-data-set> <ORDER=DATA | FORMATTED | FREQ... > <PLOTONLY>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS variables ;     \n\tCONTRAST <SINGULAR=number> ; \n   \n\tMANOVA M=equation,...,equation | (row-of-matrix,...,row-of-matrix) <ORTH> ; \n   \n\tMODEL dependents = independents ;  \n  \n\tPLOT INTERPOL=JOIN|NONE  KEY=BYCURVE|BYFEATURE|ONCURVES  MARKERS=ANALYSIS|COMPUTED|NICE...  ...;     \n\tPOWER <ALPHA=number-list> <CORRMAT=name-list> <CORRS=name-list> ...; \n   \n\tREPEATED factor-specification;     \n\tWEIGHT variable; ","arguments":[{"name":"DATA=","optional":true,"description":"Names a SAS data set to be used as the exemplary data set, which is an artificial data set constructed to represent the intended sampling design and the conjectured response means for the underlying population.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"ORDER=","optional":true,"description":"Specifies the sorting order for the levels of all classification variables (specified in the CLASS statement).","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels are sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels are sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels are sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels are sorted by the unformatted value.","type":"standalone"}]},{"name":"PLOTONLY","optional":true,"description":"Specifies that only graphical results from the PLOT statement be produced.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC GLMPOWER to obtain separate analyses for observations in groups defined by the BY variables. When a BY statement appears, the procedure expects the exemplary data set to be sorted in order of the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. Classification variables can be either character or numeric.","help":"CLASS variables "},{"name":"CONTRAST","description":"The CONTRAST statement enables you to define custom hypothesis tests by specifying an L vector or matrix for testing the hypothesis LB=0.","help":"CONTRAST &lt;SINGULAR=number&gt; ","arguments":[{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"}]},{"name":"MANOVA","description":"If the MODEL statement includes more than one dependent variable, you can indicate a multivariate model and define transformations of dependent variables by using the MANOVA statement.","help":"MANOVA M=equation,...,equation | (row-of-matrix,...,row-of-matrix) &lt;ORTH&gt; ","arguments":[{"name":"M=","description":"Specifies a transformation matrix for the dependent variables listed in the MODEL statement.","type":"value"},{"name":"ORTH","optional":true,"followsDelimiter":"/","description":"Requests that the transformation matrix in the M= specification of the MANOVA statement be orthonormalized by rows before the analysis.","type":"standalone"}]},{"name":"MODEL","description":"The MODEL statement serves two basic purposes: o The dependents specify scenarios for the cell means. o The independents specify the independent effects.","help":"MODEL dependents = independents "},{"name":"PLOT","description":"The PLOT statement produces a graph or set of graphs for the sample size analysis defined by the previous POWER statement. The plot-options define the plot characteristics, and the graph-options are like those in SAS/GRAPH software.","help":"PLOT INTERPOL=JOIN|NONE  KEY=BYCURVE|BYFEATURE|ONCURVES  MARKERS=ANALYSIS|COMPUTED|NICE...  ...","arguments":[{"name":"INTERPOL=","description":"Specifies the type of curve to draw through the computed points.","help":"INTERPOL=JOIN | NONE","type":"choice","arguments":[{"name":"JOIN","description":"Connects computed points with straight lines.","type":"standalone"},{"name":"NONE","description":"Leaves computed points unconnected.","type":"standalone"}]},{"name":"KEY=","description":"Specifies the style of key (or \"legend\") for the plot. The default is KEY=BYFEATURE.","help":"KEY=BYCURVE | BYFEATURE | ONCURVES","type":"choice","arguments":[{"name":"BYCURVE","description":"Specifies a key with each row identifying a distinct curve in the plot. Syntax: BYCURVE <(bycurve-options)> You can specify the following bycurve-options in parentheses after the KEY=BYCURVE option. NUMBERS=OFF | ON specifies how the key should identify curves. If NUMBERS=OFF, then the key includes symbol, color, and line style samples to identify the curves. If NUMBERS=ON, then the key includes numbers matching numeric labels placed adjacent to the curves. The default is NUMBERS=ON. POS=BOTTOM | INSET specifies the position of the key. The POS=BOTTOM option places the key below the X axis. The POS=INSET option places the key inside the plotting region and attempts to choose the least crowded corner. The default is POS=BOTTOM.","type":"standalone"},{"name":"BYFEATURE","description":"Specifies a key with a column of entries for each plot feature (line style, color, and/or symbol). Syntax: BYFEATURE <(byfeature-options)> You can specify the following byfeature-options in parentheses after KEY=BYFEATURE option. POS=BOTTOM | INSET specifies the position of the key. The POS=BOTTOM option places the key below the X axis. The POS=INSET option places the key inside the plotting region and attempts to choose the least crowded corner. The default is POS=BOTTOM.","type":"standalone"},{"name":"ONCURVES","description":"Places a curve-specific label adjacent to each curve.","type":"standalone"}]},{"name":"MARKERS=","description":"Specifies the locations for plotting symbols.","help":"MARKERS=ANALYSIS | COMPUTED | NICE | NONE","type":"choice","arguments":[{"name":"ANALYSIS","description":"Places plotting symbols at locations corresponding to the values of the relevant input parameter from the POWER statement preceding the PLOT statement.","type":"standalone"},{"name":"COMPUTED","description":"Places plotting symbols at the locations of actual computed points from the sample size analysis. This is the default.","type":"standalone"},{"name":"NICE","description":"Places plotting symbols at tick mark locations (corresponding to the argument axis).","type":"standalone"},{"name":"NONE","description":"Disables plotting symbols.","type":"standalone"}]},{"name":"MAX=","description":"Specifies the maximum of the range of values for the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for).","help":"MAX=&lt;*number*&gt; | DATAMAX","type":"choice","arguments":[{"name":"number","placeholder":true,"description":"Replace <number> with an actual value.","type":"value"},{"name":"DATAMAX","description":"Specifies the maximum value that occurs for this parameter in the POWER statement that precedes the PLOT statement. This is the default.","type":"standalone"}]},{"name":"MIN=","description":"Specifies the minimum of the range of values for the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for).","help":"MIN=&lt;*number*&gt; | DATAMIN","type":"choice","arguments":[{"name":"number","placeholder":true,"description":"Replace <number> with an actual value.","type":"value"},{"name":"DATAMIN","description":"Specifies the minimum value that occurs for this parameter in the POWER statement that precedes the PLOT statement. This is the default.","type":"standalone"}]},{"name":"NPOINTS=","aliases":["NPTS="],"description":"Specifies the number of values for the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for).","help":"NPOINTS=*number*","type":"value"},{"name":"STEP=","description":"Specifies the increment between values of the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for).","help":"STEP=*number*","type":"value"},{"name":"VARY=","description":"Specifies how plot features should be linked to varying analysis parameters.","help":"VARY=BY","type":"choice","arguments":[{"name":"BY","type":"standalone"}]},{"name":"X=","description":"Specifies a plot with the requested type of parameter on the X axis and the parameter being solved for on the Y axis. You cannot use the X= and Y= options simultaneously. The default is X=POWER.","help":"X=N | POWER","type":"choice","arguments":[{"name":"N","description":"Sample size is assigned to the X axis.","type":"standalone"},{"name":"POWER","description":"Power is assigned to the X axis.","type":"standalone"}]},{"name":"XOPTS=","description":"Specifies plot characteristics pertaining to the X axis. You can specify the following x-options in parentheses. CROSSREF=NO | YES specifies whether the reference lines defined by the REF= y-option should be crossed with a reference line on the Y axis that indicates the solution point on the curve.","help":"XOPTS=CROSSREF= | REF=","type":"choice","arguments":[{"name":"CROSSREF=","type":"value"},{"name":"REF=","type":"value"}]},{"name":"Y=","description":"Specifies a plot with the requested type of parameter on the Y axis and the parameter being solved for on the X axis. You cannot use the X= and Y= options simultaneously. The default is Y=POWER.","help":"Y=N | POWER","type":"choice","arguments":[{"name":"N","description":"Sample size is assigned to the Y axis.","type":"standalone"},{"name":"POWER","description":"Power is assigned to the Y axis.","type":"standalone"}]},{"name":"YOPTS=","description":"Specifies plot characteristics pertaining to the Y axis. You can specify the following y-options in parentheses. CROSSREF=NO | YES specifies whether the reference lines defined by the REF= y-option should be crossed with a reference line on the X axis that indicates the solution point on the curve.","help":"YOPTS=CROSSREF= | REF=","type":"choice","arguments":[{"name":"CROSSREF=","type":"value"},{"name":"REF=","type":"value"}]},{"name":"DESCRIPTION=","optional":true,"followsDelimiter":"/","description":"Specifies a descriptive string of up to 40 characters that appears in the \"Description\" field of the graphics catalog.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"NAME=","optional":true,"followsDelimiter":"/","description":"Specifies a name of up to eight characters for the catalog entry for the plot. The default name is PLOTn, where n is the number of the plot statement within the current invocation of PROC GLMPOWER. If the name duplicates the name of an existing entry, SAS/GRAPH software adds a number to the duplicate name to create a unique entry—for example, PLOT11 and PLOT12 for the second and third panels of a multipanel plot generated in the first PLOT statement in an invocation of PROC GLMPOWER.","help":"NAME='*string*'","type":"value"}]},{"name":"POWER","description":"The POWER statement performs power and sample size analyses for the Type III test of each effect in the model defined by the MODEL statements and for the contrasts defined by all CONTRAST statements.","help":"POWER &lt;ALPHA=number-list&gt; &lt;CORRMAT=name-list&gt; &lt;CORRS=name-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of each test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CORRMAT=","optional":true,"description":"Specifies the correlation matrix of the dependent variables in a multivariate model, by using labels that are specified in the MATRIX= option.","help":"CORRMAT=*name-list*","type":"value"},{"name":"CORRS=","optional":true,"description":"Specifies the correlations among the dependent variables in a multivariate model, by using labels that are specified in the MATRIX= option.","help":"CORRS=*name-list*","type":"value"},{"name":"CORRXY=","optional":true,"description":"Specifies the multiple correlation between all covariates and the response.","help":"CORRXY=*number-list*","type":"value"},{"name":"COVMAT=","optional":true,"description":"Specifies the covariance matrix of the dependent variables in a multivariate model, by using labels that are specified in the MATRIX= option.","help":"COVMAT=*name-list*","type":"value"},{"name":"DEPENDENT","optional":true,"description":"Specifies the location of the Dependent column in the output when the OUTPUTORDER=REVERSE option or OUTPUTORDER=SYNTAX option is used, according to its relative position in the POWER statement.","type":"standalone"},{"name":"EFFECTS=","optional":true,"description":"Specifies the model effects to include in the power analysis. By default, or if the EFFECTS keyword is specified without the equal sign (=), all model effects are included.","type":"value"},{"name":"MATRIX","optional":true,"description":"Defines a matrix or vector that you can use along with the CORRMAT=, CORRS=, COVMAT=, and SQRTVAR= options when you have a multivariate model.","type":"standalone"},{"name":"METHOD=","optional":true,"description":"","help":"METHOD=MULLERPETERSON | OBRIENSHIEH","type":"choice","arguments":[{"name":"MULLERPETERSON","aliases":["MP"],"description":"METHOD=MULLERPETERSON is based on Muller and Peterson (1984).","type":"standalone"},{"name":"OBRIENSHIEH","aliases":["OS"],"description":"METHOD=OBRIENSHIEH (the default) is based on O’Brien and Shieh (1992).","type":"standalone"}]},{"name":"MTEST=","optional":true,"description":"Specifies the form of the F test for a multivariate model.","help":"MTEST=*test-list*","type":"value"},{"name":"NCOVARIATES=","optional":true,"aliases":["NCOVARIATE=","NVCOVS=","NCOV="],"description":"Specifies the number of additional degrees of freedom to accommodate covariate effects—both class and continuous—not listed in the MODEL statement.","help":"NCOVARIATES=*number-list*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"(The default) Arranges the parameters in the output according to the following order of their corresponding options: DEPENDENT EFFECTS= weight variable (from the WEIGHT statement) ALPHA= NCOVARIATES= CORRXY= PROPVARREDUCTION= STDDEV= NTOTAL= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the POWER statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the POWER statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of each test or requests a solution for the power with a missing value (POWER=.).","help":"POWER=*number-list*","type":"value"},{"name":"PROPVARREDUCTION=","optional":true,"aliases":["PVRED="],"description":"Specifies the proportional reduction (r) in total R² incurred by the covariates—-in other words, the amount of additional variation explained by the covariates.","help":"PROPVARREDUCTION=*number-list*","type":"value"},{"name":"SQRTVAR=","optional":true,"description":"Specifies the vector of standard deviations—that is, the square roots of the variances—of the dependent variables in a multivariate model, by using labels that are specified using the MATRIX= option. The standard deviation values must be positive.","help":"SQRTVAR=*name-list*","type":"value"},{"name":"STDDEV=","optional":true,"description":"Specifies the error standard deviation, or root MSE.","help":"STDDEV=*number-list*","type":"value"},{"name":"UEPSDEF=","optional":true,"description":"Specifies the type of adjustment for MTEST=HF. The default is UEPSDEF=HFL, which corresponds to the corrected form of the Huynh-Feldt adjustment (Huynh and Feldt; 1976; Lecoutre; 1991).","help":"UEPSDEF=*unbiased-epsilon-definition*","type":"value"}]},{"name":"REPEATED","description":"If the MODEL statement includes more than one dependent variable, you can indicate a multivariate model and define transformations of dependent variables by using the REPEATED statement.","help":"REPEATED factor-specification"},{"name":"WEIGHT","description":"The WEIGHT statement names a variable that provides a profile weight (\"cell weight\") for each observation in the exemplary data set specified by the DATA= option in the PROC GLMPOWER statement.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_019","docsetTargetFile":"statug_glmpower_toc.htm"}}