{"name":"GMM","statements":[{"name":"PROC GMM","description":"The GMM procedure performs clustering—a common step in data exploration—on quantitative data in SAS Viya. † You can use this procedure to read and write data in distributed form, as well as to perform clustering and scoring in parallel by making full use of multicore computers or a distributed computing environment. † PROC GMM performs cluster analysis by using the Gaussian mixture model (GMM), which is a probabilistic model that assumes that all the data points are generated from a mixture of Gaussian distributions. This model can be regarded as generalizing k-means clustering to incorporate information about the covariance structure of the data as well as the centers of the latent Gaussians.","help":"PROC GMM <ALPHA=number><CLUSTERCOVOUT=CAS-libref.data-table><CLUSTERSUMOUT=CAS-libref.data-table><DATA=CAS-libref.data-table><INFERENCE=VB <suboptions>><MAXCLUSTERS=number><NTHREADS=number-of-threads><SEED=number>;     \n\tDISPLAY <CASESENSITIVE><EXCLUDE><EXCLUDEALL> ...;\n\tDISPLAYOUT <INCLUDEALL><NOREPLACE><REPEATED> ...;\n\tINPUT variables;\n\tSAVESTATE <RSTORE=CAS-libref.data-table> ;\n\tSCORE <COPYVAR=variable | COPYVARS=(variables)><OUT=CAS-libref.data-table> ;","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the mass parameter of the Dirichlet process. The value of number must be a positive real number. When you specify a larger number, the Dirichlet process tends to discover more clusters in the input data. By default, ALPHA=1.","help":"ALPHA=*number*","type":"value"},{"name":"CLUSTERCOVOUT=","optional":true,"description":"Creates the output data table that contains the summary of the clustering results. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"CLUSTERCOVOUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"CLUSTERSUMOUT=","optional":true,"description":"Creates the output data table that contains the summary of the clustering results. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"CLUSTERSUMOUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC GMM to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"INFERENCE=","optional":true,"description":"Performs the inference by using the variational Bayesian (VB) algorithm. You can specify one or more of the following suboptions: COVARIANCE=keyword specifies the type of covariance matrices in the Gaussian mixture model. You can specify the following keywords: DIAGONAL specifies the covariance matrices of the Gaussian distributions as diagonal matrices. FULL specifies the covariance matrices of the Gaussian distributions as full matrices. By default, COVARIANCE=DIAGONAL.","help":"INFERENCE=COVARIANCE= | MAXVBITER= | THRESHOLD=","type":"choice","arguments":[{"name":"COVARIANCE=","type":"value"},{"name":"MAXVBITER=","type":"value"},{"name":"THRESHOLD=","type":"value"}]},{"name":"MAXCLUSTERS=","optional":true,"description":"Specifies the maximum number of clusters that PROC GMM searches to find the best number of clusters by using the Dirichlet process. By default, MAXCLUSTERS=100.","help":"MAXCLUSTERS=*number*","type":"value"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads to use for the computation. The default value is the number of CPUs available in the machine.","help":"NTHREADS=*number-of-threads*","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies an integer to use to start the pseudorandom number generator. If you do not specify a seed or if you specify a value less than or equal to zero, the seed is generated by reading the time of day from the computer’s clock.","help":"SEED=*number*","type":"value"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt;&lt;EXCLUDE&gt;&lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt;&lt;NOREPLACE&gt;&lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"INPUT","description":"The INPUT statement specifies the names of the variables to use in clustering. The GMM procedure uses only interval input variables for its clustering. Any nominal variables that you specify in the INPUT statement are ignored. Any input interval variable that has a standard deviation of zero indicates a constant variable (column) in the input data table. Such constant variables do not contribute to the clustering and are ignored.","help":"INPUT variables"},{"name":"SAVESTATE","description":"The SAVESTATE statement creates an analytic store for the model and saves it as a binary object in a data table. You can use the analytic store in the ASTORE procedure to score new data.","help":"SAVESTATE &lt;RSTORE=CAS-libref.data-table&gt;","arguments":[{"name":"RSTORE=","optional":true,"description":"Specifies a data table in which to save the analytic store for the model. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"RSTORE=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"SCORE","aliases":["OUTPUT"],"description":"The SCORE statement writes the cluster membership information of each observation to the output data table that is specified in the OUT= option. This information includes the variables that are specified in the COPYVARS= option, the predicted cluster scores, and the probability distributions over the discovered clusters. The probability value can be interpreted as the probability of that observation being a member of that cluster. This information enables you to use the GMM procedure as a soft-clustering technique.","help":"SCORE &lt;COPYVAR=variable | COPYVARS=(variables)&gt;&lt;OUT=CAS-libref.data-table&gt;","arguments":[{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Lists one or more variables from the input data table to be copied to the scored output data table, provided that the output data table produces one or more records per input observation. By default, the GMM procedure does not transfer any variables from the input data table to the output data table. The COPYVARS= option accepts numeric and character variables. You can also use COPYVARS=(_ALL_) to include all the input variables.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC GMM to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"latest","docsetTargetFile":"casml_gmm_toc.htm"}}