{"name":"GMM","statements":[{"name":"PROC GMM","description":"The GMM procedure performs clustering—a common step in data exploration—on quantitative data in SAS Viya . You can use this procedure to read and write data in distributed form, as well as to perform clustering and scoring in parallel by making full use of multicore computers or a distributed computing environment. PROC GMM performs cluster analysis by using the Gaussian mixture model (GMM), which is a probabilistic model that assumes that all the data points are generated from a mixture of Gaussian distributions. This model can be regarded as generalizing k-means clustering to incorporate information about the covariance structure of the data as well as the centers of the latent Gaussians.","help":"PROC GMM <options>;                 \n\tDISPLAY <table-list></ options>;                 \n\tDISPLAYOUT  table-spec-list </ options>;                 \n\tINPUT  variables <INTERVAL>;                 \n\tSAVESTATE  RSTORE=libref.data-table<option>;                 \n\tSCORE  OUT=libref.data-table<options>;                 ","arguments":[{"name":"ALPHA=","optional":true,"description":"specifies the mass parameter of the Dirichlet process. The value of number must be a positive real number. When you specify a larger number, the Dirichlet process tends to discover more clusters in the input data. By default, ALPHA=1.","help":"ALPHA=*number*","type":"value"},{"name":"CLUSTERCOVOUT=","optional":true,"description":"creates the output data table that contains the summary of the clustering results. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table. This data table includes the covariance matrices of the Gaussian distributions for the clusters that PROC GMM discovers. The table contains the cluster ID (_CLUSTER_ID_) and the covariance matrices of the Gaussian distributions of the discovered clusters, which consist of the nonconstant variables specified in the INPUT statement.","help":"CLUSTERCOVOUT=*libref.data-table*","type":"dataSet"},{"name":"CLUSTERSUMOUT=","optional":true,"description":"creates the output data table that contains the summary of the clustering results. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table. The summary consists of the following items: the cluster ID (_CLUSTER_ID_), the numbers of observations in the clusters (_SIZE_), the clusters closest to the clusters (_NEIGHBOR_), and the cluster centroids (the means of the Gaussian distributions, which consist of the nonconstant variables specified in the INPUT statement).","help":"CLUSTERSUMOUT=*libref.data-table*","type":"dataSet"},{"name":"DATA=","optional":true,"description":"names the input data table for PROC GMM to use. The default is the most recently created data table. libref.data-table is a two-level name, where libref refers to a collection of information that is defined in the LIBNAME statement and includes the library, which includes a path to the data, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement. data-table specifies the name of the input data table.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"INFERENCE=","optional":true,"description":"performs the inference by using the variational Bayesian (VB) algorithm.","help":"INFERENCE=VB &lt;*suboptions*&gt;","type":"standaloneOrValue","arguments":[{"name":"COVARIANCE=","description":"specifies the type of covariance matrices in the Gaussian mixture model. You can specify the following keywords:","help":"COVARIANCE=*keyword*","type":"value","arguments":[{"name":"DIAGONAL","description":"specifies the covariance matrices of the Gaussian distributions as diagonal matrices.","type":"standalone"},{"name":"FULL","description":"specifies the covariance matrices of the Gaussian distributions as full matrices.","type":"standalone"}]},{"name":"MAXVBITER=","description":"specifies the maximum number of VB iterations. The VB iterations stop either when the number of iterations reaches the number or when the change in the Kullback-Leibler distance between the approximated distribution q and the true posterior distribution p between two consecutive VB iterations is lower than the threshold specified by THRESHOLD=number. When the VB iterations stop with the threshold criterion satisfied, the VB reaches its convergence. By default, MAXVBITER=100.","help":"MAXVBITER=*number*","type":"value"},{"name":"THRESHOLD=","description":"specifies the threshold to define the convergence of the VB algorithm. By default, THRESHOLD=0.01.","help":"THRESHOLD=*number*","type":"value"}]},{"name":"MAXCLUSTERS=","optional":true,"description":"specifies the maximum number of clusters that PROC GMM searches to find the best number of clusters by using the Dirichlet process. By default, MAXCLUSTERS=100.","help":"MAXCLUSTERS=*number*","type":"value"},{"name":"NTHREADS=","optional":true,"description":"specifies the number of threads to use for the computation. The default value is the number of CPUs available in the machine.","help":"NTHREADS=*number-of-threads*","type":"value"},{"name":"SEED=","optional":true,"description":"specifies an integer to use to start the pseudorandom number generator. If you do not specify a seed or if you specify a value less than or equal to zero, the seed is generated by reading the time of day from the computer’s clock.","help":"SEED=*number*","type":"value"}]},{"name":"DISPLAY","description":"enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, first all the generated display tables are sent to the client, and then the client creates a subset. If you use both DISPLAY and ODS statements together, the DISPLAY statement takes precedence over the ODS statements. Note that the ODS EXCLUDE statement processes tables that are sent to the client after they have been filtered by the DISPLAY statement. In some cases, it might appear that the ODS EXCLUDE statement is taking precedence because it can further filter the tables. You can specify the table-list as a list of table names, paths, partial pathnames, and regular expressions.","help":"DISPLAY &lt;table-list&gt;&lt;/ options&gt;;                                              ","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"displays all display tables except those that you specify in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"enables you to create output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of output tables to create. Each entry in the list has either a key=value format or a key format. key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the output table name. key specifies key as the ODS table name and also as the output table name. You cannot specify the ODS table named OutputCasTables in the table-spec-list. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT  table-spec-list &lt;/ options&gt;;                         ","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"creates output tables for all display tables. The name of the created output table is the same as the name of the corresponding display table. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"does not replace any existing output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"replicates all output tables on all nodes.","type":"standalone"}]},{"name":"INPUT","description":"specifies the names of the variables to use in clustering. The GMM procedure uses only interval input variables for its clustering. Any input interval variable that has a standard deviation of zero indicates a constant variable (column) in the input data table. Such constant variables do not contribute to the clustering and are ignored.","help":"INPUT  variables &lt;INTERVAL&gt;;                                              "},{"name":"SAVESTATE","description":"creates an analytic store for the model and saves it as a binary object in a data table. You can then use the analytic store in the ASTORE procedure to score new data.","help":"SAVESTATE  RSTORE=*libref.data-table*&lt;option&gt;;                                              ","arguments":[{"name":"RSTORE=","optional":true,"description":"specifies a data table in which to save the analytic store for the model. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table.","help":"RSTORE=*libref.data-table*","type":"dataSet"}]},{"name":"SCORE","description":"writes the cluster membership information of each observation to the output data table that is specified in the OUT= option. This information includes the variables that are specified in the COPYVARS= option, the predicted cluster scores, and the probability distributions over the discovered clusters. The probability value can be interpreted as the probability of that observation being a member of that cluster. This information enables you to use the GMM procedure as a soft-clustering technique.","help":"SCORE  OUT=libref.data-table<option>;                                              \nOUTPUT  OUT=libref.data-table<option>","arguments":[{"name":"OUT=","optional":true,"description":"names the output data table for PROC GMM to use. You must specify this option before any other options. libref.data-table is a two-level name, where libref refers to a collection of information that is defined in the LIBNAME statement and includes the library, which includes a path to where the data table is to be stored, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement. data-table specifies the name of the output data table. The output data table contains the scored data. When you specify this option, the table contains all variables that are specified in the COPYVARS= option, followed by the probability distribution over the discovered clusters, and then the predicted cluster score.","help":"OUT=*libref.data-table*","type":"dataSet"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"lists one or more variables to transfer from the input data table to the scored output data table, provided that the output data table produces one or more records per input observation. By default, the GMM procedure does not transfer any variables from the input data table to the output data table. The COPYVARS= option accepts numeric and character variables. You can also use COPYVARS=(_ALL_) to include all the input variables.","help":"COPYVAR={*variable*}","type":"value"}]}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"latest","docsetTargetFile":"casml_gmm_toc.htm"}}