{"name":"GVARCLUS","statements":[{"name":"PROC GVARCLUS","description":"The GVARCLUS procedure performs variable clustering and graphical modeling in SAS Viya. The procedure divides a set of variables into disjoint clusters and creates tables that contain the edge and vertex information for defining an undirected graph. Variables in different clusters are conditionally independent given their own clusters. The procedure also provides the edge and vertex information for an undirected graphical model; this information expresses the relationships among all the variables. A regularization parameter is used to control the sparsity of connections among variables. Tuning the regularization parameter from low to high increases the number of disconnected components and splits larger clusters into smaller ones. Those divided clusters naturally form a hierarchical structure during this process.","help":"PROC GVARCLUS <DATA=CAS-libref.data-table> <EXACT> <MAXITER=n | MAXITERS=n> <MAXMEMBER=n | MAXMEMBERS=n> <MAXSTEP=n | MAXSTEPS=n> <MINCLUSTER=n | MINCLUSTERS=n> <OUTCP=CAS-libref.data-table < / LIST <EPS=number>>> <OUTEDGE=CAS-libref.data-table> <OUTTREE=CAS-libref.data-table> <OUTVERT=CAS-libref.data-table> <RHO=fraction> <SELECT=NONE | PENALIZED> <STOP=n> <TOLERANCE=fraction | TOL=fraction>;     \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...;\n    \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...;\n    \n\tFREQ variable;\n    \n\tINPUT <LEVEL=<INTERVAL | NOMINAL>> ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC GVARCLUS to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"EXACT","optional":true,"description":"Performs graphical variable clustering without preprocessing by thresholding the sample covariance into connected components. By default, the preprocessing step is performed.","type":"standalone"},{"name":"MAXITER=","optional":true,"aliases":["MAXITERS="],"description":"Specifies the maximum number of iterations for estimating the sparse precision matrix by using coordinate descent. By default, MAXITER=50.","type":"value"},{"name":"MAXMEMBER=","optional":true,"aliases":["MAXMEMBERS="],"description":"Stops PROC GVARCLUS when the number of members within any cluster is greater than or equal to n.","type":"value"},{"name":"MAXSTEP=","optional":true,"aliases":["MAXSTEPS="],"description":"Stops PROC GVARCLUS after it runs n steps. By default, MAXSTEP=3.","type":"value"},{"name":"MINCLUSTER=","optional":true,"aliases":["MINCLUSTERS="],"description":"Stops PROC GVARCLUS when the number of clusters is less than or equal to n.","type":"value"},{"name":"OUTCP=","optional":true,"description":"Creates a data table that contains a covariance matrix that depicts the relationships among variables and also creates a set of statistics about the input data table and variables. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table. When you specify the LIST option, the symmetric matrix is output in the list-of-list (LIL) format. In this format, the matrix is represented as a set of tuples (i, j, x), where x is an entry in the matrix and i and j denote its row and column indices, respectively.","help":"OUTCP=LIST | EPS=","type":"choice","arguments":[{"name":"LIST","type":"standalone"},{"name":"EPS=","type":"value"}]},{"name":"OUTEDGE=","optional":true,"description":"Creates a data set for use with the hypergroup action. This table contains the information that defines the edges in the network, _FROM_, _TO_, and _WEIGHT_. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTEDGE=*CAS-libref.data-table*","type":"dataSet"},{"name":"OUTTREE=","optional":true,"description":"Creates a data table that depicts a tree diagram to display the hierarchical clustering results. The tree diagram can be plotted using the DENDROGRAM statement in the Graph Template Language. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTTREE=*CAS-libref.data-table*","type":"dataSet"},{"name":"OUTVERT=","optional":true,"description":"Creates a data set for use with the hypergroup action. This table contains the vertices in the network and their size. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTVERT=*CAS-libref.data-table*","type":"dataSet"},{"name":"RHO=","optional":true,"description":"Specifies the value of ρ that determines the sequence of regularization parameters, {ρ1, ρ2, ρ3, ...} that are used on sequential clustering steps. The higher the ρ value, the more regularization and the sparser the inverse covariance. By default, RHO=0.8.","help":"RHO=*fraction*","type":"value"},{"name":"SELECT=","optional":true,"description":"Selects the optimal clustering on the basis of the specified criterion.","help":"SELECT=NONE | PENALIZED","type":"choice","arguments":[{"name":"NONE","description":"Performs no selection, and the output tables of the edges and vertices of the network reflect the clustering from the last step.","type":"standalone"},{"name":"PENALIZED","description":"Performs selection through minimizing the penalized log likelihood.","type":"standalone"}]},{"name":"STOP=","optional":true,"description":"Requests that the action stop if the clustering results do not change in the previous n consecutive steps. By default, STOP=3.","help":"STOP=*n*","type":"value"},{"name":"TOLERANCE=","optional":true,"aliases":["TOL="],"description":"Specifies the minimal absolute tolerance at which an iteration stops. The tolerance number must be equal to or greater than 1.0E–12. By default, TOLERANCE=1.0E–3.","type":"value"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. PROC GVARCLUS treats each observation as if it appears f times, where f is the value of the FREQ variable for the observation. If f is not an integer, it is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable"},{"name":"INPUT","description":"The INPUT statement specifies the names of variables to be used in training. Only interval, binary, and nominal variables are accepted. If you want to use different options for different variables, you can specify multiple INPUT statements.","help":"INPUT &lt;LEVEL=&lt;INTERVAL | NOMINAL&gt;&gt; ","arguments":[{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"Specifies whether the specified input variables are continuous or categorical.","help":"LEVEL=INTERVAL | NOMINAL","type":"choice","arguments":[{"name":"INTERVAL","followsDelimiter":"/","description":"Specifies that the input variables are continuous.","type":"standalone"},{"name":"NOMINAL","followsDelimiter":"/","description":"Specifies that the input variables are categorical.","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"v_017","docsetTargetFile":"casml_gvarclus_toc.htm"}}