{"name":"HMM","statements":[{"name":"PROC HMM","description":"The HMM procedure supports hidden Markov models (HMMs), which have been widely applied in economics, finance, science, and engineering. The HMM has many well-known aliases, such as the general state space model (GSSM), regime-switching model (RSM), Markov-switching model (MSM), and Markov regime- switching model (MRSM). This procedure supports the Gaussian hidden Markov model (Gaussian HMM).","help":"PROC HMM <DATA=libref.data-table> <options>;     \n\tDECODE <options> ;\n\tDISPLAY <table-list></ options> ;\n\tDISPLAYOUT table-spec-list </ options> ;\n\tESTIMATE <options> ;\n\tEVALUATE <options> ;\n\tFILTER <options> ;\n\tFORECAST <options>;\n\tID TIME=variable <SECTION=variable> ;\n\tINITIAL equation<, …, equation>\n\tMODEL dependents <= regressors > < / options  >;\n\tOPTIMIZE <options >;\n\tPRIOR distribution <, …, distribution>;\n\tSCORE <options>  ;\n\tSMOOTH <options> ;\n\tSTORE <out=>libref.data-table;\n           \n","arguments":[{"name":"DATA=","description":"names the input data table for PROC HMM to use.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"OUTSTAT=","description":"writes the log likelihood and information criteria to the specified output data table.The information criteria include Akaike’s information criterion (AIC), the corrected Akaike’s information criterion (AICC), the Bayesian information criterion (BIC, also referred to as the Schwarz Bayesian criterion, SBC), and the Hannan-Quinn criterion (HQC). libref.data-table is a two-level name, where libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTSTAT=*libref.data-table*","type":"dataSet"},{"name":"SEED=","description":"specifies a nonnegative integer to be used as the seed for generating random number sequences. You can use this option to replicate results from different runs. By default, SEED=1.","help":"SEED=*number*","type":"value"},{"name":"LABELSWITCH=","optional":true,"description":"specifies the order in which to label the states (and components). The label switching problem is a common issue for HMMs because any two HMMs are mathematically equivalent if the only difference between two models is that the states are labeled in different ways.","help":"LABELSWITCH=&lt;OUT=*libref.data-table*&gt;&lt;REORDER=*(number-list)*&gt;&lt;REORDERCOMPONENT=*(number-list)*&gt;&lt;SORT=ASC&lt;*(name-list)*&gt; | DESC&lt;*(name-list)*&gt; | NONE&gt;","type":"standaloneOrValue"}]},{"name":"DECODE","description":"The DECODE statement solves the decoding problem by finding the best possible state path for the observations.","help":"DECODE &lt;option&gt;","arguments":[{"name":"OUT=","optional":true,"description":"writes the decoding results to the specified output data table.","help":"OUT=*libref.data-table*","type":"dataSet"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude.","help":"DISPLAY &lt;table-list&gt;&lt;/options&gt;","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"displays all display tables except those that you specify in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement.","help":"DISPLAYOUT &lt;table-spec-list&gt;&lt;/options&gt;","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"does not replace any existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"ESTIMATE","aliases":["LEARN"],"description":"The ESTIMATE statement estimates the parameters.","help":"ESTIMATE &lt;options&gt;","arguments":[{"name":"IN=","optional":true,"description":"specifies the input data table for parameter estimation.","help":"IN=*libref.data-table*","type":"dataSet"},{"name":"OUT=","optional":true,"description":"writes the parameter estimates to the specified output data table.","help":"OUT=*libref.data-table*","type":"dataSet"},{"name":"OUTALL=","optional":true,"description":"writes the parameter estimates and their standard errors and covariance matrix to the specified output data table.","help":"OUTALL=*libref.data-table*","type":"dataSet"}]},{"name":"EVALUATE","description":"The EVALUATE statement evaluates the model by calculating the log likelihood.","help":"EVALUATE &lt;options&gt;","arguments":[{"name":"OUT=","optional":true,"description":"writes the evaluation results to the specified output data table.","help":"OUT=*libref.data-table*","type":"dataSet"}]},{"name":"FILTER","description":"The FILTER statement solves the filtering problem, which is to find the probability distribution of the current state, conditional on the observations that precede and include the current observation.","help":"FILTER &lt;options&gt;","arguments":[{"name":"OUT=","optional":true,"description":"writes the filtering results to the specified output data table.","help":"OUT=*libref.data-table*","type":"dataSet"}]},{"name":"FORECAST","description":"The FORECAST statement finds the probability distribution of the future states and the dependent variables.","help":"FORECAST &lt;options&gt;","arguments":[{"name":"ALPHA=","optional":true,"description":"specifies the forecast confidence limit size, where number is between 0 and 1. When you specify this option, the upper and lower confidence limits define the 100α% confidence interval. By default, ALPHA=0.95, which produces 95% confidence intervals.","help":"ALPHA=*number*","type":"value"},{"name":"BACK=","optional":true,"description":"specifies the number of observations before the end of the data at which the multistep forecasts begin, where number must be less than or equal to the number of observations minus the number of lagged regressors in the model. By default, BACK=0, which means that the forecasts start at the end of the available data.","help":"BACK=*number*","type":"value"},{"name":"LEAD=","optional":true,"description":"specifies the number of multistep forecast values to compute, where number must be a nonnegative integer. By default, LEAD=1, which means that a one-step-ahead forecast is performed.","help":"LEAD=*number*","type":"value"},{"name":"NSIM=","optional":true,"description":"specifies the number of paths to be simulated in the forecasting of a regime-switching autoregression model, where number must be a positive integer. By default, NSIM=100.","help":"NSIM=*number*","type":"value"},{"name":"ONLINE","optional":true,"description":"requests that the (multistep) forecasts be done after each observation. When you specify this option, the BACK= option is ignored.","type":"standalone"},{"name":"OUT=","optional":true,"description":"writes the forecasting results to the specified output data table.","help":"OUT=*libref.data-table*","type":"dataSet"},{"name":"OUTALL=","optional":true,"description":"writes the state distributions, means, standard errors, confidence intervals, medians, and covariance matrices of forecasts for dependent variables to the specified output data table.","help":"OUTALL=*libref.data-table*","type":"dataSet"}]},{"name":"ID","description":"The ID statement identifies observations in the input data table by specifying a variable for the time series data or two variables for the cross-sectional time series data.","help":"ID TIME=variable &lt;SECTION=variable&gt;","arguments":[{"name":"TIME=","description":"specifies the temporal or sequential order of the observations. The variable cannot have missing values.","help":"TIME=*variable*","type":"value"},{"name":"SECTION=","optional":true,"description":"identifies the section of each observation for modeling cross-sectional time series data. The variable cannot have missing values.","help":"SECTION=*variable*","type":"value"}]},{"name":"INITIAL","description":"The INITIAL statement specifies the initial parameter values for nonlinear optimization when the maximum likelihood method or the maximum a posteriori method is applied to the estimation of the HMMs (that is, METHOD=ML or METHOD=MAP, respectively, in the MODEL statement). Only one INITIAL statement is allowed. If you specify more than one equation, separate them with commas.","help":"INITIAL equation &lt;, …, equation&gt;"},{"name":"MODEL","description":"The MODEL statement specifies dependent (endogenous) variables and regressors (the independent or exogenous variables) for the HMM model. Only one MODEL statement is allowed.","help":"MODEL *dependents*&lt;=regressors&gt;&lt;/options&gt;","arguments":[{"name":"ARMEAN=","optional":true,"followsDelimiter":"/","description":"specifies the mean form in a regime-switching autoregression model. The ARMEAN= option applies only when you specify the TYPE=AR option in the MODEL statement.By default, ARMEAN=STANDARD.","help":"ARMEAN=ADJUST | STANDARD","type":"choice","arguments":[{"name":"ADJUST","followsDelimiter":"/","description":"specifies the mean-adjusted form of regime-switching autoregression model.","type":"standalone"},{"name":"STANDARD","followsDelimiter":"/","description":"specifies the standard regime-switching autoregression model.","type":"standalone"}]},{"name":"ESTISPV","optional":true,"followsDelimiter":"/","description":"estimates the initial state probability vector (ISPV).","type":"standalone"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"specifies the maximum a posteriori method.By default, METHOD=ML.","help":"METHOD=MAP | ML","type":"choice","arguments":[{"name":"MAP","followsDelimiter":"/","description":"specifies the mean-adjusted form of regime-switching autoregression model.","type":"standalone"},{"name":"ML","followsDelimiter":"/","description":"specifies the maximum likelihood method.","type":"standalone"}]},{"name":"NCATEGORY=","optional":true,"followsDelimiter":"/","description":"Specifies the number of categories in a state for a finite HMM, where number must be a positive integer. This option applies only when you specify TYPE=FINITE. By default, NCATEGORY=2.","help":"NCATEGORY=*number*","type":"value"},{"name":"NCOMPONENT=","optional":true,"followsDelimiter":"/","description":"specifies the number of components in a state for a Gaussian mixture HMM (GM HMM), where number must be a positive integer. This option applies only when you specify TYPE=GAUSSIANMIXTURE. By default, NCOMPONENT=1.","help":"NCOMPONENT=*number*","type":"value"},{"name":"NOCURRENTX","optional":true,"followsDelimiter":"/","description":"suppresses the present values of the exogenous variables. This option applies only when you specify TYPE=AR or TYPE=REG.","type":"standalone"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"suppresses the constant (intercept) parameters. This option applies only when you specify TYPE=AR or TYPE=REG.","type":"standalone"},{"name":"NSEASON=","optional":true,"followsDelimiter":"/","description":"specifies the number of seasonal periods (where s must be a positive integer) and adds (snegative 1) seasonal dummies to the regressors. This option applies only when you specify TYPE=AR or TYPE=REG and do not specify the NOINT option.","help":"NSEASON=*s*","type":"value"},{"name":"NSTATE=","optional":true,"followsDelimiter":"/","description":"specifies the number or the range of numbers of hidden states, where number1 and number2 must be positive integers. If you specify NSTATE=number1, the number of hidden states is number1; if you specify NSTATE=number1:number2, multiple models whose number of hidden states is inclusively between number1 and number2 are estimated and inferred. If you specify the same number for both number1 and number2, number2 is ignored. By default, NSTATE=2.","help":"NSTATE=*number1*&lt;*:number2*&gt;","type":"value"},{"name":"SCENTER","optional":true,"followsDelimiter":"/","description":"centers seasonal dummies that are implied by the NSEASON= option.This option applies only when you specify the NSEASON= option and TYPE=AR or TYPE=REG.","type":"standalone"},{"name":"STATEINDEPENDENT=","optional":true,"followsDelimiter":"/","description":"specifies the parameters to be estimated independent of state.","help":"STATEINDEPENDENT=*(name-list)*","type":"value"},{"name":"TREND=","optional":true,"followsDelimiter":"/","description":"specifies the degree of deterministic time trend that the model includes. This option applies only when you specify TYPE=AR or TYPE=REG. You can specify the following values:","help":"TREND=LINEAR | QUAD","type":"choice","arguments":[{"name":"LINEAR","followsDelimiter":"/","description":"includes a linear time trend as a regressor.","type":"standalone"},{"name":"QUAD","followsDelimiter":"/","description":"includes linear and quadratic time trends as regressors.","type":"standalone"}]},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"specifies the type of the model of interest to use. By default, TYPE=GAUSSIAN.","help":"TYPE=AR | FINITE | GAUSSIAN | GAUSSIANMIXTURE | POISSON | REG","type":"choice","arguments":[{"name":"AR","followsDelimiter":"/","description":"uses the regime-switching autoregression model (RS-AR, also known as the autoregressive hidden Markov model, AR HMM).","type":"standalone"},{"name":"FINITE","followsDelimiter":"/","description":"uses the finite hidden Markov model (finite HMM).","type":"standalone"},{"name":"GAUSSIAN","followsDelimiter":"/","description":"uses the Gaussian hidden Markov model (Gaussian HMM).","type":"standalone"},{"name":"GAUSSIANMIXTURE","followsDelimiter":"/","description":"uses the Gaussian mixture hidden Markov model (GM HMM).","type":"standalone"},{"name":"POISSON","followsDelimiter":"/","description":"uses the Poisson hidden Markov model (Poisson HMM).","type":"standalone"},{"name":"REG","followsDelimiter":"/","description":"uses the regime-switching regression model (RS-REG, also known as the regression hidden Markov model, REG HMM).","type":"standalone"}]},{"name":"XLAG=","optional":true,"followsDelimiter":"/","description":"specifies the lags of exogenous (independent) variables. To exclude the present values of exogenous variables from the model, you must specify the NOCURRENTX option. This option applies only when you specify TYPE=AR or TYPE=REG. By default, XLAG=0.","help":"XLAG=*number*","type":"value"},{"name":"YLAG=","optional":true,"followsDelimiter":"/","description":"specifies the order or the range of orders of the autoregressive process, where number1 and number2 must be nonnegative integers. If you specify YLAG=number1, the order of the autoregressive process is number1; if you specify YLAG=number1:number2, multiple models whose order of the autoregressive process is inclusively between number1 and number2 are estimated and inferred. If you specify the same number for both number1 and number2, number2 is ignored. This option applies only when you specify TYPE=AR. By default, YLAG=0.","help":"YLAG=*number1*&lt;*:number2*&gt;","type":"value"}]},{"name":"OPTIMIZE","description":"The OPTIMIZE statement optimizes the parameter estimation.","help":"OPTIMIZE &lt;options&gt;","arguments":[{"name":"ALGORITHM=","optional":true,"description":"specifies the optimization algorithm to use. You can specify the following types:","help":"ALGORITHM=ACTIVESET | EM&lt;(suboptions)&gt; | INTERIORPOINT&lt;(suboptions)&gt; | IPDIRECT&lt;(suboptions)&gt; | SGD&lt;(suboptions)&gt;&lt;(suboptions)&gt;","type":"standaloneOrValue","arguments":[{"name":"ACTIVESET","description":"uses the active set algorithm. You can specify one or more of the following suboptions in parentheses:","help":"ACTIVESET&lt;(suboptions)&gt;","type":"standaloneOrValue","arguments":[{"name":"FEASTOL=","description":"defines the feasible tolerance.","help":"FEASTOL=*number*","type":"value"},{"name":"MSRANGE=","description":"defines the range from which each variable can take values during the sampling process in multistart mode, where number is a positive number. This option is ignored if MULTISTART=0. This option affects only the sampling process that determines starting points for the local solver. It does not affect the bounds of the original nonlinear optimization problem. By default, MSRANGE=2.","help":"MSRANGE=*number*","type":"value"},{"name":"MULTISTART=","description":"specifies whether to enable multistart mode or specifies suboptions to enable the distributed multistart mode. By default, MULTISTART=0.","help":"MULTISTART=0 | 1&lt;(suboptions)&gt;","type":"standaloneOrValue","arguments":[{"name":"0","description":"disables multistart mode.","type":"standalone"},{"name":"1","description":"solves the problem from multiple starting points, possibly finding a better local optimum as a result. The computing cost in multistart mode might be huge.","type":"standalone"},{"name":"FESESSIONS=","description":"specifies the number of CAS subsessions that are dedicated to the function evaluations, where number is a positive integer. The default value is based on the setting of the CAS session.","help":"FESESSIONS=*number*","type":"value"},{"name":"FESESSNODES=","description":"specifies the number of computing nodes in each CAS subsession that are dedicated to the function evaluations, where number is a positive integer. The default value is based on the setting of the CAS session.","help":"FESESSNODES=*number*","type":"value"},{"name":"MAXSTARTS=","description":"specifies the maximum number of starting points to be used by the multistart algorithm, where number is a positive integer. By default, MAXSTARTS=100.","help":"MAXSTARTS=*number*","type":"value"},{"name":"SAMPSELRATIO=","description":"specifies the ratio of the total number of sample points to be generated to the value of the MAXSTARTS= option, where number is a positive integer. By default, SAMPSELRATIO=20.","help":"SAMPSELRATIO=*number*","type":"value"},{"name":"SESSNODES=","description":"specifies the number of computing nodes in the CAS session that are dedicated to the multistart algorithm, where number is a positive integer. The default value is based on the setting of the CAS session.","help":"SESSNODES=*number*","type":"value"}]},{"name":"OBJLIMIT=","description":"specifies an upper limit on the magnitude of the objective value.","help":"OBJLIMIT=*number*","type":"value"},{"name":"OPTTOL=","description":"specifies the measure by which the current iterate is determined to be an acceptable approximation of a local optimum, where ε is a positive real number.","help":"OPTTOL=*ε*","type":"value"},{"name":"SOLTYPE=","description":"specifies the type of solution that the optimizer should return. You can specify the following values:","help":"SOLTYPE=0 | 1","type":"choice","arguments":[{"name":"0","description":"requests that the optimizer return a locally optimal solution, provided that it locates one.","type":"standalone"},{"name":"1","description":"requests that the optimizer return the best feasible solution that was found, provided that its objective value is better than that of the locally optimal solution that was found.","type":"standalone"}]}]},{"name":"EM","description":"uses the expectation-maximization (EM) algorithm. This algorithm is supported only for the Gaussian HMM and the maximum likelihood method. You can specify the following suboption in parentheses:","help":"EM&lt;(suboptions)&gt;","type":"standaloneOrValue","arguments":[{"name":"MINITER=","description":"specifies the minimum number of iterations in the optimization process, where number must be a nonnegative integer. By default, MINITER=0.","help":"MINITER=*number*","type":"value"},{"name":"SINGLE","description":"executes the EM algorithm in a single thread on a single node. By default, the EM algorithm runs in parallel on multiple threads and nodes if you divide the data into sections and specify the SECTION= option in the ID statement.","type":"standalone"}]},{"name":"INTERIORPOINT","description":"uses the interior point algorithm. You can specify the same suboptions in parentheses that you can specify for ALGORITHM=ACTIVESET.","help":"INTERIORPOINT &lt;(suboptions)&gt;","type":"standaloneOrValue"},{"name":"IPDIRECT","description":"uses the interior point direct algorithm, in which the use of direct factorizations and other enhancements can reduce both the number of iterations and the CPU time for many problem types. You can specify the same suboptions in parentheses that you can specify for ALGORITHM=INTERIORPOINT.","help":"IPDIRECT  &lt;(suboptions)&gt;","type":"standaloneOrValue"},{"name":"SGD","description":"uses the stochastic gradient descent algorithm. You can specify one or more of the following suboptions in parentheses:","help":"SGD&lt;(suboptions)&gt;","type":"standaloneOrValue","arguments":[{"name":"ADAPTIVEDECAY=","description":"specifies the adaptive rate for the gradient descent algorithm when it is used, where the algorithm becomes ADAGRAD if ADAPTIVEDECAY=0 and becomes ADADELTA otherwise. By default, ADAPTIVEDECAY=0.95.","help":"ADAPTIVEDECAY=*number*","type":"value"},{"name":"ANNEALINGRATE=","description":"specifies the annealing parameter, where number must be a nonnegative double. Annealing is a way to automatically reduce the learning rate as SGD progresses, causing smaller steps as SGD approaches a solution.","help":"ANNEALINGRATE=*number*","type":"value"},{"name":"CHAIN=","description":"specifies the options for the sequence data (which constitute a chain). You can specify the following options within parentheses:","help":"CHAIN=&lt;(options)&gt;","type":"standaloneOrValue","arguments":[{"name":"LENGTH=","description":"specifies the length of a chain in a minibatch in optimization process, where number must be a positive integer. By default, LENGTH=1000.","help":"LENGTH=*number*","type":"value"},{"name":"BUFFER=","description":"specifies the buffer length on the left side of a chain in a minibatch in optimization process, where number must be a nonnegative integer. By default, BUFFER=20.","help":"BUFFER=*number*","type":"value"}]},{"name":"LEARNINGRATE=","description":"specifies the learning rate parameter, for SGD, where number must be a positive double.","help":"LEARNINGRATE=*number*","type":"value"},{"name":"MINIBATCHSIZE=","description":"specifies the size of the minibatches used in SGD, where number must be a positive integer. By default, MINIBATCHSIZE=1.","help":"MINIBATCHSIZE=*number*","type":"value"},{"name":"MOMENTUM=","description":"specifies the value for momentum parameter, where number must be greater than or equal to 0 and less than 1.","help":"MOMENTUM=*number*","type":"value"},{"name":"NONADUPDATE","description":"suppresses the adaptive gradient descent algorithm.","type":"standalone"},{"name":"USELOCKING","description":"requests that computational threads share a common weight vector and that they update the weight vector without race conditions. By default, computational threads update a single weight vector simultaneously. This causes intentional race conditions and nondeterministic behavior, but it increases performance significantly.","type":"standalone"}]}]},{"name":"COVOFPARM=","optional":true,"description":"specifies whether to calculate the covariance of parameters. You can specify the following values:","help":"COVOFPARM=YES | NO","type":"choice","arguments":[{"name":"YES","description":"calculates the covariance of parameters.","type":"standalone"},{"name":"NO","description":"suppresses the calculation of the covariance of parameters.","type":"standalone"}]},{"name":"MAXITER=","optional":true,"description":"specifies the maximum number of iterations in the optimization process, where number must be a nonnegative integer. By default, MAXITER=128.","help":"MAXITER=*number*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"specifies an upper limit of t seconds for the optimization process, including problem generation time and solution time, where t can be any positive number. The default value of t is the positive number that has the largest absolute value that your operating environment can represent. If you omit this option, the optimizer does not stop on the basis of the amount of time elapsed. This option is not supported for the EM algorithm.","help":"MAXTIME=*t*","type":"value"},{"name":"PRINTITERFREQ=","optional":true,"description":"specifies how frequently to output the optimization process history, where number must be a nonnegative integer. If PRINTITERFREQ=0, no iterations are output. If number=n and n is positive, the optimization process history is output every n iterations. By default, PRINTITERFREQ=0.","help":"PRINTITERFREQ=*number*","type":"value"},{"name":"PRINTLEVEL=","optional":true,"description":"specifies the print level. You can specify the following values:","help":"PRINTLEVEL=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","description":"suppresses output of the initial parameter values, the initial objective value, the algorithm information, the final parameter values, and the final objective value.","type":"standalone"},{"name":"1","description":"outputs the initial parameter values and the initial objective value.","type":"standalone"},{"name":"2","description":"outputs the initial parameter values, the initial objective value, and the algorithm information.","type":"standalone"},{"name":"3","description":"outputs the initial parameter values, the initial objective value, the algorithm information, the final parameter values, and the final objective value.","type":"standalone"}]}]},{"name":"PRIOR","description":"The PRIOR statement specifies the initial hyperparameter values in the prior distributions of the parameters when the maximum a posteriori method is applied to the estimation of the HMM (that is, when METHOD=MAP in the MODEL statement). If you specify the maximum likelihood (ML) method (METHOD=ML), the PRIOR statement is ignored. You can specify only one PRIOR statement. If you specify more than one distribution, separate them with commas.The distribution is in the following format: parameter-name ~ distribution-function(arguments);","help":"PRIOR distributions &lt;, …, distribution&gt;","arguments":[{"name":"CPM","optional":true,"description":"indicates the category probability matrix in the finite HMM. The prior distribution must be the Dirichlet distribution.","type":"standalone"},{"name":"ISPV","optional":true,"description":"indicates the initial state probability vector. The prior distribution must be the Dirichlet distribution.","type":"standalone"},{"name":"LAMBDA","optional":true,"description":"indicates the mean vector in the Poisson HMM. The prior distribution must be the gamma distribution.","type":"standalone"},{"name":"MCP","optional":true,"description":"indicates the mixture component probabilities in the Gaussian mixture HMM (GM HMM). The prior distribution must be the Dirichlet distribution.","type":"standalone"},{"name":"MUSIGMA","optional":true,"description":"indicates the mean and covariance parameters for the observation distributions. For the Gaussian HMM, regime-switching regression model, or regime-switching autoregression model, the prior distribution of the mean and covariance parameters for each state must be the normal-inverse-Wishart (NIW) distribution. For the GM HMM, the prior distribution of the mean and covariance parameters for each component at each state must be the normal-inverse-Wishart (NIW) distribution.","type":"standalone"},{"name":"TPM","optional":true,"description":"indicates the transition probability matrix. The prior distribution must be the Dirichlet distribution.","type":"standalone"},{"name":"DIR","optional":true,"description":"specifies the Dirichlet distribution.","type":"standalone"},{"name":"GAMMA","optional":true,"description":"specifies the gamma distribution.","type":"standalone"},{"name":"NIW","optional":true,"description":"specifies the normal-inverse-Wishart (NIW) distribution. There are four arguments for the NIW distribution (mu overTilde comma normal upper Sigma overTilde comma kappa overTilde, and nu overTilde), and they must be valid matrix expressions of the proper size.","type":"standalone"},{"name":"LAMBDA","optional":true,"description":"indicates the mean vector in the Poisson HMM. The prior distribution must be the gamma distribution.","type":"standalone"}]},{"name":"SCORE","description":"The SCORE statement specifies options that are related to scoring data.","help":"SCORE ","arguments":[{"name":"INMODEL=","description":"specifies the input data table for model information. The data table must be an output data table that is produced by the OUTMODEL= option in a previous call of the HMM procedure. When you specify this option, the IN= option in the ESTIMATE statement and the ID, INITIAL, MODEL, OPTIMIZE, and PRIOR statements are ignored.","help":"INMODEL=*libref.data-table*","type":"dataSet"},{"name":"OUTMODEL=","description":"writes the model information to the specified output data table. The output data table consists of binary large object columns to store the binary data. Do not edit the content of this output data table. If you run the PRINT procedure on this data table, you get a row of zeros or meaningless characters because the data type of each column is binary.","help":"OUTMODEL=*libref.data-table*","type":"dataSet"}]},{"name":"SMOOTH","description":"The SMOOTH statement specifies options that are related to the smoothing problem, which is to find the probability distribution of the state, conditional on all available observations.","help":"SMOOTH ","arguments":[{"name":"OUT=","description":"writes the smoothing results to the specified output data table.","help":"OUT=*libref.data-table*","type":"dataSet"}]},{"name":"STORE","description":"The STORE statement saves the model information to the specified output data table that can be processed by the ASTORE procedure.","help":"STORE &lt;OUT=&gt;*libref.data-table*"}],"supportSiteInformation":{"docsetId":"casecon","docsetVersion":"latest","docsetTargetFile":"casecon_hmm_toc.htm"}}