{"name":"HMM","statements":[{"name":"PROC HMM","description":"The HMM procedure supports hidden Markov models (HMMs), which have been widely applied in economics, finance, science, and engineering. The HMM has many well-known aliases, such as the general state space model (GSSM), regime-switching model (RSM), Markov-switching model (MSM), and Markov regime- switching model (MRSM). This procedure supports the Gaussian hidden Markov model (Gaussian HMM).","help":"PROC HMM <DATA=SAS-data-set> <OUTSTAT=SAS-data-set>;     \n\tDECODE <OUT=SAS-data-set> ;\n    \n\tESTIMATE <OUT=SAS-data-set> ;\n    \n\tEVALUATE <OUT=SAS-data-set> ;\n    \n\tFILTER <OUT=SAS-data-set> ;\n    \n\tFORECAST <ALPHA=number> <BACK=number> <LEAD=number> ...;\n    \n\tID <SECTION=variable> TIME=variable ;\n    \n\tINITIAL equation, …, equation;\n    \n\tMODEL <ESTISPV> <METHOD=<MAP | ML>> <NSTATE=number> ...;\n    \n\tOPTIMIZE <ALGORITHM=<ACTIVESET | INTERIORPOINT>> <FEASTOL=number> <MAXITER=number> ...;\n    \n\tPRIOR ISPV MUSIGMA TPM ...;\n    \n\tSCORE <INMODEL=SAS-data-set> <OUTMODEL=SAS-data-set> ;\n    \n\tSMOOTH <OUT=SAS-data-set> ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the input data set. This option is required. If you do not specify this option, you get a system error.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Writes the log likelihood and information criteria to an output data set.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"}]},{"name":"DECODE","description":"The DECODE statement specifies options that are related to the decoding problem, which is to find the best possible state path for the observations.","help":"DECODE &lt;OUT=SAS-data-set&gt; ","arguments":[{"name":"OUT=","optional":true,"description":"Writes the decoding results to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"}]},{"name":"ESTIMATE","aliases":["LEARN"],"description":"The ESTIMATE statement specifies options that are related to parameter estimation.","help":"ESTIMATE &lt;OUT=SAS-data-set&gt; ","arguments":[{"name":"OUT=","optional":true,"description":"Writes the parameter estimates to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"}]},{"name":"EVALUATE","description":"The EVALUATE statement specifies options that are related to the evaluation, which is the log-likelihood calculation.","help":"EVALUATE &lt;OUT=SAS-data-set&gt; ","arguments":[{"name":"OUT=","optional":true,"description":"Writes the evaluation results to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"}]},{"name":"FILTER","description":"The FILTER statement specifies options that are related to the filtering problem, which is to find the probability distribution of the current state conditional on the observations up to now.","help":"FILTER &lt;OUT=SAS-data-set&gt; ","arguments":[{"name":"OUT=","optional":true,"description":"Writes the filtering results to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"}]},{"name":"FORECAST","description":"The FORECAST statement specifies options that are related to the forecasting problem, which is to find the probability distribution of the future states and the dependent variables.","help":"FORECAST &lt;ALPHA=number&gt; &lt;BACK=number&gt; &lt;LEAD=number&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Sets the forecast confidence limit size, where number is between 0 and 1. When you specify this option, the upper and lower confidence limits define the 100α% confidence interval. By default, ALPHA=0.95, which produces 95% confidence intervals.","help":"ALPHA=*number*","type":"value"},{"name":"BACK=","optional":true,"description":"Specifies the number of observations before the end of the data at which the multistep forecasts begin. The number must be less than or equal to the number of observations minus the number of lagged regressors in the model. By default, BACK=0, which means that the forecasts start at the end of the available data.","help":"BACK=*number*","type":"value"},{"name":"LEAD=","optional":true,"description":"Specifies the number of multistep forecast values to compute. By default, LEAD=1, which means that a one-step-ahead forecast is performed.","help":"LEAD=*number*","type":"value"},{"name":"ONLINE","optional":true,"description":"Specifies that the (multistep) forecasts be done after each observation. When you specify this option, the BACK= option is ignored.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Writes the forecasting results to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"}]},{"name":"ID","description":"The ID statement identifies observations in the input data set by specifying a variable for the time series data or two variables for the cross-sectional time series data.","help":"ID &lt;SECTION=variable&gt; TIME=variable ","arguments":[{"name":"TIME=","description":"Specifies the temporal or sequential order of the observations.","help":"TIME=*variable*","type":"value"},{"name":"SECTION=","optional":true,"description":"If the cross-sectional time series data are modeled, you should specify the SECTION= option to identify the section of each observation.","help":"SECTION=*variable*","type":"value"}]},{"name":"INITIAL","description":"The INITIAL statement sets up the initial parameter values for nonlinear optimization when the maximum likelihood method or the maximum a posteriori method is applied to the estimation of the HMMs. Only one INITIAL statement is allowed. If you specify more than one equation, separate them with commas. Only equations are supported in the INITIAL statement; hence, the inequality comparison operators (<, <=, >, >=) and the distribution operator ~ are not supported in the INITIAL statement.","help":"INITIAL equation, …, equation"},{"name":"MODEL","description":"The MODEL statement specifies dependent (endogenous) variables for the HMM model. Only one MODEL statement is allowed.","help":"MODEL &lt;ESTISPV&gt; &lt;METHOD=&lt;MAP | ML&gt;&gt; &lt;NSTATE=number&gt; ...","arguments":[{"name":"ESTISPV","optional":true,"followsDelimiter":"/","description":"Requests that the initial state probability vector (ISPV) not be fixed to the stationary distribution of the Markov chain and be estimated instead. If you do not specify this option, the ISPV is fixed to the stationary distribution of the Markov chain.","type":"standalone"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"Requests the type of estimates to be computed.","help":"METHOD=MAP | ML*value*","type":"value","arguments":[{"name":"MAP","followsDelimiter":"/","description":"Specifies the maximum a posteriori estimates.","type":"standalone"},{"name":"ML","followsDelimiter":"/","description":"Specifies the maximum likelihood method.","type":"standalone"}]},{"name":"NSTATE=","optional":true,"followsDelimiter":"/","description":"Specifies the number of hidden states. The number must be a positive integer. By default, NSTATE=2.","help":"NSTATE=*number*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the type of model of interest.","help":"TYPE=GAUSSIAN*value*","type":"value","arguments":[{"name":"GAUSSIAN","followsDelimiter":"/","description":"Specifies the Gaussian HMM.","type":"standalone"}]}]},{"name":"OPTIMIZE","description":"The OPTIMIZE statement specifies options that are related to optimization.","help":"OPTIMIZE &lt;ALGORITHM=&lt;ACTIVESET | INTERIORPOINT&gt;&gt; &lt;FEASTOL=number&gt; &lt;MAXITER=number&gt; ...","arguments":[{"name":"ALGORITHM=","optional":true,"description":"Specifies the optimization algorithm.","help":"ALGORITHM=ACTIVESET | INTERIORPOINT*value*","type":"value","arguments":[{"name":"ACTIVESET","description":"Specifies the active set algorithm.","type":"standalone"},{"name":"INTERIORPOINT","description":"Specifies the interior point algorithm.","type":"standalone"}]},{"name":"FEASTOL=","optional":true,"description":"Defines the feasible tolerance. The optimizer exits if the constraint violation is less than number and the scaled optimality conditions are less than the value of the OPTTOL= option. By default, FEASTOL=10^-6.","help":"FEASTOL=*number*","type":"value"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations in the optimization process. The number must be a nonnegative integer. By default, MAXITER=128.","help":"MAXITER=*number*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies an upper limit of t seconds for the optimization process, including problem generation time and solution time. If you do not specify this option, the optimizer does not stop based on the amount of time elapsed. The value of t can be any positive number; the default value is the positive number that has the largest absolute value that your operating environment can represent.","help":"MAXTIME=*t*","type":"value"},{"name":"MSRANGE=","optional":true,"description":"Defines the range, a positive number, from which each variable can take values during the sampling process in multistart mode. This option is ignored if MULTISTART=0.","help":"MSRANGE=*number*","type":"value"},{"name":"MULTISTART=","optional":true,"description":"Specifies whether to enable multistart mode. In multistart mode (that is, when you specify MULTISTART=1), the local solver solves the problem from multiple starting points, possibly finding a better local minimum as a result. The computing cost in multistart mode might be huge. By default, MULTISTART=0; that is, multistart mode is disabled by default.","help":"MULTISTART=0 | 1","type":"choice","arguments":[{"name":"0","description":"Multistart mode is disabled. This is the default.","type":"standalone"},{"name":"1","description":"Specifies multistart mode.","type":"standalone"}]},{"name":"OBJLIMIT=","optional":true,"description":"Specifies an upper limit on the magnitude of the objective value. By default, OBJLIMIT=10^20.","help":"OBJLIMIT=*number*","type":"value"},{"name":"OPTTOL=","optional":true,"description":"Defines the measure by which you can decide whether the current iterate is an acceptable approximation of a local minimum.","help":"OPTTOL=*number*","type":"value"},{"name":"PRINTITERFREQ=","optional":true,"description":"Specifies how frequently to output the optimization process history. The number must be a nonnegative integer. If PRINTITERFREQ=0, no iterations are output. If PRINTITERFREQ=n and n is positive, the optimization process history is output every n iterations. By default, PRINTITERFREQ=0.","help":"PRINTITERFREQ=*number*","type":"value"},{"name":"PRINTLEVEL=","optional":true,"description":"Specifies the print level. By default, PRINTLEVEL=0.","help":"PRINTLEVEL=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","description":"Suppresses output of the initial parameter values and objective value, the algorithm information, and the final parameter values and objective value.","type":"standalone"},{"name":"1","description":"Outputs the initial parameter values and objective value.","type":"standalone"},{"name":"2","description":"Outputs the initial parameter values and objective value, and the algorithm information.","type":"standalone"},{"name":"3","description":"Outputs the initial parameter values and objective value, the algorithm information, and the final parameter values and objective value.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies a nonnegative integer to be used as the seed for generating random number sequences. You can use this option to replicate results from different runs.","help":"SEED=*number*","type":"value"},{"name":"SOLTYPE=","optional":true,"description":"Specifies whether the optimizer should return only a solution that is locally optimal.","help":"SOLTYPE=0 | 1","type":"choice","arguments":[{"name":"0","description":"Requests that the optimizer return a locally optimal solution, provided that it locates one.","type":"standalone"},{"name":"1","description":"Requests that the optimizer return the best feasible solution found, provided that its objective value is better than that of the locally optimal solution found.","type":"standalone"}]}]},{"name":"PRIOR","description":"The PRIOR statement sets up the initial hyperparameter values in the prior distributions of the parameters when the maximum a posteriori method is applied to the estimation of the HMM. If you specify the maximum likelihood (ML) method, the PRIOR statement is ignored. You can specify only one PRIOR statement. If you specify more than one distribution, separate them with commas.","help":"PRIOR ISPV MUSIGMA TPM ...","arguments":[{"name":"ISPV","description":"Indicates the initial state probability vector. The prior distribution for ISPV must be the Dirichlet distribution.","type":"standalone"},{"name":"MUSIGMA","description":"Indicates the mean and covariance parameters for the observation distributions in the Gaussian HMM. The prior distribution of the mean and covariance parameters for each state must be the normal- inverse-Wishart (NIW) distribution.","type":"standalone"},{"name":"TPM","description":"Indicates the transition probability matrix. The prior distribution for TPM must be the Dirichlet distribution.","type":"standalone"},{"name":"DIR","optional":true,"description":"Indicates the Dirichlet distribution. There is one argument for the Dirichlet distribution, and it should be a valid matrix expression of the proper size.","type":"standalone"},{"name":"NIW","optional":true,"description":"Indicates the normal-inverse-Wishart (NIW) distribution. There are four arguments for the NIW distribution, and they should be valid matrix expressions of the proper size.","type":"standalone"}]},{"name":"SCORE","description":"The SCORE statement specifies options that are related to scoring data.","help":"SCORE &lt;INMODEL=SAS-data-set&gt; &lt;OUTMODEL=SAS-data-set&gt; ","arguments":[{"name":"INMODEL=","optional":true,"description":"Specifies the input data set for model information. The data set must be an output data set from the OUTMODEL= option in a previous call of the HMM procedure. When you specify this option, the ID, INITIAL, MODEL, OPTIMIZE, and PRIOR statements are ignored.","help":"INMODEL=*SAS-data-set*","type":"dataSet"},{"name":"OUTMODEL=","optional":true,"description":"Writes the model information to an output data set. The output data set consists of binary large object columns to store the binary data. Do not edit the content of this output data set. If you run the PRINT procedure on this data set, you get a row of zeros because the data type of each column is binary.","help":"OUTMODEL=*SAS-data-set*","type":"dataSet"}]},{"name":"SMOOTH","description":"The SMOOTH statement specifies options that are related to the smoothing problem, which is to find the probability distribution of the state conditional on all available observations.","help":"SMOOTH &lt;OUT=SAS-data-set&gt; ","arguments":[{"name":"OUT=","optional":true,"description":"Writes the smoothing results to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casecon","docsetVersion":"v_037","docsetTargetFile":"casecon_hmm_toc.htm"}}