{"name":"HPBIN","statements":[{"name":"PROC HPBIN","description":"Binning is a common step in the data preparation stage of the model building process. One can use binning to classify missing variables, reduce the impact of outliers, or generate multiple effects. The generated effects are useful and contain certain nonlinear information of the original interval variables. † The HPBIN procedure conducts high-performance binning using either bucket binning, winsorized binning or pseudo-quantile binning. Like other high-performance procedures, the HPBIN procedure can read and write data in distributed form. And it can perform computation in parallel in either symmetric multiprocessing (SMP) or massively parallel processing (MPP) mode. † The HPBIN procedure has following features. † o performs analysis on a massively parallel SAS high-performance appliance o reads input data in parallel and writes output data in parallel when the data source is on the appliance database o is highly multithreaded during all phases of analytic execution o provides a bucket, or equal length, binning method o provides a winsorized binning method and winsorized statistics o provides a pseudo-quantile binning method, which is similar to quantile binning o provides a mapping table for the selected binning method o provides a basic statistic table which contains minimum, maximum, mean, pseudo-median, etc. o provides a histogram table showing the output mapping statistics o provides an estimation of pseudo-quantile table","help":"PROC HPBIN <BINS_META=SAS-data-set><BUCKET><COMPUTEHIST><COMPUTEQUANTILE><COMPUTESTATS><DATA=SAS-data-set><NOPRINT><NUMBIN=integer><OUTPUT=SAS-data-set><PSEUDO_QUANTILE><WINSOR><WINSOR WINSORRATE=number><WOE><WOEADJUST=number>;     \n\tCODE <FILE= filename> ;\n\tFREQ variable ;\n\tID id-1 id-2 ... id-n ;\n\tINPUT <NUMBIN=integer> ;\n\tPERFORMANCE <COMMIT=n><CPUCOUNT=<ACTUAL | <num>>><DATASERVER=“name”> ...;\n\tTARGET <LEVEL=level><ORDER=order> ;\n\tVAR var-1 var-2 ... var-n;","arguments":[{"name":"BINS_META=","optional":true,"description":"Specifies the BINS_META input data set, which contains the binning results. The BINS_META data set contains six variables: variable name, bin variable name, lower bound, upper bound, bin, and SAS Enterprise Miner bin label. The mapping table that is generated by PROC HPBIN can be used as the BINS_META data set.","help":"BINS_META=*SAS-data-set*","type":"dataSet"},{"name":"BUCKET","optional":true,"description":"If you specify BUCKET, then PROC HPBIN uses equal-length binning.","type":"standalone"},{"name":"COMPUTEHIST","optional":true,"description":"Specifies the histogram table to be printed. If you specify COMPUTEHIST, PROC HPBIN prints the histogram table, which contains frequencies of the mapping result for each mapping range. The histogram table contains five variables: variable name, bin variable name, bin, frequency, and range.","type":"standalone"},{"name":"COMPUTEQUANTILE","optional":true,"description":"If option COMPUTEQUANTILE is specified, the estimated quantile table is provided. The table contains the following percentages 0%, 1%, 5%, 10%, 25%, 50%, 75%, 90%, 95%, 99% and 100%.","type":"standalone"},{"name":"COMPUTESTATS","optional":true,"description":"If option COMPUTESTATS is specified, the basic statistic information is computed and the ODS output can be provided. The output table contains minimum, maximum, mean, std, pseudo-median, ect.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set or database table to be used by PROC HPBIN.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NOPRINT","optional":true,"description":"Specify this option to suppress the generation of ODS outputs. The output table is generated if output option presents.","type":"standalone"},{"name":"NUMBIN=","optional":true,"description":"Specifies the global number of binning levels for all binning variables. The value of integer can be any integer between 2 and 1,000, inclusive. The default number of binning levels is 16, which is used in SAS Enterprise Miner. The resulting number of binning levels might be less than integer if the sample size is small or if the data are not normalized. In this case, PROC HPBIN provides a warning message.","help":"NUMBIN=*integer*","type":"value"},{"name":"OUTPUT=","optional":true,"description":"Creates an output SAS data set in SMP mode or database table that is saved alongside the distributed database in MPP mode. The output data set or table contains binning variables. The variables in the input data set are not included in the output data set to avoid data duplication for large data sets.","help":"OUTPUT=*SAS-data-set*","type":"dataSet"},{"name":"PSEUDO_QUANTILE","optional":true,"description":"If you specify PSEUDO_QUANTILE, then PROC HPBIN generates a result that approximates the quantile binning.","type":"standalone"},{"name":"WINSOR","optional":true,"description":"If you specify WINSOR, PROC HPBIN uses Winsorized binning, and you must specify the WINSORRATE option with a value from 0.0 to 0.5 exclusive for number.","type":"standalone"},{"name":"WINSORRATE=","optional":true,"description":"If you specify WINSOR, PROC HPBIN uses Winsorized binning, and you must specify the WINSORRATE option with a value from 0.0 to 0.5 exclusive for number.","help":"WINSORRATE=*number*","type":"value"},{"name":"WOE","optional":true,"description":"Specifies that the weight of evidence (WOE) and information value (IV) be computed.","type":"standalone"},{"name":"WOEADJUST=","optional":true,"description":"Specifies the adjustment factor for the weight-of-evidence calculation. You can specify any value from 0.0 to 1.0, inclusive, for number. The default is 0.5.","help":"WOEADJUST=*number*","type":"value"}]},{"name":"CODE","description":"The CODE statement is optional in PROC HPBIN. If you use a CODE statement, score code is generated and stored in a file that can be used for scoring purposes. Only one CODE statement is processed. If you specify multiple CODE statements, only the first one is used.","help":"CODE &lt;FILE= filename&gt;","arguments":[{"name":"FILE=","optional":true,"description":"If you use a CODE statement, score code is generated and stored in a file that can be used for scoring purposes.","type":"value"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence for each observation. The HPBIN procedure treats each observation as if it appeared f times, where f is the value of the FREQ variable for the observation. If the frequency value is not an integer, it is truncated to an integer. If the frequency value is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1. NOTE: For bucket binning, the frequency option has no effect.","help":"FREQ variable "},{"name":"ID","description":"The optional ID statement lists one or more variables from the input data set to be transferred to the output data set. If you specify an ID statement, the output data set contains the ID variables: id1 id2 . . . idn. The ID statement accepts both numeric and character variables. By default, the HPBIN procedure does not include any variables from the input data set in the output data set to avoid data duplication for large data sets. The variables in an ID statement can also appear in an INPUT statement. Therefore, the ID statement can be used to copy variables from the input data set to the output data set.","help":"ID id-1 id-2 ... id-n "},{"name":"INPUT","description":"The INPUT statement names one or more variables as input variables for binning. The specified variables must be interval variables. If classification variables are provided, PROC HPBIN stops with an error message. PROC HPBIN does not support duplicate variables. If the INPUT statement contains a duplicate variable, PROC HPBIN takes only the first variable and provides a warning message.","help":"INPUT &lt;NUMBIN=integer&gt;","arguments":[{"name":"NUMBIN=","optional":true,"description":"Specifies the number of binning levels for all the binning variables in the current INPUT statement. The value of integer can be any integer between 2 and 1,000, inclusive. The resulting number of binning levels might be less than integer if the sample size is small or if the data are not normalized. In these cases, PROC HPBIN provides a warning message.","help":"NUMBIN=*integer*","type":"value"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multi-threaded and distributed computing, communicates variable information regarding the distributed computing environment, and requests detailed results about the performance characteristics of the HPBIN procedure. With the PERFORMANCE statement, you can control whether the HPBIN procedure executes in symmetric multiprocessing or massively parallel mode.","help":"PERFORMANCE &lt;COMMIT=n&gt;&lt;CPUCOUNT=&lt;ACTUAL | &lt;num&gt;&gt;&gt;&lt;DATASERVER=“name”&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"This option specifies the minimum number of observations transferred from the client to the appliance necessary to update the SAS Log. For instance, if you specify COMMIT=5000, then every time the number of observations sent exceeds an integer multiple of 5000 a log message is produced. This message indicates the actual number of observations distributed, not the COMMIT= value that triggered the message.","help":"COMMIT=*n*","type":"value"},{"name":"CPUCOUNT=","optional":true,"description":"This argument specifies how many processors PROC HPBIN assumes are available on each host in the computing environment. Valid values for number are integers between 1 and 256, inclusive. Setting CPUCOUNT= to a value greater than the actual number of available CPUs might results in reduced performance. Specify CPUCOUNT=ACTUAL to set CPUCOUNT= to the number of processors physically available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools. This option overrides the CPUCOUNT= SAS system option. If PROC HPBIN executes in SMP mode, then this option referes to the client machine of the SAS session. If PROC HPBIN executes in MPP mode, then this option applies the nodes on the appliance.","help":"CPUCOUNT=ACTUAL | &lt;*num*&gt;","type":"choice","arguments":[{"name":"ACTUAL","description":"Sets CPUCOUNT to the number of processors physically available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","type":"standalone"},{"name":"num","placeholder":true,"description":"Replace <num> with an actual number. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","type":"standaloneOrValue"}]},{"name":"DATASERVER=","optional":true,"description":"Specifies the name of the server on Teradata systems as defined through the hosts file and as used in the LIBNAME statement for Teradata. For example, if the hosts file defines myservercop1 33.44.55.66 as the server for Teradata, then a LIBNAME specification would be as follows: libname TDLib teradata server=myserver user= password= database= ; A PERFORMANCE statement to induce running alongside the Teradata server would specify the following:","type":"value"},{"name":"DETAILS","optional":true,"description":"Specify this option to request a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"HOST=","optional":true,"aliases":["GRIDHOST="],"description":"This option specifies the name of the appliance host. The HOST= option overrides the value of the GRIDHOST environment variable.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"This option specifies the directory where the High-Performance Analytics shared libraries are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"This option specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database. Specify NODES=0 to indicate that you want to process the data in SMP mode on the client machine. If the input data are not alongside the database, this is the default setting. The HPBIN procedure then performs multithreaded analysis on the client. If the data are not read alongside the database, the NODES= option specifies the number of nodes on the appliance that are involved in the analysis. If the number of nodes can be modified by the application, you can specify a NODES= option where n exceeds the number of physical nodes on the appliance. The High-Performance Analytics software then oversubscribes the nodes and associates nodes with multiple units of work. For example, on a system with 16 appliance nodes, the following statement would oversubscribe the system by a factor of 3:","type":"value"},{"name":"NTHREADS=","optional":true,"description":"This option specifies the number of threads used for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, then the number of threads is determined based on the number of CPUs on the host machine where the analytic computations execute. By default, High-Performance Analytics procedures execute in multiple concurrent threads, unless you disable this behavior with the NOTHREADS system option or you specify NTHREADS=1 to force single-threaded execution. The value specified here must not exceed 256.","help":"NTHREADS=*n*","type":"value"},{"name":"TIMEOUT=","optional":true,"description":"This options specifies the length of time, in seconds, PROC HPBIN should wait for a connection to the appliance and to establish a connection back to the client. The default value for s is 120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the timeout value.","help":"TIMEOUT=*s*","type":"value"}]},{"name":"TARGET","description":"The TARGET statement names the variable that PROC HPBIN uses to calculate the weight of evidence and information value. You can specify the following arguments: LEVEL=level specifies the level of the target variable. The values of level can be BINARY or NOMINAL. ORDER=order specifies the order of the target variable. The values of order can be ASCENDING or DESCENDING.","help":"TARGET &lt;LEVEL=level&gt;&lt;ORDER=order&gt;","arguments":[{"name":"LEVEL=","optional":true,"description":"Specifies the level of the target variable. The values of level can be BINARY or NOMINAL.","help":"LEVEL=*level*","type":"value"},{"name":"ORDER=","optional":true,"description":"Specifies the order of the target variable. The values of order can be ASCENDING or DESCENDING.","help":"ORDER=*order*","type":"value"}]},{"name":"VAR","description":"[New in SAS HPA Server 12.2: You can use the new INPUT statement as an alias for the VAR statement.] The list of interval variables which will be the input as the binning variables. Unlike other PROCs, the VAR statement is required for PROC HPBIN. If the statement does not exist, the process stops. The selected variables must be intervals, if class variables are provided, the process stops with error message. Duplicated variables are not supported in proc hpbin. If a duplicated variable exists in the VAR statement, process stops with error message. Input variables are not allowed in ID statement nor as a frequency variable.","help":"VAR var-1 var-2 ... var-n"}],"supportSiteInformation":{"docsetId":"prochp","docsetVersion":"v_001","docsetTargetFile":"prochp_hpbin_toc.htm"}}