{"name":"HPCANDISC","statements":[{"name":"PROC HPCANDISC","description":"The HPCANDISC procedure is a high-performance procedure that performs canonical discriminant analysis. It is a high-performance version of the CANDISC procedure in SAS/STAT software. PROC HPCANDISC runs in either single-machine mode or distributed mode. † Note: Distributed mode requires SAS High-Performance Statistics.","help":"PROC HPCANDISC <ALL><ANOVA><BCORR><BCOV><BSSCP><DATA=SAS-data-set><DISTANCE><NCAN=n><NOPRINT><OUT=SAS-data-set><OUTSTAT=SAS-data-set><PCORR><PCOV><PREFIX=name><PSSCP><SHORT><SIMPLE><SINGULAR=p><STDMEAN><TCORR><TCOV><TSSCP><WCORR><WCOV><WSSCP>;     \n\tBY <DESCENDING><NOTSORTED> ;\n\tCLASS variable ;\n\tFREQ variable;\n\tID variables;\n\tPERFORMANCE <COMMIT=n><DETAILS><GRIDHOST=\"name\"> ...;\n\tVAR variables;\n\tWEIGHT variable;","arguments":[{"name":"ALL","optional":true,"description":"Activates all of the display options.","type":"standalone"},{"name":"ANOVA","optional":true,"description":"Displays univariate statistics for testing the hypothesis that the class means are equal in the population for each variable.","type":"standalone"},{"name":"BCORR","optional":true,"description":"Displays between-class correlations.","type":"standalone"},{"name":"BCOV","optional":true,"description":"Displays between-class covariances.","type":"standalone"},{"name":"BSSCP","optional":true,"description":"Displays the between-class SSCP matrix.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the data set to be analyzed. The data set can be an ordinary SAS data set or one of several specially structured data sets created by SAS statistical procedures.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DISTANCE","optional":true,"aliases":["MAHALANOBIS"],"description":"Displays squared Mahalanobis distances between the group means, F statistics, and the corresponding probabilities of greater squared Mahalanobis distances between the group means.","type":"standalone"},{"name":"NCAN=","optional":true,"description":"Specifies the number of canonical variables to be computed. The value of n must be less than or equal to the number of variables. If you specify NCAN=0, PROC HPCANDISC displays the canonical correlations but not the canonical coefficients, structures, or means. A negative value suppresses the canonical analysis entirely.","help":"NCAN=*n*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results. This option temporarily disables the Output Delivery System (ODS).","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set to contain observationwise canonical variable scores. The variables in the input data set are not included in the output data set to avoid data duplication for large data sets; however, variables that are specified in the ID statement are included.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Creates a TYPE=CORR output SAS data set that contains various statistics, including class means, standard deviations, correlations, canonical correlations, canonical structures, canonical coefficients, and means of canonical variables for each class level.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PCORR","optional":true,"description":"Displays pooled within-class correlations (partial correlations based on the pooled within-class covariances).","type":"standalone"},{"name":"PCOV","optional":true,"description":"Displays pooled within-class covariances.","type":"standalone"},{"name":"PREFIX=","optional":true,"description":"Specifies a prefix for naming the canonical variables. By default, the names are Can1, Can2, Can3, and so on. If you specify PREFIX=Abc, the components are named Abc1, Abc2, and so on. The number of characters in the prefix plus the number of digits required to designate the canonical variables should not exceed 32. The prefix is truncated if the combined length exceeds 32.","help":"PREFIX=*name*","type":"value"},{"name":"PSSCP","optional":true,"description":"Displays the pooled within-class corrected SSCP matrix.","type":"standalone"},{"name":"SHORT","optional":true,"description":"Suppresses the display of canonical structures, canonical coefficients, and class means on canonical variables; only tables of canonical correlations and multivariate test statistics are displayed.","type":"standalone"},{"name":"SIMPLE","optional":true,"description":"Displays simple descriptive statistics for the total sample and within each class.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Specifies the criterion for determining the singularity of the total-sample correlation matrix and the pooled within-class covariance matrix, where 0 < p < 1. The default is SINGULAR=1E–8.","help":"SINGULAR=*p*","type":"value"},{"name":"STDMEAN","optional":true,"description":"Displays total-sample and pooled within-class standardized class means.","type":"standalone"},{"name":"TCORR","optional":true,"description":"Displays total-sample correlations.","type":"standalone"},{"name":"TCOV","optional":true,"description":"Displays total-sample covariances.","type":"standalone"},{"name":"TSSCP","optional":true,"description":"Displays the total-sample corrected SSCP matrix.","type":"standalone"},{"name":"WCORR","optional":true,"description":"Displays within-class correlations for each class level.","type":"standalone"},{"name":"WCOV","optional":true,"description":"Displays within-class covariances for each class level.","type":"standalone"},{"name":"WSSCP","optional":true,"description":"Displays the within-class corrected SSCP matrix for each class level.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC HPCANDISC to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY &lt;DESCENDING&gt;&lt;NOTSORTED&gt;","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The values of the CLASS variable define the groups for analysis. Class levels are determined by the formatted values of the CLASS variable. The CLASS variable can be numeric or character. A CLASS statement is required.","help":"CLASS variable "},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. SAS high-performance analytics procedures that support the FREQ statement treat each observation as if it appeared f times, where f is the value of the FREQ variable for the observation. If the frequency value is not an integer, it is truncated to an integer. If the frequency value is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable"},{"name":"ID","description":"The ID statement lists one or more variables from the input data set that are transferred to output data sets created by SAS high-performance analytics procedures, provided that the output data set produces one (or more) records per input observation.","help":"ID variables"},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables about the distributed computing environment, and requests detailed results about the performance characteristics of a High-Performance Analytics procedure. You can also use the PERFORMANCE statement to control whether a high-performance analytical procedure executes in single-machine or distributed mode.","help":"PERFORMANCE &lt;COMMIT=n&gt;&lt;DETAILS&gt;&lt;GRIDHOST=\"name\"&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"Requests that the High-Performance Analytics procedure write periodic updates to the SAS Log when observations are sent from the client to the appliance for distributed processing.","help":"COMMIT=*n*","type":"value"},{"name":"DETAILS","optional":true,"description":"Requests a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"GRIDHOST=","optional":true,"aliases":["HOST="],"description":"Syntax: GRIDHOST=\"name\" HOST=\"name\"","help":"GRIDHOST=\"*name*\"","type":"value"},{"name":"GRIDMODE=","optional":true,"aliases":["MODE="],"description":"Is a deprecated option that specifies whether to run the high-performance analytical procedure in symmetric (SYM) mode or asymmetric (ASYM) mode. This option overrides the GRIDMODE environment variable.","help":"GRIDMODE=SYM | ASYM","type":"choice","arguments":[{"name":"SYM","description":"Specifies to run the high-performance analytical procedure in symmetric (SYM) mode","type":"standalone"},{"name":"ASYM","description":"Specifies to run the high-performance analytical procedure in asymmetric (ASYM) mode.","type":"standalone"}]},{"name":"GRIDTIMEOUT=","optional":true,"aliases":["TIMEOUT="],"description":"Specifies the time-out in seconds for a high-performance analytical procedure to wait for a connection to the appliance and establish a connection back to the client. The default is 120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the time-out value.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"Specifies the directory in which the shared libraries for the high-performance analytical procedure are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"LASRSERVER=","optional":true,"aliases":["LASR="],"description":"Specifies the fully qualified path to the description file of a SAS LASR Analytic Server instance. If the input data set is held in memory by this LASR Analytic Server instance, then the procedure runs alongside LASR. This option is not needed to run alongside LASR if the DATA= specification of the input data uses a libref that is associated with a LASR Analytic Server instance.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"Specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database.","type":"value"},{"name":"NTHREADS=","optional":true,"aliases":["THREADS="],"description":"Specifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, the number of threads is determined based on the number of CPUs on the host on which the analytic computations execute. The algorithm by which a CPU count is converted to a thread count is specific to the high-performance analytical procedure. Most procedures create one thread per CPU for the analytic computations. By default, high-performance analytical procedures run in multiple concurrent threads unless multithreading has been turned off by the NOTHREADS system option or you force single-threaded execution by specifying NTHREADS=1. The largest number that can be specified for n is 256. Individual high-performance analytical procedures can impose more stringent limits if called for by algorithmic considerations.","type":"value"}]},{"name":"VAR","description":"You specify the quantitative variables to include in the analysis by using a VAR statement. If you do not use a VAR statement, the analysis includes all numeric variables that are not listed in other statements.","help":"VAR variables"},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations that have nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, all observations that are used in the analysis are assigned a weight of 1. The WEIGHT statement does not alter the degrees of freedom.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"latest","docsetTargetFile":"statug_hpcandisc_toc.htm"}}