{"name":"HPDMDB","statements":[{"name":"PROC HPDMDB","description":"The HPDMDB procedure is a high-performance version of the DMDB procedure, which creates summaries of the input data source. PROC HPDMDB creates two output data sets: the VAROUT data set, which contains a summary of the numeric variables, and the CLASSOUT data set, which contains a summary of the classification variables. † PROC HPDMDB is high-performance in that it takes advantage of distributed and multicore computing environments when the input data are stored on the SAS appliance. † You can use PROC HPDMDB to create a data mining database (DMDB) that is compatible with the DMDB from PROC DMDB, although this feature of PROC HPDMDB might not be supported in future versions.","help":"PROC HPDMDB <CLASSOUT= <libref.>SAS-data-set> DATA= <libref.>SAS-data-set <DMDBCAT= <libref.>SAS-catalog> <MAXLEVEL=max> <PRINT> <SPECIALMISSING> <VARDEF=N | DF> <VAROUT= <libref.>SAS-data-set>;     \n\tCLASS <ASCENDING> <ASCFORMATTED> <DESCENDING> ...; \n   \n\tFREQ variable ;     \n\tPERFORMANCE <COMMIT=n> <CPUCOUNT=<ACTUAL | <num>>> <DATASERVER=“name”> ...; \n   \n\tVAR variable(s) ;     \n\tWEIGHT variable ; ","arguments":[{"name":"DATA=","description":"Names the SAS data set that contains the information that you want added to the data mining database. If the data set resides on the SAS appliance, then the SAS appliance is used during summarization.","type":"value"},{"name":"CLASSOUT=","optional":true,"description":"Names the data set to contain the summaries of classification variables that are specified in the CLASS statement.","type":"value"},{"name":"DMDBCAT=","optional":true,"description":"Names the metadata catalog to be created by PROC HPDMDB.","type":"value"},{"name":"MAXLEVEL=","optional":true,"description":"Specifies the maximum number of levels to be reported for each class variable. If more than max levels of a class variable exist, PROC HPDMDB reports the frequency of unreported observations in a level named _OTHER_.","help":"MAXLEVEL=*max*","type":"value"},{"name":"PRINT","optional":true,"description":"Prints the class-level information to all open ODS destinations.","type":"standalone"},{"name":"SPECIALMISSING","optional":true,"description":"Enables special missing values to be treated as separate levels.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the divisor to use in the calculation of the variance and standard deviation.","help":"VARDEF=N | DF*divisor*","type":"value","arguments":[{"name":"N","description":"Number of observations (n)","type":"standalone"},{"name":"DF","description":"Degrees of freedom (n - 1)","type":"standalone"}]},{"name":"VAROUT=","optional":true,"description":"Names the data set to contain the summaries of analysis variables that are specified in the VAR statement.","type":"value"}]},{"name":"CLASS","description":"The CLASS statement specifies the variables whose values define subgroup combinations for the analysis. The CLASS and VAR statements are mutually exclusive.","help":"CLASS &lt;ASCENDING&gt; &lt;ASCFORMATTED&gt; &lt;DESCENDING&gt; ...","arguments":[{"name":"ASCENDING","optional":true,"aliases":["ASC"],"description":"Arranges class levels in lowest-to-highest order of unformatted values.","type":"standalone"},{"name":"ASCFORMATTED","optional":true,"aliases":["ASCFMT"],"description":"Arranges class levels in ascending order by their formatted values.","type":"standalone"},{"name":"DESCENDING","optional":true,"aliases":["DESC"],"description":"Arranges class levels in highest-to-lowest order of unformatted values.","type":"standalone"},{"name":"DESFORMATTED","optional":true,"aliases":["DESFMT"],"description":"Arranges class levels in descending order by their formatted values.","type":"standalone"},{"name":"DSORDER","optional":true,"aliases":["DATA"],"description":"Arranges class levels according to the order of their appearance in the input data set. NOTE: The DSORDER sort option is not supported for input data sets stored on the SAS appliance.","type":"standalone"}]},{"name":"FREQ","description":"The FREQ statement specifies a numeric variable that contains the frequency of each observation. Required Argument: variable specifies a numeric variable whose value represents the frequency of the observation. For observations where variable is 0 or missing, the observation is omitted in the CLASSOUT data set and is not included in statistical calculations.","help":"FREQ variable "},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables about the distributed computing environment, and requests detailed results about the performance characteristics of a High-Performance Analytics procedure. With the PERFORMANCE statement, you can also control whether a High-Performance Analytics procedure executes in SMP or MPP mode.","help":"PERFORMANCE &lt;COMMIT=n&gt; &lt;CPUCOUNT=&lt;ACTUAL | &lt;num&gt;&gt;&gt; &lt;DATASERVER=“name”&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"Requests that the High-Performance Analytics procedure write periodic updates to the SAS Log when observations are sent from the client to the appliance for distributed processing.","help":"COMMIT=*n*","type":"value"},{"name":"CPUCOUNT=","optional":true,"description":"Specifies how many processors the procedure assumes are available on each host in the computing environment. num can be any integer from 1 to 256. CPUCOUNT=ACTUAL sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","help":"CPUCOUNT=ACTUAL | &lt;*num*&gt;","type":"choice","arguments":[{"name":"ACTUAL","description":"Sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","type":"standalone"},{"name":"num","placeholder":true,"description":"Replace <num> with an actual number. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","type":"standaloneOrValue"}]},{"name":"DATASERVER=","optional":true,"description":"Specifies the name of the server on Teradata systems as defined through the hosts file and as used in the LIBNAME statement for Teradata. For example, if the hosts file defines myservercop1 33.44.55.66 as the server for Teradata, then a LIBNAME specification would be as follows: libname TDLib teradata server=myserver user= password= database= ; A PERFORMANCE statement to induce running alongside the Teradata server would specify the following:","type":"value"},{"name":"DETAILS","optional":true,"description":"Requests a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"HOST=","optional":true,"aliases":["GRIDHOST="],"description":"Specifies the name of the appliance host in single or double quotes. If the HOST= option is specified, it overrides the value of the GRIDHOST environment variable.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"Specifies the directory in which the High-Performance Analytics shared libraries are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"Specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database.","type":"value"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, the number of threads are determined based on the number of CPUs on the host on which the analytic computations execute. The algorithm by which a CPU count is converted to a thread count is specific to the High- Performance Analytics procedure. Most procedures create one thread per CPU for the analytic computations. By default, High-Performance Analytics procedures execute in multiple concurrent threads unless turned off by the NOTHREADS system option or you force single-threaded execution with NTHREADS=1. The largest number that can be specified for n is 256. Individual High-Performance Analytics procedures can impose more stringent limits if called for by algorithmic considerations. You can affect the determination of the CPU count with the CPUCOUNT= option in the PERFORMANCE statement.","help":"NTHREADS=*n*","type":"value"},{"name":"TIMEOUT=","optional":true,"description":"Specifies the timeout in seconds for a High-Performance Analytics procedure to wait for a connection to the appliance and establish a connection back to the client. The default is s=120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the timeout value.","help":"TIMEOUT=*s*","type":"value"}]},{"name":"VAR","description":"The VAR statement specifies one or more numeric variables to analyze. The CLASS and VAR statements are mutually exclusive. Required Argument: variable(s) specifies one or more numeric variables to be used in the analysis. The variable(s) must be numeric. For each variable, the VAROUT data set and the metadata contain the following statistics: N Number of observations NMISS Number of observations that contain a missing value MIN Minimum observed value MAX Maximum observed value MEAN Mean of observed values STD Standard deviation SKEWNESS Measure of asymmetry KURTOSIS Measure of the “heaviness of the tails” SUM Sum of all nonmissing observations CSS Corrected sum of squares USS Sum of squares","help":"VAR variable(s) "},{"name":"WEIGHT","description":"The WEIGHT statement specifies a numeric variable that contains a weight for each observation. The variable is used in the computation of means, standard deviation, skewness, and kurtosis. Required Argument: variable represents how the observation should be weighted in statistical calculations. For observations where variable is 0 or missing, then the observation is still included in the CLASSOUT data set, but the value is not used in statistical calculations.","help":"WEIGHT variable "}],"supportSiteInformation":{"docsetId":"prochp","docsetVersion":"v_001","docsetTargetFile":"prochp_hpdmdb_toc.htm"}}