{"name":"HPGENSELECT","statements":[{"name":"PROC HPGENSELECT","description":"The HPGENSELECT procedure is a high-performance procedure that fits generalized linear models on the SAS appliance. † The HPGENSELECT procedure fits a broader class of regression models than exponential family generalized linear models; the procedure permits several link functions and can handle zero-modified models for count data as well as ordinal and nominal data with more than two response categories (multinomial data). † With the HPGENSELECT procedure you can read and write data in distributed form and perform analyses in parallel in symmetric multiprocessing (SMP) or massively parallel processing (MPP) mode.","help":"PROC HPGENSELECT <ABSCONV= | ABSTOL=r> <ABSFCONV=r<n> | ABSFTOL=r<n>> <ABSGCONV=r<n> | ABSGTOL=r<n>> <ALPHA=number> <CORR> <COV> <DATA=SAS-data-set> <FCONV=r | FTOL=r> <FMTLIBXML=file-ref> <GCONV=r | GTOL=r> <ITDETAILS> <ITSELECT> <MAXFUNC=n | MAXFU=n> <MAXITER=n | MAXIT=n> <MAXTIME=r> <MINITER=n | MINIT=n> <NAMELEN=number> <NOCLPRINT< =number >> <NOPRINT> <NORMALIZE=YES | NO> <NOSTDERR> <SINGCHOL=number> <SINGSWEEP=number> <SINGULAR=number> <TECHNIQUE=CONGRA | DBLDOG | NMSIMP... >;     \n\tCLASS <UPCASE> ; \n   \n\tCODE <CATALOG=library.catalog.entry.type> <DUMMIES> <NODUMMIES> ...; \n   \n\tFREQ variable ;     \n\tID variables ;     \n\tMODEL <DESCENDING> <EVENT=> <ORDER=> ...; \n   \n\tOUTPUT ADJPEARSON | ADJPEARS | STDRESCHI < =name > LINP | XBETA < =name > OUT=SAS-data-set ...; \n   \n\tPERFORMANCE <COMMIT=n> <CPUCOUNT=<ACTUAL | <num>>> <DATASERVER=“name”> ...; \n   \n\tSELECTION <DETAILS=<SUMMARY | STEPS | ALL>> <METHOD=<NONE | FORWARD | BACKWARD>... > ; \n   \n\tWEIGHT variable ;     \n\tZEROMODEL <INCLUDE=n> <LINK=<CLOGLOG|CLL | LOGIT | LOGLOG>... > <START=n> ...; ","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function difference convergence criterion.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. Termination requires the maximum absolute gradient element to be small.","type":"value"},{"name":"ALPHA=","optional":true,"description":"Specifies a global significance level for the construction of confidence intervals. The confidence level is 1–number. The value of number must be between 0 and 1; the default is 0.05. You can override the global specification with the ALPHA= option in the MODEL statement.","help":"ALPHA=*number*","type":"value"},{"name":"CORR","optional":true,"description":"Creates the “Parameter Estimates Correlation Matrix” table.","type":"standalone"},{"name":"COV","optional":true,"description":"Creates the “Parameter Estimates Covariance Matrix” table. The covariance matrix is computed as the inverse of the negative of the matrix of second derivatives of the log-likelihood function with respect to the model parameters (the Hessian matrix).","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the input SAS data set for PROC HPGENSELECT to use. The default is the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies a relative function difference convergence criterion.","type":"value"},{"name":"FMTLIBXML=","optional":true,"description":"Specifies the file reference for the XML stream that contains the user-defined format definitions. Userdefined formats are handled differently in a distributed computing environment compared to other SAS products.","help":"FMTLIBXML=*file-ref*","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies the relative gradient convergence criterion.","type":"value"},{"name":"ITDETAILS","optional":true,"description":"Adds to the “Iteration History” table the current values of the parameter estimates and their gradients. These quantities are reported only for parameters that participate in the optimization. The ITDETAILS option is not available with model selection.","type":"standalone"},{"name":"ITSELECT","optional":true,"description":"Generates the “Iteration History” table when you perform a model selection.","type":"standalone"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Specifies the maximum number n of function calls in the optimization process. The default values are as follows, depending on the optimization technique:","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"specifies the maximum number n of iterations in the optimization process. The default values are as follows, depending on the optimization technique: • TRUREG, NRRIDG, NEWRAP: 50 • QUANEW, DBLDOG: 200 • CONGRA: 400 • NMSIMP: 1,000","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies an upper limit of r seconds of CPU time for the optimization process. The default value is the largest floating-point double representation of your computer. The time specified by the MAXTIME= option is checked only once at the end of each iteration. Therefore, the actual running time can be longer than that specified by the MAXTIME= option.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0. If you request more iterations than are actually needed for convergence to a stationary point, the optimization algorithms can behave strangely. For example, the effect of rounding errors can prevent the algorithm from continuing for the required number of iterations.","type":"value"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length to which long effect names are shortened. The default and minimum value is 20.","help":"NAMELEN=*number*","type":"value"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the “Class Level Information” table if you do not specify number. If you specify number, the values of the classification variables are displayed for only those variables whose number of levels is less than number. Specifying a number helps to reduce the size of the “Class Level Information” table if some classification variables have a large number of levels.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the generation of ODS output.","type":"standalone"},{"name":"NORMALIZE=","optional":true,"description":"Specifies whether the objective function should be normalized during the optimization by the reciprocal of the used frequency count. The default is to normalize the objective function. This option affects the values reported in the “Iteration History” table. The results reported in the “Fit Statistics” are always displayed for the nonnormalized log-likelihood function.","help":"NORMALIZE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"Specifies that the objective function should be normalized during the optimization by the reciprocal of the used frequency count. This is the default.","type":"standalone"},{"name":"NO","description":"Specifies that the objective function should not be normalized during the optimization by the reciprocal of the used frequency count.","type":"standalone"}]},{"name":"NOSTDERR","optional":true,"description":"Suppresses the computation of the covariance matrix and the standard errors of the logistic regression coefficients. When the model contains many variables (thousands), the inversion of the Hessian matrix to derive the covariance matrix and the standard errors of the regression coefficients can be time -consuming.","type":"standalone"},{"name":"SINGCHOL=","optional":true,"description":"Tunes the singularity criterion in Cholesky decompositions. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGCHOL=*number*","type":"value"},{"name":"SINGSWEEP=","optional":true,"description":"Tunes the singularity criterion for sweep operations. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGSWEEP=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Tunes the general singularity criterion applied by the HPGENSELECT procedure in sweeps and inversions. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGULAR=*number*","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH=","OMETHOD=","OM="],"description":"Specifies the optimization technique for obtaining maximum likelihood estimates.","help":"TECHNIQUE=CONGRA | DBLDOG | NMSIMP | NEWRAP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Performs a conjugate-gradient optimization.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization.","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NEWRAP","description":"Performs a Newton-Raphson optimization with line search.","type":"standalone"},{"name":"NRRIDG","description":"Performs a Newton-Raphson optimization with ridging.","type":"standalone"},{"name":"QUANEW","description":"Performs a dual quasi-Newton optimization.","type":"standalone"},{"name":"TRUREG","description":"Performs a trust-region optimization","type":"standalone"},{"name":"NONE","description":"Performs no optimization.","type":"standalone"}]}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis. The CLASS statement must precede the MODEL statement. You can list the response variable for binary and multinomial models in the CLASS statement, but this is not necessary. The HPGENSELECT procedure additionally supports the following global-option in the CLASS statement: UPCASE uppercases the values of character-valued CLASS variables before levelizing them. For example, if the UPCASE option is in effect and a CLASS variable can take the values ‘a’, ‘A’, and ‘b’, then ‘a’ and ‘A’ represent the same level and the CLASS variable is treated as having only two values: ‘A’ and ‘B’.","help":"CLASS &lt;UPCASE&gt; ","arguments":[{"name":"UPCASE","optional":true,"followsDelimiter":"/","description":"Uppercases the values of character-valued CLASS variables before levelizing them. For example, if the UPCASE option is in effect and a CLASS variable can take the values ‘a’, ‘A’, and ‘b’, then ‘a’ and ‘A’ represent the same level and the CLASS variable is treated as having only two values: ‘A’ and ‘B’.","type":"standalone"}]},{"name":"CODE","description":"The CODE statement enables you to write SAS DATA step code for computing predicted values of the fitted model either to a file or to a catalog entry. This code can then be included in a DATA step to score new data.","help":"CODE &lt;CATALOG=library.catalog.entry.type&gt; &lt;DUMMIES&gt; &lt;NODUMMIES&gt; ...","arguments":[{"name":"CATALOG=","optional":true,"aliases":["CAT="],"description":"Syntax: CATALOG=library.catalog.entry.type CAT=library.catalog.entry.type Specifies where to write the generated code in the form of library.catalog.entry.type. The compound name can have from one to four levels. The default library is determined by the USER= SAS system option, which by default is WORK. The default entry is SASCODE, and the default type is SOURCE.","type":"value"},{"name":"DUMMIES","optional":true,"description":"Specifies to keep dummy variables that represent the CLASS levels in the data set. The default is NODUMMIES, which specifies that dummy variables not be retained.","type":"standalone"},{"name":"ERROR","optional":true,"description":"","type":"standalone"},{"name":"FILE=","optional":true,"description":"Names the external file that saves the generated code. When enclosed in a quoted string (for example, FILE=\"c:nmydirnscorecode.sas\"), this option specifies the path for writing the code to an external file. You can also specify unquoted SAS filenames of no more than eight characters for filename. If the filename is assigned as a fileref in a Base SAS FILENAME statement, the file specified in the FILENAME statement is opened. The special filerefs LOG and PRINT are always assigned. If the specified filename is not an assigned fileref, the specified value for filename is concatenated with a .txt extension before the file is opened. For example, if FOO is not an assigned fileref, FILE=FOO causes FOO.txt to be opened. If filename has more than eight characters, an error message is printed.","type":"value"},{"name":"FORMAT=","optional":true,"description":"Specifies the format for the regression coefficients and other numerical values that do not have a format from the input data set. The default format is BEST20.","help":"FORMAT=*format*","type":"value"},{"name":"GROUP=","optional":true,"description":"Specifies the group identifier for group processing. The group-name should be a valid SAS name of no more than 16 characters. It is used to construct array names and statement labels in the generated code.","help":"GROUP=*group-name*","type":"value"},{"name":"IMPUTE","optional":true,"description":"Imputes the predicted values according to an intercept-only model for observations with missing or invalid covariate values. For a continuous response, the predicted value is the mean of the response variable; for a categorical response, the predicted values are the proportions of the response categories. When the IMPUTE option is specified, the scoring code also creates a variable named _WARN_ that contains one or more single-character codes that indicate problems in computing predicted values. The character codes used in _WARN_ go in the following positions:","type":"standalone"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the line size for the generated code. The default is 72. The permissible range is 64 to 254.","type":"value"},{"name":"LOOKUP=","optional":true,"description":"Specifies the algorithm for looking up CLASS levels. The default is LOOKUP=AUTO.","help":"LOOKUP=AUTO | BINARY | LINEAR | SELECT*lookup-method*","type":"value","arguments":[{"name":"AUTO","description":"Selects the LINEAR algorithm if a CLASS variable has fewer than five categories; otherwise, the BINARY algorithm is used. This is the default.","type":"standalone"},{"name":"BINARY","description":"Uses a binary search. This method is fast, but might produce incorrect results and the normalized category values might contain characters that collate in different orders in ASCII and EBCDIC, if you generate the code on an ASCII machine and execute the code on an EBCDIC machine or vice versa.","type":"standalone"},{"name":"LINEAR","description":"Uses a linear search with IF statements that have categories in the order of the class levels. This method is slow if there are many categories.","type":"standalone"},{"name":"SELECT","description":"Uses a SELECT statement.","type":"standalone"}]},{"name":"NODUMMIES","optional":true,"description":"Specifies that dummy variables not be retained.","type":"standalone"},{"name":"NOERROR","optional":true,"description":"The default is NOERROR, which specifies that the error function not be generated.","type":"standalone"},{"name":"NORESIDUAL","optional":true,"description":"The default is NORESIDUAL, which specifies that the code for residuals not be generated.","type":"standalone"},{"name":"RESIDUAL","optional":true,"description":"Specifies to generate code to compute residual values. If you request code for residuals and then score a data set that does not contain target values, the residuals will have missing values. The default is NORESIDUAL, which specifies that the code for residuals not be generated.","type":"standalone"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence for each observation. High-Performance Analytics procedures that support the FREQ statement treat each observation as if it appeared f times, where the frequency value f is the value of the FREQ variable for the observation. If f is not an integer, then f is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable "},{"name":"ID","description":"The ID statement lists one or more variables from the input data set that are to be transferred to output data sets created by High-Performance Analytics procedures, provided that the output data set produces one (or more) records per input observation.","help":"ID variables "},{"name":"MODEL","description":"The MODEL statement defines the statistical model in terms of a response variable (the target) or an events/trials specification, model effects constructed from variables in the input data set, and options. An intercept is included in the model by default. You can remove the intercept with the NOINT option.","help":"MODEL &lt;DESCENDING&gt; &lt;EVENT=&gt; &lt;ORDER=&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that confidence intervals for each of the parameters be constructed with confidence level 1–number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that confidence limits be constructed for each of the parameter estimates. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"","type":"standalone"},{"name":"DISPERSION=","optional":true,"followsDelimiter":"/","aliases":["PHI="],"description":"Specifies a fixed dispersion parameter for those distributions that have a dispersion parameter. The dispersion parameter used in all computations is fixed at number, and not estimated.","help":"DISPERSION=*number*","type":"value"},{"name":"DISTRIBUTION=","optional":true,"followsDelimiter":"/","aliases":["DIST="],"description":"Specifies the response distribution for the model.","help":"DISTRIBUTION=BINARY | BINOMIAL | GAMMA | INVERSEGAUSSIAN | MULTINOMIAL | NEGATIVEBINOMIAL | NORMAL | POISSON | TWEEDIE | ZINB | ZIP","type":"choice","arguments":[{"name":"BINARY","followsDelimiter":"/","description":"Binary distribution","type":"standalone"},{"name":"BINOMIAL","followsDelimiter":"/","description":"Binomial distribution","type":"standalone"},{"name":"GAMMA","followsDelimiter":"/","description":"Gamma distribution","type":"standalone"},{"name":"INVERSEGAUSSIAN","followsDelimiter":"/","aliases":["IG"],"description":"Inverse Gaussian distribution","type":"standalone"},{"name":"MULTINOMIAL","followsDelimiter":"/","aliases":["MULT"],"description":"Multinomial distribution","type":"standalone"},{"name":"NEGATIVEBINOMIAL","followsDelimiter":"/","aliases":["NB"],"description":"Negative binomial distribution","type":"standalone"},{"name":"NORMAL","followsDelimiter":"/","aliases":["GAUSSIAN"],"description":"Normal distribution","type":"standalone"},{"name":"POISSON","followsDelimiter":"/","description":"Poisson distribution","type":"standalone"},{"name":"TWEEDIE","followsDelimiter":"/","description":"Tweedie distribution Syntax: TWEEDIE< (Tweedie options) > You can specify the following options for the Tweedie distribution: INITIALP= specifies a starting value for iterative estimation of the Tweedie power parameter. P= specifies a fixed Tweedie power parameter. SEED= specifies a seed for selecting a random sample of the data for computing starting values for Tweedie parameter estimation. TWEEDIEEQL | EQL requests that extended quasilikelihood be used instead of Tweedie log likelihood in parametrer estimation.","type":"standalone"},{"name":"ZINB","followsDelimiter":"/","description":"Zero-inflated negative binomial distribution","type":"standalone"},{"name":"ZIP","followsDelimiter":"/","description":"Zero-inflated Poisson distribution","type":"standalone"}]},{"name":"EVENT=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"INCLUDE=","optional":true,"followsDelimiter":"/","description":"Syntax: INCLUDE=n INCLUDE=single-effect INCLUDE=(effects) Forces effects to be included in all models. If you specify INCLUDE=n, then the first n effects that are listed in the MODEL statement are included in all models. If you specify INCLUDE=single-effect or if you specify a list of effects within parentheses, then the specified effects are forced into all models. The effects that you specify in the INCLUDE= option must be explanatory effects that are specified in the MODEL statement before the slash (/).","help":"INCLUDE=*n*","type":"value"},{"name":"INITIALPHI=","optional":true,"followsDelimiter":"/","description":"Specifies a starting value for iterative maximum likelihood estimation of the dispersion parameter for those distributions that have a dispersion parameter.","help":"INITIALPHI=*number*","type":"value"},{"name":"LINK=","optional":true,"followsDelimiter":"/","description":"Specifies the link function for the model.","help":"LINK=CLOGLOG | GLOGIT | IDENTITY | INV | INV2 | LOG | LOGIT | LOGLOG | PROBIT","type":"choice","arguments":[{"name":"CLOGLOG","followsDelimiter":"/","aliases":["CLL"],"description":"Complementary log-log function","type":"standalone"},{"name":"GLOGIT","followsDelimiter":"/","aliases":["GENLOGIT"],"description":"Generalized logit function","type":"standalone"},{"name":"IDENTITY","followsDelimiter":"/","aliases":["ID"],"description":"Identity function","type":"standalone"},{"name":"INV","followsDelimiter":"/","aliases":["RECIP"],"description":"Reciprocal function","type":"standalone"},{"name":"INV2","followsDelimiter":"/","description":"Reciprocal square function","type":"standalone"},{"name":"LOG","followsDelimiter":"/","description":"Logarithm function","type":"standalone"},{"name":"LOGIT","followsDelimiter":"/","description":"Logit function","type":"standalone"},{"name":"LOGLOG","followsDelimiter":"/","description":"Log-log function","type":"standalone"},{"name":"PROBIT","followsDelimiter":"/","description":"Probit function.","type":"standalone"}]},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept be included in the model. An intercept is included by default. The NOINT option is not available in multinomial models.","type":"standalone"},{"name":"OFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies a variable to be used as an offset to the linear predictor. An offset plays the role of an effect whose coefficient is known to be 1. The offset variable cannot appear in the CLASS statement or elsewhere in the MODEL statement. Observations with missing values for the offset variable are excluded from the analysis.","help":"OFFSET=*variable*","type":"value"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"REF=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"SAMPFRAC=","optional":true,"followsDelimiter":"/","description":"Specifies a fraction of the data to be used in determining starting values for iterative estimation of the parameters of a Tweedie model. The sampled data are used in an extended quasi-likelihood estimation of the model paramerters, which are then used as starting values in a full maximum likelihood estimation of the model parameters, using all of the data.","help":"SAMPFRAC=*number*","type":"value"},{"name":"START=","optional":true,"followsDelimiter":"/","description":"Syntax: START=n START=single-effect START=(effects) Begins the selection process from the designated initial model for the FORWARD and STEPWISE selection methods. If you specify START=n, then the starting model includes the first n effects that are listed in the MODEL statement. If you specify START=single-effect or if you specify a list of effects within parentheses, then the starting model includes those specified effects. The effects that you specify in the START= option must be explanatory effects that are specified in the MODEL statement before the slash (/). The START= option is not available when you specify METHOD=BACKWARD in the SELECTION statement.","help":"START=*n*","type":"value"}]},{"name":"OUTPUT","description":"however, variables specified in the ID statement are included.","help":"OUTPUT ADJPEARSON | ADJPEARS | STDRESCHI &lt; =name &gt; LINP | XBETA &lt; =name &gt; OUT=SAS-data-set ...","arguments":[{"name":"ADJPEARSON","aliases":["ADJPEARS","STDRESCHI"],"description":"Requests the Pearson residual, adjusted to have unit variance. This statistic is not computed for multinomial models, nor is it computed for zero-modified models.","type":"standalone"},{"name":"LINP","aliases":["XBETA"],"description":"Requests the linear predictor η = x'β.","type":"standalone"},{"name":"LOWER","description":"Requests a lower confidence limit for the predicted value. This statistic is not computed for generalized logit multinomial models.","type":"standalone"},{"name":"OUT=","aliases":["DATA="],"description":"Syntax: OUT=SAS-data-set DATA=SAS-data-set","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PEARSON","aliases":["PEARS","RESCHI"],"description":"Requests the Pearson residual, (y-μ)/V(μ), where μ is the estimate of the predicted response mean, and V is the response distribution variance function. This statistic is not computed for multinomial models.","type":"standalone"},{"name":"PREDICTED","aliases":["PRED"],"description":"Requests predicted values (predicted probabilities of events) for the response variable.","type":"standalone"},{"name":"RESIDUAL","aliases":["RESID"],"description":"Requests the raw residual, y - μ where μ is the estimate of the predicted event probability. This statistic is not computed for multinomial models.","type":"standalone"},{"name":"UPPER","description":"Requests an upper confidence limit for the predicted value. This statistic is not computed for generalized logit multinomial models.","type":"standalone"},{"name":"ZBETA","description":"Requests the linear predictor for the zeroes model in zero-modified models k = z'y.","type":"standalone"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"specifies the significance level for the construction of confidence intervals in the OUTPUT data set. The confidence level is 1 - number.","help":"ALPHA=*number*","type":"value"},{"name":"OBSCAT","optional":true,"followsDelimiter":"/","description":"Requests (for multinomial models) that observationwise statistics be produced for the response level only. If the OBSCAT option is not specified and the response variable has J levels, then the following outputs are created: for cumulative link models, J 􀀀 1 records are output for every observation in the input data that corresponds to the J 􀀀 1 lower-ordered response categories; for generalized logit models, J records are output that correspond to all J response categories.","type":"standalone"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables about the distributed computing environment, and requests detailed results about the performance characteristics of the HPGENSELECT procedure. With the PERFORMANCE statement you can also control whether the HPGENSELECT procedure executes in SMP or MPP mode.","help":"PERFORMANCE &lt;COMMIT=n&gt; &lt;CPUCOUNT=&lt;ACTUAL | &lt;num&gt;&gt;&gt; &lt;DATASERVER=“name”&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"Requests that the High-Performance Analytics procedure write periodic updates to the SAS Log when observations are sent from the client to the appliance for distributed processing.","help":"COMMIT=*n*","type":"value"},{"name":"CPUCOUNT=","optional":true,"description":"Specifies how many processors the procedure assumes are available on each host in the computing environment. num can be any integer from 1 to 256. CPUCOUNT=ACTUAL sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","help":"CPUCOUNT=ACTUAL | &lt;*num*&gt;","type":"choice","arguments":[{"name":"ACTUAL","description":"Sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","type":"standalone"},{"name":"num","placeholder":true,"description":"Replace <num> with an actual number. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","type":"standaloneOrValue"}]},{"name":"DATASERVER=","optional":true,"description":"Specifies the name of the server on Teradata systems as defined through the hosts file and as used in the LIBNAME statement for Teradata. For example, if the hosts file defines myservercop1 33.44.55.66 as the server for Teradata, then a LIBNAME specification would be as follows: libname TDLib teradata server=myserver user= password= database= ; A PERFORMANCE statement to induce running alongside the Teradata server would specify the following:","type":"value"},{"name":"DETAILS","optional":true,"description":"Requests a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"HOST=","optional":true,"aliases":["GRIDHOST="],"description":"Specifies the name of the appliance host in single or double quotes. If the HOST= option is specified, it overrides the value of the GRIDHOST environment variable.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"Specifies the directory in which the High-Performance Analytics shared libraries are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"Specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database.","type":"value"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, the number of threads are determined based on the number of CPUs on the host on which the analytic computations execute. The algorithm by which a CPU count is converted to a thread count is specific to the High- Performance Analytics procedure. Most procedures create one thread per CPU for the analytic computations. By default, High-Performance Analytics procedures execute in multiple concurrent threads unless turned off by the NOTHREADS system option or you force single-threaded execution with NTHREADS=1. The largest number that can be specified for n is 256. Individual High-Performance Analytics procedures can impose more stringent limits if called for by algorithmic considerations. You can affect the determination of the CPU count with the CPUCOUNT= option in the PERFORMANCE statement.","help":"NTHREADS=*n*","type":"value"},{"name":"TIMEOUT=","optional":true,"description":"Specifies the timeout in seconds for a High-Performance Analytics procedure to wait for a connection to the appliance and establish a connection back to the client. The default is s=120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the timeout value.","help":"TIMEOUT=*s*","type":"value"}]},{"name":"SELECTION","description":"The SELECTION statement performs model selection by examining whether effects should be added to or removed from the model according to rules defined by model selection methods.","help":"SELECTION &lt;DETAILS=&lt;SUMMARY | STEPS | ALL&gt;&gt; &lt;METHOD=&lt;NONE | FORWARD | BACKWARD&gt;... &gt; ","arguments":[{"name":"DETAILS=","optional":true,"description":"Specifies the level of detail about the selection process that is produced. The default is DETAILS= SUMMARY.","help":"DETAILS=SUMMARY | STEPS | ALL","type":"choice","arguments":[{"name":"SUMMARY","description":"Produces a summary table that shows the effect added or removed at each step along with the p-value. The summary table is produced by default if the DETAILS= option is not specified.","type":"standalone"},{"name":"STEPS","description":"Produces a detailed listing of all candidates at each step and their ranking in terms of the significance level for entry into or removal from the model and a table of selection details which displays fit statistics for the model at each step of the selection process and the approximate chi-square score statistic.","type":"standalone"},{"name":"ALL","description":"Produces the preceding two tables.","type":"standalone"}]},{"name":"METHOD=","optional":true,"aliases":["SELECTION="],"description":"Specifies the method used to select the model, optionally followed by parentheses enclosing options that are applicable to the specified method. The default selection method (when the METHOD= option is not specified) is METHOD=STEPWISE. method can be one of the following:","help":"METHOD=NONE | FORWARD | BACKWARD | STEPWISE","type":"choice","arguments":[{"name":"NONE","description":"Results in no model selection. This method fits the full model.","type":"standalone"},{"name":"FORWARD","description":"Performs forward selection. This method starts with no effects in the model and adds effects.","type":"standalone"},{"name":"BACKWARD","description":"Performs backward elimination. This method starts with all effects in the model and deletes effects.","type":"standalone"},{"name":"STEPWISE","description":"Performs stepwise regression. This method is similar to the FORWARD method except that effects already in the model do not necessarily stay there.","type":"standalone"}]}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations with nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, then all observations used in the analysis are assigned a weight of 1.","help":"WEIGHT variable "},{"name":"ZEROMODEL","description":"The ZEROMODEL statement defines the statistical model for zero inflation probability in terms of model effects constructed from variables in the input data set, and options. An intercept term is always included in the model.","help":"ZEROMODEL &lt;INCLUDE=n&gt; &lt;LINK=&lt;CLOGLOG|CLL | LOGIT | LOGLOG&gt;... &gt; &lt;START=n&gt; ...","arguments":[{"name":"INCLUDE=","optional":true,"followsDelimiter":"/","description":"Syntax: INCLUDE=n INCLUDE=single-effect INCLUDE=(effects)","help":"INCLUDE=*n*","type":"value"},{"name":"LINK=","optional":true,"followsDelimiter":"/","description":"Specifies the link function for the zero inflation probability.","help":"LINK=CLOGLOG | LOGIT | LOGLOG | PROBIT","type":"choice","arguments":[{"name":"CLOGLOG","followsDelimiter":"/","aliases":["CLL"],"description":"Complementary log-log function","type":"standalone"},{"name":"LOGIT","followsDelimiter":"/","description":"Logit function","type":"standalone"},{"name":"LOGLOG","followsDelimiter":"/","description":"Log-log function","type":"standalone"},{"name":"PROBIT","followsDelimiter":"/","description":"Probit function","type":"standalone"}]},{"name":"START=","optional":true,"followsDelimiter":"/","description":"Syntax: START=n START=single-effect START=(effects)","help":"START=*n*","type":"value"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_029","docsetTargetFile":"statug_hpgenselect_toc.htm"}}