{"name":"HPLOGISTIC","statements":[{"name":"PROC HPLOGISTIC","description":"The HPLOGISTIC procedure is a high-performance procedure that fits logistic regression models for binary, binomial, and multinomial data on the SAS appliance. † The HPLOGISTIC procedure fits logistic regression models in the broader sense; the procedure permits several link functions and can handle ordinal and nominal data with more than two response categories (multinomial data). † With the HPLOGISTIC procedure you can read and write data in distributed form and perform analyses in parallel in symmetric multiprocessing (SMP) or massively parallel processing (MPP) mode.","help":"PROC HPLOGISTIC <ABSCONV= | ABSTOL=r><ABSFCONV=r<n> | ABSFTOL=r<n>><ABSGCONV=r<n> | ABSGTOL=r<n>><ALPHA=number><DATA=SAS-data-set><FCONV=r | FTOL=r><FMTLIBXML=file-ref><GCONV=r | GTOL=r><ITDETAILS><ITSELECT><MAXFUNC=i | MAXFU=i><MAXITER= | MAXIT=i <n>><MAXTIME=r><MINITER= | MINIT=i><NAMELEN=number><NOCLPRINT< =number >><NOITPRINT><NOPRINT><NORMALIZE=YES | NO><NOSTDERR><SINGCHOL=number><SINGSWEEP=number><SINGULAR=number><TECHNIQUE=CONGRA | DBLDOG | NEWRAP... >;     \n\tCLASS <DESCENDING><ORDER=<DATA | FORMATTED | FREQ>... ><REF=<'category'; | FIRST | LAST>> ...;\n\tFREQ variable ;\n\tID variables ;\n\tMODEL <DESCENDING><EVENT=><ORDER=> ...;\n\tOUTPUT LINP|XBETA < =name > OUT=SAS-data-set | DATA=SAS-data-set PREDICTED|PRED|P < =name > ...;\n\tPERFORMANCE <COMMIT=n><CPUCOUNT=<ACTUAL | <num>>><DATASERVER=“name”> ...;\n\tSELECTION <DETAILS=<NONE | SUMMARY | ALL>... ><HIERARCHY=<NONE | SINGLE | SINGLECLASS>><METHOD=<NONE | FORWARD | BACKWARD>... > ...;\n\tWEIGHT variable;","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function difference convergence criterion.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies the absolute gradient convergence criterion. Termination requires the maximum absolute gradient element to be small.","type":"value"},{"name":"ALPHA=","optional":true,"description":"Specifies a global significance level for the construction of confidence intervals. The confidence level is 1 - number. You can override the global specification with the ALPHA= option in the MODEL statement.","help":"ALPHA=*number*","type":"value"},{"name":"DATA=","optional":true,"description":"Names the input SAS data set for PROC HPLOGISTIC to use. The default is the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies the relative function difference convergence criterion.","type":"value"},{"name":"FMTLIBXML=","optional":true,"description":"Specifies the file reference for the XML stream that contains the user-defined format definitions. Userdefined formats are handled differently in a distributed computing environment compared to other SAS products.","help":"FMTLIBXML=*file-ref*","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies the relative gradient convergence criterion.","type":"value"},{"name":"ITDETAILS","optional":true,"description":"Adds to the “Iteration History” table the current values of the parameter estimates and their gradients. These quantities are reported only for parameters that participate in the optimization. The ITDETAILS option is not available with model selection.","type":"standalone"},{"name":"ITSELECT","optional":true,"description":"Generates the “Iteration History” table when you perform a model selection.","type":"standalone"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Specifies the maximum number n of function calls in the optimization process. The default values are as follows, depending on the optimization technique:","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Specifies the maximum number n of iterations in the optimization process. The default values are as follows, depending on the optimization technique:","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies an upper limit of r seconds of CPU time for the optimization process. The default value is the largest floating-point double representation of your computer. Note that the time specified by the MAXTIME= option is checked only once at the end of each iteration. Therefore, the actual running time can be longer than that specified by the MAXTIME= option.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0. If you request more iterations than are actually needed for convergence to a stationary point, the optimization algorithms can behave strangely. For example, the effect of rounding errors can prevent the algorithm from continuing for the required number of iterations.","type":"value"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length to which long effect names are shortened. The default and minimum value is 20.","help":"NAMELEN=*number*","type":"value"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the “Class Level Information” table if you do not specify number. If you specify number, the values of the classification variables are displayed for only those variables whose number of levels is less than number. Specifying a number helps to reduce the size of the “Class Level Information” table if some classification variables have a large number of levels.","type":"standalone"},{"name":"NOITPRINT","optional":true,"description":"Suppresses the generation of the “Iteration History” table.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the generation of ODS output.","type":"standalone"},{"name":"NORMALIZE=","optional":true,"description":"Specifies whether the objective function should be normalized during the optimization by the reciprocal of the used frequency count. The default is to normalize the objective function. This option affects the values reported in the “Iteration History” table. The results reported in the “Fit Statistics” are always displayed for the nonnormalized log-likelihood function.","help":"NORMALIZE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"Specifies that the objective function should be normalized during the optimization by the reciprocal of the used frequency count. This is the default.","type":"standalone"},{"name":"NO","description":"Specifies that the objective function should not be normalized during the optimization by the reciprocal of the used frequency count.","type":"standalone"}]},{"name":"NOSTDERR","optional":true,"description":"Suppresses the computation of the covariance matrix and the standard errors of the logistic regression coefficients. When the model contains many variables (thousands), the inversion of the Hessian matrix to derive the covariance matrix and the standard errors of the regression coefficients can be time -consuming.","type":"standalone"},{"name":"SINGCHOL=","optional":true,"description":"Tunes the singularity criterion in Cholesky decompositions. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGCHOL=*number*","type":"value"},{"name":"SINGSWEEP=","optional":true,"description":"Tunes the singularity criterion for sweep operations. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGSWEEP=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Tunes the general singularity criterion applied by the HPLOGISTIC procedure in sweeps and inversions. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGULAR=*number*","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH="],"description":"Specifies the optimization technique to obtain maximum likelihood estimates.","help":"TECHNIQUE=CONGRA | DBLDOG | NEWRAP | NMSIMP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Chooses one of four different conjugate-gradient optimization algorithms, which can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization, which uses the gradient to update an approximation of the Cholesky factor of the Hessian.","type":"standalone"},{"name":"NEWRAP","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. The algorithm combines a line-search algorithm with ridging, and it can be modified with the LINESEARCH= option.","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NRRIDG","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. This algorithm does not perform a line search.","type":"standalone"},{"name":"QUANEW","description":"Chooses one of four different quasi-Newton optimization algorithms that can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"TRUREG","description":"Performs a usually very stable but, for large problems, memory- and time-consuming trust-region optimization technique. The algorithm is implemented similar to Gay (1983) and Moré and Sorensen (1983).","type":"standalone"},{"name":"NONE","description":"Does not perform any optimization. This option is similar to METHOD=NONE, but TECH=NONE also computes and displays residuals and goodness of fit statistics.","type":"standalone"}]}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis. If a CLASS statement is specified, it must precede the MODEL statement.","help":"CLASS &lt;DESCENDING&gt;&lt;ORDER=&lt;DATA | FORMATTED | FREQ&gt;... &gt;&lt;REF=&lt;'category'; | FIRST | LAST&gt;&gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sorting order of the classification variable. If both the DESCENDING and ORDER= options are specified, High-Performance Analytics procedures order the categories according to the ORDER= option and then reverse that order.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (“.”, “.A”, . . . , “.Z” for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sorting order for the levels of classification variables. This ordering determines which parameters in the model correspond to each level in the data.","help":"ORDER=DATA | FORMATTED | FREQ | FREQDATA | FREQFORMATTED | FREQINTERNAL | INTERNAL","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Levels sorted by the order of appearance in the input data set FORMATTED External formatted values, except for numeric.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"Levels sorted by the external formatted values, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) values","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Levels sorted by the descending frequency count (levels with more observations come earlier in the order)","type":"standalone"},{"name":"FREQDATA","followsDelimiter":"/","description":"Levels sorted by the order of descending frequency count, and within counts by order of appearance in the input data set when counts are tied","type":"standalone"},{"name":"FREQFORMATTED","followsDelimiter":"/","description":"Levels sorted by the order of descending frequency count, and within counts by formatted value when counts are tied","type":"standalone"},{"name":"FREQINTERNAL","followsDelimiter":"/","description":"Levels sorted by the Order of descending frequency count, and within counts by unformatted (internal) value when counts are tied","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Levels sorted by the unformatted value","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables. The GLM parameterization is the default.","help":"PARAM=GLM | REFERENCE","type":"choice","arguments":[{"name":"GLM","followsDelimiter":"/","description":"Less-than-full-rank reference cell coding. This parameterization is used in, for example, the GLM, MIXED, and GLIMMIX procedures in SAS/STAT.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","description":"Reference cell encoding. You can choose the reference value with a specific variable option in the CLASS statement, or designate the first or last ordered value with a globaloption. The default is REF=LAST.","type":"standalone"}]},{"name":"REF=","optional":true,"followsDelimiter":"/","aliases":["REFERENCE="],"description":"Specifies the reference level for PARAM=REFERENCE. For an individual (but not a global) variable REF= option, you can specify the level of the variable to use as the reference level. Specify the formatted value of the variable if a format is assigned. For a REF= option or global-option, you can use one of the following keywords. The default is REF=LAST.","help":"REF='category'; | FIRST | LAST","type":"choice","arguments":[{"name":"'category';","followsDelimiter":"/","description":"You can specify the value (formatted if a format is applied) of the reference category in quotes.","type":"standalone"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first-ordered category as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last-ordered category as reference. This is the default.","type":"standalone"}]},{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies the truncation width of formatted values of CLASS variables when the optional n is specified. If n is not specified, the TRUNCATE option requests that classification levels should be determined using no more than the first 16 characters of the formatted values of CLASS variables. When formatted values are longer than 16 characters, you can use this option in order to revert to the levels as determined in releases prior to SAS 9.","type":"standalone"},{"name":"UPCASE","optional":true,"followsDelimiter":"/","description":"Uppercases the values of character-valued CLASS variables before levelizing them. For example, if the UPCASE option is in effect and a CLASS variable can take the values ‘a’, ‘A’, and ‘b’, then ‘a’ and ‘A’ represent the same level and the CLASS variable is treated as having only two values: ‘A’ and ‘B’.","type":"standalone"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence for each observation. SAS High-Performance Analytics procedures that support the FREQ statement treat each observation as if it appeared f times, where f is the value of the FREQ variable for the observation. If the frequency value is not an integer, it is truncated to an integer. If the frequency value is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable "},{"name":"ID","description":"The ID statement lists one or more variables from the input data set that are transferred to output data sets created by High-Performance Analytics procedures, provided that the output data set contains one (or more) records per input observation. For example, when an OUTPUT statement is used to produce observationwise scores or prediction statistics, ID variables are added to the output data set. By default, High-Performance Analytics procedures do not include all variables from the input data set in output data sets.","help":"ID variables "},{"name":"MODEL","description":"The MODEL statement defines the statistical model in terms of a response variable (the target) or an events/trials specification, model effects constructed from variables in the input data set, and options. An intercept is included in the model by default. You can remove the intercept with the NOINT option. You can specify a single response variable that contains your binary, ordinal, or nominal response values. When you have binomial data, you can specify the events/trials form of the response, where one variable contains the number of positive responses (or events) and another variable contains the number of trials. Note that the values of both events and (trials – events) must be nonnegative and the value of trials must be positive. There are two sets of options in the MODEL statement. The response-options determine how the HPLOGISTIC procedure models probabilities for binary data. The model-options control other aspects of model formation and inference. Response Variable Options DESCENDING reverses the response categories EVENT=’category’|FIRST|LAST specifies the event category ORDER=DATA|FORMATTED|FREQ|INTERNAL specifies the sort order REF= specifies the reference category","help":"MODEL &lt;DESCENDING&gt;&lt;EVENT=&gt;&lt;ORDER=&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that confidence intervals for each of the parameters be constructed with confidence level 1–number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that confidence limits be constructed for each of the parameter estimates. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"DDFM=","optional":true,"followsDelimiter":"/","description":"Specifies how degrees of freedom for statistical inference be determined in the “Parameter Estimates Table.”","help":"DDFM=RESIDUAL | NONE","type":"choice","arguments":[{"name":"RESIDUAL","followsDelimiter":"/","description":"If you specify DDFM=RESIDUAL, the degrees of freedom are finite and determined by the number of usable frequencies (observations) minus the number of nonredundant model parameters. This leads to t-based statistical tests and confidence intervals. If the number of frequencies is large relative to the number of parameters, the inferences from the two degrees-of-freedom methods are almost identical.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"This is the default, which leads to z-based statistical tests and confidence intervals. The HPLOGISTIC procedure then displays the degrees of freedom in the DF column as Infty, the p-values are identical to those from a Wald chi-square test, and the square of the t value equals the Wald chisquare statistic.","type":"standalone"}]},{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"","type":"standalone"},{"name":"EVENT=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"INCLUDE=","optional":true,"followsDelimiter":"/","description":"Syntax: INCLUDE=n INCLUDE=single-effect INCLUDE=(effects) Forces effects to be included in all models. If you specify INCLUDE=n, then the first n effects that are listed in the MODEL statement are included in all models. If you specify INCLUDE=single-effect or if you specify a list of effects within parentheses, then the specified effects are forced into all models. The effects that you specify in the INCLUDE= option must be explanatory effects that are specified in the MODEL statement before the slash (/).","help":"INCLUDE=*n*","type":"value"},{"name":"LACKFIT=","optional":true,"followsDelimiter":"/","description":"Performs the Hosmer and Lemeshow goodness-of-fit test (Hosmer and Lemeshow 2000) for binary response models.","help":"LACKFIT=DFREDUCE= | NGROUPS=","type":"choice","arguments":[{"name":"DFREDUCE=","type":"value"},{"name":"NGROUPS=","type":"value"}]},{"name":"LINK=","optional":true,"followsDelimiter":"/","aliases":["L="],"description":"Specifies the link function for the model.","help":"LINK=CLOGLOG | GLOGIT | LOGIT | LOGLOG | PROBIT","type":"choice","arguments":[{"name":"CLOGLOG","followsDelimiter":"/","aliases":["CLL"],"description":"Complementary log-log function","type":"standalone"},{"name":"GLOGIT","followsDelimiter":"/","aliases":["GENLOGIT"],"description":"Generalized logit function","type":"standalone"},{"name":"LOGIT","followsDelimiter":"/","description":"Logit function","type":"standalone"},{"name":"LOGLOG","followsDelimiter":"/","description":"Log-log function","type":"standalone"},{"name":"PROBIT","followsDelimiter":"/","description":"Probit function.","type":"standalone"}]},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept be included in the model. An intercept is included by default. The NOINT option is not available in multinomial models.","type":"standalone"},{"name":"OFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies a variable to be used as an offset to the linear predictor. An offset plays the role of an effect whose coefficient is known to be 1. The offset variable cannot appear in the CLASS statement or elsewhere in the MODEL statement. Observations with missing values for the offset variable are excluded from the analysis.","help":"OFFSET=*variable*","type":"value"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"REF=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"RSQUARE","optional":true,"followsDelimiter":"/","aliases":["R2"],"description":"Requests a generalized coefficient of determination (R square) and a scaled version thereof for the fitted model. The results are added to the “Fit Statistics” table.","type":"standalone"},{"name":"START=","optional":true,"followsDelimiter":"/","description":"Syntax: START=n START=single-effect START=(effects) Begins the selection process from the designated initial model for the FORWARD and STEPWISE selection methods. If you specify START=n, then the starting model includes the first n effects that are listed in the MODEL statement. If you specify START=single-effect or if you specify a list of effects within parentheses, then the starting model includes those specified effects. The effects that you specify in the START= option must be explanatory effects that are specified in the MODEL statement before the slash (/). The START= option is not available when you specify METHOD=BACKWARD in the SELECTION statement.","help":"START=*n*","type":"value"}]},{"name":"OUTPUT","description":"","help":"OUTPUT LINP|XBETA &lt; =name &gt; OUT=SAS-data-set | DATA=SAS-data-set PREDICTED|PRED|P &lt; =name &gt; ...","arguments":[{"name":"LINP","aliases":["XBETA"],"description":"Requests the linear predictor Ƞ=x’β.","type":"standalone"},{"name":"OUT=","aliases":["DATA="],"description":"Specifies the name of the output data set. If the OUT= (or DATA=) option is omitted, the procedure uses the DATAn convention to name the output data set.","type":"value"},{"name":"PEARSON","aliases":["PEARS","RESCHI"],"description":"Requests the Pearson residual.","type":"standalone"},{"name":"PREDICTED","aliases":["PRED"],"description":"Requests predicted values (predicted probabilities of events) for the response variable.","type":"standalone"},{"name":"RESIDUAL","aliases":["RESID"],"description":"Requests the raw residual, y - μ, where μ is the estimate of the predicted event probability. This statistic is not computed for multinomial models.","type":"standalone"},{"name":"OBSCAT","optional":true,"description":"Requests (for multinomial models) that observationwise statistics be produced for the response level only. If the OBSCAT option is not specified and the response variable has J levels, then the following outputs are created: for cumulative link models, J - 1 records are output for every observation in the input data that corresponds to the J - 1 lower-ordered response categories; for generalized logit models, J records are output that correspond to all J response categories.","type":"standalone"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables about the distributed computing environment, and requests detailed results about the performance characteristics of a High-Performance Analytics procedure. With the PERFORMANCE statement, you can also control whether the HPLOGISTIC procedure executes in SMP or MPP mode.","help":"PERFORMANCE &lt;COMMIT=n&gt;&lt;CPUCOUNT=&lt;ACTUAL | &lt;num&gt;&gt;&gt;&lt;DATASERVER=“name”&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"Requests that the High-Performance Analytics procedure write periodic updates to the SAS Log when observations are sent from the client to the appliance for distributed processing.","help":"COMMIT=*n*","type":"value"},{"name":"CPUCOUNT=","optional":true,"description":"Specifies how many processors the procedure assumes are available on each host in the computing environment. num can be any integer from 1 to 256. CPUCOUNT=ACTUAL sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","help":"CPUCOUNT=ACTUAL | &lt;*num*&gt;","type":"choice","arguments":[{"name":"ACTUAL","description":"Sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","type":"standalone"},{"name":"num","placeholder":true,"description":"Replace <num> with an actual number. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","type":"standaloneOrValue"}]},{"name":"DATASERVER=","optional":true,"description":"Specifies the name of the server on Teradata systems as defined through the hosts file and as used in the LIBNAME statement for Teradata. For example, if the hosts file defines myservercop1 33.44.55.66 as the server for Teradata, then a LIBNAME specification would be as follows: libname TDLib teradata server=myserver user= password= database= ; A PERFORMANCE statement to induce running alongside the Teradata server would specify the following:","type":"value"},{"name":"DETAILS","optional":true,"description":"Requests a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"HOST=","optional":true,"aliases":["GRIDHOST="],"description":"Specifies the name of the appliance host in single or double quotes. If the HOST= option is specified, it overrides the value of the GRIDHOST environment variable.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"Specifies the directory in which the High-Performance Analytics shared libraries are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"Specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database.","type":"value"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, the number of threads are determined based on the number of CPUs on the host on which the analytic computations execute. The algorithm by which a CPU count is converted to a thread count is specific to the High- Performance Analytics procedure. Most procedures create one thread per CPU for the analytic computations. By default, High-Performance Analytics procedures execute in multiple concurrent threads unless turned off by the NOTHREADS system option or you force single-threaded execution with NTHREADS=1. The largest number that can be specified for n is 256. Individual High-Performance Analytics procedures can impose more stringent limits if called for by algorithmic considerations. You can affect the determination of the CPU count with the CPUCOUNT= option in the PERFORMANCE statement.","help":"NTHREADS=*n*","type":"value"},{"name":"TIMEOUT=","optional":true,"description":"Specifies the timeout in seconds for a High-Performance Analytics procedure to wait for a connection to the appliance and establish a connection back to the client. The default is s=120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the timeout value.","help":"TIMEOUT=*s*","type":"value"}]},{"name":"SELECTION","description":"The SELECTION statement performs model selection by examining whether effects should be added to or removed from the model according to rules defined by model selection methods.","help":"SELECTION &lt;DETAILS=&lt;NONE | SUMMARY | ALL&gt;... &gt;&lt;HIERARCHY=&lt;NONE | SINGLE | SINGLECLASS&gt;&gt;&lt;METHOD=&lt;NONE | FORWARD | BACKWARD&gt;... &gt; ...","arguments":[{"name":"DETAILS=","optional":true,"description":"Specifies the level of detail about the selection process that is produced. The default is DETAILS= SUMMARY. The DETAILS=ALL and DETAILS=STEPS options produce the following output:","help":"DETAILS=NONE | SUMMARY | ALL | STEPS","type":"choice","arguments":[{"name":"NONE","description":"Produces no detail about the selection process that is produced.","type":"standalone"},{"name":"SUMMARY","description":"Produces only the selection summary, stop reason, selection reason, and selected effects tables.","type":"standalone"},{"name":"ALL","description":"The DETAILS=ALL option produces the following output: o tables that provide information about the model selected at each step of the selection process. o entry and removal statistics for inclusion or exclusion candidates at each step. By default, only the top 10 candidates at each step are shown. If you specify STEPS(CANDIDATES(n)), then the best n candidates are shown. If you specify STEPS(CANDIDATES(ALL)), then all candidates are shown. o a selection summary table that shows by step the effect that is added to or removed from the model in addition to the values of the SELECT, STOP, and CHOOSE criteria for the resulting model. o a stop reason table that describes why the selection process stopped. o a selection reason table that describes why the selected model was chosen. o a selected effects table that lists the effects that are in the selected model.","type":"standalone"},{"name":"STEPS","description":"Syntax: DETAILS=STEPS< CANDIDATES(ALL | n) > This option produces the following output: o tables that provide information about the model selected at each step of the selection process. o entry and removal statistics for inclusion or exclusion candidates at each step. By default, only the top 10 candidates at each step are shown. If you specify STEPS(CANDIDATES(n)), then the best n candidates are shown. If you specify STEPS(CANDIDATES(ALL)), then all candidates are shown. o a selection summary table that shows by step the effect that is added to or removed from the model in addition to the values of the SELECT, STOP, and CHOOSE criteria for the resulting model. o a stop reason table that describes why the selection process stopped. o a selection reason table that describes why the selected model was chosen. o a selected effects table that lists the effects that are in the selected model.","type":"standalone"}]},{"name":"HIERARCHY=","optional":true,"description":"Specifies whether and how the model hierarchy requirement is applied. This option also controls whether a single effect or multiple effects are allowed to enter or leave the model in one step. You can specify that only classification effects, or both classification and continuous effects, be subject to the hierarchy requirement. The HIERARCHY= option is ignored unless you also specify one of the following options: METHOD=FORWARD, METHOD=BACKWARD, or METHOD=STEPWISE.","help":"HIERARCHY=NONE | SINGLE | SINGLECLASS","type":"choice","arguments":[{"name":"NONE","description":"Specifies that model hierarchy not be maintained. Any single effect can enter or leave the model at any given step of the selection process. This is the default.","type":"standalone"},{"name":"SINGLE","description":"Specifies that only one effect enter or leave the model at one time, subject to the model hierarchy requirement. For example, suppose that the model contains the main effects A and B and the interaction A*B. In the first step of the selection process, either A or B can enter the model. In the second step, the other main effect can enter the model. The interaction effect can enter the model only when both main effects have already entered. Also, before A or B can be removed from the model, the A*B interaction must first be removed. All effects (CLASS and interval) are subject to the hierarchy requirement.","type":"standalone"},{"name":"SINGLECLASS","description":"Is the same as HIERARCHY=SINGLE except that only CLASS effects are subject to the hierarchy requirement.","type":"standalone"}]},{"name":"METHOD=","optional":true,"aliases":["SELECTION="],"description":"Specifies the method used to select the model, optionally followed by parentheses enclosing options that are applicable to the specified method. The default selection method (when the METHOD= option is not specified) is METHOD=STEPWISE. method can be one of the following:","help":"METHOD=NONE | FORWARD | BACKWARD | STEPWISE | LAR | LASSO","type":"choice","arguments":[{"name":"NONE","description":"Specifies no model selection.","type":"standalone"},{"name":"FORWARD","description":"Specifies forward selection. This method starts with no effects in the model and adds effects.","type":"standalone"},{"name":"BACKWARD","description":"Specifies backward elimination. This method starts with all effects in the model and deletes effects.","type":"standalone"},{"name":"STEPWISE","description":"Specifies stepwise regression. This method is similar to the FORWARD method except that effects already in the model do not necessarily stay there.","type":"standalone"},{"name":"LAR","description":"Adding effects to an empty model. The parameter estimates at any step are “shrunk” when compared to the corresponding least squares estimates. If the model contains classification variables, then these classification variables are split.","type":"standalone"},{"name":"LASSO","description":"Adds and deletes parameters based on a version of ordinary least squares where the sum of the absolute regression coefficients is constrained. If the model contains classification variables, then these classification variables are split.","type":"standalone"}]},{"name":"STOPHORIZON=","optional":true,"description":"Specifies the number of consecutive steps at which the STOP= criterion must worsen for a local extremum to be detected. The default value is STOPHORIZON=3. The stop horizon value is ignored if you also specify STOP=NONE or STOP=SL. For example, suppose that STOP=AIC and the sequence of AIC values at steps 1 to 6 of a selection are 10, 7, 4, 6, 5, 2. If STOPHORIZON=2, then the AIC criterion is deemed to have a local minimum at step 3 because the AIC value at the next two steps are greater than the value of 4 that occurs at step 3. However, if STOPHORIZON=3, then the value of step 3 is not deemed to be a local minimum because the AIC value at step 6 is lower than the AIC value at step 3.","help":"STOPHORIZON=*n*","type":"value"}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations with nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, all observations used in the analysis are assigned a weight of 1.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"latest","docsetTargetFile":"statug_hplogistic_toc.htm"}}