{"name":"HPMIXED","statements":[{"name":"PROC HPMIXED","description":"The HPMIXED procedure uses a number of specialized high-performance techniques to fit linear mixed models with variance component structure. The HPMIXED procedure is specifically designed to cope with estimation problems involving a large number of fixed effects, a large number of random effects, or a large number of observations. † The HPMIXED procedure complements the MIXED procedure and other SAS/STAT procedures for mixed modeling. On the one hand, the models supported by the HPMIXED procedure are a subset of the models that you can fit with the MIXED procedure, and the confirmatory inferences available in the HPMIXED procedure are also a subset of the general analyses available with the MIXED procedure. On the other hand, the HPMIXED procedure can have considerably better performance than other SAS/STAT mixed modeling tools, in terms of memory requirements and computational speed.","help":"PROC HPMIXED <DATA=SAS-data-set> <INFOCRIT=NONE | PQ | Q> <ITDETAILS> <MAXCLPRINT=number> <METHOD=REML> <MMEQ> <NAMELEN=number> <NOCLPRINT<=number>> <NOFIT> <NOINFO> <NOITPRINT> <NOPRINT> <NOPROFILE> <ORDER=DATA | FORMATTED | FREQ... > <SINGCHOL=number> <SINGRES=number> <SINGULAR=number>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <TRUNCATE> ; \n   \n\tCONTRAST <CHISQ> <DF=number> <E> ...; \n   \n\tEFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tESTIMATE <ALPHA=number> <CL> <DIVISOR=number> ...; \n   \n\tID variables ;     \n\tLSMEANS <CL> <COV> <E> ...; \n   \n\tMODEL <ALPHA=number> <CL> <DDF=value-list> ...; \n   \n\tNLOPTIONS <ABSCONV= | ABSTOL=r> <ABSFCONV=r <n> | ABSFTOL=r<n>> <ABSGCONV= | ABSGTOL=r <n>> ...;     \n\tOUTPUT OUT=SAS-data-set PREDICTED= STDERR= ...;     \n\tPARMS <HOLD=value-list> <NOITER> <PARMSDATA=SAS-data-set> ...; \n   \n\tRANDOM <ALPHA=number> <CL> <GROUP=effect> ...; \n   \n\tREPEATED <GROUP=effect> <R<=value-list>> <RC<=value-list>> ...; \n   \n\tTEST <CHISQ> <E> <HTYPE=value-list> ...; \n   \n\tWEIGHT variable; ","arguments":[{"name":"DATA=","optional":true,"description":"Names the SAS data set to be used by PROC HPMIXED. The default is the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"INFOCRIT=","optional":true,"aliases":["IC="],"description":"Determines the computation of information criteria in the \"Fit Statistics\" table.","help":"INFOCRIT=NONE | PQ | Q","type":"choice","arguments":[{"name":"NONE","description":"Suppresses the \"Fit Statistics\" table.","type":"standalone"},{"name":"PQ","description":"For models with random effects, the number of parameters in the optimization whose solutions do not fall on the boundary or are otherwise constrained is incremented by rank(X).","type":"standalone"},{"name":"Q","description":"IC=Q is the default.","type":"standalone"}]},{"name":"ITDETAILS","optional":true,"description":"Specifies the maximum levels of CLASS variables to print in the ODS table \"ClassLevels.\"","type":"standalone"},{"name":"MAXCLPRINT=","optional":true,"description":"Specifies the maximum levels of CLASS variables to print in the ODS table \"ClassLevels.\" The default value is 20. MAXCLPRINT=0 enables you to print all levels of each CLASS variable.","help":"MAXCLPRINT=*number*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the estimation method for the covariance parameters. There is no other choice at this experimental stage.","help":"METHOD=REML","type":"choice","arguments":[{"name":"REML","description":"The REML specification performs residual (restricted) maximum likelihood, and it is the default method.","type":"standalone"}]},{"name":"MMEQ","optional":true,"description":"Displays coefficients of the mixed model equations.","type":"standalone"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length to which long effect names are shortened. The default and minimum value is 20.","help":"NAMELEN=*number*","type":"value"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the \"Class Level Information\" table if you do not specify number. If you do specify number, only levels with totals that are less than number are listed in the table.","type":"standalone"},{"name":"NOFIT","optional":true,"description":"Suppresses fitting of the model. When the NOFIT option is in effect, PROC HPMIXED produces the \"Model Information,\" \"Class Level Information,\" \"Number of Observations,\" \"Dimensions,\" and \"Descriptive Statistics\" tables.","type":"standalone"},{"name":"NOINFO","optional":true,"description":"Suppresses the display of the \"Model Information,\" \"Number of Observations,\" and \"Dimensions\" tables.","type":"standalone"},{"name":"NOITPRINT","optional":true,"description":"Suppresses the display of the \"Iteration History\" table.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results.","type":"standalone"},{"name":"NOPROFILE","optional":true,"description":"Includes the residual variance as one of the covariance parameters in the optimization iterations.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the sorting order for the levels of all CLASS variables. The default is ORDER=FORMATTED.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels sorted by the unformatted value.","type":"standalone"}]},{"name":"SINGCHOL=","optional":true,"description":"Tunes the singularity criterion in Cholesky decompositions. The default is 1E6 times the machine epsilon; this product is approximately 1E-10 on most computers.","help":"SINGCHOL=*number*","type":"value"},{"name":"SINGRES=","optional":true,"description":"Sets the tolerance for which the residual variance is considered to be zero. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGRES=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Tunes the general singularity criterion applied by the HPMIXED procedure in divisions and inversions. The default is 1E4 times the machine epsilon; this product is approximately 1E-12 on most computers.","help":"SINGULAR=*number*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC HPMIXED to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the model. If you specify the CLASS statement, it must appear before the MODEL statement.","help":"CLASS &lt;TRUNCATE&gt; ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined by using no more than the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"CONTRAST","description":"The CONTRAST statement provides a mechanism for obtaining custom hypothesis tests.","help":"CONTRAST &lt;CHISQ&gt; &lt;DF=number&gt; &lt;E&gt; ...","arguments":[{"name":"CHISQ","optional":true,"followsDelimiter":"/","description":"Requests that chi-square tests be performed in addition to any F tests.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the denominator degrees of freedom for the F test.","help":"DF=*number*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the contrast be displayed.","type":"standalone"},{"name":"GROUP","optional":true,"followsDelimiter":"/","description":"Sets up random-effect contrasts between different groups when a GROUP variable appears in the RANDOM statement.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"},{"name":"SUBJECT","optional":true,"followsDelimiter":"/","description":"Sets up random-effect contrasts between different subjects when a SUBJECT= variable appears in the RANDOM statement.","type":"standalone"}]},{"name":"EFFECT","description":"The name of the effect is specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. The effect-type is specified after an equal sign, followed by a list of variables within parentheses which are used in constructing the effect. Effect-options that are specific to an effect-type can be specified after a slash (/) following the variable list. The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects formed from continuous or classification variables.","help":"EFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"EFFECT-NAME=","placeholder":true,"description":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. These values can be used: COLLECTION, LAG, MULTIMEMBER, POLYNOMIAL, or SPLINE.","type":"value"},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"ESTIMATE","description":"The ESTIMATE statement provides a mechanism for obtaining custom hypothesis tests.","help":"ESTIMATE &lt;ALPHA=number&gt; &lt;CL&gt; &lt;DIVISOR=number&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1 exclusively; the default is 0.05.","type":"value"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed. If DDFM=NONE and you do not specify degrees of freedom with the DF= option, PROC HPMIXED uses infinite degrees of freedom, essentially computing a z interval. The confidence level is 0.95 by default.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t-test.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a value by which to divide all coefficients so that fractional coefficients can be entered as integer numerators.","help":"DIVISOR=*number*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L matrix coefficients be displayed.","type":"standalone"},{"name":"GROUP","optional":true,"description":"Sets up random-effect contrasts between different groups when a GROUP variable appears in the RANDOM statement.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"},{"name":"SUBJECT","optional":true,"description":"Sets up random-effect estimates between different subjects when a SUBJECT= variable appears in the RANDOM statement.","type":"standalone"}]},{"name":"ID","description":"The ID statement specifies which variables from the input data set are to be included in the OUT= data sets from the OUTPUT statement. If you do not specify an ID statement, then all variables are included in these data sets.","help":"ID variables "},{"name":"LSMEANS","description":"The LSMEANS statement computes least squares means (LS-means) of fixed effects.","help":"LSMEANS &lt;CL&gt; &lt;COV&gt; &lt;E&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L coefficients for all LSMEANS effects be displayed.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"}]},{"name":"MODEL","description":"The MODEL statement names a single dependent variable and the fixed effects, which determine the X matrix of the mixed model.","help":"MODEL &lt;ALPHA=number&gt; &lt;CL&gt; &lt;DDF=value-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the fixed-effects parameters with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the fixed-effects parameter estimates.","type":"standalone"},{"name":"DDF=","optional":true,"followsDelimiter":"/","description":"Enables you to specify your own denominator degrees of freedom for the fixed effects.","help":"DDF=*value-list*","type":"value"},{"name":"DDFM=","optional":true,"followsDelimiter":"/","description":"Specifies the method for computing the denominator degrees of freedom for the tests of fixed effects resulting from the MODEL, CONTRAST, ESTIMATE, LSMEANS, and TEST statements.","help":"DDFM=RESIDUAL | NONE","type":"choice","arguments":[{"name":"RESIDUAL","followsDelimiter":"/","description":"Performs all tests by using the residual degrees of freedom, n-rank(X), where n is the number of observations used.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no denominator degrees of freedom be applied.","type":"standalone"}]},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept be included in the model. An intercept is included by default.","type":"standalone"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Requests that a solution for the fixed-effects parameters be produced.","type":"standalone"},{"name":"ZETA=","optional":true,"followsDelimiter":"/","description":"Tunes the sensitivity in forming Type III functions.","help":"ZETA=*number*","type":"value"}]},{"name":"NLOPTIONS","description":"You can control the optimization of nonlinear parameters through options in this NLOPTIONS statement.","help":"NLOPTIONS &lt;ABSCONV= | ABSTOL=r&gt; &lt;ABSFCONV=r &lt;n&gt; | ABSFTOL=r&lt;n&gt;&gt; &lt;ABSGCONV= | ABSGTOL=r &lt;n&gt;&gt; ...","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function convergence criterion.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. Termination requires the maximum absolute gradient element to be small.","type":"value"},{"name":"ABSXCONV=","optional":true,"aliases":["ABSXTOL="],"description":"Specifies the absolute parameter convergence criterion. Termination requires a small Euclidean distance between successive parameter vectors.","type":"value"},{"name":"ASINGULAR=","optional":true,"aliases":["ASING="],"description":"Specifies an absolute singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"DAMPSTEP=","optional":true,"aliases":["DS="],"description":"Specifies that the initial step-size value a⁰ for each line search (used by the QUANEW, CONGRA, or NEWRAP technique) cannot be larger than r times the step-size value used in the former iteration.","type":"value"},{"name":"FCONV2=","optional":true,"aliases":["FTOL2="],"description":"Specifies a second function convergence criterion.","type":"value"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies the relative function convergence criterion.","type":"value"},{"name":"FSIZE=","optional":true,"description":"Specifies the FSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"FSIZE=*r*","type":"value"},{"name":"GCONV2=","optional":true,"description":"Specifies another relative gradient convergence criterion.","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies the relative gradient convergence criterion.","type":"value"},{"name":"HESCAL=","optional":true,"aliases":["HS="],"description":"Specifies the scaling version of the Hessian or crossproduct Jacobian matrix used in NRRIDG, TRUREG, LEVMAR, NEWRAP, or DBLDOG optimization.","help":"HESCAL=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","description":"Specifies that no scaling is done.","type":"standalone"},{"name":"1","description":"Specifies the Moré (1978) scaling update","type":"standalone"},{"name":"2","description":"Specifies the Dennis, Gay, and Welsch (1981) scaling update","type":"standalone"},{"name":"3","description":"Specifies that di is reset in each iteration","type":"standalone"}]},{"name":"INHESSIAN=","optional":true,"description":"Specifies how the initial estimate of the approximate Hessian is defined for the quasi-Newton techniques QUANEW and DBLDOG.","type":"value"},{"name":"INSTEP=","optional":true,"aliases":["SALPHA=","RADIUS="],"description":"Reduces the length of the first trial step during the line search of the first iterations.","help":"INSTEP=*r*","type":"value"},{"name":"LCDEACT=","optional":true,"aliases":["LCD="],"description":"Specifies a threshold r for the Lagrange multiplier that decides whether an active inequality constraint remains active or can be deactivated.","type":"value"},{"name":"LCEPSILON=","optional":true,"aliases":["LCEPS=","LCE="],"description":"Specifies the range r, r ≥ 0, for active and violated boundary and linear constraints.","type":"value"},{"name":"LCSINGULAR=","optional":true,"aliases":["LCSING=","LCS="],"description":"Specifies a criterion r, r ≥ 0, used in the update of the QR decomposition that decides whether an active constraint is linearly dependent on a set of other active constraints.","type":"value"},{"name":"LINESEARCH=","optional":true,"aliases":["LIS=","SMETHOD=","SM="],"description":"Specifies the line-search method for the CONGRA, QUANEW, and NEWRAP optimization techniques.","help":"LINESEARCH=1 | 2 | 3 | 4 | 5 | 6 | 7 | 8","type":"choice","arguments":[{"name":"1","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is similar to one used by the Harwell subroutine library.","type":"standalone"},{"name":"2","description":"Specifies a line-search method that needs more function calls than gradient calls for quadratic and cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"3","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"4","description":"Specifies a line-search method that needs the same number of function and gradient calls for stepwise extrapolation and cubic interpolation","type":"standalone"},{"name":"5","description":"Specifies a line-search method that is a modified version of LIS=4.","type":"standalone"},{"name":"6","description":"Specifies golden section line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"7","description":"Specifies bisection line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"8","description":"Specifies Armijo line-search technique (Polak 1971), which uses only function values for linear approximation.","type":"standalone"}]},{"name":"LSPRECISION=","optional":true,"aliases":["LSP=","SPRECISION=","SP="],"description":"Specifies the degree of accuracy that should be obtained by the line-search algorithms LIS=2 and LIS=3. The default LSPRECISION= values are:","type":"value"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Requires the number of function calls to be no larger than i. The default values are:","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Requires the number of iterations to be no larger than i. The default values are:","type":"value"},{"name":"MAXSTEP=","optional":true,"description":"Specifies an upper bound for the step length of the line-search algorithms during the first n iterations.","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Requires the CPU time to be no larger than r. The default value of the MAXTIME= option is the largest double floating-point number on your computer.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0.","type":"value"},{"name":"MSINGULAR=","optional":true,"aliases":["MSING="],"description":"Specifies a relative singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses output related to optimization such as the iteration history.","type":"standalone"},{"name":"PALL","optional":true,"aliases":["ALL"],"description":"[Displays information about the starting values and final values of the optimization process.","type":"standalone"},{"name":"PHISTORY","optional":true,"aliases":["PHIS"],"description":"Displays the optimization history. The PHISTORY option is set automatically if the PALL or PRINT option is set.","type":"standalone"},{"name":"RESTART=","optional":true,"aliases":["REST="],"description":"Specifies that the QUANEW or CONGRA algorithm is restarted with a steepest descent/ascent search direction after at most i iterations, i > 0.","type":"value"},{"name":"SINGULAR=","optional":true,"aliases":["SING="],"description":"Specifies the singularity criterion r, 0 < r < 1, used, for example, for matrix inversion.","type":"value"},{"name":"SOCKET=","optional":true,"description":"Specifies the fileref that contains the information needed for remote monitoring.","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH=","OMETHOD=","OM="],"description":"Specifies the optimization technique.","help":"TECHNIQUE=CONGRA | DBLDOG | LEVMAR | NEWRAP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Chooses one of four different conjugate-gradient optimization algorithms, which can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization, which uses the gradient to update an approximation of the Cholesky factor of the Hessian.","type":"standalone"},{"name":"LEVMAR","description":"Performs a highly stable but, for large problems, memory- and time-consuming Levenberg-Marquardt optimization technique, a slightly improved variant of the Moré (1978) implementation. This is the default optimization technique if there are fewer than 40 parameters to estimate.","type":"standalone"},{"name":"NEWRAP","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. The algorithm combines a line-search algorithm with ridging, and it can be modified with the LINESEARCH= option.","type":"standalone"},{"name":"NRRIDG","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. This algorithm does not perform a line search.","type":"standalone"},{"name":"QUANEW","description":"Chooses one of four different quasi-Newton optimization algorithms that can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"TRUREG","description":"Performs a usually very stable but, for large problems, memory- and time-consuming trust-region optimization technique. The algorithm is implemented similar to Gay (1983) and Moré and Sorensen (1983).","type":"standalone"},{"name":"NONE","description":"Does not perform any optimization. This option is similar to METHOD=NONE, but TECH=NONE also computes and displays residuals and goodness of fit statistics.","type":"standalone"}]},{"name":"UPDATE=","optional":true,"description":"Specifies the update method for the quasi-Newton, double-dogleg, or conjugate-gradient optimization technique.","help":"UPDATE=BFGS | DBFGS | DDFP | DFP | PB | FR | PR | CD","type":"choice","arguments":[{"name":"BFGS","description":"Performs the original Broyden, Fletcher, Goldfarb, and Shanno (BFGS) update of the inverse Hessian matrix.","type":"standalone"},{"name":"DBFGS","description":"Performs the dual BFGS update of the Cholesky factor of the Hessian matrix. This is the default update method.","type":"standalone"},{"name":"DDFP","description":"Performs the dual Davidon, Fletcher, and Powell (DFP) update of the Cholesky factor of the Hessian matrix.","type":"standalone"},{"name":"DFP","description":"Performs the original DFP update of the inverse Hessian matrix.","type":"standalone"},{"name":"PB","description":"Performs the automatic restart update method of Powell (1977) and Beale (1972).","type":"standalone"},{"name":"FR","description":"Performs the Fletcher-Reeves update (Fletcher 1987).","type":"standalone"},{"name":"PR","description":"Performs the Polak-Ribiere update (Fletcher 1987).","type":"standalone"},{"name":"CD","description":"Performs a conjugate-descent update of Fletcher (1987).","type":"standalone"}]},{"name":"VERSION=","optional":true,"aliases":["VS="],"description":"Specifies the version of the quasi-Newton optimization technique with nonlinear constraints.","help":"VERSION=1 | 2","type":"choice","arguments":[{"name":"1","description":"Specifies the update of the U vector as in Powell (1978a, 1978b) (update like VF02AD).","type":"standalone"},{"name":"2","description":"Specifies the update of the U vector as in Powell (1982a, 1982b) (update like VMCWD).","type":"standalone"}]},{"name":"VSINGULAR=","optional":true,"aliases":["VSING="],"description":"Specifies a relative singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"XCONV=","optional":true,"aliases":["XTOL="],"description":"Specifies the relative parameter convergence criterion. Termination requires a small relative parameter change in subsequent iterations.","type":"value"},{"name":"XSIZE=","optional":true,"description":"Specifies the XSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"XSIZE=*r*","type":"value"}]},{"name":"OUTPUT","description":"where: keyword<(keyword-options)> <=name> specifies a statistic to include in the output data set and optionally assigns the variable the name, name. The OUTPUT statement creates a data set that contains predicted values and residual diagnostics, computed after fitting the model. By default, all variables in the original data set are included in the output data set. You can use the keyword-options to control which type of a particular statistic to compute. The keyword-options can take on the following values: BLUP uses the predictors of the random effects in computing the statistic. NOBLUP does not use the predictors of the random effects in computing the statistic. The default is to compute statistics by using BLUPs.","help":"OUTPUT OUT=SAS-data-set PREDICTED= STDERR= ...","arguments":[{"name":"LCL=","description":"Outputs the following statistic: LCL<=name> Lower prediction limit for linear predictor; default variable name: \"LCL\"","help":"LCL=BLUP | NOBLUP","type":"choice","arguments":[{"name":"BLUP","type":"standalone"},{"name":"NOBLUP","type":"standalone"}]},{"name":"OUT=","description":"Specifies the name of the output data set. If the OUT= (or DATA=) option is omitted, the procedure uses the DATAn convention to name the output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PEARSON=","description":"Outputs the following statistic: PEARSON<=name> Pearson-type residual; default variable name: \"Pearson\"","help":"PEARSON=NOBLUP","type":"choice","arguments":[{"name":"NOBLUP","type":"standalone"}]},{"name":"PREDICTED=","aliases":["PRED="],"description":"Outputs the following statistic: PREDICTED<=name> Linear predictor; default variable name: \"Pred\"","help":"PREDICTED=BLUP | NOBLUP","type":"choice","arguments":[{"name":"BLUP","type":"standalone"},{"name":"NOBLUP","type":"standalone"}]},{"name":"RESIDUAL=","aliases":["RESID="],"description":"Outputs the following statistic: RESIDUAL<=name> Residual; default variable name: \"Resid\"","help":"RESIDUAL=BLUP | NOBLUP","type":"choice","arguments":[{"name":"BLUP","type":"standalone"},{"name":"NOBLUP","type":"standalone"}]},{"name":"STDERR=","aliases":["STD="],"description":"Outputs the following statistic: STDERR<=name> Standard deviation of linear predictor; default variable name: \"StdErr\"","help":"STDERR=BLUP | NOBLUP","type":"choice","arguments":[{"name":"BLUP","type":"standalone"},{"name":"NOBLUP","type":"standalone"}]},{"name":"STUDENT=","description":"Outputs the following statistic: STUDENT<=name> Studentized residual; default variable name: \"Student\"","help":"STUDENT=NOBLUP","type":"choice","arguments":[{"name":"NOBLUP","type":"standalone"}]},{"name":"UCL=","description":"Outputs the following statistic: UCL<=name> Upper prediction limit for linear predictor; default variable name: \"UCL\"","help":"UCL=BLUP | NOBLUP","type":"choice","arguments":[{"name":"BLUP","type":"standalone"},{"name":"NOBLUP","type":"standalone"}]},{"name":"VARIANCE=","aliases":["VAR="],"description":"Outputs the following statistic: VARIANCE<=name> Conditional variance of pseudo-data; default variable name: \"Variance\"","help":"VARIANCE=BLUP | NOBLUP","type":"choice","arguments":[{"name":"BLUP","type":"standalone"},{"name":"NOBLUP","type":"standalone"}]},{"name":"ALLSTATS","optional":true,"description":"Requests that all statistics are computed.","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Determines the coverage probability for two-sided confidence and prediction intervals. The coverage probability is computed as 1-number. The value of number must be between 0 and 1 inclusively; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"NOMISS","optional":true,"description":"Requests that records be written to the output data only for those observations that were used in the analysis.","type":"standalone"},{"name":"NOUNIQUE","optional":true,"description":"Requests that names not be made unique in the case of naming conflicts.","type":"standalone"},{"name":"NOVAR","optional":true,"description":"Requests that variables from the input data set not be added to the output data set.","type":"standalone"}]},{"name":"PARMS","description":"The PARMS statement specifies initial values for the covariance parameters, or it requests a grid search over several values of these parameters. You must specify the values in the order in which they appear in the \"Covariance Parameter Estimates\" table. The value-list specification can take any of several forms: m a single value m1,m2,...,mn several values m to n a sequence where m equals the starting value, n equals the ending value, and the increment equals 1 m to n by i a sequence where m equals the starting value, n equals the ending value, and the increment equals i m1,m2 to m3 mixed values and sequences You can use the PARMS statement to input known parameters.","help":"PARMS &lt;HOLD=value-list&gt; &lt;NOITER&gt; &lt;PARMSDATA=SAS-data-set&gt; ...","arguments":[{"name":"HOLD=","optional":true,"followsDelimiter":"/","aliases":["EQCONS="],"description":"Specifies which parameter values PROC HPLMIXED should hold equal to the specified values. For example, the following statement constrains the first and third covariance parameters to equal 5 and 2, respectively:","help":"HOLD=*value-list*","type":"value"},{"name":"NOITER","optional":true,"followsDelimiter":"/","description":"Requests that no Newton-Raphson iterations be performed and that PROC HPLMIXED use the best value from the grid search to perform inferences. By default, iterations begin at the best value from the PARMS grid search.","type":"standalone"},{"name":"PARMSDATA=","optional":true,"followsDelimiter":"/","aliases":["PDATA="],"description":"Reads in covariance parameter values from a SAS data set. The data set should contain the Est or Covp1–Covpn variables.","help":"PARMSDATA=*SAS-data-set*","type":"dataSet"}]},{"name":"RANDOM","description":"The RANDOM statement defines the random effects in the mixed model.","help":"RANDOM &lt;ALPHA=number&gt; &lt;CL&gt; &lt;GROUP=effect&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval with confidence level 1-number be constructed for the predictors of random effects in this statement. The value of number must be between 0 and 1 exclusively; the default is 0.05","help":"ALPHA=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the predictors of random effects in this statement.","type":"standalone"},{"name":"GROUP=","optional":true,"followsDelimiter":"/","description":"Defines an effect specifying heterogeneity in the covariance structure of G.","help":"GROUP=*effect*","type":"value"},{"name":"NOFULLZ","optional":true,"followsDelimiter":"/","description":"Eliminates the columns in Z corresponding to missing levels of random effects involving CLASS variables. By default, these columns are included in Z. It is sufficient to specify the NOFULLZ option in any RANDOM statement.","type":"standalone"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Requests that the solution for the random-effects parameters be produced.","type":"standalone"},{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","description":"Identifies the subjects in your mixed model. Complete independence is assumed across subjects; thus, for the RANDOM statement, the SUBJECT= option produces a block-diagonal structure in G with identical blocks.","help":"SUBJECT=*effect*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the covariance structure of G for G-side effects. The TYPE=VC (variance components) option is the default structure. Another structure available in this experimental release is CHOL.","help":"TYPE=*covariance-structure*","type":"value"}]},{"name":"REPEATED","description":"The REPEATED statement defines the repeated effect and the residual covariance structure in the mixed model. The residual variance-covariance matrix is denoted as R. The repeated- effect is required and consists entirely of classification variables. The levels of the repeated-effect must be different for each observation within a subject in order to avoid the singular R matrix. The SUBJECT= option is required. The data set must be grouped by subject effect.","help":"REPEATED &lt;GROUP=effect&gt; &lt;R&lt;=value-list&gt;&gt; &lt;RC&lt;=value-list&gt;&gt; ...","arguments":[{"name":"GROUP=","optional":true,"followsDelimiter":"/","aliases":["GRP="],"description":"Defines an effect that specifies heterogeneity in the residual covariance structure. All observations that have the same level of the GROUP effect have the same covariance parameters. Each new level of the GROUP effect produces a new set of covariance parameters with the same structure as the original group. You should exercise caution in defining the GROUP effect, because strange covariance patterns can result with its misuse. Also, the GROUP effect can greatly increase the number of estimated covariance parameters, which can adversely affect the optimization process.","help":"GROUP=*effect*","type":"value"},{"name":"R=","optional":true,"followsDelimiter":"/","description":"Requests that blocks of the estimated R matrix be displayed. The first block determined by the SUBJECT= effect is the default displayed block. The value-list indicates the subjects for which blocks of are to be displayed. For example, the following statement displays block matrices for the first, third, and fifth persons:","type":"value"},{"name":"RC=","optional":true,"followsDelimiter":"/","description":"Displays the Cholesky root of blocks of the estimated R matrix. The value-list specification is the same as for the R= option.","type":"value"},{"name":"RCI=","optional":true,"followsDelimiter":"/","description":"Displays the inverse Cholesky root of blocks of the estimated R matrix. The value-list specification is the same as for the R= option.","type":"value"},{"name":"RCORR=","optional":true,"followsDelimiter":"/","description":"Displays the correlation matrix that corresponds to blocks of the estimated R matrix. The value-list specification is the same as for the R= option.","type":"value"},{"name":"RI=","optional":true,"followsDelimiter":"/","description":"Produces the inverse of blocks of the estimated R matrix. The value-list specification is the same as for the R= option.","type":"value"},{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","aliases":["SUB="],"description":"Identifies the subjects in your mixed model. Complete independence is assumed across subjects; therefore, the SUBJECT= option produces a block-diagonal structure in R with identical blocks. The SUBJECT= option is required. The data set must be grouped by SUBJECT= effect. When the SUBJECT= effect consists entirely of classification variables, the blocks of R correspond to observations that share the same level of that effect. These blocks are sorted according to this effect as well. Continuous variables are permitted as arguments to the SUBJECT= option. PROC HPMIXED does not sort by the values of the continuous variable; rather, it considers the data to be from a new subject or group whenever the value of the continuous variable changes from the previous observation. Using a continuous variable decreases execution time for models with a large number of subjects or groups and also prevents the production of a large \"Class Level Information\" table.","help":"SUBJECT=*effect*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the structure of the residual variance-covariance matrix R. The SUBJECT= option defines the blocks of R, and the TYPE= option specifies the structure of these blocks.","help":"TYPE=AR(1) | CHOL | UN | VC*covariance-structure*","type":"value","arguments":[{"name":"AR","followsDelimiter":"/","description":"Specifies an autoregressive(1) structure","help":"AR(1)","type":"standalone"},{"name":"CHOL","followsDelimiter":"/","description":"Specifies a Cholesky root structure","type":"standalone"},{"name":"UN","followsDelimiter":"/","description":"Specifies an unstructured structure","type":"standalone"},{"name":"VC","followsDelimiter":"/","description":"Specifies variance components structure","type":"standalone"}]}]},{"name":"TEST","description":"By default, for each sum of squares in the analysis an F value is computed that uses the residual MS as an error term. Use a TEST statement to request additional F tests that use other effects as error terms.","help":"TEST &lt;CHISQ&gt; &lt;E&gt; &lt;HTYPE=value-list&gt; ...","arguments":[{"name":"CHISQ","optional":true,"followsDelimiter":"/","description":"Requests that chi-square tests be performed in addition to any F tests.","type":"standalone"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that matrix coefficients associated with test types be displayed for specified effects.","type":"standalone"},{"name":"E3","optional":true,"followsDelimiter":"/","aliases":["EIII"],"description":"Requests that Type III matrix coefficients be displayed if a Type III test is performed.","type":"standalone"},{"name":"HTYPE=","optional":true,"followsDelimiter":"/","description":"Indicates the type of hypothesis test to perform on the specified effects. Valid entries for values in the value-list are 3, corresponding to a Type III test. The default value is 3. The ODS table name is \"Tests3\" for the Type III test.","help":"HTYPE=*value-list*","type":"value"}]},{"name":"WEIGHT","description":"The WEIGHT statement replaces R with W^(-1/2)RW^(-1/2), where W is a diagonal matrix containing the weights. Observations with nonpositive or missing weights are not included in the resulting PROC HPMIXED analysis. If a WEIGHT statement is not included, all observations used in the analysis are assigned a weight of 1.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_026","docsetTargetFile":"statug_hpmixed_toc.htm"}}