{"name":"HPPANEL","statements":[{"name":"PROC HPPANEL","description":"The HPPANEL procedure is a high-performance version of the PANEL procedure in SAS/ETS software. Both procedures analyze a class of linear econometric models that commonly arise when time series and cross-sectional data are combined. This type of data on time series cross-sectional bases is often referred to as panel data. Typical examples of panel data include observations over time about households, countries, firms, trade, and so on. For example, in the case of survey data about household income, the panel is created by repeatedly surveying the same households in different time periods (years). The HPPANEL procedure is specifically designed to operate in the high-performance distributed mode. By default, PROC HPPANEL performs computations in multiple threads. The ID and MODEL statements are required. You can specify any of the following MODEL statement options in the PROC HPPANEL statement: FIXONE, FIXONETIME, FIXTWO, RANONE, RANTWO, NOINT, PRINTFIXED, and VCOMP=. Specifying these options in the PROC HPPANEL statement is equivalent to specifying them in the MODEL statement.","help":"PROC HPPANEL <DATA=libref.data-table><CORRB><COVB><NOPRINT><CORRB><OUTEST=libref.data-table><OUTCOV><COVOUT><OUTCORR><CORROUT>;\n\tID  cross-section-idtime-series-id;\n\tMODEL response = regressors</ options>;\n\tRESTRICT equation1 <, equations2...>;\n\tTEST equation1<, equations2...></ options>;\n\tOUTPUT OUT=libref.data-table <output-options>;\n\tPERFORMANCE <performance-options>;","arguments":[{"name":"DATA=","optional":true,"description":"names the input data set. Only one observation is allowed for each cross section and time period. If you omit the DATA= option, PROC HPPANEL uses the most recently created SAS data set.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"CORRB","optional":true,"description":"prints the matrix of estimated correlations between the parameter estimates.","type":"standalone"},{"name":"COVB","optional":true,"description":"prints the matrix of estimated covariances between the parameter estimates.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"suppresses the normal printed output.","type":"standalone"},{"name":"OUTEST=","optional":true,"description":"names an output data set to contain the parameter estimates. When the OUTEST= option is not specified, the OUTEST=libref.data-table is not created.","help":"OUTEST=*libref.data-table*","type":"dataSet"},{"name":"OUTCOV","optional":true,"aliases":["COVOUT"],"description":"writes the standard errors and covariance matrix of the parameter estimates to the OUTEST=libref.data-table.","type":"standalone"},{"name":"OUTCORR","optional":true,"aliases":["CORROUT"],"description":"writes the correlation matrix of the parameter estimates to the OUTEST=libref.data-table.","type":"standalone"}]},{"name":"ID","description":"The ID statement specifies variables in the input data set that identify the cross section and the time period for each observation. The ID statement is required. Unlike the PANEL procedure, the HPPANEL procedure does not require the data set to be sorted.","help":"ID *cross-section-id**time-series-id*;"},{"name":"MODEL","description":"The MODEL statement specifies the regression model, the error structure that is assumed for the regression residuals, and the estimation technique to be used. The response variable is regressed on the independent variables (regressors). You can specify only one MODEL statement and only one response. You can specify only one of the following models: BTWNG, BTWNT, FIXONE, FIXONETIME, FIXTWO, POOLED, RANONE, and RANTWO. By default, a FIXONE estimation is performed.","help":"MODEL *response = regressors*&lt;*/ options*&gt;;","arguments":[{"name":"BTWNG","optional":true,"description":"estimates the between-groups model.","type":"standalone"},{"name":"BTWNT","optional":true,"description":"estimates the between-time-periods model.","type":"standalone"},{"name":"FIXONE","optional":true,"description":"estimates a one-way fixed-effects model, which corresponds to cross-sectional effects.","type":"standalone"},{"name":"FIXONETIME","optional":true,"description":"estimates a one-way fixed-effects model, which corresponds to time effects.","type":"standalone"},{"name":"FIXTWO","optional":true,"description":"estimates a two-way fixed-effects model.","type":"standalone"},{"name":"POOLED","optional":true,"description":"estimates the pooled regression model.","type":"standalone"},{"name":"RANONE","optional":true,"description":"estimates a one-way random-effects model.","type":"standalone"},{"name":"RANTWO","optional":true,"description":"estimates a two-way random-effects model.","type":"standalone"},{"name":"NOINT","optional":true,"description":"suppresses the intercept parameter from the model.","type":"standalone"},{"name":"PRINTFIXED","optional":true,"description":"prints the fixed effects.","type":"standalone"},{"name":"VCOMP=","optional":true,"description":"specifies the type of variance component estimator to use. By default, VCOMP=WK for both balanced and unbalanced data. You can specify the following values:","help":"VCOMP=FB | NL | WH | WK","type":"choice","arguments":[{"name":"FB","description":"requests the Fuller-Battese estimator.","type":"standalone"},{"name":"NL","description":"requests the Nerlove estimator.","type":"standalone"},{"name":"WH","description":"requests the Wallace-Hussain estimator.","type":"standalone"},{"name":"WK","description":"requests the Wansbeek-Kapteyn estimator.","type":"standalone"}]}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set to contain variables that are specified by the COPYVAR option, the cross-sectional ID (_CSID_), and the time period (_TSID_). This data set also contains the predicted value and the residual if they are specified by output-options. When the response values are missing for the observation, all output estimates except the residual are still computed as long as none of the explanatory variables are missing. You can specify only one OUTPUT statement.","help":"OUTPUT OUT=*libref.data-table*&lt;*output-options*&gt;;","arguments":[{"name":"OUT=","description":"names the output data set.","help":"OUT=*libref.data-table*","type":"dataSet"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS=(<i>variables</i>)"],"description":"adds variables to the output data set.","help":"COPYVAR=(*variables*)","type":"value"},{"name":"PREDICTED","optional":true,"description":"outputs estimates of predicted dependent variables.","type":"standalone"},{"name":"RESIDUAL","optional":true,"description":"outputs estimates of residuals.","type":"standalone"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement specifies performance-options to control the multithreaded computing environment and requests detailed performance results of the HPPANEL procedure.","help":"PERFORMANCE &lt;*performance-options*&gt;;","arguments":[{"name":"DETAILS","optional":true,"description":"requests a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"NTHREADS=","optional":true,"description":"specifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, PROC HPPANEL creates one thread per CPU for the analytic computations.","help":"NTHREADS=*n*","type":"value"}]},{"name":"RESTRICT","description":"The RESTRICT statement specifies linear equality restrictions on the parameters in the MODEL statement. There can be as many unique restrictions as the number of parameters in the MODEL statement. Multiple RESTRICT statements are understood as joint restrictions on the model’s parameters. Currently, PROC HPPANEL only supports linear equality restrictions. Restriction expressions can be composed only of algebraic operations that involve the addition symbol (+), subtraction symbol (–), and multiplication symbol (*). A RESTRICT statement cannot include a division sign in its formulation. You can obtain restrictions on the intercept by using the keyword INTERCEPT.","help":"RESTRICT *equation1*&lt;*,equation2…*&gt;; "},{"name":"TEST","description":"The TEST statement performs Wald, Lagrange multiplier, and likelihood ratio tests of linear hypotheses about the regression parameters in the MODEL statement. Each equation specifies a linear hypothesis to be tested. Currently, only linear equality restrictions and tests are permitted in PROC HPPANEL. Test expressions can be composed only of algebraic operations that involve the addition symbol (+), subtraction symbol (–), and multiplication symbol (*). All hypotheses in one TEST statement are tested jointly. Variable names in the equations must correspond to regressors in the preceding MODEL statement, and each name represents the coefficient of the corresponding regressor. In the equality restrictions, you can use the keyword INTERCEPT to refer to the coefficient of the intercept.","help":"TEST *equation1*&lt;*,equation2...*&gt;&lt;*/ options*&gt;","arguments":[{"name":"ALL","optional":true,"description":"specifies Wald, Lagrange multiplier, and likelihood ratio tests.","type":"standalone"},{"name":"WALD","optional":true,"description":"specifies the Wald test. This is the default test.","type":"standalone"},{"name":"LM","optional":true,"description":"specifies the Lagrange multiplier test.","type":"standalone"},{"name":"LR","optional":true,"description":"specifies the likelihood ratio test.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"latest","docsetTargetFile":"etsug_hppanel_toc.htm"}}