{"name":"HPPRINCOMP","statements":[{"name":"PROC HPPRINCOMP","description":"The HPPRINCOMP procedure is a high-performance procedure that performs principal component analysis. It is a high-performance version of the PRINCOMP procedure in SAS/STAT software, but it provides additional iterative methods to calculate the principal components. † Principal component analysis is a multivariate technique for examining relationships among several quantitative variables. The choice between using factor analysis and using principal component analysis depends in part on your research objectives. You should use the PRINCOMP procedure if you are interested in summarizing data and detecting linear relationships. You can use principal components to reduce the number of variables in regression, clustering, and so on.","help":"PROC HPPRINCOMP <COVARIANCE> <DATA=SAS-data-set> <METHOD=EIG | ITERGS | NIPALS> <N=number> <NOINT> <NOPRINT> <OUT=SAS-data-set> <OUTSTAT=SAS-data-set> <PARPREFIX=|PPREFIX=|RPREFIX=name> <PREFIX=name> <SINGULAR=p> <STANDARD> <VARDEF=DF | N | WEIGHT|WGT... >;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCODE <CATALOG=library.catalog.entry.typeCAT=library.catalog.entry.type> <FILE= filename> <FORMAT=format> ...; \n   \n\tFREQ variable ;     \n\tID variables ;     \n\tOUTPUT <H <=prefix>> OUT=SAS-data-set | DATA=SAS-data-set <STD <=prefix>> ...; \n   \n\tPARTIAL variables ;     \n\tPERFORMANCE <COMMIT=n> <DETAILS> <GRIDHOST=\"name\"> ...; \n   \n\tVAR variables ;     \n\tWEIGHT variable; ","arguments":[{"name":"COVARIANCE","optional":true,"aliases":["COV"],"description":"Computes the principal components from the covariance matrix. If you omit the COV option, the correlation matrix is analyzed.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be analyzed.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"METHOD=","optional":true,"description":"Specifies the principal component extraction method to be used.","help":"METHOD=EIG | ITERGS | NIPALS","type":"choice","arguments":[{"name":"EIG","description":"Requests eigenvalue decomposition.","type":"standalone"},{"name":"ITERGS","description":"Syntax: ITERGS<(iter-options)> Requests the iterative method based on Gram-Schmidt orthogonalization (ITERGS) of Andrecut (2009). You can also specify the following optional iter-options in parentheses after METHOD=ITERGS: EPSILON=n specifies the convergence criterion for the iterative method. By default, EPSILON=10E–12. MAXITER=n specifies the maximum number of iterations for the iterative method. By default, MAXITER=5000. NOCENTER suppresses centering of the numeric variables to be analyzed. T NOSCALE suppresses scaling of the numeric variables to be analyzed.","type":"standalone"},{"name":"NIPALS","description":"Syntax: NIPALS<(iter-options)> Requests the nonlinear iterative partial least squares (NIPALS) method. You can also specify the optional iter-options in parentheses after METHOD=NIPALS. EPSILON=n specifies the convergence criterion for the iterative method. By default, EPSILON=10E–12. MAXITER=n specifies the maximum number of iterations for the iterative method. By default, MAXITER=5000. NOCENTER suppresses centering of the numeric variables to be analyzed. T NOSCALE suppresses scaling of the numeric variables to be analyzed.","type":"standalone"}]},{"name":"N=","optional":true,"description":"Specifies the number of principal components to be computed. The default is the number of variables. The value of the N= option must be an integer greater than or equal to zero.","help":"N=*number*","type":"value"},{"name":"NOINT","optional":true,"description":"Omits the intercept from the model. In other words, the NOINT option requests that the covariance or correlation matrix not be corrected for the mean.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set to contain observationwise principal component scores.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Creates an output SAS data set that contains means, standard deviations, number of observations, correlations or covariances, eigenvalues, and eigenvectors.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PARPREFIX=","optional":true,"aliases":["PPREFIX=","RPREFIX="],"description":"Specifies a prefix for naming the residual variables in the OUT= data set and the OUTSTAT= data set. By default, the prefix is R_.","type":"value"},{"name":"PREFIX=","optional":true,"description":"Specifies a prefix for naming the principal components. By default, the names are Prin1, Prin2, ..., Prinn. If you specify PREFIX=ABC, the components are named ABC1, ABC2, ABC3, and so on. The number of characters in the prefix plus the number of digits required to designate the variables should not exceed the current name length defined by the VALIDVARNAME= system option.","help":"PREFIX=*name*","type":"value"},{"name":"SINGULAR=","optional":true,"aliases":["SING="],"description":"Specifies the singularity criterion, where 0 < p < 1.","help":"SINGULAR=*p*","type":"value"},{"name":"STANDARD","optional":true,"aliases":["STD"],"description":"Standardizes the principal component scores in the OUT= data set to unit variance.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the divisor used in calculating variances and standard deviations.","help":"VARDEF=DF | N | WEIGHT | WDF","type":"choice","arguments":[{"name":"DF","description":"Error degrees of freedom","type":"standalone"},{"name":"N","description":"Number of observations","type":"standalone"},{"name":"WEIGHT","aliases":["WGT"],"description":"Sum of weights","type":"standalone"},{"name":"WDF","description":"Sum of weights minus one","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC HPPRINCOMP to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CODE","description":"The CODE statement enables you to write SAS DATA step code for computing the principal component scores either to a file or to a catalog entry. This code can then be included in a DATA step to score new data. The CODE statement is not supported when the PARTIAL statement is specified. If you specify more than one CODE statement, only the last one specified is used.","help":"CODE &lt;CATALOG=library.catalog.entry.typeCAT=library.catalog.entry.type&gt; &lt;FILE= filename&gt; &lt;FORMAT=format&gt; ...","arguments":[{"name":"CATALOG=","optional":true,"aliases":["CAT="],"description":"Specifies where to write the generated code in the form of library.catalog.entry.type. The compound name can have from one to four levels. The default library is determined by the USER= SAS system option, which by default is WORK. The default entry is SASCODE, and the default type is SOURCE.","type":"value"},{"name":"FILE=","optional":true,"description":"Names the external file that saves the generated code. When enclosed in a quoted string (for example, FILE=\"c:nmydirnscorecode.sas\"), this option specifies the path for writing the code to an external file. You can also specify unquoted SAS filenames of no more than eight characters for filename. If the filename is assigned as a fileref in a Base SAS FILENAME statement, the file specified in the FILENAME statement is opened. The special filerefs LOG and PRINT are always assigned. If the specified filename is not an assigned fileref, the specified value for filename is concatenated with a .txt extension before the file is opened. For example, if FOO is not an assigned fileref, FILE=FOO causes FOO.txt to be opened. If filename has more than eight characters, an error message is printed.","type":"value"},{"name":"FORMAT=","optional":true,"description":"Specifies the format for the regression coefficients and other numerical values that do not have a format from the input data set. The default format is BEST20.","help":"FORMAT=*format*","type":"value"},{"name":"GROUP=","optional":true,"description":"Specifies the group identifier for group processing. The group-name should be a valid SAS name of no more than 16 characters. It is used to construct array names and statement labels in the generated code.","help":"GROUP=*group-name*","type":"value"},{"name":"IMPUTE","optional":true,"description":"Imputes the predicted values according to an intercept-only model for observations with missing or invalid covariate values. For a continuous response, the predicted value is the mean of the response variable; for a categorical response, the predicted values are the proportions of the response categories. When the IMPUTE option is specified, the scoring code also creates a variable named _WARN_ that contains one or more single-character codes that indicate problems in computing predicted values. The character codes used in _WARN_ go in the following positions:","type":"standalone"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the line size for the generated code. The default is 72. The permissible range is 64 to 254.","type":"value"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. SAS high-performance analytics procedures that support the FREQ statement treat each observation as if it appeared f times, where f is the value of the FREQ variable for the observation. If the frequency value is not an integer, it is truncated to an integer. If the frequency value is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1. The FREQ statement is not supported if you specify METHOD= NIPALS or METHOD=ITERGS in the PROC HPPRINCOMP statement.","help":"FREQ variable "},{"name":"ID","description":"The ID statement lists one or more variables from the input data set that are transferred to output data sets created by SAS high-performance analytics procedures, provided that the output data set produces one (or more) records per input observation.","help":"ID variables "},{"name":"OUTPUT","description":"The OUTPUT statement creates a data set that contains observationwise statistics, which are computed after PROC HPPRINCOMP fits the model. If you do not specify a keyword, then only the principal component scores are included. The OUTPUT statement causes the OUT= option in the PROC HPPRINCOMP statement to be ignored.","help":"OUTPUT &lt;H &lt;=prefix&gt;&gt; OUT=SAS-data-set | DATA=SAS-data-set &lt;STD &lt;=prefix&gt;&gt; ...","arguments":[{"name":"OUT=","aliases":["DATA="],"description":"Specifies the name of the output data set. If you omit this option, the procedure uses the DATAn convention to name the output data set.","type":"value"},{"name":"RESIDUAL","aliases":["RESID"],"description":"","type":"standalone"},{"name":"H","optional":true,"description":"Requests the approximate leverage. The default prefix is H.","type":"standalone"},{"name":"SCORE","optional":true,"description":"Requests principal component scores for each principal component. The default prefix is Score.","type":"standalone"},{"name":"STD","optional":true,"description":"Requests standardized (centered and scaled) VAR variable values for each VAR variable. The default prefix is Std.","type":"standalone"},{"name":"STDSSE","optional":true,"description":"Requests the sum of squares of residuals for standardized VAR variables. The default prefix is StdSSE.","type":"standalone"},{"name":"TSQUARE","optional":true,"aliases":["T2"],"description":"Requests scaled sum of squares of score values. The default prefix is TSquare.","type":"standalone"}]},{"name":"PARTIAL","description":"If you want to analyze a partial correlation or covariance matrix, specify the names of the numeric variables to be partialed out in the PARTIAL statement. The HPPRINCOMP procedure computes the principal components of the residuals from the prediction of the VAR variables by the PARTIAL variables. If you request an OUT= or OUTSTAT= data set, the residual variables are named by prefixing either the characters R_ (by default) or the string specified in the PARPREFIX= option to the VAR variables. The PARTIAL statement is not supported if you specify METHOD= NIPALS or METHOD=ITERGS in the PROC HPPRINCOMP statement.","help":"PARTIAL variables "},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables that describe the distributed computing environment, and requests detailed results about the performance characteristics of the HPPRINCOMP procedure. You can also use the PERFORMANCE statement to control whether the HPPLS procedure executes in single-machine mode or distributed mode.","help":"PERFORMANCE &lt;COMMIT=n&gt; &lt;DETAILS&gt; &lt;GRIDHOST=\"name\"&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"Requests that the High-Performance Analytics procedure write periodic updates to the SAS Log when observations are sent from the client to the appliance for distributed processing.","help":"COMMIT=*n*","type":"value"},{"name":"DETAILS","optional":true,"description":"Requests a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"GRIDHOST=","optional":true,"aliases":["HOST="],"description":"Syntax: GRIDHOST=\"name\" HOST=\"name\"","help":"GRIDHOST=\"*name*\"","type":"value"},{"name":"GRIDMODE=","optional":true,"aliases":["MODE="],"description":"Is a deprecated option that specifies whether to run the high-performance analytical procedure in symmetric (SYM) mode or asymmetric (ASYM) mode. This option overrides the GRIDMODE environment variable.","help":"GRIDMODE=SYM | ASYM","type":"choice","arguments":[{"name":"SYM","description":"Specifies to run the high-performance analytical procedure in symmetric (SYM) mode","type":"standalone"},{"name":"ASYM","description":"Specifies to run the high-performance analytical procedure in asymmetric (ASYM) mode.","type":"standalone"}]},{"name":"GRIDTIMEOUT=","optional":true,"aliases":["TIMEOUT="],"description":"Specifies the time-out in seconds for a high-performance analytical procedure to wait for a connection to the appliance and establish a connection back to the client. The default is 120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the time-out value.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"Specifies the directory in which the shared libraries for the high-performance analytical procedure are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"LASRSERVER=","optional":true,"aliases":["LASR="],"description":"Specifies the fully qualified path to the description file of a SAS LASR Analytic Server instance. If the input data set is held in memory by this LASR Analytic Server instance, then the procedure runs alongside LASR. This option is not needed to run alongside LASR if the DATA= specification of the input data uses a libref that is associated with a LASR Analytic Server instance.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"Specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database.","type":"value"},{"name":"NTHREADS=","optional":true,"aliases":["THREADS="],"description":"Specifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, the number of threads is determined based on the number of CPUs on the host on which the analytic computations execute. The algorithm by which a CPU count is converted to a thread count is specific to the high-performance analytical procedure. Most procedures create one thread per CPU for the analytic computations. By default, high-performance analytical procedures run in multiple concurrent threads unless multithreading has been turned off by the NOTHREADS system option or you force single-threaded execution by specifying NTHREADS=1. The largest number that can be specified for n is 256. Individual high-performance analytical procedures can impose more stringent limits if called for by algorithmic considerations.","type":"value"}]},{"name":"VAR","description":"The VAR statement lists the numeric variables to be analyzed. If you omit the VAR statement, all numeric variables not specified in other statements are analyzed.","help":"VAR variables "},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations that have nonpositive or missing weights are not included in the analysis. If you do not specify a WEIGHT statement, all observations that are used in the analysis are assigned a weight of 1. The WEIGHT statement is not supported if you specify METHOD= NIPALS or METHOD=ITERGS in the PROC HPPRINCOMP statement.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_017","docsetTargetFile":"statug_hpprincomp_toc.htm"}}