{"name":"HPREDUCE","statements":[{"name":"PROC HPREDUCE","description":"The HPREDUCE procedure is a high-performance procedure that performs both supervised and unsupervised variable selection on the SAS appliance. With the HPREDUCE procedure you can read data in distributed form and perform variable selection in parallel in symmetric multiprocessing (SMP) or massively parallel processing (MPP) mode. † The HPREDUCE procedure performs unsupervised variable selection by identifying a set of variables that jointly explain the maximum amount of data variance. Unlike principal component analysis (PCA), which reduces dimensionality by generating a set of new variables (variable extraction), the HPREDUCE procedure reduces dimensionality by selecting a subset of the original variables (variable selection). Thus, this technique preserves model interpretation. † The HPREDUCE procedure performs supervised variable selection by identifying a set of variables that jointly explain the maximum amount of variance contained in the response variables. The HPREDUCE procedure supports variable selection in both the regression setting and the classification (categorization) setting. † The HPREDUCE procedure can also be used to output the sums of squares and crossproducts (SSCP) matrix, the correlation (CORR) matrix, or the covariance (COV) matrix for exploratory data analysis and direct input to statistical procedures that accept that form. This step saves time by eliminating redundant matrix aggregations.","help":"PROC HPREDUCE <CORR> <COV> <DATA=SAS-data-set> <FMTLIBXML=file-ref> <NAMELEN=number> <NOCLPRINT< =number >> <NOPRINT> <NOSUMPRINT> <OUTCP=SAS-data-set< /LIST< (EPS = number) > >> <SSCP> <TECHNIQUE=VARIANCEANALYSIS|VAR | DISCRIMINANTANALYSIS|DSC> <TIMEPRINT>;     \n\tCLASS <DESCENDING> <ORDER=<DATA | FORMATTED | FREQ>... > <REF=<<'level'> | FIRST | LAST>> ...; \n   \n\tPERFORMANCE <COMMIT=n> <CPUCOUNT=<ACTUAL | <num>>> <DATASERVER=“name”> ...; \n   \n\tREDUCE <MAXSTEPS=n> <SUPERVISED> <UNSUPERVISED> ...; ","arguments":[{"name":"CORR","optional":true,"description":"Selects variables based on the correlation matrix.","type":"standalone"},{"name":"COV","optional":true,"description":"Selects variables based on the covariance matrix.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the input SAS data set to be used by PROC HPREDUCE. The default is the most recently created data set. If the procedure executes in MPP mode, the input data are distributed to memory on the appliance nodes and analyzed in parallel, unless the data are already distributed in the appliance database. When data are already distributed, the procedure reads the data alongside the distributed database.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"FMTLIBXML=","optional":true,"description":"Specifies the file reference for the XML stream that contains the user-defined format definitions. Userdefined formats are handled differently in a distributed computing environment compared to other SAS products.","help":"FMTLIBXML=*file-ref*","type":"value"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length to which long effect names are shortened (20 <= number <= 128).","help":"NAMELEN=*number*","type":"value"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the “Class Level Information” table if you do not specify number. If you specify number, the values of the classification variables are displayed for only those variables whose number of levels is less than number. Specifying a number helps to reduce the size of the “Class Level Information” table if some classification variables have a large number of levels.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the generation of ODS output.","type":"standalone"},{"name":"NOSUMPRINT","optional":true,"description":"Suppresses the generation of the “Selection Summary” table.","type":"standalone"},{"name":"OUTCP=","optional":true,"description":"Creates both a data set that contains a symmetric matrix that depicts the relationships among variables and also a set of statistics about the input data set and variables. Depending on the Pearson correlation statistics option specified in the PROC HPREDUCE statement, the symmetric matrix can be a correlation (CORR) matrix, a covariance (COV) matrix, or a sums of squares and crossproducts (SSCP) matrix.","type":"value"},{"name":"SSCP","optional":true,"description":"Selects variables based on the sums of squares and crossproducts matrix.","type":"standalone"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH="],"description":"Specifies the variable selection technique. You can choose from the following techniques by specifying the appropriate keyword: VARIANCEANALYSIS | VAR performs variance analysis for variable selection. DISCRIMINANTANALYSIS | DSC performs discriminant analysis for variable selection. The default value is TECHNIQUE=VAR.","help":"TECHNIQUE=VARIANCEANALYSIS | DISCRIMINANTANALYSIS","type":"choice","arguments":[{"name":"VARIANCEANALYSIS","aliases":["VAR"],"description":"Performs variance analysis for variable selection.","type":"standalone"},{"name":"DISCRIMINANTANALYSIS","aliases":["DSC"],"description":"Performs discriminant analysis for variable selection.","type":"standalone"}]},{"name":"TIMEPRINT","optional":true,"description":"Prints the time (in seconds) used by each variable selection iteration in the “Selection Summary” table. If this option does not appear in the PROC HPREDUCE statement, the time information is not printed.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis. The CLASS statement must precede the REDUCE statement. The HPREDUCE procedure does not support the SPLIT option in the CLASS statement. For CLASS variable parameterization, the HPREDUCE procedure only support the GLM method.","help":"CLASS &lt;DESCENDING&gt; &lt;ORDER=&lt;DATA | FORMATTED | FREQ&gt;... &gt; &lt;REF=&lt;&lt;'level'&gt; | FIRST | LAST&gt;&gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sorting order of the classification variable. If both the DESCENDING and ORDER= options are specified, High-Performance Analytics procedures order the categories according to the ORDER= option and then reverse that order.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (“.”, “.A”, . . . , “.Z” for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sorting order for the levels of classification variables. This ordering determines which parameters in the model correspond to each level in the data.","help":"ORDER=DATA | FORMATTED | FREQ | FREQDATA | FREQFORMATTED | FREQINTERNAL | INTERNAL","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Levels sorted by the order of appearance in the input data set FORMATTED External formatted values, except for numeric.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"Levels sorted by the external formatted values, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) values","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Levels sorted by the descending frequency count (levels with more observations come earlier in the order)","type":"standalone"},{"name":"FREQDATA","followsDelimiter":"/","description":"Levels sorted by the order of descending frequency count, and within counts by order of appearance in the input data set when counts are tied","type":"standalone"},{"name":"FREQFORMATTED","followsDelimiter":"/","description":"Levels sorted by the order of descending frequency count, and within counts by formatted value when counts are tied","type":"standalone"},{"name":"FREQINTERNAL","followsDelimiter":"/","description":"Levels sorted by the Order of descending frequency count, and within counts by unformatted (internal) value when counts are tied","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Levels sorted by the unformatted value","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables. The GLM parameterization is the default.","help":"PARAM=GLM | REFERENCE","type":"choice","arguments":[{"name":"GLM","followsDelimiter":"/","description":"Less-than-full-rank reference cell coding. This parameterization is used in, for example, the GLM, MIXED, and GLIMMIX procedures in SAS/STAT.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","description":"Reference cell encoding. You can choose the reference value with a specific variable option in the CLASS statement, or designate the first or last ordered value with a globaloption. The default is REF=LAST.","type":"standalone"}]},{"name":"REF=","optional":true,"followsDelimiter":"/","aliases":["REFERENCE="],"description":"Specifies the reference level for PARAM=REFERENCE. For an individual (but not a global) variable REF= option, you can specify the level of the variable to use as the reference level. Specify the formatted value of the variable if a format is assigned. For a REF= option or global-option, you can use one of the following keywords. The default is REF=LAST.","help":"REF=&lt;'*level*'&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"'level'","placeholder":true,"followsDelimiter":"/","description":"For an individual (but not a global) variable REF= option, you can specify the level of the variable to use as the reference level.","type":"value"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first-ordered level as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last-ordered level as reference.","type":"standalone"}]},{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies the truncation width of formatted values of CLASS variables when the optional n is specified. If n is not specified, the TRUNCATE option requests that classification levels should be determined using no more than the first 16 characters of the formatted values of CLASS variables. When formatted values are longer than 16 characters, you can use this option in order to revert to the levels as determined in releases prior to SAS 9.","type":"standalone"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables about the distributed computing environment, and requests detailed results about the performance characteristics of the HPREDUCE procedure. With the PERFORMANCE statement, you can also control whether the HPREDUCE procedure executes in SMP or MPP mode.","help":"PERFORMANCE &lt;COMMIT=n&gt; &lt;CPUCOUNT=&lt;ACTUAL | &lt;num&gt;&gt;&gt; &lt;DATASERVER=“name”&gt; ...","arguments":[{"name":"COMMIT=","optional":true,"description":"Requests that the High-Performance Analytics procedure write periodic updates to the SAS Log when observations are sent from the client to the appliance for distributed processing.","help":"COMMIT=*n*","type":"value"},{"name":"CPUCOUNT=","optional":true,"description":"Specifies how many processors the procedure assumes are available on each host in the computing environment. num can be any integer from 1 to 256. CPUCOUNT=ACTUAL sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","help":"CPUCOUNT=ACTUAL | &lt;*num*&gt;","type":"choice","arguments":[{"name":"ACTUAL","description":"Sets CPUCOUNT to the number of physical processors available. This number can be less than the physical number of CPUs if the SAS process has been restricted by system administration tools.","type":"standalone"},{"name":"num","placeholder":true,"description":"Replace <num> with an actual number. Setting CPUCOUNT= to a number greater than the actual number of available CPUs might result in reduced performance. This option overrides the CPUCOUNT= SAS system option.","type":"value"}]},{"name":"DATASERVER=","optional":true,"description":"Specifies the name of the server on Teradata systems as defined through the hosts file and as used in the LIBNAME statement for Teradata. For example, if the hosts file defines myservercop1 33.44.55.66 as the server for Teradata, then a LIBNAME specification would be as follows: libname TDLib teradata server=myserver user= password= database= ; A PERFORMANCE statement to induce running alongside the Teradata server would specify the following:","type":"value"},{"name":"DETAILS","optional":true,"description":"Requests a table that shows a timing breakdown of the procedure steps.","type":"standalone"},{"name":"HOST=","optional":true,"aliases":["GRIDHOST="],"description":"Specifies the name of the appliance host in single or double quotes. If the HOST= option is specified, it overrides the value of the GRIDHOST environment variable.","type":"value"},{"name":"INSTALL=","optional":true,"aliases":["INSTALLLOC="],"description":"Specifies the directory in which the High-Performance Analytics shared libraries are installed on the appliance. Specifying the INSTALL= option overrides the GRIDINSTALLLOC environment variable.","type":"value"},{"name":"NODES=","optional":true,"aliases":["NNODES="],"description":"Specifies the number of nodes in the distributed computing environment, provided that the data are not processed alongside the database.","type":"value"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads for analytic computations and overrides the SAS system option THREADS | NOTHREADS. If you do not specify the NTHREADS= option, the number of threads are determined based on the number of CPUs on the host on which the analytic computations execute. The algorithm by which a CPU count is converted to a thread count is specific to the High- Performance Analytics procedure. Most procedures create one thread per CPU for the analytic computations. By default, High-Performance Analytics procedures execute in multiple concurrent threads unless turned off by the NOTHREADS system option or you force single-threaded execution with NTHREADS=1. The largest number that can be specified for n is 256. Individual High-Performance Analytics procedures can impose more stringent limits if called for by algorithmic considerations. You can affect the determination of the CPU count with the CPUCOUNT= option in the PERFORMANCE statement.","help":"NTHREADS=*n*","type":"value"},{"name":"TIMEOUT=","optional":true,"description":"Specifies the timeout in seconds for a High-Performance Analytics procedure to wait for a connection to the appliance and establish a connection back to the client. The default is s=120 seconds. If jobs are submitted to the appliance through workload management tools that might suspend access to the appliance for a longer period, you might want to increase the timeout value.","help":"TIMEOUT=*s*","type":"value"}]},{"name":"REDUCE","description":"PROC HPREDUCE can be used for both supervised and unsupervised variable selection. In unsupervised case, the REDUCE statement specifies the effects to be considered in the variable selection process. An effect can be an original variable in the input data set or a variable constructed from the original variables. In the supervised case, besides the effects, the response variables also needs to be specified. A response variable can be an original variable in the input data set or a variable constructed from the original variables. The HPREDUCE procedure allows users to specify more than one response variables. The following reduce-options control the number of variables to be selected: MAXSTEPS= Specifies the maximal number steps to take for variable selection MAXEFFECTS= Specifies the number of effects to select VARIANCEXPLAINED | VAREXP= Specifies the fraction of the total variance to be explained MINVARIANCEINCREMENT | VARINC= Specifies minimal increment of explained variance (in fraction of the total variance)","help":"REDUCE &lt;MAXSTEPS=n&gt; &lt;SUPERVISED&gt; &lt;UNSUPERVISED&gt; ...","arguments":[{"name":"MAXEFFECTS=","optional":true,"followsDelimiter":"/","description":"Specifies the number of effects to select; the number must be greater than or equal to 1.","help":"MAXEFFECTS=*n*","type":"value"},{"name":"MAXSTEPS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of steps to take for variable selection; the number must be greater than or equal to 1.","help":"MAXSTEPS=*n*","type":"value"},{"name":"MINVARIANCEINCREMENT=","optional":true,"followsDelimiter":"/","aliases":["VARINC="],"description":"Specifies the minimum increment of explained variance (in a fraction of the total variance); the value must be between 0 and 1.","type":"value"},{"name":"SUPERVISED","optional":true,"followsDelimiter":"/","description":"In the supervised case, besides the effects, the response variables also needs to be specified. A response variable can be an original variable in the input data set or a variable constructed from the original variables.","type":"standalone"},{"name":"UNSUPERVISED","optional":true,"followsDelimiter":"/","description":"In unsupervised case, the REDUCE statement specifies the effects to be considered in the variable selection process. An effect can be an original variable in the input data set or a variable constructed from the original variables.","type":"standalone"},{"name":"VARIANCEEXPLAINED=","optional":true,"followsDelimiter":"/","aliases":["VAREXP="],"description":"Specifies the fraction of the total variance to be explained; the value must be between 0 and 1.","type":"value"}]}],"supportSiteInformation":{"docsetId":"emhpprcref","docsetVersion":"v_001","docsetTargetFile":"emhpprcref_hpreduce_toc.htm"}}