{"name":"ICA","statements":[{"name":"PROC ICA","description":"The ICA procedure performs independent component analysis in SAS Viya. † Independent component analysis attempts to extract from the observed multivariate data independent components (also called factors or latent variables) that are as statistically independent from each other as possible. The methods that PROC ICA implements, where statistical independence is defined as the maximization of non-Gaussianity, seek linear combinations of the observed random variables that maximize the non-Gaussianity of the estimated independent components.","help":"PROC ICA <DATA=CAS-libref.data-table> <EIGTHRESH=p | EIGENTHRESHOLD=p> <GFUNCTION=EXP | LOGCOSH> <METHOD=DEFLATION | SYMMETRIC> <N=number> <NOCENTER> <NOSCALE> <PREFIX=name> <SEED=number> <WHITEPREFIX=name | WPREFIX=name>;     \n\tBY variables;\n    \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...;\n    \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...;\n    \n\tOUTPUT <COMP<=prefix> | COMPONENT<=prefix>> <COPYVAR=variable | COPYVARS=(variables)> <OUT=CAS-libref.data-table> ...;\n    \n\tVAR variables;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC ICA to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"EIGTHRESH=","optional":true,"aliases":["EIGENTHRESHOLD="],"description":"Specifies the threshold for the proportion of variance explained by eigenvalues, where 0 ≤ p ≤ 1. If the proportion of variance that an eigenvalue explains is less than the threshold, the eigenvalue is discarded in the analysis. You can use this option to reduce the dimensionality of the input data.","type":"value"},{"name":"GFUNCTION=","optional":true,"aliases":["GFUNC="],"description":"Specifies the nonquadratic function G(x) to be used in the approximation of negentropy.","help":"GFUNCTION=EXP | LOGCOSH","type":"choice","arguments":[{"name":"EXP","description":"Uses an exponential function","type":"standalone"},{"name":"LOGCOSH","description":"Uses a log cosh function","type":"standalone"}]},{"name":"METHOD=","optional":true,"description":"Specifies the independent component extraction method to be used.","help":"METHOD=DEFLATION | SYMMETRIC","type":"choice","arguments":[{"name":"DEFLATION","description":"Syntax: DEFLATION<(defl-options)> Requests the deflationary decorrelation method. You can specify the following defl-options: MAXITER=n specifies the maximum number of iterations to perform. By default, MAXITER=500. TOL=n TOLERANCE=n specifies the convergence criterion. By default, TOL=1E–4.","type":"standalone"},{"name":"SYMMETRIC","description":"Syntax: SYMMETRIC<(symm-options)> Requests the symmetric decorrelation method. You can specify the following symm-options: MAXITER=n specifies the maximum number of iterations to perform. By default, MAXITER=500. TOL=n TOLERANCE=n specifies the convergence criterion. By default, TOL=1E–4.","type":"standalone"}]},{"name":"N=","optional":true,"description":"Specifies the number of independent components to be computed. The default is the number of numeric variables to be analyzed. The number must be an integer greater than or equal to 0. If N=0, the default is used.","help":"N=*number*","type":"value"},{"name":"NOCENTER","optional":true,"description":"Suppresses centering of the numeric variables to be analyzed. This option is useful if the analysis variables are already centered and scaled.","type":"standalone"},{"name":"NOSCALE","optional":true,"description":"Suppresses scaling of the numeric variables to be analyzed. This option is useful if the analysis variables are already centered and scaled.","type":"standalone"},{"name":"PREFIX=","optional":true,"description":"Specifies a prefix for naming the independent components. By default, the names are Comp1, Comp2, …, Compn. If you specify PREFIX=Abc, the components are named Abc1, Abc2, Abc3, and so on. The number of characters in the prefix plus the number of digits required to designate the variables should not exceed the current name length that is defined by the VALIDVARNAME= system option.","help":"PREFIX=*name*","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies an integer as the seed value for pseudorandom number generation. PROC ICA uses random values to initialize the demixing matrix. Changing the seed value changes the initial demixing matrix, resulting in a different estimated demixing matrix. If you do not specify this option or if number is less than or equal to 0, the seed is generated by reading the time of day from the computer’s clock. By default, SEED=0.","help":"SEED=*number*","type":"value"},{"name":"WHITEPREFIX=","optional":true,"aliases":["WPREFIX="],"description":"Specifies a prefix for naming the whitened variables. By default, the names are White1, White2, …, Whiten. If you specify WHITEPREFIX=Abc, the components are named Abc1, Abc2, Abc3, and so on. The number of characters in the prefix plus the number of digits required to designate the variables should not exceed the current name length that is defined by the VALIDVARNAME= system option.","type":"value"}]},{"name":"BY","description":"You can specify a BY statement in PROC ICA to obtain separate analyses of observations in groups that are defined by the values of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY variables"},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a data table that contains observationwise statistics, which are computed after PROC ICA fits the model. If you do not specify a keyword, then only the independent component values are included.","help":"OUTPUT &lt;COMP&lt;=prefix&gt; | COMPONENT&lt;=prefix&gt;&gt; &lt;COPYVAR=variable | COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; ...","arguments":[{"name":"COMP","optional":true,"aliases":["COMPONENT"],"description":"Requests the source values for each indepedent component. The optional prefix is for naming the output variables. The default prefix is the one that you specify in the PREFIX= option.","type":"standalone"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Transfers one or more variables from the input data table to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC TSNE to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"WHITE","optional":true,"description":"Requests the source values for each whitened variable. The optional prefix is for naming the output variables. The default prefix is the one that you specify in the WHITEPREFIX= option.","type":"standalone"}]},{"name":"VAR","description":"The VAR statement lists the numeric variables to be analyzed. If you omit the VAR statement, all numeric variables that are not specified in other statements are analyzed.","help":"VAR variables"}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"v_027","docsetTargetFile":"casstat_ica_toc.htm"}}