{"name":"ICLIFETEST","statements":[{"name":"PROC ICLIFETEST","description":"The ICLIFETEST procedure performs nonparametric survival analysis for interval-censored data. You can use the ICLIFETEST procedure to compute nonparametric estimates of the survival functions and to examine the equality of the survival functions through statistical tests. † The ICLIFETEST procedure compares most closely to the LIFETEST procedure. The two procedures share the same analytic objectives: estimating and summarizing subjects’ survival experiences and comparing them systematically. The distinction between these procedures lies in the types of data that they are designed to handle. The ICLIFETEST procedure is intended primarily for handling interval-censored data, whereas the LIFETEST procedure deals exclusively with right-censored data. You can use the ICLIFETEST procedure to analyze data that are left-censored, interval-censored, or right-censored. However, if the data to be analyzed contain only exact or right-censored observations, it is recommended that you use the LIFETEST procedure because it provides specialized methods for dealing with right-censored data.","help":"PROC ICLIFETEST <ALPHA=α> <ALPHAQT=α> <ATRISK> <BOOTSTRAP <(options)> | BOOT <(options)>> <CONFTYPE=ASINSQRT | LOGLOG | LINEAR... > <DATA=SAS-data-set> <IMPUTE <(options)> | IM <(options)>> <ITHISTORY> <MAXITER=n | MAXIT=n> <MAXTIME=value> <METHOD=TURNBULL | EMICM | ICM> <MISSING> <NOPRINT> <NOSUMMARY> <OUTSURV=SAS-data-set | OUTS=SAS-data-set> <PLOTS=ALL | HAZARD | LOGLOGS... > <SHOWTI> <SINGULAR=value> <TOLLIKE=value>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tFREQ variable;     \n\tSTRATA variables ;     \n\tTEST <ADJUST=<BONFERRONI | DUNNETT | SCHEFFE>... > <DIFF=<ALL | CONTROL>> <NODETAIL> ...; \n   \n\tTIME (variable, variable ); ","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance, α, for the 100(1 - α)% confidence intervals for the survival functions. For example, ALPHA=0.05 requests 95% confidence limits. By default, ALPHA=0.05.","type":"value"},{"name":"ALPHAQT=","optional":true,"description":"Specifies the significance level, α, for the 100(1 - α)% confidence intervals for the quartiles of the survival time. For example, ALPHAQT=0.05 requests a 95% confidence interval. By default, ALPHAQT=0.05.","type":"value"},{"name":"ATRISK","optional":true,"description":"Adds a column that represents the number of subjects at risk to the survival estimate table. Also added is a column that represents the number of events at each observed time. This option has no effect for the life-table method.","type":"standalone"},{"name":"BOOTSTRAP","optional":true,"aliases":["BOOT"],"description":"Performs simple bootstrap sampling and computes bootstrap standard errors of nonparametric survival estimates. You can specify the following suboptions to control how the bootstrap samples are generated:","type":"standalone"},{"name":"CONFTYPE=","optional":true,"description":"Specifies the transformation applied to S(t) to obtain the pointwise confidence intervals and the confidence bands for the survival function in addition to the confidence intervals for the quartiles of the survival times.","help":"CONFTYPE=ASINSQRT | LOGLOG | LINEAR | LOG | LOGIT","type":"choice","arguments":[{"name":"ASINSQRT","description":"Specifies the arcsine-square root transformation.","type":"standalone"},{"name":"LOGLOG","description":"Specifies the log-log transformation.","type":"standalone"},{"name":"LINEAR","description":"Specifies the identity transformation.","type":"standalone"},{"name":"LOG","description":"Specifies the logarithmic transformation.","type":"standalone"},{"name":"LOGIT","description":"Specifies the logit transformation.","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Names tthe SAS data set that PROC ICLIFETEST reads. By default, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"IMPUTE=","optional":true,"aliases":["IM"],"description":"Specifies details for multiple imputations. You can specify the following two suboptions to control how the samples are generated:","help":"IMPUTE=NIMSE | NIMTEST | SEED","type":"choice","arguments":[{"name":"NIMSE","type":"standalone"},{"name":"NIMTEST","type":"standalone"},{"name":"SEED","type":"standalone"}]},{"name":"ITHISTORY","optional":true,"description":"Prints the iteration history of the nonparametric estimation, including the log likelihood, the probability estimate that is associated with each Turnbull interval, and whether the EM or ICM method is used for each iteration.","type":"standalone"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Specifies the maximum number of iterations for estimating the survival function. The default value depends on the estimation method as follows: •EMICM method: 200 •ICM method: 200 •Turnbull method: 500","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies the maximum value of the time variable that is allowed in plots so that outlying points do not determine the scale of the time axis of the plots. This option affects only the way in which plots are displayed and has no effect on any calculations.","help":"MAXTIME=*value*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the method to be used for computing survival function estimates. By default, METHOD=EMICM.","help":"METHOD=TURNBULL | EMICM | ICM","type":"choice","arguments":[{"name":"TURNBULL","description":"Requests that the Turnbull method be used to estimate the survival function.","type":"standalone"},{"name":"EMICM","description":"Requests that the EMICM algorithm be used to estimate the survival function.","type":"standalone"},{"name":"ICM","description":"Requests that the iterative convex minorant algorithm be used to estimate the survival function.","type":"standalone"}]},{"name":"MISSING","optional":true,"description":"Allows missing values to be a stratum level or a valid group for the variables that are specified in the STRATA and TEST statements.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of output. This option is useful when only an output data set is needed.","type":"standalone"},{"name":"NOSUMMARY","optional":true,"description":"Suppresses the summary table of the number of censored and uncensored values.","type":"standalone"},{"name":"OUTSURV=","optional":true,"aliases":["OUTS="],"description":"Creates an output SAS data set to contain the estimates of the survival function and corresponding confidence limits for all strata.","type":"value"},{"name":"PLOTS=","optional":true,"description":"Controls the plots that are produced by using ODS Graphics. You can specify the following global-plot-option:","help":"PLOTS=ALL | HAZARD | LOGLOGS | LOGSURV | SURVIVAL | NONE","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"HAZARD","description":"Syntax: HAZARD <(hazard-options)> Plots the kernel-smoothed hazard functions. You can specify the following hazard-options. BANDWIDTH|BW=value | numeric-list | RANGE(lower,upper) specifies the bandwidth for kernel-smoothed estimation of the hazard function. You can specify one of the following bandwidth-options. value -- sets the bandwidth to the given value. numeric-list -- selects the bandwidth from the given numeric-list that minimizes the mean integrated squared error. RANGE(lower,upper) -- selects the bandwidth from the interval (lower, upper) that minimizes the mean integrated squared error. SAMPLING=LEAVEONE | RANDOM specifies how to partition the data set to form cross validation groups. GRIDL=number -- specifies the lower grid limit for the kernel-smoothed estimate. The default value is the time origin. GRIDU=number -- specifies the upper grid limit for the kernel-smoothed estimate. The default value equals the maximum event time KERNEL=kernel-option -- specifies the kernel used. The choices are as follows: BIWEIGHT | BW EPANECHNIKOV | E UNIFORM | U CVFOLD=number -- specifies the number of cross validation groups. CVGRID=number -- specifies the number of grid points to use in determining the cross validation pseudo-likelihood. HGRID=number -- specifies the number of grid points for discretizing the smoothed hazard function.","type":"standalone"},{"name":"LOGLOGS","description":"Plots the log of the negative log of the estimated survival function versus the log of time.","type":"standalone"},{"name":"LOGSURV","description":"Plots the negative log of the estimated survival function versus time.","type":"standalone"},{"name":"SURVIVAL","description":"Syntax: SURVIVAL|S <(CL | FAILURE | NODASH | STRATA | TEST)> Plots the estimated survival function. You can customize the display by specifying the following values: CL -- displays pointwise confidence limits for the survival function. FAILURE | F -- changes all the displays for survival function to those for the failure function. NODASH -- suppresses the plotting of dashed lines as linear interpolations for the Turnbull intervals. STRATA=INDIVIDUAL | OVERLAY | PANEL specifies how to display the survival or failure curves for multiple strata. You can specify one of the following values: INDIVIDUAL | UNPACK -- requests that a separate plot be displayed for each stratum. OVERLAY -- requests that the survival or failure curves for the strata be overlaid on the same plot. PANEL -- requests that separate plots for the strata be organized into panels of two or four plots, depending on the number of strata. TEST -- displays the p-value for a K-sample test that is specified in the TEST statement.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"}]},{"name":"SHOWTI","optional":true,"description":"Presents the survival estimates in terms of Turnbull intervals.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Sets the tolerance for testing the singularity of the covariance matrix of test statistics.","help":"SINGULAR=*value*","type":"value"},{"name":"TOLLIKE=","optional":true,"description":"Sets the log-likelihood convergence criterion for the estimation algorithm. The default value depends on the estimation method as follows:","help":"TOLLIKE=*value*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC ICLIFETEST to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","description":"The FREQ statement names a variable that provides frequencies for each observation in the DATA= data set. Specifically, if n is the value of the FREQ variable for a given observation, then that observation is used n times.","help":"FREQ variable"},{"name":"STRATA","description":"The STRATA statement identifies the variables that determine the stratum levels. You can specify more than one variable in the STRATA statement. By default, strata are formed according to the nonmissing values of these variables. However, missing values are treated as a valid stratum level if you specify the MISSING option in the PROC ICLIFETEST statement.","help":"STRATA variables "},{"name":"TEST","description":"In the preceding syntax, variable is a variable whose values determine the groups to be tested. The values for variable can be formatted or unformatted. If variable is a character or numeric variable, then the groups are defined by the unique values of the TEST variable. You can specify only one variable in the TEST statement.","help":"TEST &lt;ADJUST=&lt;BONFERRONI | DUNNETT | SCHEFFE&gt;... &gt; &lt;DIFF=&lt;ALL | CONTROL&gt;&gt; &lt;NODETAIL&gt; ...","arguments":[{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Specifies the multiple-comparison method to use for adjusting the p-values of the paired tests.","help":"ADJUST=BONFERRONI | DUNNETT | SCHEFFE | SIDAK | SMM | TUKEY | SIMULATE","type":"choice","arguments":[{"name":"BONFERRONI","followsDelimiter":"/","description":"Applies the Bonferroni correction to the raw p-values.","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Performs Dunnett’s two-tailed comparisons of the control group to all other groups.","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Performs Scheffé’s multiple-comparison adjustment.","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Applies the Šidák correction to the raw p-values.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"performs the paired comparisons based on the studentized maximum modulus test.","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"Performs the paired comparisons based on Tukey’s studentized range test.","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes the adjusted p-values from the simulated distribution of the maximum or maximum absolute value of a multivariate normal random vector. Syntax: SIMULATE<(simulate-options)> You can specify the following simulate-options in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. ALPHA=value -- specifies the value α for estimating the (1 - α) quantile. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. NSAMP=n specifies the sample size for the simulation. REPORT specifies that a report on the simulation should be displayed, including a listing of the parameters, such as γ, ε, and α, as well as an analysis of various methods for estimating or approximating the quantile. SEED=number specifies an integer used to start the pseudo-random number generator for the simulation.","type":"standalone"}]},{"name":"DIFF=","optional":true,"followsDelimiter":"/","description":"Specifies which pairs of survival curves to consider for the multiple comparisons.","help":"DIFF=ALL | CONTROL","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all paired comparisons.","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Syntax: CONTROL <('string' <…'string'>)> Requests comparisons of the control survival curve with all other survival curves. To specify the control curve, you specify the quoted strings of formatted values that represent the curve in parentheses.","type":"standalone"}]},{"name":"NODETAIL","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the generalized log-rank statistics and the corresponding covariance matrices. If you specify the TREND option, the display of the scores for computing the trend test is suppressed.","type":"standalone"},{"name":"NOTEST","optional":true,"followsDelimiter":"/","description":"Suppresses the K-sample tests, stratified tests, and trend tests.","type":"standalone"},{"name":"OUTSCORE=","optional":true,"followsDelimiter":"/","aliases":["OUTSC="],"description":"Creates an output SAS data set to contain subject scores that are derived from a permutation form of the generalized log-rank statistic.","type":"value"},{"name":"TREND","optional":true,"followsDelimiter":"/","description":"Computes the trend test for the null hypothesis that the survival rates are the same for the groups versus an ordered alternative. If the TEST variable is numeric, the unformatted values of the variable are used as the scores; otherwise, the scores are 1, 2, ..., in the order of the strata.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"SyntaxL WEIGHT=test-request | (test-request <…test-request>) Requests weights to be applied to the generalized log-rank statistics to perform various tests.","help":"WEIGHT=FAY | FINKELSTEIN | FLEMING | SUN | NONE","type":"choice","arguments":[{"name":"FAY","followsDelimiter":"/","description":"Specifies the test that uses Fay’s weights (Fay 1999).","type":"standalone"},{"name":"FINKELSTEIN","followsDelimiter":"/","description":"Specifies the test that uses Finkelstein’s weights (Finkelstein 1986).","type":"standalone"},{"name":"FLEMING","followsDelimiter":"/","description":"Syntax: FLEMING(ρ1, ρ2) Specifies the family of tests in Harrington and Fleming (1982), where ρ1 and ρ2 are nonnegative numbers.","type":"standalone"},{"name":"SUN","followsDelimiter":"/","description":"Specifies the test that uses Sun’s weights (Sun 1996).","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Suppresses all comparison tests. Specifying WEIGHT=NONE is equivalent to specifying NOTEST.","type":"standalone"}]}]},{"name":"TIME","description":"The TIME statement names the variables that represent the interval-censored observations. The variables should be numeric. For example, the following statement identifies Left as the lower bound and Right as the upper bound of an observed interval: time (Left, Right);","help":"TIME (variable, variable )"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_023","docsetTargetFile":"statug_iclifetest_toc.htm"}}