{"name":"IRP","statements":[{"name":"PROC IRP","description":"The IRP procedure provides the ability to calculate periodic-review inventory replenishment policies for single-location and two-echelon-distribution inventory systems. These policies are determined through a number of algorithms that are controlled by user-specified options.","help":"PROC IRP *ALGORITHM=1|2**DATA=SAS-data-set**DIST=AUTO|GAMMA**MAXITER=i**MAXMESSAGES=i**METHOD=SERVICE|PENALTY**OUT=SAS-data-set* ;    HOLDINGCOST *variable*;   ITEMID *variables*;   LEADTIME &lt;/ options&gt;;   LEADTIMEDEMAND &lt;/ options&gt;;   LOCATION  variable &lt;/ options&gt;;   PENALTY &lt;/ options&gt;;   POLICYTYPE &lt;variable&gt;;   REPLENISHMENT &lt;/ options&gt;;   REVIEWTIMEDEMAND &lt;/ options&gt;;   SERVICE &lt;/ options&gt;; ","arguments":[{"name":"Algorithm=","optional":true,"description":"specifies the type of optimization heuristic to use for single-location inventory systems. This option is ignored when the OPTIMAL option is specified in the PENALTY statement. You can specify the following values: 1 uses an exact optimization algorithm. 2 uses an approximation algorithm. By default, ALGORITHM=1. For more information, see the section Policy Algorithm.","help":"Algorithm=*0 | 1*","type":"value"},{"name":"DATA=","optional":true,"description":"names the SAS data set that contains information about the items to be analyzed. The data set must include the mean and variance of review-time demand, mean replenishment order lead time, per-unit holding cost, fixed replenishment cost, and target service level or back-order penalty cost. The data set can contain other optional variables for use by PROC IRP. For single-location inventory systems, every observation corresponds to an individual inventory item to be analyzed. For two-echelon-distribution systems, every observation corresponds to an inventory item-location pair, and these pairs must be grouped together by item. The DATA= input data set must be sorted by the variables specified in the ITEMID statement. For more information about the variables in this data set, see the section Input Data Set. If the DATA= option is omitted, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DIST=","optional":true,"description":"specifies the type of probability distribution to use for approximating the distributions for both the lead-time demand and the demand during lead time plus review time. You can specify the following values: AUTO uses the normal distribution whenever appropriate; otherwise uses the gamma distribution. GAMMA uses the gamma distribution every time. By default, DIST=AUTO. This option is ignored when the OPTIMAL option is specified in the PENALTY statement. For more information, see the section Policy Algorithm.","help":"DIST=*AUTO |GAMMA*","type":"value"},{"name":"MAXITER=","optional":true,"description":"specifies the maximum number of iterations that the heuristic algorithm can use to calculate inventory replenishment policies. By default, MAXITER=100. This option is ignored when the OPTIMAL option is specified in the PENALTY statement.","help":"MAXITER=*i*","type":"value"},{"name":"MAXMESSAGES=","optional":true,"description":"specifies the maximum number of different items in the DATA= input data set for which input error messages are printed to the SAS log. By default, MAXMESSAGES=100.","help":"MAXMESSAGES=*i*","type":"value"},{"name":"METHOD=","optional":true,"description":"specifies the optimization method to use for calculating the inventory replenishment policies. You can specify the following values: SERVICE uses service-level requirements to calculate the replenishment policy. PENALTY uses back-order penalty costs to calculate the replenishment policy. By default, METHOD=SERVICE.","help":"METHOD=*SERVICE |PENALTY*","type":"value"},{"name":"OUT=","optional":true,"description":"specifies a name for the output data set that contains inventory replenishment policies, service measure estimates, and other inventory metrics as determined by PROC IRP. This data set also contains all the variables that are specified in the ITEMID statement. Every observation in the DATA= input data set has a corresponding observation in the output data set. For information about the variables in this data set, see the section OUT= Data Set. If this option is omitted, PROC IRP creates a data set and names it according to the DATAn naming convention.","help":"OUT=*SAS-data-set*","type":"dataSet"}]},{"name":"HOLDINGCOST","description":"The HOLDINGCOST statement identifies the variable in the DATA= input data set that specifies the per-period, per-unit holding cost of each item. (Negative, zero, and missing values for this variable are not permitted.) If this statement is not specified, PROC IRP looks for a variable named HOLDINGCOST. If this variable is not found in the DATA= input data set, PROC IRP halts with an error.","help":"HOLDINGCOST *variable*;","arguments":[{"name":"variable","placeholder":true,"description":"names the HOLDINGCOST variable.","type":"value"}]},{"name":"ITEMID","description":"The ITEMID statement identifies the variables in the DATA= input data set that specify individual inventory items. For a single-location inventory system, the variables primarily identify unique items in the input data set. However, each observation is processed independently, regardless of whether the values of the variables are unique. Thus, you can include any variables that might not necessarily pertain to the descriptions of the items in the list. All variables that are specified in this statement are included in the output data set. Therefore, in addition to identifying inventory information (such as SKU), you can also use the ITEMID statement in a single-location inventory system to specify variables that are carried through from the input data set to the output data set. For an illustration, see Example 1.1. For a two-echelon system, the ITEMID statement specifies the variables in the DATA= input data set that are used to group the observations in the input data set. Each group identifies a single item that is shipped from a warehouse to one or more retailers; each individual observation within a group corresponds to a single warehouse or retailer. The observations within a group are used together to process the group. As in the single-location inventory case, variables that are specified in the ITEMID statement are included in the output data set; however, in this case, the variables are used to process observations in groups rather than independently. Thus, you cannot use the ITEMID statement to simply copy variables from the input data set to the output data set (as you can in the single-location inventory system). Instead, you can include a simple DATA step after a call to PROC IRP to merge variables from the input and output data sets. If the ITEMID statement is not specified, PROC IRP halts with an error. Furthermore, PROC IRP expects the DATA= input data set to be sorted by the variables that are specified in the ITEMID statement. The ITEMID statement behaves much like the BY statement; therefore, you can use options such as DESCENDING and NOTSORTED in the ITEMID statement. For more information about the BY statement, see SAS System documentation.","help":"ITEMID *variable*;ID *variable*;SKUID *variable*;","arguments":[{"name":"variable","placeholder":true,"description":"names the ITEMID variable.","type":"value"}]},{"name":"LEADTIME","description":"The LEADTIME statement identifies the variables in the DATA= input data set that contain the mean and variance of the replenishment order lead time. This information is used to calculate the mean and variance of lead-time demand. The replenishment order lead time should be specified using the same scale as that used for the review periods. This statement is ignored if the LEADTIMEDEMAND statement is specified.","help":"LEADTIME */options*;","arguments":[{"name":"MAXCOV=","optional":true,"placeholder":true,"description":"specifies the maximum allowed value of the coefficient of variation for replenishment order lead time. Items whose coefficient of variation (ratio of the standard deviation and mean) of lead time is greater than maxcov are not processed. By default, MAXCOV=10.","type":"value"},{"name":"MEAN=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the mean of the replenishment order lead time. (Negative, zero, and missing values for this variable are not permitted.) If this option is omitted, PROC IRP looks for a variable named LTMEAN in the DATA= data set. If this variable is not found, PROC IRP halts with an error.","type":"value"},{"name":"VARIANCE=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the variance of the replenishment order lead time. (Negative and missing values for this variable are interpreted as 0.) If this option is omitted, a value of 0 is used for all observations.","type":"value"}]},{"name":"LEADTIMEDEMAND","description":"The LEADTIMEDEMAND statement identifies the variables in the DATA= input data set that contain the mean and variance of lead-time demand (that is, the amount of demand that occurs during the lead time). The IRP procedure uses the review-time demand and lead-time information to calculate the parameters of lead-time demand. Instead of specifying the parameters of lead time, you can directly specify the mean and variance of lead-time demand by using the LEADTIMEDEMAND statement. This feature is especially useful if lead time is greater than review time and demand is not stationary. If this statement is specified, the LEADTIME statement is ignored. Because the inventory is periodically reviewed, the lead time in consideration should start after one review period. For an illustration, see Example 1.4.","help":"LEADTIMEDEMAND */options*;","arguments":[{"name":"MEAN","placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the mean of the demand during lead time. (Negative, zero, and missing values for this variable are not permitted.)","type":"value"},{"name":"VARIANCE","placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the variance of the demand during lead time. (Negative, zero, and missing values for this variable are not permitted.)","type":"value"},{"name":"MAXCOV","optional":true,"placeholder":true,"description":"specifies the maximum allowed value of the coefficient of variation for lead-time demand. Items whose coefficient of variation (ratio of the standard deviation and mean) of lead-time demand is greater than maxcov are not processed. By default, MAXCOV=10.","type":"value"}]},{"name":"LOCATION","description":"The LOCATION statement identifies the character variable in the DATA= data set that identifies the retailer locations for the two-echelon-distribution inventory problem. The value of variable should be missing if the current observation corresponds to a warehouse. This statement is required for solving two-echelon-distribution inventory problems. If this statement is omitted, each observation is treated as a separate single-location inventory problem.","help":"LOCATION  variable &lt;/options&gt;","arguments":[{"name":"NLOCATIONS","optional":true,"placeholder":true,"description":"specifies an estimate of the maximum number of retailer locations in a single item group for the two-echelon-distribution inventory problem. This option is used for initial memory","type":"value"}]},{"name":"PENALTY","description":"The PENALTY statement enables you to specify back-order penalty cost information. This statement is ignored if METHOD=SERVICE in the PROC IRP statement.","help":"PENALTY */options*;","arguments":[{"name":"COST=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that specifies the per-period, per-unit item penalty cost for backlogged demand. (Negative, zero, and missing values for this variable are not permitted. In addition, values of this variable must be greater than or equal to 1.5 times the value of the variable specified in the HOLDINGCOST statement. This limitation prevents accidental user input errors and guarantees a minimum ready rate of at least 60%.) If METHOD=PENALTY in the PROC IRP statement and this option is not specified, PROC IRP looks for a variable named PENALTYCOST in the DATA= input data set. If this variable is not found, PROC IRP halts with an error.","type":"value"},{"name":"OPTIMAL","optional":true,"placeholder":true,"description":"requests that an optimal policy be calculated. This option is valid only if the LOCATION statement is not specified. By default, PROC IRP uses a heuristic method to calculate nearly optimal policies. For more information, see the section OPTIMAL Option.","type":"value"},{"name":"SCALE=","optional":true,"placeholder":true,"description":"controls the initial scaling of demand and cost parameters for optimal policy calculations. Initial scaling takes place if the calculated mean of demand during lead time plus review time is greater than scale. This option is ignored if the OPTIMAL option is not specified. Valid values are between 50 and 10,000. In general, the default scaling is sufficient to produce fast and accurate results. If desired, you can obtain more accuracy at the expense of longer execution time by increasing scale (thus decreasing the effective scaling). However, increasing scale increases the demand on memory and might result in an error. For more information, see the section OPTIMAL Option. By default, SCALE=100.","type":"value"}]},{"name":"POLICYTYPE","description":"The POLICYTYPE statement identifies the variable in the DATA= input data set that specifies the type of inventory replenishment policy to be calculated. Table 3 lists the valid values of this variable. For more information about policy types, see the section Replenishment Policies.","help":"POLICYTYPE *variable*;","arguments":[{"name":"variable","placeholder":true,"description":"names the POLICYTYPE variable.","type":"value"}]},{"name":"REPLENISHMENT","description":"You can specify the following options:","help":"REPLENISHMENT */options*;","arguments":[{"name":"DELTA=","optional":true,"placeholder":true,"description":"specifies the method used for calculating the difference, DELTA, for (s,S) policies or the base lot size, Q, for (s, nQ) policies. You can specify the following values: POWER uses a power approximation to determine DELTA or Q. EOQ uses the classic economic order quantity to determine DELTA or Q. For more information, see the section Policy Algorithm. By default, DELTA=POWER.","help":"*DELTA=POW|EOQ*","type":"value"},{"name":"FCOST=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that specifies the fixed ordering cost of placing a replenishment order. (Negative and missing values for this variable are interpreted as 0.) If this option is not specified, PROC IRP looks for a variable named FIXEDCOST in the DATA= input data set. If this variable is not found, PROC IRP halts with an error.","type":"value"},{"name":"LOTSIZE=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that specifies the difference, DELTA, for (s,S) policies or the base lot size, Q, for (s, nQ) policies. (Negative, zero, and missing values for this variable are ignored.)","type":"value"},{"name":"MAXFREQ=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the maximum allowable average ordering frequency. In practice, the fixed cost of placing an order can be difficult to estimate; therefore, this variable enables you to limit the frequency with which orders are placed. (Negative, zero, and missing values for this variable are ignored. Furthermore, for (s, S) policies, the value cannot be less then 1/qgrid, where qgrid is the value specified by the QGRID= option, or PROC IRP halts with an error.)","type":"value"},{"name":"MINSIZE=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the minimum allowable replenishment order size. (Negative and missing values for this variable are ignored, with the exception of –1. A value of –1 is a special flag and sets the minimum order size to 1.5 times the average one-period demand.) If this option is omitted, a value of 0 is used for all observations.","help":"*MINSIZE=* ","type":"value"},{"name":"QGRID=","optional":true,"placeholder":true,"description":"identifies the granularity of the inventory position distribution for (s, S) policies. This option is used only for the heuristic algorithms and is ignored when the OPTIMAL option is specified in the PENALTY statement. Valid values are between 5 and 100. By default, QGRID=10, which is appropriate for most situations. However, specifying a value greater than the default might result in better accuracy (at the expense of computation time).","type":"value"}]},{"name":"REVIEWTIMEDEMAND","description":"The REVIEWTIMEDEMAND statement identifies the variables in the DATA= input data set that contain the mean and variance of the review-time demand. When the REVIEWTIMEDEMAND statement is specified, demand during the review periods is assumed to be stationary and independent.","help":"REVIEWTIMEDEMAND */options*;","arguments":[{"name":"MAXCOV=","optional":true,"placeholder":true,"description":"specifies the maximum allowed value of the coefficient of variation for review-time demand. Items whose coefficient of variation (ratio of the standard deviation and mean) of review-time demand is greater than maxcov are not processed. By default, MAXCOV=10.","type":"value"},{"name":"MEAN=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the mean of the demand during a single inventory review period. (Missing values and values less than 1 for this variable are not permitted. However, the mean of review-time demand at the warehouse in the two-echelon-distribution problem can be set to missing to instruct PROC IRP to automatically calculate the mean and variance of demand at the warehouse as the sum of the means and variances of demand at the retailer locations.) If this option is omitted, PROC IRP looks for a variable named RTDMEAN in the DATA= input data set. If this variable is not found, PROC IRP halts with an error.","type":"value"},{"name":"VARIANCE=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that contains the variance of the demand during a single inventory review period. (Negative and missing values for this variable are interpreted as 0.) If this statement is omitted, PROC IRP looks for a variable named RTDVAR in the DATA= input data set. If this variable is not found, PROC IRP halts with an error.","type":"value"}]},{"name":"SERVICE","description":"The SERVICE statement identifies the variables in the DATA= input data set that specify the type and the desired level of the service measure to be used by the inventory policy algorithm. This statement is ignored if METHOD=PENALTY in the PROC IRP statement.","help":"SERVICE */options*;","arguments":[{"name":"LEVEL=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that specifies the desired service level for the service measure that is specified in the TYPE= option. (Common ranges of service level are [0.80,0.99] for fill rate and ready rate and [0.01,0.20] for back-order ratio. Valid values for fill rate and ready rate are between 0.600 and 0.999 and for back-order ratio are between 0.001 and 0.400.) If METHOD=SERVICE in the PROC IRP statement and this option is not specified, PROC IRP looks for a variable named SERVICELEVEL in the DATA= input data set. If this variable is not found, PROC IRP halts with an error.","type":"value"},{"name":"TYPE=","optional":true,"placeholder":true,"description":"identifies the variable in the DATA= input data set that specifies the type of service measure to be used by the inventory replenishment algorithm. Only one service measure per item can be specified in a single procedure invocation.","type":"value"}]}],"supportSiteInformation":{"docsetId":"irpug","docsetVersion":"1.0","docsetTargetFile":"irpug_irp_toc.htm"}}