{"name":"IRT","statements":[{"name":"PROC IRT","description":"The item response theory (IRT) model was first proposed in the field of psychometrics for the purpose of ability assessment. It is most widely used in education to calibrate and evaluate items in tests, questionnaires, and other instruments and to score subjects on their abilities, attitudes, or other latent traits. Today, all major psychological and educational tests are built using IRT, because the methodology can significantly improve measurement accuracy and reliability while providing potential significant reductions in assessment time and effort, especially via computerized adaptive testing. In a computerized adaptive test, items are optimally selected for each subject. Different subjects might receive entirely different items during the test. IRT plays an essential role in selecting the most appropriate items for each subject and equating scores for subjects who receive different subsets of items. Notable examples of these tests include the Scholastic Aptitude Test (SAT), Graduate Record Examination (GRE), and Graduate Management Admission Test (GMAT). In recent years, IRT models have also become increasingly popular in health behavior, quality of life, and clinical research. The Patient Reported Outcomes Measurement Information System (PROMIS) project, funded by the US National Institutes of Health, is an excellent example. By using IRT, it aims to develop item banks that clinicians and researchers can use to collect important information about therapeutic effects that is not available from traditional clinical measures.","help":"PROC IRT <ABSFCONV=r | ABSFTOL=r> <ABSGCONV=r | ABSGTOL=r> <ABSPCONV=r | ABSPTOL=r> <DATA=SAS-data-set> <DESCENDING> <FCONV=r | FTOL=r> <GCONV=r | GTOL=r> <INMODEL<(SCORE)>=SAS-data-set> <ITEMFIT> <ITEMSTAT <(itemstat-options )>> <LINK=LOGIT | PROBIT> <MAXFUNC=n | MAXFU=n> <MAXITER=n | MAXIT=n> <MAXMITER=n | MAXMIT=n> <NFACTOR=i | NFACT=i> <NOAD> <NOITPRINT> <NOPRINT> <OUT=SAS-data-set> <OUTMODEL=SAS-data-set> <PINITIAL> <PLOTS=ALL | ICC | IIC... > <POLYCHORIC> <QPOINTS=i> <RCONVERGE=p | RCONV=p> <RESFUNC=ONEP | TWOP | THREEP... > <RITER=n> <RORDER=DATA | FORMATTED | FREQ... > <ROTATE=BIQUARTIMAX | EQUAMAX | ARSIMAX... > <SCOREMETHOD=ML | EAP | MAP> <TECHNIQUE=CONGRA | EM | NRRIDG... >;     \n\tBY variables;\n    \n\tCOV assignment <, assignment …>;\n    \n\tEQUALITY _ALLITEM_ _ALLONEP_ _ALL_ ...;\n    \n\tFACTOR factor-variables-relation <, factor-variables-relation …>;\n    \n\tFREQ variable;\n    \n\tGROUP variable;\n    \n\tMODEL <RESFUNC < = [ response-model-types ] >> ;\n    \n\tVARIANCE assignment <, assignment …>;\n    \n\tVAR | VARIABLE variables;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function difference convergence criterion. Termination requires a small change of the function value in successive iterations. By default, r = 0.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. Termination requires the maximum absolute gradient element to be small. By default, r = 1E–5.","type":"value"},{"name":"ABSPCONV=","optional":true,"aliases":["ABSPTOL="],"description":"Specifies a maximum absolute parameter difference convergence criterion. This criterion is used only by the EM algorithm. Termination requires the maximum absolute parameter change in successive iterations to be small.","type":"value"},{"name":"DATA=","optional":true,"description":"Specifies the SAS-data-set to be read by PROC IRT. The default value is the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DESCENDING","optional":true,"aliases":["DESC"],"description":"Reverses the sorting order for the levels of the response variables. If you specify both the DESCENDING and RORDER= options, PROC IRT orders the levels according to the RORDER= option and then reverses that order.","type":"standalone"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies the relative function convergence criterion. Termination requires a small relative change of the function value in successive iterations","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies the relative gradient convergence criterion. For all techniques except CONGRA, termination requires the normalized predicted function reduction to be small. By default, r = 1E–8.","type":"value"},{"name":"INMODEL=","optional":true,"description":"Specifies an input data set that contains information about the analysis model. Instead of specifying and running the model in a new run, you can use the INMODEL= option to input the model specification saved as an OUTMODEL= data set in a previous PROC IRT run.","help":"INMODEL=SCORE","type":"choice","arguments":[{"name":"SCORE","type":"standalone"}]},{"name":"ITEMFIT","optional":true,"description":"Displays the item fit statistics. These item fit statistics apply only to binary items that have one latent factor.","type":"standalone"},{"name":"ITEMSTAT=","optional":true,"description":"Displays the classical item statistics, which include the item means, item-total correlations, adjusted item-total correlations, and item means for i ordered groups of observations or individuals. You can specify the following itemstat-options: NPARTITION=i specifies the number of groups, where i must be an integer between 2 and 5, inclusive. By default NPARTITION=4. TIES=HIGH | LOW | MEAN | DENSE specifies how to compute normal scores or ranks for tied data values.","help":"ITEMSTAT=NPARTITION= | TIES=","type":"choice","arguments":[{"name":"NPARTITION=","type":"value"},{"name":"TIES=","type":"value"}]},{"name":"LINK=","optional":true,"description":"Specifies the link function. You can specify the following names: LOGIT requests the logistic link function. PROBIT requests the probit link function.","help":"LINK=LOGIT | PROBIT","type":"choice","arguments":[{"name":"LOGIT","description":"Requests the logistic link function.","type":"standalone"},{"name":"PROBIT","description":"Requests the probit link function.","type":"standalone"}]},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Specifies the maximum number of function calls in the optimization process. This option is not used by the EM algorithm. The default values are as follows, depending on which optimization technique is specified in the TECHNIQUE= option: •NRRIDG: 125 •QUANEW: 500 •CONGRA: 1000","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Specifies the maximum number of iterations in the optimization process. The default values are as follows, depending on which optimization technique is specified in the TECHNIQUE= option:","type":"value"},{"name":"MAXMITER=","optional":true,"aliases":["MAXMIT="],"description":"Specifies the maximum number of iterations in the maximization step of the EM algorithm. By default, MAXMITER=1.","type":"value"},{"name":"NFACTOR=","optional":true,"aliases":["NFACT="],"description":"Specifies the number of factors, i, in the model. You must specify the number of factors only for exploratory analysis, in which all the slope parameters of the items are freely estimated without being explicitly constrained by using the FACTOR statement. By default, NFACTOR=1. When you use the FACTOR statement to specify the confirmatory factor pattern, the number of factors is implicitly defined by the number of distinctive factor names that you specify in the statement.","type":"value"},{"name":"NOAD","optional":true,"description":"Requests that the Gaussian quadrature be nonadaptive.","type":"standalone"},{"name":"NOITPRINT","optional":true,"description":"Suppresses the display of the \"Iteration History\" table.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses all output displays.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output data set that contains all the data in the DATA= data set plus estimated factor scores. For exploratory analysis, the factor scores are named _Factor1, _Factor2, and so on. For confirmatory analysis, user-specified factor names are used.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTMODEL=","optional":true,"description":"Creates an output data set that contains the model specification, the parameter estimates, and their standard errors. You can use an OUTMODEL= data set as an input INMODEL= data set in a subsequent analysis by PROC IRT.","help":"OUTMODEL=*SAS-data-set*","type":"dataSet"},{"name":"PINITIAL","optional":true,"description":"Displays the initial parameter estimates.","type":"standalone"},{"name":"PLOTS=","optional":true,"description":"Controls the plots that are produced through ODS Graphics. When you specify only one plot-request, you can omit the parentheses around it. You can specify the following global-plot-options, which apply to all plots that the IRT procedure generates:","help":"PLOTS=ALL | ICC | IIC | POLYCHORIC | SCREE | TIC | NONE","type":"choice","arguments":[{"name":"ALL","description":"Displays all default plots.","type":"standalone"},{"name":"ICC","description":"Syntax: ICC <(UNPACK |UNPACKPANEL), (XVIEWMAX=), (XVIEWMIN=)> Displays item characteristic curves (ICCs).","type":"standalone"},{"name":"IIC","description":"Syntax: IIC <(UNPACK |UNPACKPANEL), (XVIEWMAX=), (XVIEWMIN=)> Displays item information curves (IICs).","type":"standalone"},{"name":"POLYCHORIC","description":"Syntax: POLYCHORIC <options> | PLCORR <options> Displays a heat map of the polychoric correlation matrix. You can specify one or both of the following options: FUZZ=p displays polychoric correlations whose absolute values are less than p as 0 in the heat map. This option is useful when you want to focus on the patterns of sizable correlations that are larger than p in the heat map. By default, FUZZ=0. OUTLINE=ON | OFF specifies whether to display an outline of the regions in the polychoric correlation heat map.","type":"standalone"},{"name":"SCREE","description":"Syntax: SCREE <(UNPACK |UNPACKPANEL)> Displays the scree and variance-explained plots in the same panel. You can display these plots individually by specifying the UNPACK suboption.","type":"standalone"},{"name":"TIC","description":"Syntax: TIC <(XVIEWMAX=), (XVIEWMIN=)> Displays a test information curve (TIC) plot.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"}]},{"name":"POLYCHORIC","optional":true,"description":"Displays the polychoric correlation matrix.","type":"standalone"},{"name":"QPOINTS=","optional":true,"description":"Specifies the number of quadrature points in each dimension of the integral.","help":"QPOINTS=*i*","type":"value"},{"name":"RCONVERGE=","optional":true,"aliases":["RCONV="],"description":"Specifies the convergence criterion for rotation cycles. Rotation stops when the scaled change of the simplicity function value is less than the RCONVERGE= value.","type":"value"},{"name":"RESFUNC=","optional":true,"description":"Specifies the response functions for the variables that are included in the VAR statement. The response functions correspond to different response models.","help":"RESFUNC=ONEP | TWOP | THREEP | FOURP | GRADED | RASCH","type":"choice","arguments":[{"name":"ONEP","description":"Specifies the one-parameter model.","type":"standalone"},{"name":"TWOP","description":"Specifies the two-parameter model.","type":"standalone"},{"name":"THREEP","description":"Specifies the three-parameter model.","type":"standalone"},{"name":"FOURP","description":"Specifies the four-parameter model.","type":"standalone"},{"name":"GRADED","description":"Specifies the graded response model.","type":"standalone"},{"name":"RASCH","description":"Specifies the Rasch model.","type":"standalone"}]},{"name":"RITER=","optional":true,"description":"Specifies the maximum number of cycles for factor rotation. The default value is the maximum between 10 times the number of variables and 100.","help":"RITER=*n*","type":"value"},{"name":"RORDER=","optional":true,"description":"Specifies the sort order for the levels of the response variable. This order determines which threshold parameter in the model corresponds to each level in the data.","help":"RORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their external formatted value, except for numeric variables that have no explicit format, which are sorted by their unformatted (internal) value","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count; levels that contain the most observations come first in the order","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted value.","type":"standalone"}]},{"name":"ROTATE=","optional":true,"aliases":["R="],"description":"Specifies the rotation method.","help":"ROTATE=BIQUARTIMAX | EQUAMAX | ARSIMAX | QUARTIMAX | VARIMAX | BIQUARTIMIN  | COVARIMIN | OBBIQUARTIMAX | OBEQUAMAX | OBPARSIMAX | OBQUARTIMAX | OBVARIMAX | QUARTIMIN | NONE","type":"choice","arguments":[{"name":"BIQUARTIMAX","description":"Specifies orthogonal biquartimax rotation.","type":"standalone"},{"name":"EQUAMAX","description":"Specifies orthogonal equamax rotation.","type":"standalone"},{"name":"ARSIMAX","description":"Specifies orthogonal parsimax rotation.","type":"standalone"},{"name":"QUARTIMAX","description":"Specifies orthogonal quartimax rotation.","type":"standalone"},{"name":"VARIMAX","description":"Specifies orthogonal varimax rotation.","type":"standalone"},{"name":"BIQUARTIMIN","description":"Specifies biquartimin rotation.","help":"BIQUARTIMIN ","type":"standalone"},{"name":"COVARIMIN","description":"Specifies covarimin rotation.","type":"standalone"},{"name":"OBBIQUARTIMAX","description":"Specifies oblique biquartimax rotation.","type":"standalone"},{"name":"OBEQUAMAX","description":"Specifies oblique equamax rotation.","type":"standalone"},{"name":"OBPARSIMAX","description":"Specifies oblique parsimax rotation.","type":"standalone"},{"name":"OBQUARTIMAX","description":"Specifies oblique quartimax rotation.","type":"standalone"},{"name":"OBVARIMAX","description":"Specifies oblique varimax rotation.","type":"standalone"},{"name":"QUARTIMIN","description":"Specifies quartimin rotation.","type":"standalone"},{"name":"NONE","description":"Specifies that no rotation be performed, leaving the original orthogonal solution.","type":"standalone"}]},{"name":"SCOREMETHOD=","optional":true,"description":"Specifies the method of factor score estimation.","help":"SCOREMETHOD=ML | EAP | MAP","type":"choice","arguments":[{"name":"ML","description":"Requests the maximum likelihood method.","type":"standalone"},{"name":"EAP","description":"Requests the expected a posteriori method.","type":"standalone"},{"name":"MAP","description":"Requests the maximum a posteriori method.","type":"standalone"}]},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH=","OMETHOD="],"description":"Specifies the optimization technique to obtain maximum likelihood estimates.","help":"TECHNIQUE=CONGRA | EM | NRRIDG | QUANEW | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Performs a conjugate-gradient optimization.","type":"standalone"},{"name":"EM","description":"Performs an EM optimization.","type":"standalone"},{"name":"NRRIDG","description":"Performs a Newton-Raphson optimization with ridging.","type":"standalone"},{"name":"QUANEW","description":"Performs a dual quasi-Newton optimization.","type":"standalone"},{"name":"NONE","description":"Performs no optimization.","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC IRT to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY variables"},{"name":"COV","description":"where assignment represents var-list < *var-list2 > < = parameter-spec> The COV statement defines the factor covariances in confirmatory models. In each assignment of the COV statement, you specify variables in the var-list and var-list2 lists, followed by the covariance parameter specification in the parameter-spec list. The last two specifications are optional. You can specify the following five types of the parameters for the covariances: • an unnamed free parameter • an initial value • a fixed value • a free parameter with a name provided • a free parameter with a name and initial value provided","help":"COV assignment &lt;, assignment …&gt;"},{"name":"EQUALITY","aliases":["EQCON"],"description":"where equality-constraints is defined as variable-list < / constraint-options >. The EQUALITY statement provides a versatile way to specify various types of equality constraints on the parameters in the model. You can specify within-group or between-group equality constraints on specific sets of parameters for particular sets of variables or factors. In the variable-list, you specify the set of variables that are subject to the equality constraints on their respective parameters. You can either specify the names of the variables or use one of the support keywords (see list later in this section) for variable-list. In the constraint-options, you specify the types of parameters, the specific groups (in multiple-group analysis), and the specific factors (in multidimensional models) on which the equality constraints are imposed.","help":"EQUALITY _ALLITEM_ _ALLONEP_ _ALL_ ...","arguments":[{"name":"_ALLFOURPITEM_BUT_","aliases":["_ALLFOURP_BUT_"],"description":"Specifies all variables except the excluded-variables that are fitted by the four-parameter model in the analysis.","type":"standalone"},{"name":"_ALLFOURP_","aliases":["_ALLFOURPITEM_"],"description":"Specifies all variables that are fitted by the four-parameter model in the analysis.","type":"standalone"},{"name":"_ALLGPCITEM_BUT_","aliases":["_ALLGPC_BUT_"],"description":"Specifies all variables except the excluded-variables that are fitted by the generalized partial credit model in the analysis.","type":"standalone"},{"name":"_ALLGPC_","aliases":["_ALLGPCITEM_"],"description":"Specifies all variables that are fitted by the generalized partial credit model in the analysis.","type":"standalone"},{"name":"_ALLGRITEM_BUT_","aliases":["_ALLGR_BUT_"],"description":"Specifies all variables except the excluded-variables that are fitted by the graded response model in the analysis.","type":"standalone"},{"name":"_ALLGR_","aliases":["_ALLGRITEM_"],"description":"Specifies all variables that are fitted by the graded response model in the analysis.","type":"standalone"},{"name":"_ALLITEM_","description":"Specifies all variables in the analysis.","type":"standalone"},{"name":"_ALLITEM_BUT_","description":"Specifies all variables except the excluded-variables in the analysis.","type":"standalone"},{"name":"_ALLONEPITEM_BUT_","aliases":["_ALLONEP_BUT_"],"description":"Specifies all variables except the excluded-variables that are fitted by the one-parameter model in the analysis.","type":"standalone"},{"name":"_ALLONEP_","aliases":["_ALLONEPITEM_"],"description":"Specifies all variables that are fitted by the one-parameter model in the analysis.","type":"standalone"},{"name":"_ALLRASCHITEM_BUT_","aliases":["_ALLRASCH_BUT_"],"description":"Specifies all variables except the excluded-variables that are fitted by the Rasch model in the analysis.","type":"standalone"},{"name":"_ALLRASCH_","aliases":["_ALLRASCHITEM_"],"description":"Specifies all variables that are fitted by the Rasch model in the analysis.","type":"standalone"},{"name":"_ALLTHREEPITEM_BUT_","aliases":["_ALLTHREEP_BUT_"],"description":"Specifies all variables except the excluded-variables that are fitted by the three-parameter model in the analysis.","type":"standalone"},{"name":"_ALLTHREEP_","aliases":["_ALLTHREEPITEM_"],"description":"Specifies all variables that are fitted by the three-parameter model in the analysis.","type":"standalone"},{"name":"_ALLTWOPITEM_BUT_","aliases":["_ALLTWOP_BUT_"],"description":"Specifies all variables except the excluded-variables that are fitted by the two-parameter model in the analysis.","type":"standalone"},{"name":"_ALLTWOP_","aliases":["_ALLTWOPITEM_"],"description":"Specifies all variables that are fitted by the two-parameter model in the analysis.","type":"standalone"},{"name":"_ALL_","description":"Specifies all variables and factors in the analysis. Equality constraints on parameters related to factors apply to multiple-group analysis only.","type":"standalone"},{"name":"_ALL_BUT_","description":"Specifies all variables and factors except the excluded-variables in the analysis.","type":"standalone"},{"name":"BETWEEN_GP","optional":true,"followsDelimiter":"/","aliases":["BETWEEN","BET"],"description":"Specifies that the equality constraints be applied across or between groups in the multiple-group analysis. Setting between-group constraints is the default when you fit multiple-group models. Hence, it is not necessary to use this option when you want to set equality constraints between all groups. When only a subset of groups is subject to the intended constraints, you can specify the groups in the group-list. This option has no effect if you have only one group in the analysis.","type":"standalone"},{"name":"PARM","optional":true,"followsDelimiter":"/","description":"Specifies the particular types of parameters that are subject to equality constraints. By default, all related parameters are subject to the constraints.","help":"PARMCEILING|CEIL | GUESSING|GUESS | INTERCEPT  | SLOPE","type":"choice","arguments":[{"name":"CEILING","followsDelimiter":"/","description":"Indicates that the ceiling parameters are constrained.","help":"CEILING|CEIL","type":"choice"},{"name":"GUESSING","followsDelimiter":"/","description":"Indicates that the guessing parameters are constrained.","help":"GUESSING|GUESS","type":"choice"},{"name":"INTERCEPT","followsDelimiter":"/","description":"Indicates that the intercept parameters are constrained.","help":"INTERCEPT ","type":"standalone"},{"name":"SLOPE","followsDelimiter":"/","description":"Syntax: SLOPE < [ factor-list ]> | DISCRIMINATION <[ factor-list ]> Indicates that the slope or discrimination parameters are constrained. The optional factor-list indicates the set of factors to which the constrained slope parameters pertain. The use of factor-list is relevant only when you conduct a confirmatory analysis by specifying the factor pattern in the FACTOR statement.","type":"standalone"}]},{"name":"WITHIN_GP","optional":true,"followsDelimiter":"/","aliases":["WITHIN","WIT"],"description":"Specifies that the equality constraints be applied within groups in multiple-group analyses. Setting within-group constraints is the default when you fit a single-group model. Hence, this option is not necessary when you have only one group in the analysis. In multiple-group analyses, between-group constraints are set by default. When you specify this option, within-group constraints are set instead of between-group constraints. You can also specify the specific groups in the group-list that are subject to the within-group constraints. The default is to apply the equality constraints to all groups.","type":"standalone"}]},{"name":"FACTOR","description":"where each factor-variables-relation is defined as factor right-arrow var-list < = parameter-spec> where factor is a name that represents an intended factor; right-arrow is ===>, --->, ==>, -->, =>, ->, or >; var-list is a list of variables that have nonzero slopes associated with the factor; and parameter-spec represents the specifications of parameter name and values (fixed or initial). You use the FACTOR statement to specify the pattern of relationships between variables and factors in confirmatory models. You do not need to use the FACTOR statement if you are fitting an exploratory model. To complete the specification of a confirmatory model, you might need to use the VARIANCE and COV statements to specify the variance and covariance parameters in the model, as shown in the following syntax: FACTOR factor-variable-relation <, factor-variables-relation …>; VARIANCE variance-parameters; COV covariance-parameters;","help":"FACTOR factor-variables-relation &lt;, factor-variables-relation …&gt;"},{"name":"FREQ","description":"If one variable in your data set represents the frequency of occurrence for the other values in the observation, specify the variable’s name in a FREQ statement. PROC IRT then treats the data set as if each observation appears n times, where n is the value of the FREQ variable for observation i. Only the integer portion of the value is used. If the value of the FREQ variable is less than 1 or is missing, that observation is not included in the analysis. The total number of observations is considered to be the sum of the FREQ values.","help":"FREQ variable"},{"name":"GROUP","description":"The GROUP statement specifies the grouping variable that defines the groups of the observations. This statement is required if you intend to do a multiple-group analysis. The values of the grouping variable can be either integers or character strings. PROC IRT analyzes the input data set and determines the number of distinct groups in the data set by counting the number of distinct values in the grouping variable. Because there is no other explicit way to specify the number of groups or the grouping values, you must make sure that all (and only) the intended groups have been indexed properly by the grouping variable in the data set for a multiple-group analysis.","help":"GROUP variable"},{"name":"MODEL","description":"where model-specification is defined as variable-list < / model-option >. The MODEL statement specifies the items and their response functions or models. You can specify different response models for different items. In the variable-list, you specify the set of variables that use the same model.","help":"MODEL &lt;RESFUNC &lt; = [ response-model-types ] &gt;&gt; ","arguments":[{"name":"RESFUNC","optional":true,"followsDelimiter":"/","description":"Specifies the response function or model. Available response-model-types are:","type":"standalone"}]},{"name":"VARIANCE","description":"where assignment represents var-list < =parameter-spec>. The VARIANCE statement specifies the factor variance parameters in connection with the FACTOR statement. Notice that the VARIANCE statement is different from the VAR statement, which specifies variables for analysis. You can list factors only in the var-list of the VARIANCE statement. In each assignment of the VARIANCE statement, you include the var-list whose variances you want to specify. Optionally, you can provide a list of parameter specifications (parameter-spec) after an equal sign for each var-list. You can specify the following five types of the parameters for the variances of the latent factor in the VARIANCE statement: • an unnamed free parameter • an initial value • a fixed value • a free parameter with a name provided • a free parameter with a name and initial value provided","help":"VARIANCE assignment &lt;, assignment …&gt;"},{"name":"VAR","aliases":["VARIABLE"],"description":"The VAR statement lists the analysis variables or items in the model. If you do a multiple-group analysis, the same set of analysis variables is assumed for all groups. By default, all variables that you specify in the VAR statement are fitted by the graded response model, which assumes that the analysis variables are ordinal and have 2 to 19 levels.","help":"VAR | VARIABLE variables"},{"name":"WEIGHT","description":"The WEIGHT statement specifies the weight variable for the observations. The WEIGHT and FREQ statements have a similar effect, except that the WEIGHT statement does not alter the number of observations. An observation is used in the analysis only if the WEIGHT variable is greater than 0 and is not missing.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_029","docsetTargetFile":"statug_irt_toc.htm"}}