{"name":"KRIGE2D","statements":[{"name":"PROC KRIGE2D","description":"PROC KRIGE2D can handle anisotropic and nested semivariogram models. Eight semivariogram models are supported: the Gaussian, exponential, spherical, power, cubic, pentaspherical, sine hole effect, and Matérn models. A single nugget effect is also supported. You can specify the correlation model by naming the form and supplying the associated parameters, or by using the contents of an item store file that was previously created by PROC VARIOGRAM. † You can specify the locations of kriging predictions in a GRID statement, or they can be read from a SAS data set. The grid specification is most suitable for a regular grid; the data set specification can handle any irregular pattern of points.","help":"PROC KRIGE2D <DATA=SAS-data-set> <NOPRINT> <OUTEST=SAS-data-set> <OUTNBHD=SAS-data-set> <PLOTS=ALL | EQUATE | NONE... > <SINGULARMSG=number>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCOORDINATES <XCOORD= (variable-name)> <YCOORD= (variable-name)> ;     \n\tGRID <GRIDDATA=SAS-data-set> <XCOORD= (variable-name)> <YCOORD= (variable-name)> ...; \n   \n\tMODEL <ANGLE=angle | ANGLE=(angle-1,...,angle-k)> <FORM=<SPHERICAL|SPH | EXPONENTIAL|EXP | GAUSSIAN|GAUSS>... > <MDATA=SAS-data-set> ...; \n   \n\tPREDICT <MAXPOINTS=number> <MINPOINTS=number> <NODECREMENT> ...; \n   \n\tRESTORE <INFO <( info-options )>> ; ","arguments":[{"name":"DATA=","optional":true,"description":"Specifies a SAS data set containing the x and y coordinate variables and the VAR= variables in the PREDICT statement.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results.","type":"standalone"},{"name":"OUTEST=","optional":true,"aliases":["OUTE="],"description":"Specifies a SAS data set in which to store the kriging predictions, standard errors, and grid location.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"OUTNBHD=","optional":true,"aliases":["OUTN="],"description":"Specifies a SAS data set in which to store the neighborhood information for each grid point.","help":"OUTNBHD=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Controls the plots produced through ODS Graphics. The optional ONLY suppresses the default plot. Only plots specifically requested are displayed.","help":"PLOTS=ALL | EQUATE | NONE | OBSERVATIONS | PREDICTION","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"EQUATE","description":"Specifies that all appropriate plots be produced in a way that the axes coordinates have equal size units.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"OBSERVATIONS","aliases":["OBSERV","OBS"],"description":"Syntax: OBSERVATIONS <(observations-plot-options)> Produces the observed data plot, with the following suboptions: GRADIENT specifies that observations be displayed as circles colored by the observed measurement. OUTLINE specifies that observations be displayed as circles with a border but with a completely transparent fill. OUTLINEGRADIENT is the same as OBSERVATIONS(GRADIENT) except that a border is shown around each observation. SHOWMISSING specifies that observations with missing values be displayed in addition to the observations with nonmissing values.","type":"standalone"},{"name":"PREDICTION","aliases":["PRED"],"description":"Syntax: PREDICTION <(prediction-plot-options)> Specifies that the kriging prediction plot be produced, with the following prediction-plot-options: FILL=NONE | PRED | SE produces a surface plot for either the predicted values or the standard errors. LINE=NONE | PRED | SE produces a contour line plot for either the predicted values or the standard errors OBS=obs-options produces an overlaid scatter plot of the observations in addition to the specified contour plots. The following obs-options are available: GRAD specifies that observations be displayed as circles colored by the observed measurement. LINEGRAD is the same as OBS=GRAD except that a border is shown around each observation. NONE specifies that no observations be displayed. OUTL specifies that observations be displayed as circles with a border but with a completely transparent fill.","type":"standalone"}]},{"name":"SINGULARMSG=","optional":true,"aliases":["SMSG="],"description":"Controls the number of warning messages displayed for a singular matrix.","help":"SINGULARMSG=*number*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC KRIGE2D to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"COORDINATES","aliases":["COORD"],"description":"Only one COORDINATES statement is allowed, and it is applied to all PREDICT statements. In other words, it is assumed that all the VAR= variables in all PREDICT statements have the same x and y coordinates.","help":"COORDINATES &lt;XCOORD= (variable-name)&gt; &lt;YCOORD= (variable-name)&gt; ","arguments":[{"name":"XCOORD=","optional":true,"aliases":["XC="],"description":"Specifies the name of the variable containing the x coordinate of the data locations in the DATA= data set.","type":"value"},{"name":"YCOORD=","optional":true,"aliases":["YC="],"description":"Specifies the name of the variable containing the y coordinate of the data locations in the DATA= data set.","type":"value"}]},{"name":"GRID","description":"There are two basic methods for specifying the grid. You can specify the x and y coordinates explicitly, or they can be read from a SAS data set.","help":"GRID &lt;GRIDDATA=SAS-data-set&gt; &lt;XCOORD= (variable-name)&gt; &lt;YCOORD= (variable-name)&gt; ...","arguments":[{"name":"GRIDDATA=","optional":true,"aliases":["GDATA="],"description":"Specifies a SAS data set containing the x and y grid coordinates.","help":"GRIDDATA=*SAS-data-set*","type":"dataSet"},{"name":"XCOORD=","optional":true,"aliases":["XC="],"description":"Specifies the name of the variable containing the x coordinate of the data locations in the DATA= data set.","type":"value"},{"name":"YCOORD=","optional":true,"aliases":["YC="],"description":"Specifies the name of the variable containing the y coordinate of the data locations in the DATA= data set.","type":"value"}]},{"name":"MODEL","description":"The MODEL statement specifies details about the correlation model that you use in the kriging system for prediction. The specified model is used in the kriging system defined by the most previous PREDICT statement.","help":"MODEL &lt;ANGLE=angle | ANGLE=(angle-1,...,angle-k)&gt; &lt;FORM=&lt;SPHERICAL|SPH | EXPONENTIAL|EXP | GAUSSIAN|GAUSS&gt;... &gt; &lt;MDATA=SAS-data-set&gt; ...","arguments":[{"name":"ANGLE=","optional":true,"description":"Specifies the angle of the major axis for anisotropic models, measured in degrees clockwise from the N-S axis.","type":"value"},{"name":"FORM=","optional":true,"description":"Specifies the functional form (type) of the semivariogram model.","help":"FORM=SPHERICAL | EXPONENTIAL | GAUSSIAN | POWER","type":"choice","arguments":[{"name":"SPHERICAL","aliases":["SPH"],"description":"Spherical form","type":"standalone"},{"name":"EXPONENTIAL","aliases":["EXP"],"description":"Exponential form","type":"standalone"},{"name":"GAUSSIAN","aliases":["GAUSS"],"description":"Gaussian form","type":"standalone"},{"name":"POWER","aliases":["POW"],"description":"Power form","type":"standalone"}]},{"name":"MDATA=","optional":true,"description":"Specifies the input data set that contains parameter values for the covariance or semivariogram model.","help":"MDATA=*SAS-data-set*","type":"dataSet"},{"name":"NUGGET=","optional":true,"description":"Specifies the nugget effect for the model.","help":"NUGGET=*number*","type":"value"},{"name":"RANGE=","optional":true,"description":"Specifies the range parameter in semivariogram models.","type":"value"},{"name":"RATIO=","optional":true,"description":"Specifies the ratio of the length of the minor axis to the length of the major axis for anisotropic models.","type":"value"},{"name":"SCALE=","optional":true,"description":"Specifies the scale (or sill) parameter in semivariogram models.","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Gives the singularity criteria for solving kriging systems.","help":"SINGULAR=*number*","type":"value"},{"name":"SMOOTH=","optional":true,"description":"Specifies the smoothness parameter ν > 0 in the Matérn type of semivariance structures. The special case ν=0.5 is equivalent to the exponential model, whereas ν → ∞ gives the Gaussian model.","type":"value"},{"name":"STORESELECT=","optional":true,"description":"Specifies that information from an input item store be used for the prediction. You cannot combine the STORESELECT option with any of the FORM= or MDATA= options. The STORESELECT option has the following ssel-options: TYPE=field-type specifies whether to perform isotropic or anisotropic prediction. You can choose the field-type from one of the following: ISO specifies an isotropic field for the prediction. ANIGEO | GEO specifies a field with geometric anisotropy for the prediction. ANIZON(zonal-form1, ..., zonal-formn) ZON(zonal-form1, ..., zonal-formn) specifies a field with zonal anisotropy for the prediction. Each zonal-formi, i=1,...,n, can be any of the following: CUB | EXP | GAU | MAT | PEN | POW | SHE | SPH ANGLEID=angleid1 ANGLEID=(angleid1, angleid2) specifies which direction angles in the input item store be used for prediction.","help":"STORESELECT=MODEL= | ANGLEID= | ANIZON | TYPE=","type":"choice","arguments":[{"name":"MODEL=","type":"value"},{"name":"ANGLEID=","type":"value"},{"name":"ANIZON","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"PREDICT","aliases":["PRED"],"description":"","help":"PREDICT &lt;MAXPOINTS=number&gt; &lt;MINPOINTS=number&gt; &lt;NODECREMENT&gt; ...","arguments":[{"name":"MAXPOINTS=","optional":true,"aliases":["MAXP=","MAX="],"description":"Specifies the maximum number of data points in a neighborhood.","help":"MAXPOINTS=*number*","type":"value"},{"name":"MINPOINTS=","optional":true,"aliases":["MINP=","MIN="],"description":"Specifies the minimum number of data points in a neighborhood.","help":"MINPOINTS=*number*","type":"value"},{"name":"NODECREMENT","optional":true,"aliases":["NODECR"],"description":"Requests that the RADIUS= value not be decremented when the MAXPOINTS= value is exceeded at a grid point.","type":"standalone"},{"name":"NOINCREMENT","optional":true,"aliases":["NOINCR"],"description":"Requests that the RADIUS= value not be incremented when the MINPOINTS= value is not met at a grid point.","type":"standalone"},{"name":"NUMPOINTS=","optional":true,"aliases":["NPOINTS=","NPTS=","NP="],"description":"Specifies the exact size of a neighborhood. This option is incompatible with all other PREDICT statement options that control the neighborhood; it must appear by itself.","help":"NUMPOINTS=*number*","type":"value"},{"name":"RADIUS=","optional":true,"aliases":["R="],"description":"Specifies the radius to use in a local kriging regression.","help":"RADIUS=*number*","type":"value"},{"name":"VAR=","optional":true,"description":"Specifies the single numeric variable used in the kriging system.","type":"value"}]},{"name":"RESTORE","description":"The RESTORE statement specifies an item store that provides spatial correlation model input for the PROC KRIGE2D prediction tasks. An item store is a binary file defined by the SAS System. You cannot modify the contents of an item store. The KRIGE2D procedure can use only item stores created by PROC VARIOGRAM. The store-name is a usual one- or two-level SAS name, as for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session. Since item stores are often used for postprocessing tasks, typical usage specifies a two-level name of the form libname.membername.","help":"RESTORE &lt;INFO &lt;( info-options )&gt;&gt; ","arguments":[{"name":"INFO=","optional":true,"followsDelimiter":"/","description":"Specifies that additional information about the input item store be printed. This information is provided in two ODS tables. One table displays the variables in the item store, in addition to the mean and standard deviation for each of them. These statistics are based on the observations that were used to produce the store results. The second table shows the model on top of the list of all fitted models for each direction angle in the item store. The INFO option has the following info-options:","help":"INFO=DETAILS | DET | ONLY","type":"choice","arguments":[{"name":"DETAILS","type":"standalone"},{"name":"DET","type":"standalone"},{"name":"ONLY","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_019","docsetTargetFile":"statug_krige2d_toc.htm"}}