{"name":"LMIXED","statements":[{"name":"PROC LMIXED","description":"The LMIXED procedure fits a variety of linear mixed models to data and enables you to use these fitted models to make statistical inferences about the data. A linear mixed model is a generalization of the standard linear model that is used in the GLM procedure in SAS/STAT software; the generalization is that the data are permitted to exhibit correlation and nonconstant variability. Therefore, the linear mixed model provides you with the flexibility of modeling not only the means of your data (as in the standard linear model) but also their variances and covariances.","help":"PROC LMIXED <DATA=CAS-libref.data-table> <DMMETHOD=DENSE | SPARSE> <MAXCLPRINT=number> <METHOD=ML | REML> <MMEQ> <NAMELEN=number> <NOCLPRINT<=number>> <NOINFO> <NOITPRINT> <NOPRINT> <NOPROFILE> <RANKS> <SIMPLE> <SINGCHOL=number> <SINGRES=number> <SINGULAR=number> <TIMING>;     \n\tBLUP <ITPRINT=number> <MAXITER=number> <OUT=CAS-libref.data-table> ...; \n   \n\tBY variables;     \n\tCLASS <DESCENDING> <MISSING> <ORDER=<DATA | FORMATTED | FREQ>... > ...; \n   \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...; \n   \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...; \n   \n\tEFFECT <DETAILS> NAME=COLLECTION|MULTIMEMBER|MM|POLYNOMIAL|POLY...  <NOEFFECT> ...;     \n\tMODEL <ALPHA=α> <DDFM=<NONE | RESIDUAL>> <NOINT> ...; \n   \n\tOPTIMIZATION <ABSCONV=r> <ABSFCONV=r> <ABSGCONV=r> ...; \n   \n\tOUTPUT <ALLSTATS> <ALPHA=number> <OUT=CAS-libref.data-table> ...; \n   \n\tPARMS <HOLD<=order-list> | EQCONS<=order-list> | HOLD<=ALL> | EQCONS<=ALL>> <LOWERB=value-list> <NOITER> ...; \n   \n\tRANDOM <ALPHA=α> <CL> <SOLUTION> ...; \n   \n\tWEIGHT variable; ","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC LMIXED to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"DMMETHOD=","optional":true,"aliases":["DMM="],"description":"Specifies the method for computing the likelihood, gradient, and Hessian.","help":"DMMETHOD=DENSE | SPARSE","type":"choice","arguments":[{"name":"DENSE","description":"Is more suitable for models that have a large number of levels for a common subject effect and a relatively small number of levels for fixed-effects.","type":"standalone"},{"name":"SPARSE","description":"Is more memory-efficient and faster for models that have a large and sparse design matrix.","type":"standalone"}]},{"name":"MAXCLPRINT=","optional":true,"description":"Specifies the maximum number of levels of CLASS variables to print in the ODS table \"ClassLevels.\" MAXCLPRINT=0 enables you to print all levels of each CLASS variable. However, the option NOCLPRINT takes precedence over MAXCLPRINT. By default, MAXCLPRINT=20.","help":"MAXCLPRINT=*number*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the estimation method for the covariance parameters.","help":"METHOD=ML | REML","type":"choice","arguments":[{"name":"ML","description":"Performs maximum likelihood estimation.","type":"standalone"},{"name":"REML","description":"Performs residual (restricted) maximum likelihood estimation.","type":"standalone"}]},{"name":"MMEQ","optional":true,"description":"Displays the coefficients of the mixed model equations.","type":"standalone"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length to which long effect names are shortened. The minimum value is 20. Be default, NAMELEN=20.","help":"NAMELEN=*number*","type":"value"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the \"Class Level Information\" table if you do not specify number. If you specify number, the values of the classification variables are displayed only for variables whose number of levels is less than number. Specifying a number helps reduce the size of the \"Class Level Information\" table if some classification variables have a large number of levels.","type":"standalone"},{"name":"NOINFO","optional":true,"description":"Suppresses the display of the \"Model Information,\" \"Number of Observations,\" and \"Dimensions\" tables.","type":"standalone"},{"name":"NOITPRINT","optional":true,"description":"Suppresses the display of the \"Iteration History\" table.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results. This option is useful when you want only to create one or more output data tables by using the OUTPUT statement.","type":"standalone"},{"name":"NOPROFILE","optional":true,"description":"Includes the residual variance as one of the covariance parameters in the optimization iterations. (By default, this parameter is profiled out of the optimization iterations, except when you have specified the HOLD= option in the PARMS statement.)","type":"standalone"},{"name":"RANKS","optional":true,"description":"Displays the rank of the design matrix X.","type":"standalone"},{"name":"SIMPLE","optional":true,"description":"Displays the mean, standard deviation, coefficient of variation, minimum, and maximum statistics for each variable that is not a classification variable in the input DATA= table.","type":"standalone"},{"name":"SINGCHOL=","optional":true,"description":"Tunes the singularity criterion in Cholesky decompositions. The default is 1E4 times the machine epsilon, which is approximately 1E–12 on most computers.","help":"SINGCHOL=*number*","type":"value"},{"name":"SINGRES=","optional":true,"description":"Sets the tolerance for which the residual variance is considered to be zero. The default is 1E4 times the machine epsilon, which is approximately 1E–12 on most computers.","help":"SINGRES=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Tunes the general singularity criterion that the LMIXED procedure applies in sweeps and inversions. The default is 1E4 times the machine epsilon, which is approximately 1E–12 on most computers.","help":"SINGULAR=*number*","type":"value"},{"name":"TIMING","optional":true,"description":"Displays the amount of time (in seconds) that PROC LMIXED took to perform each different task in the analysis and its percentage of the total time.","type":"standalone"}]},{"name":"BLUP","description":"The BLUP statement creates a CAS data table that contains the best linear unbiased estimation (BLUE) of fixed effects and the best linear unbiased prediction (BLUP) of random effects. To use the BLUP statement, you must also use the PARMS statement to specify fixed values for all covariance parameters. When you use the BLUP statement, the ODS IterHistory table displays solver iterations that are used for BLUP solutions rather than displaying optimization iterations.","help":"BLUP &lt;ITPRINT=number&gt; &lt;MAXITER=number&gt; &lt;OUT=CAS-libref.data-table&gt; ...","arguments":[{"name":"ITPRINT=","optional":true,"description":"Displays that the iteration history after every number of iterations. By default, ITPRINT=10, which means the procedure displays the iteration history for every 10 iterations.","help":"ITPRINT=*number*","type":"value"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations. The default value is the number of parameters in the OUT= data table plus 2.","help":"MAXITER=*number*","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC LMIXED to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where CAS-libref refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, which includes a path to where the data table is to be stored, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement.","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"SOLVER=","optional":true,"description":"Specifies the solver to use for BLUP solutions. By default, SOLVER=IOC.","help":"SOLVER=DIRECT | IOC | IOD","type":"choice","arguments":[{"name":"DIRECT","description":"Requires storing mixed model equations (MMEQ) in memory and computing the Cholesky decomposition of MMEQ. This solver is the most accurate, but it is the most inefficient in terms of speed and memory.","type":"standalone"},{"name":"IOC","description":"Requires storing mixed model equations in memory and iterates on MMEQ to solve for the solutions.This solver is the most efficient in terms of speed.","type":"standalone"},{"name":"IOD","description":"Does not build mixed model equations; instead it iterates on data to solve for the solutions. This solver is most efficient in terms of memory.","type":"standalone"}]},{"name":"TOL=","optional":true,"description":"specifies the tolerance value. The default value is the square root of machine precision.","help":"TOL=*number*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement in PROC LMIXED to obtain separate analyses of observations in groups that are defined by the values of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY variables"},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis.","help":"CLASS &lt;DESCENDING&gt; &lt;MISSING&gt; &lt;ORDER=&lt;DATA | FORMATTED | FREQ&gt;... &gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sort order of the classification variable.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (., ._, .A, …, .Z for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sort order for the levels of classification variables. This ordering determines which parameters in the model correspond to each level in the data. By default, ORDER=FORMATTED. For ORDER=FORMATTED and ORDER=INTERNAL, the sort order is machine-dependent. When ORDER=FORMATTED is in effect for numeric variables for which you have supplied no explicit format, the levels are ordered by their internal values.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Levels sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"Levels sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Levels sorted by the descending frequency count; levels with the more observations come ealier in the order.","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Levels sorted by the unformatted value.","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | GLM | ORDINAL | POLYNOMIAL | REFERENCE | ORTHEFFECT | ORTHORDINAL | ORTHPOLY | ORTHREF","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Specifies effect coding.","type":"standalone"},{"name":"GLM","followsDelimiter":"/","description":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","type":"standalone"},{"name":"ORDINAL","followsDelimiter":"/","aliases":["THERMOMETER"],"description":"Specifies the cumulative parameterization for an ordinal CLASS variable.","type":"standalone"},{"name":"POLYNOMIAL","followsDelimiter":"/","aliases":["POLY"],"description":"Specifies polynomial coding.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","aliases":["REF"],"description":"Specifies reference-cell coding.","type":"standalone"},{"name":"ORTHEFFECT","followsDelimiter":"/","description":"Orthogonalizes PARAM=EFFECT.","type":"standalone"},{"name":"ORTHORDINAL","followsDelimiter":"/","aliases":["ORTHOTHERM"],"description":"Orthogonalizes PARAM=ORDINAL.","type":"standalone"},{"name":"ORTHPOLY","followsDelimiter":"/","description":"Orthogonalizes PARAM=POLYNOMIAL.","type":"standalone"},{"name":"ORTHREF","followsDelimiter":"/","description":"Orthogonalizes PARAM=REFERENCE.","type":"standalone"}]},{"name":"REF=","optional":true,"followsDelimiter":"/","aliases":["REFERENCE="],"description":"Specifies the reference level for PARAM= EFFECT, PARAM= REFERENCE, and their orthogonalizations.","help":"REF=&lt;'*level*'&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"'level'","placeholder":true,"followsDelimiter":"/","description":"The level of the variable to use as the reference level. Specify the formatted value of the variable if a format is assigned. Replace <level> with an actual value.","type":"value"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first ordered level as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last ordered level as reference.","type":"standalone"}]}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"EFFECT","description":"The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects that are formed from continuous or classification variables.","help":"EFFECT &lt;DETAILS&gt; NAME=COLLECTION|MULTIMEMBER|MM|POLYNOMIAL|POLY...  &lt;NOEFFECT&gt; ...","arguments":[{"name":"NAME=","placeholder":true,"description":"Replace NAME with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. These values can be used: COLLECTION, MULTIMEMBER, POLYNOMIAL, or SPLINE.","type":"value"},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the: (1) constituents of the collection effect, or (2) levels of the multimember effect, or (3) details of the specified polynomial, or (4) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NATURALCUBIC","optional":true,"followsDelimiter":"/","description":"Uses a natural cubic spline basis for the spline expansion. Natural cubic splines, also known as restricted cubic splines, are cubic splines that are constrained to be linear beyond the extreme knots.","type":"standalone"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"Specifies that observations whose levels are all missing for the multimember variables should have 0 values in the corresponding design matrix columns.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies numeric variables used to weigh the contributions of each of the classification effects that define the constructed multimember effect. The number of variables in wght-list must match the number of classification variables that define the effect.","help":"WEIGHT=*wght-list*","type":"value"}]},{"name":"MODEL","description":"The MODEL statement names a single dependent variable and the fixed effects, which determine the X matrix of the mixed model. The MODEL statement is required. An intercept is included in the fixed-effects model by default. If no fixed effects are specified, only this intercept term is fit. The intercept can be removed by using the NOINT option.","help":"MODEL &lt;ALPHA=α&gt; &lt;DDFM=&lt;NONE | RESIDUAL&gt;&gt; &lt;NOINT&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Sets the confidence level to be 1-α for each confidence interval of the fixed-effects parameters, where α must be a number between 0 and 1. By default, ALPHA=0.05.","type":"value"},{"name":"DDFM=","optional":true,"followsDelimiter":"/","description":"Specifies the method for computing the denominator degrees of freedom for the tests of fixed effects.","help":"DDFM=NONE | RESIDUAL","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Specifies that no denominator degrees of freedom be applied. PROC HPLMIXED then essentially assumes that infinite degrees of freedom are available in the calculation of p-values.","type":"standalone"},{"name":"RESIDUAL","followsDelimiter":"/","description":"Performs all tests by using the residual degrees of freedom, n - rank(X)/, where n is the number of observations used.","type":"standalone"}]},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept be included in the model. (An intercept is included by default.)","type":"standalone"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Produces a solution for the fixed-effects parameters.","type":"standalone"}]},{"name":"OPTIMIZATION","description":"The OPTIMIZATION statement specifies the technique and relevant specifications that are used in nonlinear optimization of REML and ML functions.","help":"OPTIMIZATION &lt;ABSCONV=r&gt; &lt;ABSFCONV=r&gt; &lt;ABSGCONV=r&gt; ...","arguments":[{"name":"ABSCONV=","optional":true,"description":"Specifies an absolute function convergence criterion.","help":"ABSCONV=*r*","type":"value"},{"name":"ABSFCONV=","optional":true,"description":"Specifies an absolute function difference convergence criterion.","help":"ABSFCONV=*r*","type":"value"},{"name":"ABSGCONV=","optional":true,"description":"Specifies an absolute gradient convergence criterion.","help":"ABSGCONV=*r*","type":"value"},{"name":"FCONV2=","optional":true,"description":"Specifies a second function convergence criterion.","help":"FCONV2=*r*","type":"value"},{"name":"FCONV=","optional":true,"description":"Specifies the relative function convergence criterion.","help":"FCONV=*r*","type":"value"},{"name":"GCONV2=","optional":true,"description":"Specifies another relative gradient convergence criterion.","help":"GCONV2=*r*","type":"value"},{"name":"GCONV=","optional":true,"description":"Specifies the relative gradient convergence criterion.","help":"GCONV=*r*","type":"value"},{"name":"MAXFUNC=","optional":true,"description":"Specifies the maximum number of function calls in the optimization process. The optimization can terminate only after completing a full iteration. Therefore, the number of function calls that are performed can exceed n. The default values are as follows, depending on the optimization technique:","help":"MAXFUNC=*n*","type":"value"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations in the optimization process. These default values also apply when is specified as a missing value. The default values are as follows, depending on the optimization technique:","help":"MAXITER=*n*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies an upper limit of seconds of CPU time for the optimization process. The default value is the largest floating-point double representation of your computer. The time specified by the MAXTIME= option is checked only once at the end of each iteration. Therefore, the actual running time can be longer than r.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"description":"Specifies the minimum number of iterations. The default value is 0.","help":"MINITER=*n*","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH="],"description":"Specifies the optimization technique for obtaining restricted maximum likelihood estimation (REML) or maximum likelihood estimation (ML). There is no algorithm for optimizing general nonlinear functions that always finds the global optimum for a general nonlinear optimization problem in a reasonable amount of time. Because no single optimization technique is always superior to others, PROC LMIXED provides a variety of optimization techniques that work well in various circumstances. By default, TECHNIQUE=NRRIDG when DMMETHOD=DENSE. Otherwise, TECHNIQUE=QUANEW by default.","help":"TECHNIQUE=CONGRA | DBLDOG | NEWRAP | NNSIMP | NONE | NRRIDG | QUANEW | TRUREG","type":"choice","arguments":[{"name":"CONGRA","description":"Performs a conjugate-gradient optimization.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization.","type":"standalone"},{"name":"NEWRAP","description":"Performs a Newton-Raphson optimization that combines a line-search algorithm with ridging.","type":"standalone"},{"name":"NNSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NONE","description":"Performs no optimization.","type":"standalone"},{"name":"NRRIDG","description":"Performs a Newton-Raphson optimization with ridging.","type":"standalone"},{"name":"QUANEW","description":"Performs a dual quasi-Newton optimization.","type":"standalone"},{"name":"TRUREG","description":"Performs a trust-region optimization.","type":"standalone"}]},{"name":"XCONV=","optional":true,"description":"Specifies the relative parameter convergence criterion.","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a data table that contains observationwise statistics, which are computed after the model is fitted. The variables in the input data table are not included in the output data table in order to avoid data duplication for large data tables; however, variables that you specify in the COPYVARS= option are included.","help":"OUTPUT &lt;ALLSTATS&gt; &lt;ALPHA=number&gt; &lt;OUT=CAS-libref.data-table&gt; ...","arguments":[{"name":"ALLSTATS","optional":true,"aliases":["ALLSTAT"],"description":"Adds all available statistics to the output data table.","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Specifies the significance level for the construction of confidence intervals in the output data table. The confidence level is 1 - number, where number must be between 0 and 1. By default, number is equal to the value of the ALPHA= option in the MODEL statement, or 0.05 if that option is not specified.","help":"ALPHA=*number*","type":"value"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Copies one or more variables from the input data table to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC LMIXED to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"PARMS","description":"The PARMS statement specifies initial values for the covariance parameters, or it requests a grid search over several values of these parameters. You must specify the values in the order in which they appear in the \"Covariance Parameter Estimates\" table. The value-list specification can take any of several forms: m a single value m1,m2,...,mn several values m to n a sequence where m equals the starting value, n equals the ending value, and the increment equals 1 m to n by i a sequence where m equals the starting value, n equals the ending value, and the increment equals i m1,m2 to m3 mixed values and sequences You can use the PARMS statement to input known parameters.","help":"PARMS &lt;HOLD&lt;=order-list&gt; | EQCONS&lt;=order-list&gt; | HOLD&lt;=ALL&gt; | EQCONS&lt;=ALL&gt;&gt; &lt;LOWERB=value-list&gt; &lt;NOITER&gt; ...","arguments":[{"name":"HOLD=","optional":true,"followsDelimiter":"/","aliases":["EQCONS="],"description":"Holds the values of the covariance parameters whose order is specified in the order-list to the initial values that are specified in the value-list in the RANDOM statement.","type":"value"},{"name":"LOWERB=","optional":true,"followsDelimiter":"/","description":"Specifies the lower boundary constraints on the covariance parameters, where value-list is a list of numbers or missing values (.) separated by commas. You must list the numbers in the order that the LMIXED procedure uses for the covariance parameters, and each number corresponds to a lower boundary constraint. A missing value instructs the LMIXED procedure to use its default constraint. If you do not specify numbers for all the covariance parameters, the LMIXED procedure assumes that the remaining ones are missing.","help":"LOWERB=*value-list*","type":"value"},{"name":"NOITER","optional":true,"followsDelimiter":"/","description":"Requests that no optimization iterations be performed and that the LMIXED procedure use the best value from the grid search to perform inferences.","type":"standalone"},{"name":"PARMSDATA=","optional":true,"followsDelimiter":"/","aliases":["PDATA="],"description":"Reads in covariance parameter values from a data table. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","type":"value"},{"name":"UPPERB=","optional":true,"followsDelimiter":"/","description":"Specifies upper boundary constraints on the covariance parameters, where the value-list specification is a list of numbers or missing values (.) separated by commas. You must list the numbers in the order that the LMIXED procedure uses for the covariance parameters, and each number corresponds to the upper boundary constraint. A missing value instructs the LMIXED procedure to use its default constraint. If you do not specify numbers for all of the covariance parameters, the LMIXED procedure assumes that the remaining ones are missing.","help":"UPPERB=*value-list*","type":"value"}]},{"name":"RANDOM","description":"The RANDOM statement defines the random effects constituting the γ vector in the mixed model. You can use this statement to specify traditional variance component models and to specify random coefficients. The random effects can be classification or continuous, and multiple RANDOM statements are allowed.","help":"RANDOM &lt;ALPHA=α&gt; &lt;CL&gt; &lt;SOLUTION&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Sets the confidence level to be for each confidence interval of the random-effects estimates, where α must be a number between 0 and 1. By default, ALPHA=0.05.","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Constructs t-type confidence limits for each of the random-effect estimates. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Produces the solution for the random-effects parameters.","type":"standalone"},{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","aliases":["SUB="],"description":"Identifies the subjects in your mixed model. Complete independence is assumed across subjects; thus, the SUBJECT= option produces a block-diagonal structure in that has identical blocks. In fact, specifying an effect is equivalent to nesting all other effects in the RANDOM statement within the effect.","help":"SUBJECT=*effect*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the covariance structure of G.","help":"TYPE=ANTE(1) | AR(1) | ARH(1) | ARMA(1,1) | CHOL | CS | CSH | FA(q) | FA0(q) | FA1(q) | HF | TOEP | TOEP(q) | TOEPH | TOEPH(q) | UN | UN(q) | UNR | UNR(q) | VC*covariance-structure*","type":"value","arguments":[{"name":"ANTE(1)","followsDelimiter":"/","description":"Specifies a first-order antedependence structure (see Kenward 1987, Patel 1991, and Macchiavelli and Arnold 1994)","type":"standalone"},{"name":"AR(1)","followsDelimiter":"/","description":"Specifies a first-order autoregressive structure.","type":"standalone"},{"name":"ARH(1)","followsDelimiter":"/","description":"Specifies a heterogeneous first-order autoregressive structure.","type":"standalone"},{"name":"ARMA(1,1)","followsDelimiter":"/","description":"Specifies the first-order autoregressive moving-average (1,1) structure","type":"standalone"},{"name":"CHOL","followsDelimiter":"/","description":"Specifies a Cholesky root structure","type":"standalone"},{"name":"CS","followsDelimiter":"/","description":"Specifies the compound-symmetry structure, which has constant variance and constant covariance.","type":"standalone"},{"name":"CSH","followsDelimiter":"/","description":"Specifies the heterogeneous compound-symmetry structure, which is an equi-correlation structure but allows for different variances.","type":"standalone"},{"name":"FA(q)","followsDelimiter":"/","description":"Specifies the factor-analytic structure with q factors (Jennrich and Schluchter 1986).","type":"standalone"},{"name":"FA0(q)","followsDelimiter":"/","description":"Is similar to the FA(q) structure except that no diagonal factor analytic is included.","type":"standalone"},{"name":"FA1(q)","followsDelimiter":"/","description":"Is similar to the FA(q) structure except that an equal factor analytic is included.","type":"standalone"},{"name":"HF","followsDelimiter":"/","description":"Specifies the Huynh-Feldt covariance structure (Huynh and Feldt 1970). This structure is similar to the CSH structure in that it has the same number of parameters and heterogeneity along the main diagonal. However, it constructs the off-diagonal elements by taking arithmetic rather than geometric means.","type":"standalone"},{"name":"TOEP","followsDelimiter":"/","description":"Specifies a full Toeplitz matrix, which can be viewed as an autoregressive structure with order equal to the dimension of the matrix.","type":"standalone"},{"name":"TOEP(q)","followsDelimiter":"/","description":"Specifies a banded Toeplitz structure. This can be viewed as a moving-average structure with order equal to q-1.","type":"standalone"},{"name":"TOEPH","followsDelimiter":"/","description":"Specifies a heterogeneous banded Toeplitz structure.","type":"standalone"},{"name":"TOEPH(q)","followsDelimiter":"/","description":"Specifies a heterogeneous banded Toeplitz structure. PROC LMIXED estimates only the first q bands of the matrix, setting all higher bands equal to 0.","type":"standalone"},{"name":"UN","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized directly in terms of variances and covariances.","type":"standalone"},{"name":"UN(q)","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized directly in terms of variances and covariances. PROC LMIXED estimates only the first q bands of the matrix, setting all higher bands equal to 0.","type":"standalone"},{"name":"UNR","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized in terms of variances and correlations.","type":"standalone"},{"name":"UNR(q)","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized in terms of variances and correlations. PROC LMIXED estimates only the first q bands of the matrix, setting all higher bands equal to zero.","type":"standalone"},{"name":"VC","followsDelimiter":"/","aliases":["SIMPLE"],"description":"Specifies standard variance components and is the default structure for both the RANDOM. In the RANDOM statement, a distinct variance component is assigned to each effect.","type":"standalone"}]}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations that have nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, all observations that are used in the analysis are assigned a weight of 1. The WEIGHT statement is supported only when DMMETHOD=SPARSE.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"latest","docsetTargetFile":"casstat_lmixed_toc.htm"}}