{"name":"LOAN","statements":[{"name":"PROC LOAN","description":"The LOAN procedure analyzes and compares fixed rate, adjustable rate, buydown, and balloon payment loans. The LOAN procedure computes the loan parameters and outputs the loan summary information for each loan. † Multiple loan specifications can be processed and compared in terms of economic criteria such as after-tax or before-tax present worth of cost and true interest rate, breakeven of periodic payment and of interest paid, and outstanding balance at different periods in time. PROC LOAN selects the best alternative in terms of the specified economic criterion for each loan comparison period. † The LOAN procedure allows various payment and compounding intervals (including continuous compounding) and uniform or lump sum prepayments for a loan. Down payments, discount points, and other initialization costs can be included in the loan analysis and comparison. † The LOAN procedure does not support an input data set. All loans analyzed are specified with statements in the PROC LOAN step. The SAS DATA step provides a function MORT that can be used for data-driven analysis of many fixed-rate mortgage or installment loans. However, the MORT function supports only simple fixed rate loans.","help":"PROC LOAN <AMOUNT=amount> <AMOUNTPCT=value> <COMPOUND=CONTINUOUS | DAY | SEMIMONTH... > <DOWNPAYMENT=amount> <DOWNPAYPCT=value> <INITIAL=amount> <INITIALPCT=value> <INTERVAL=SEMIMONTH | MONTH | QUARTER... > <LABEL='loan-label'> <LIFE=n> <NOPRINT> <NOSUMMARYPRINT> <OUTSUM= SAS-data-set> <PAYMENT=amount> <POINTPCT=value> <POINTS=amount> <PREPAYMENTS=amount> <PRICE=amount> <RATE=rate> <ROUND=<n> | NONE> <SCHEDULE=nyears> <SCHEDULE=YEARLY> <SCHEDULE> <START=SAS-date-literal | START=yyyy:period>;     \n\tARM <ADJUSTFREQ=n> <CAPS=(periodic-cap, life-cap)> <MAXADJUST=rate> ...; \n   \n\tBALLOON <BALLOONPAYMENT=( date1=payment1 date2=payment2 ... )> ;     \n\tBUYDOWN <BUYDOWNRATES=( date1=rate1 date2=rate2 ... )> ;     \n\tCOMPARE <ALL> <AT=( date1 date2 ...) | AT=( period1 period2 ...)> <BREAKINTEREST> ...; \n   \n\tFIXED <AMOUNT=amount> <LIFE=n> <PAYMENT=amount> ...; ","arguments":[{"name":"AMOUNT=","optional":true,"aliases":["A="],"description":"Specifies the loan amount (the outstanding principal balance at the initialization of the loan).","help":"AMOUNT=*amount*","type":"value"},{"name":"AMOUNTPCT=","optional":true,"aliases":["APCT="],"description":"Specifies the loan amount as a percentage of the purchase price (PRICE= option). The AMOUNTPCT= specification is used to calculate the loan amount if the AMOUNT= option is not specified.","help":"AMOUNTPCT=*value*","type":"value"},{"name":"COMPOUND=","optional":true,"description":"Specifies the time interval between compoundings. The default is the time unit given by the INTERVAL= option. If the INTERVAL= option is not used, then the default is COMPOUND=MONTH.","help":"COMPOUND=CONTINUOUS | DAY | SEMIMONTH | MONTH | QUARTER | SEMIYEAR | YEAR","type":"choice","arguments":[{"name":"CONTINUOUS","description":"Compounded continuosly","type":"standalone"},{"name":"DAY","description":"Compounded daily","type":"standalone"},{"name":"SEMIMONTH","description":"Compounded semi-monthly","type":"standalone"},{"name":"MONTH","description":"Compounded monthly","type":"standalone"},{"name":"QUARTER","description":"Compounded quarterly","type":"standalone"},{"name":"SEMIYEAR","description":"Compounded semi-yearly","type":"standalone"},{"name":"YEAR","description":"Compounded yearly","type":"standalone"}]},{"name":"DOWNPAYMENT=","optional":true,"aliases":["DP="],"description":"Specifies the down payment at the initialization of the loan. The down payment is included in the calculation of the present worth of cost but not in the calculation of the true interest rate. The after-tax analysis assumes that the down payment is not tax-deductible. (Specify after-tax analysis with the TAXRATE= option in the COMPARE statement.)","help":"DOWNPAYMENT=*amount*","type":"value"},{"name":"DOWNPAYPCT=","optional":true,"aliases":["DPCT="],"description":"Specifies the down payment as a percentage of the purchase price (PRICE= option). The DOWNPAYPCT= specification is used to calculate the down payment amount if you do not specify the DOWNPAYMENT= option. The value you specify must be in the range 0% to 99%.","help":"DOWNPAYPCT=*value*","type":"value"},{"name":"INITIAL=","optional":true,"aliases":["INIT="],"description":"Specifies the amount paid for loan initialization other than the discount points and down payment. This amount is included in the calculation of the present worth of cost and the true interest rate. The after-tax analysis assumes that the initial amount is not tax-deductible. (After-tax analysis is specified by the TAXRATE= option in the COMPARE statement.)","help":"INITIAL=*amount*","type":"value"},{"name":"INITIALPCT=","optional":true,"aliases":["INITPCT="],"description":"Specifies the initialization costs as a percentage of the loan amount (AMOUNT= option). The INITIALPCT= specification is used to calculate the amount paid for loan initialization if you do not specify the INITIAL= option. The value you specify must be in the range of 0% to 100%.","help":"INITIALPCT=*value*","type":"value"},{"name":"INTERVAL=","optional":true,"description":"Gives the time interval between periodic payments. The default is INTERVAL=MONTH.","help":"INTERVAL=SEMIMONTH | MONTH | QUARTER | SEMIYEAR | YEAR","type":"choice","arguments":[{"name":"SEMIMONTH","description":"Semi-monthly periodic payment interval","type":"standalone"},{"name":"MONTH","description":"Monthly periodic payment interval","type":"standalone"},{"name":"QUARTER","description":"Quarterly periodic payment interval","type":"standalone"},{"name":"SEMIYEAR","description":"Semi-yearly periodic payment interval","type":"standalone"},{"name":"YEAR","description":"Yearly periodic payment interval","type":"standalone"}]},{"name":"LABEL=","optional":true,"description":"Specifies a label for the loan. If you specify the LABEL= option, all output related to the loan is labeled accordingly. If you do not specify the LABEL= option, the loan is labeled by sequence number.","help":"LABEL='*loan-label*'","type":"value"},{"name":"LIFE=","optional":true,"description":"Gives the life of the loan in number of payments. (The payment frequency is specified by the INTERVAL= option.) For example, if the life of the loan is 10 years with monthly payments, use LIFE=120 and INTERVAL=MONTH (default) to indicate a 10-year loan in which 120 monthly payments are made.","help":"LIFE=*n*","type":"value"},{"name":"NOPRINT","optional":true,"aliases":["NOP"],"description":"Suppresses all printed output for the loan.","type":"standalone"},{"name":"NOSUMMARYPRINT","optional":true,"aliases":["NOSUMPR"],"description":"Suppresses the printing of the loan summary report. The NOSUMMARYPRINT option is usually used when an OUTSUM= data set is created to store loan summary information.","type":"standalone"},{"name":"OUTSUM=","optional":true,"description":"Creates an output data set that contains loan summary information for all loans other than those for which a different OUTSUM= output data set is specified.","type":"value"},{"name":"PAYMENT=","optional":true,"aliases":["P="],"description":"Specifies the periodic payment. For ARM and BUYDOWN loans where the periodic payment might change, the PAYMENT= option specifies the initial amount of the periodic payment.","help":"PAYMENT=*amount*","type":"value"},{"name":"POINTPCT=","optional":true,"aliases":["PNTPCT="],"description":"Specifies the discount points as a percentage of the loan amount (AMOUNT= option). The POINTPCT= specification is used to calculate the amount paid for discount points if you do not specify the POINTS= option. The value you specify must be in the range of 0% to 100%.","help":"POINTPCT=*value*","type":"value"},{"name":"POINTS=","optional":true,"aliases":["PNT="],"description":"Specifies the amount paid for discount points at the initialization of the loan. This amount is included in the calculation of the present worth of cost and true interest rate. The amount paid for discount points is assumed to be tax-deductible in after-tax analysis (that is, if the TAXRATE= option is specified in the COMPARE statement).","help":"POINTS=*amount*","type":"value"},{"name":"PREPAYMENTS=","optional":true,"aliases":["PREP="],"description":"Syntax: PREPAYMENTS=amount | PREPAYMENTS=( date1=prepayment1 date2=prepayment2 ... ) | PREPAYMENTS=( period1=prepayment1 period2=prepayment2 ... )] Specifies either a uniform prepayment p throughout the life of the loan or lump sum prepayments. A uniform prepayment p is assumed to be paid with each periodic payment. Specify lump sum prepayments by pairs of periods (or dates) and respective prepayment amounts.","help":"PREPAYMENTS=*amount*","type":"value"},{"name":"PRICE=","optional":true,"aliases":["PRC="],"description":"Specifies the purchase price, which is the loan amount plus the down payment. If you specify the PRICE= option along with the loan amount (AMOUNT= option) or the down payment (DOWNPAYMENT= option), the value of the other one is calculated.","help":"PRICE=*amount*","type":"value"},{"name":"RATE=","optional":true,"aliases":["R="],"description":"Specifies the initial annual (nominal) interest rate in percent notation. The rate specified must be in the range 0% to 120%. For example, use RATE=12.75 for a 12.75% loan. For ARM and BUYDOWN loans, where the rate might change over the life of the loan, the RATE= option specifies the initial annual interest rate.","help":"RATE=*rate*","type":"value"},{"name":"ROUND=","optional":true,"description":"Specifies the number of decimal places to which the monetary amounts are rounded for the loan. Valid values for n are integers from 0 to 6. If you specify ROUND=NONE, the values are not rounded off internally, but the printed output is rounded off to two decimal places. The default is ROUND=2.","help":"ROUND=&lt;*n*&gt; | NONE","type":"choice","arguments":[{"name":"n","placeholder":true,"description":"Replace <n> with an integer value from 0 to 6.","type":"value"},{"name":"NONE","description":"The values are not rounded off internally, but the printed output is rounded off to two decimal places.","type":"standalone"}]},{"name":"SCHEDULE=","optional":true,"aliases":["SCHED"],"description":"Prints the amortization schedule for the loan.","help":"SCHEDULE=*nyears* | YEARLY","type":"choice","arguments":[{"name":"nyears","placeholder":true,"description":"Specifies the number of years the printed amortization table covers.","type":"value"},{"name":"YEARLY","description":"Prints yearly summary information in the amortization schedule rather than the full amortization schedule. SCHEDULE=YEARLY is useful for long-term loans.","type":"standalone"}]},{"name":"START=","optional":true,"aliases":["S="],"description":"Gives the date of loan initialization. The first payment is assumed to be one payment interval after the start date. For example, you can specify the START= option as START=’1APR2010’D or as START=2010:3, where 3 is the third payment interval within the year 2010. If INTERVAL=QUARTER, 3 refers to the third quarter. If you specify the START= option, all output for the particular loan is dated accordingly.","type":"value"}]},{"name":"ARM","description":"The ARM statement specifies an adjustable rate loan where the future interest rates are not known with certainty but will vary within specified limits according to the terms stated in the loan agreement. In practice, the adjustment terms vary. Adjustments in the interest rate can be captured using the ARM statement options.","help":"ARM &lt;ADJUSTFREQ=n&gt; &lt;CAPS=(periodic-cap, life-cap)&gt; &lt;MAXADJUST=rate&gt; ...","arguments":[{"name":"ADJUSTFREQ=","optional":true,"aliases":["ADF="],"description":"Specifies the number of periods, in terms of the INTERVAL= specification, between rate adjustments. INTERVAL=MONTH ADJUSTFREQ=6 indicates that the nominal interest rate can be adjusted every six months until the life cap or maximum rate (whichever is specified) is reached. The default is ADJUSTFREQ=12.","help":"ADJUSTFREQ=*n*","type":"value"},{"name":"BESTCASE","optional":true,"description":"Specifies a best-case analysis. The best-case analysis assumes that the interest rate charged on the loan will reach its minimum allowed limits at each adjustment period and over the life of the loan. If you use the BESTCASE option, you must specify either the CAPS= option or the MINRATE= and MAXADJUST= options.","type":"standalone"},{"name":"CAPS=","optional":true,"description":"Specifies the maximum interest rate adjustment, in percent notation, allowed by the loan agreement. The periodic cap specifies the maximum adjustment allowed at each adjustment period. The life cap specifies the maximum total adjustment over the life of the loan.","type":"value"},{"name":"ESTIMATEDCASE=","optional":true,"aliases":["ESTC="],"description":"[Syntax: ESTIMATEDCASE=( date1=rate1 date2=rate2 ... ) | ESTIMATEDCASE=( period1=rate1 period2=rate2 ... ) Specifies an estimated case analysis that indicates the rate adjustments will follow the rates you predict. This option specifies pairs of periods and estimated nominal interest rates.","type":"value"},{"name":"FIXEDCASE","optional":true,"aliases":["FIXCASE"],"description":"Specifies a fixed case analysis that assumes the rate will stay constant.","type":"standalone"},{"name":"MAXADJUST=","optional":true,"aliases":["MAXAD="],"description":"Specifies the maximum rate adjustment, in percent notation, allowed at each adjustment period. Use the MAXADJUST= option with the MAXRATE= and MINRATE= options.","help":"MAXADJUST=*rate*","type":"value"},{"name":"MAXRATE=","optional":true,"aliases":["MAXR="],"description":"Specifies the maximum annual nominal rate, in percent notation, that might be charged on the loan. The maximum annual nominal rate should be greater than or equal to the initial annual nominal rate specified with the RATE= option.","help":"MAXRATE=*rate*","type":"value"},{"name":"MINRATE=","optional":true,"aliases":["MINR="],"description":"Specifies the minimum annual nominal rate, in percent notation, that might be charged on the loan. The minimum annual nominal rate should be less than or equal to the initial annual nominal rate specified with the RATE= option.","help":"MINRATE=*rate*","type":"value"},{"name":"WORSTCASE","optional":true,"description":"Specifies a worst-case analysis. The worst-case analysis assumes that the interest rate charged on the loan will reach its maximum allowed limits at each rate adjustment period and over the life of the loan. If the WORSTCASE option is used, either the CAPS= option or the MAXRATE= and MAXADJUST= options must be specified.","type":"standalone"}]},{"name":"BALLOON","description":"The BALLOON statement specifies a fixed rate loan with scheduled balloon payments in addition to the periodic payment.","help":"BALLOON &lt;BALLOONPAYMENT=( date1=payment1 date2=payment2 ... )&gt; ","arguments":[{"name":"BALLOONPAYMENT=","optional":true,"aliases":["BPAY="],"description":"[Syntax: BALLOONPAYMENT=( date1=payment1 date2=payment2 ... ) | BALLOONPAYMENT=( period1=payment1 period2=payment2 ... ) Specifies pairs of periods and amounts of balloon (lump sum) payments in excess of the periodic payment during the life of the loan. You can also specify the balloon periods as dates if you specify the START= option. The dates are specified as SAS date literals. For example, BALLOONPAYMENT=( ’1MAR2011’D=1000 ) specifies a payment of 1000 in March of 2011.","type":"value"}]},{"name":"BUYDOWN","description":"The BUYDOWN statement specifies a buydown rate loan. The buydown rate loans are similar to ARM loans, but the interest rate adjustments are predetermined at the initialization of the loan, usually by paying interest points at the time of loan initialization.","help":"BUYDOWN &lt;BUYDOWNRATES=( date1=rate1 date2=rate2 ... )&gt; ","arguments":[{"name":"BUYDOWNRATES=","optional":true,"aliases":["BDR="],"description":"[Syntax: BUYDOWNRATES=( date1=rate1 date2=rate2 ... ) | BUYDOWNRATES=( period1=rate1 period2=rate2 ... ) Specifies pairs of periods and the predetermined nominal interest rates that will be charged on the loan starting at the corresponding time periods.","type":"value"}]},{"name":"COMPARE","description":"The COMPARE statement compares multiple loans, or it can be used with a single loan. You can use only one COMPARE statement. COMPARE statement options specify the periods and desired types of analysis for loan comparison. The default analysis reports the outstanding principal balance, breakeven of payment, breakeven of interest paid, and before-tax true interest rate. The default comparison period corresponds to the first LIFE= option specification. If the LIFE= option is not specified for any loan, the loan comparison period defaults to the first calculated life.","help":"COMPARE &lt;ALL&gt; &lt;AT=( date1 date2 ...) | AT=( period1 period2 ...)&gt; &lt;BREAKINTEREST&gt; ...","arguments":[{"name":"ALL","optional":true,"description":"Is equivalent to specifying the BREAKINTEREST, BREAKPAYMENT, PWOFCOST, and TRUEINTEREST options. The loan comparison report includes all the criteria. You need to specify the MARR= option for present worth of cost calculation.","type":"standalone"},{"name":"AT=","optional":true,"description":"Specifies the periods for loan comparison reports. If you specify the START= option in the PROC LOAN statement, you can specify the AT= option as a list of dates expressed as SAS date literals instead of periods. The comparison periods do not need to be in time sequence.","type":"value"},{"name":"BREAKINTEREST","optional":true,"aliases":["BI"],"description":"Specifies breakeven analysis of the interest paid. The loan comparison report includes the interest paid for each loan through the specified comparison period (AT= option).","type":"standalone"},{"name":"BREAKPAYMENT","optional":true,"aliases":["BP"],"description":"Specifies breakeven analysis of payment. The periodic payment for each loan is reported for every comparison period specified in the AT=option.","type":"standalone"},{"name":"MARR=","optional":true,"description":"Specifies the MARR (minimum attractive rate of return) in percent notation. The MARR reflects the cost of capital or the opportunity cost of money. The MARR= option is used i n calculating the present worth of cost.","help":"MARR=*rate*","type":"value"},{"name":"NOCOMPRINT","optional":true,"aliases":["NOCP"],"description":"Suppresses the printing of the loan comparison report. The NOCOMPRINT option is usually used when an OUTCOMP= data set is created to store loan comparison information.","type":"standalone"},{"name":"OUTCOMP=","optional":true,"description":"Suppresses the printing of the loan comparison report. The NOCOMPRINT option is usually used when an OUTCOMP= data set is created to store loan comparison information.","help":"OUTCOMP=*SAS-data-set*","type":"dataSet"},{"name":"PWOFCOST","optional":true,"aliases":["PWC"],"description":"Calculates the present worth of cost (net present value of costs) for each loan based on the cash flow through the specified comparison periods.","type":"standalone"},{"name":"TAXRATE=","optional":true,"aliases":["TAX="],"description":"Specifies income tax rate in percent notation for the after-tax calculations of the true interest rate and present worth of cost for those assets that qualify for tax deduction. If you specify this option, the amount specified in the POINTS= option and the interest paid on the loan are assumed to be tax-deductible. Otherwise, it is assumed that the asset does not qualify for tax deductions, and the cash flow is not adjusted for tax savings.","help":"TAXRATE=*rate*","type":"value"},{"name":"TRUEINTEREST","optional":true,"aliases":["TI"],"description":"Calculates the true interest rate (effective interest rate based on the cash flow of all payments, initialization costs, discount points, and the outstanding principal balance at the comparison period) for all the specified loans through each comparison period. If you specify the TAXRATE= option, the true interest rate is based on after-tax cash flow. Otherwise, the before-tax true interest rate is calculated.","type":"standalone"}]},{"name":"FIXED","description":"The FIXED statement specifies a fixed rate and periodic payment loan. It can be specified using the options that are common to all loan statements. The FIXED statement options are listed in this section. You must specify three of the following options in each loan statement: AMOUNT=, LIFE=, RATE=, and PAYMENT=. The LOAN procedure calculates the fourth parameter based on the values you give the other three. If you specify all four of the options, the PAYMENT= specification is ignored, and the periodic payment is recalculated for consistency.","help":"FIXED &lt;AMOUNT=amount&gt; &lt;LIFE=n&gt; &lt;PAYMENT=amount&gt; ...","arguments":[{"name":"AMOUNT=","optional":true,"aliases":["A="],"description":"Specifies the loan amount (the outstanding principal balance at the initialization of the loan).","help":"AMOUNT=*amount*","type":"value"},{"name":"APCT=","optional":true,"description":"Specifies the loan amount as a percentage of the purchase price (PRICE= option). The AMOUNTPCT= specification is used to calculate the loan amount if the AMOUNT= option is not specified.","help":"APCT=*value*","type":"value"},{"name":"COMPOUND=","optional":true,"description":"Specifies the time interval between compoundings. The default is the time unit given by the INTERVAL= option. If the INTERVAL= option is not used, then the default is COMPOUND=MONTH.","help":"COMPOUND=CONTINUOUS | DAY | SEMIMONTH | MONTH | QUARTER | SEMIYEAR | YEAR","type":"choice","arguments":[{"name":"CONTINUOUS","description":"Compounded continuosly","type":"standalone"},{"name":"DAY","description":"Compounded daily","type":"standalone"},{"name":"SEMIMONTH","description":"Compounded semi-monthly","type":"standalone"},{"name":"MONTH","description":"Compounded monthly","type":"standalone"},{"name":"QUARTER","description":"Compounded quarterly","type":"standalone"},{"name":"SEMIYEAR","description":"Compounded semi-yearly","type":"standalone"},{"name":"YEAR","description":"Compounded yearly","type":"standalone"}]},{"name":"DOWNPAYMENT=","optional":true,"aliases":["DP="],"description":"Specifies the down payment at the initialization of the loan. The down payment is included in the calculation of the present worth of cost but not in the calculation of the true interest rate. The after-tax analysis assumes that the down payment is not tax-deductible. (Specify after-tax analysis with the TAXRATE= option in the COMPARE statement.)","help":"DOWNPAYMENT=*amount*","type":"value"},{"name":"DOWNPAYPCT=","optional":true,"aliases":["DPCT="],"description":"Specifies the down payment as a percentage of the purchase price (PRICE= option). The DOWNPAYPCT= specification is used to calculate the down payment amount if you do not specify the DOWNPAYMENT= option. The value you specify must be in the range 0% to 99%.","help":"DOWNPAYPCT=*value*","type":"value"},{"name":"INITIAL=","optional":true,"aliases":["INIT="],"description":"Specifies the amount paid for loan initialization other than the discount points and down payment. This amount is included in the calculation of the present worth of cost and the true interest rate. The after-tax analysis assumes that the initial amount is not tax-deductible. (After-tax analysis is specified by the TAXRATE= option in the COMPARE statement.)","help":"INITIAL=*amount*","type":"value"},{"name":"INITIALPCT=","optional":true,"aliases":["INITPCT="],"description":"Specifies the initialization costs as a percentage of the loan amount (AMOUNT= option). The INITIALPCT= specification is used to calculate the amount paid for loan initialization if you do not specify the INITIAL= option. The value you specify must be in the range of 0% to 100%.","help":"INITIALPCT=*value*","type":"value"},{"name":"INTERVAL=","optional":true,"description":"Gives the time interval between periodic payments. The default is INTERVAL=MONTH.","help":"INTERVAL=SEMIMONTH | MONTH | QUARTER | SEMIYEAR | YEAR","type":"choice","arguments":[{"name":"SEMIMONTH","description":"Semi-monthly periodic payment interval","type":"standalone"},{"name":"MONTH","description":"Monthly periodic payment interval","type":"standalone"},{"name":"QUARTER","description":"Quarterly periodic payment interval","type":"standalone"},{"name":"SEMIYEAR","description":"Semi-yearly periodic payment interval","type":"standalone"},{"name":"YEAR","description":"Yearly periodic payment interval","type":"standalone"}]},{"name":"LABEL=","optional":true,"description":"Specifies a label for the loan. If you specify the LABEL= option, all output related to the loan is labeled accordingly. If you do not specify the LABEL= option, the loan is labeled by sequence number.","help":"LABEL='*loan-label*'","type":"value"},{"name":"LIFE=","optional":true,"aliases":["L="],"description":"Gives the life of the loan in number of payments. (The payment frequency is specified by the INTERVAL= option.) For example, if the life of the loan is 10 years with monthly payments, use LIFE=120 and INTERVAL=MONTH (default) to indicate a 10-year loan in which 120 monthly payments are made.","help":"LIFE=*n*","type":"value"},{"name":"NOPRINT","optional":true,"aliases":["NOP"],"description":"Suppresses all printed output for the loan.","type":"standalone"},{"name":"NOSUMMARYPRINT","optional":true,"aliases":["NOSUMPR"],"description":"Suppresses the printing of the loan summary report. The NOSUMMARYPRINT option is usually used when an OUTSUM= data set is created to store loan summary information.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Writes the loan amortization schedule to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTSUM=","optional":true,"description":"Writes the loan summary for the individual loan to an output data set.","help":"OUTSUM=*SAS-data-set*","type":"dataSet"},{"name":"PAYMENT=","optional":true,"aliases":["P="],"description":"Specifies the periodic payment. For ARM and BUYDOWN loans where the periodic payment might change, the PAYMENT= option specifies the initial amount of the periodic payment.","help":"PAYMENT=*amount*","type":"value"},{"name":"POINTPCT=","optional":true,"aliases":["PNTPCT="],"description":"Specifies the discount points as a percentage of the loan amount (AMOUNT= option). The POINTPCT= specification is used to calculate the amount paid for discount points if you do not specify the POINTS= option. The value you specify must be in the range of 0% to 100%.","help":"POINTPCT=*value*","type":"value"},{"name":"POINTS=","optional":true,"aliases":["PNT="],"description":"Specifies the amount paid for discount points at the initialization of the loan. This amount is included in the calculation of the present worth of cost and true interest rate. The amount paid for discount points is assumed to be tax-deductible in after-tax analysis (that is, if the TAXRATE= option is specified in the COMPARE statement).","help":"POINTS=*amount*","type":"value"},{"name":"PREPAYMENTS=","optional":true,"aliases":["PREP="],"description":"Syntax: PREPAYMENTS=amount | PREPAYMENTS=( date1=prepayment1 date2=prepayment2 ... ) | PREPAYMENTS=( period1=prepayment1 period2=prepayment2 ... )] Specifies either a uniform prepayment p throughout the life of the loan or lump sum prepayments. A uniform prepayment p is assumed to be paid with each periodic payment. Specify lump sum prepayments by pairs of periods (or dates) and respective prepayment amounts.","help":"PREPAYMENTS=*amount*","type":"value"},{"name":"PRICE=","optional":true,"aliases":["PRC="],"description":"Specifies the purchase price, which is the loan amount plus the down payment. If you specify the PRICE= option along with the loan amount (AMOUNT= option) or the down payment (DOWNPAYMENT= option), the value of the other one is calculated.","help":"PRICE=*amount*","type":"value"},{"name":"RATE=","optional":true,"aliases":["R="],"description":"Specifies the initial annual (nominal) interest rate in percent notation. The rate specified must be in the range 0% to 120%. For example, use RATE=12.75 for a 12.75% loan. For ARM and BUYDOWN loans, where the rate might change over the life of the loan, the RATE= option specifies the initial annual interest rate.","help":"RATE=*rate*","type":"value"},{"name":"ROUND=","optional":true,"description":"Specifies the number of decimal places to which the monetary amounts are rounded for the loan. Valid values for n are integers from 0 to 6. If you specify ROUND=NONE, the values are not rounded off internally, but the printed output is rounded off to two decimal places. The default is ROUND=2.","help":"ROUND=&lt;*n*&gt; | NONE","type":"choice","arguments":[{"name":"n","placeholder":true,"description":"Replace <n> with an integer value from 0 to 6.","type":"value"},{"name":"NONE","description":"The values are not rounded off internally, but the printed output is rounded off to two decimal places.","type":"standalone"}]},{"name":"SCHEDULE=","optional":true,"aliases":["SCHED"],"description":"Prints the amortization schedule for the loan.","help":"SCHEDULE=*nyears* | YEARLY","type":"choice","arguments":[{"name":"nyears","placeholder":true,"description":"Specifies the number of years the printed amortization table covers.","type":"value"},{"name":"YEARLY","description":"Prints yearly summary information in the amortization schedule rather than the full amortization schedule. SCHEDULE=YEARLY is useful for long-term loans.","type":"standalone"}]},{"name":"START=","optional":true,"aliases":["S="],"description":"Gives the date of loan initialization. The first payment is assumed to be one payment interval after the start date. For example, you can specify the START= option as START=’1APR2010’D or as START=2010:3, where 3 is the third payment interval within the year 2010. If INTERVAL=QUARTER, 3 refers to the third quarter. If you specify the START= option, all output for the particular loan is dated accordingly.","type":"value"}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"v_009","docsetTargetFile":"etsug_loan_toc.htm"}}