{"name":"LOGSELECT","statements":[{"name":"PROC LOGSELECT","description":"The LOGSELECT procedure fits binary and binomial response models in SAS Viya. † Logistic regression analysis is often used to investigate the relationship between discrete responses and a set of explanatory variables. † The logistic model shares a common feature with a more general class of linear models: a function g = g(µ) of the mean of the response variable is assumed to be linearly related to the explanatory variables. Because the mean µ implicitly depends on the stochastic behavior of the response and the explanatory variables are assumed to be fixed, the function g provides the link between the random (stochastic) component and the systematic (deterministic) component of the response variable Y. For this reason, Nelder and Wedderburn (1972) refer to g = g(µ) as a link function.","help":"PROC LOGSELECT <ABSCONV=r | ABSTOL=r> <ABSFCONV= r <n> | ABSFTOL=r <n>> <ABSGCONV=r <n> | ABSGTOL=r <n>> <ABSXCONV=r <n> | ABSXTOL=r <n>> <ALPHA=number> <CORRB> <COVB> <DATA=CAS-libref.data-table> <FCONV2=r <n> | FTOL2=r <n>> <FCONV=r <n> | FTOL=r <n>> <GCONV2=r <n> | GTOL2=r <n>> <GCONV=r <n> | GTOL=r <n>> <ITHIST> <LASSORHO=r> <LASSOSTEPS=n> <LASSOTOL=r> <MAXFUNC=n | MAXFU=n> <MAXITER=n | MAXIT=n> <MAXOPTBATCH=number> <MAXTIME=r> <MINITER=n | MINIT=n> <NOCHECK> <NOCLPRINT< =number >> <NORMALIZE=YES | NO> <NOSTDERR> <PARTFIT> <STB> <TECHNIQUE=CONGRA | DBLDOG | LEVMAR... > <XCONV=r | XTOL=r>;     \n\tBY variables ; \n   \n\tCLASS <DESCENDING> <MISSING> <ORDER=<FORMATTED | FREQ | INTERNAL>> ...; \n   \n\tCODE <COMMENT> <FILE=filename> <FORMATWIDTH=width> ...; \n   \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...; \n   \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...; \n   \n\tEFFECT NAME=COLLECTION|MULTIMEMBER|MM|POLYNOMIAL|POLY...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tFREQ variable ;     \n\tMODEL DESCENDING EVENT=<'category'>|FIRST|LAST  ORDER=FORMATTED|FREQ|INTERNAL  ...;     \n\tOUTPUT <ALL> <ALPHA=number> <OUT=CAS-libref.data-table> ...; \n   \n\tPARTITION <FRACTION(< TEST=fraction > < VALIDATE=fraction > < SEED=number >)> <ROLE=|ROLEVAR=variable (< TEST='value' > < TRAIN='value' > < VALIDATE='value' >)> ;     \n\tSELECTION <ADAPTIVE <(GAMMA=nonnegative number)>> <CHOOSE=<AIC | AICC | SBC>> <METHOD=<BACKWARD | FORWARD | FORWARDSWAP>... > ...; \n   \n\tWEIGHT variable; ","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion. The default value of r is the negative square root of the largest double-precision value, which serves only as a protection against overflows.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function difference convergence criterion. For all techniques except NMSIMP, termination requires a small change of the function value in successive iterations.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. This criterion is not used by the NMSIMP technique. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated. By default, ABSGCONV=1E–5.","type":"value"},{"name":"ABSXCONV=","optional":true,"aliases":["ABSXTOL="],"description":"Specifies the absolute parameter convergence criterion.","type":"value"},{"name":"ALPHA=","optional":true,"description":"Specifies a global significance level for the construction of confidence intervals. The confidence level is 1 – number. The value of number must be between 0 and 1. You can override this global significance level by specifying this option in the OUTPUT Procedure. By default, ALPHA=0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CORRB","optional":true,"description":"Creates the \"Parameter Estimates Correlation Matrix\" table.","type":"standalone"},{"name":"COVB","optional":true,"description":"Creates the \"Parameter Estimates Covariance Matrix\" table.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC LOGSELECT to use. The default is the most recently created data table. CAS-libref specifies the CAS library where the input data table resides, and data-table specifies the name of the input data table.","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"FCONV2=","optional":true,"aliases":["FTOL2="],"description":"Specifies a second function convergence criterion.","type":"value"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies a relative function convergence criterion.","type":"value"},{"name":"GCONV2=","optional":true,"aliases":["GTOL2="],"description":"Specifies another relative gradient convergence criterion.","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies a relative gradient convergence criterion.","type":"value"},{"name":"ITHIST","optional":true,"description":"Generates the “Iteration History” table.","type":"standalone"},{"name":"LASSORHO=","optional":true,"description":"Specifies the base regularization parameter for the LASSO model selection method. By default, LASSORHO=0.8.","help":"LASSORHO=*r*","type":"value"},{"name":"LASSOSTEPS=","optional":true,"description":"Specifies the maximum number of steps for LASSO model selection. By default, LASSOSTEPS=20.","help":"LASSOSTEPS=*n*","type":"value"},{"name":"LASSOTOL=","optional":true,"description":"Specifies the convergence tolerance for the optimization algorithm that solves for the LASSO parameter estimates at each step of LASSO model selection. By default, LASSOTOL=1E–6.","help":"LASSOTOL=*r*","type":"value"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Specifies the maximum number n of function calls in the optimization process. The default values are as follows, depending on the optimization technique: o TRUREG, NRRIDG, and NEWRAP: 125 o QUANEW and DBLDOG: 500 o CONGRA: 1,000 o NMSIMP: 3,000","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Specifies the maximum number n of iterations in the optimization process. The default values are as follows, depending on the optimization technique: o TRUREG, NRRIDG, and NEWRAP: 50 o QUANEW and DBLDOG: 200 o CONGRA: 400 o NMSIMP: 1,000","type":"value"},{"name":"MAXOPTBATCH=","optional":true,"description":"Specifies the maximum number of observations to be included in a batch.","help":"MAXOPTBATCH=*number*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies an upper limit of r seconds of CPU time for the optimization process. The time specified by r is checked only once at the end of each iteration. Therefore, the actual running time can be longer than r . The default value is the largest floating-point double representation of your computer.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. If you request more iterations than are actually needed for convergence to a stationary point, the optimization algorithms can behave strangely. For example, the effect of rounding errors can prevent the algorithm from continuing for the required number of iterations. By default, MINITER=0.","type":"value"},{"name":"NOCHECK","optional":true,"description":"Disables the checking process that determines whether maximum likelihood estimates of the regression parameters exist.","type":"standalone"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the “Class Level Information” table if you do not specify number. If you specify number, the values of the classification variables are displayed for only those variables whose number of levels is less than number. Specifying number helps to reduce the size of the “Class Level Information” table if some classification variables have a large number of levels.","type":"standalone"},{"name":"NORMALIZE=","optional":true,"description":"Specifies whether the objective function should be normalized during the optimization by the reciprocal of the used frequency count. This option affects the values reported in the “Iteration History” table. The results reported in the “Fit Statistics” are always displayed for the nonnormalized log-likelihood function. The default is to normalize the objective function.","help":"NORMALIZE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"Specifies that the objective function should be normalized during the optimization by the reciprocal of the used frequency count. This is the default.","type":"standalone"},{"name":"NO","description":"Specifies that the objective function should not be normalized during the optimization by the reciprocal of the used frequency count.","type":"standalone"}]},{"name":"NOSTDERR","optional":true,"description":"Suppresses computation of the covariance matrix and the standard errors of the regression coefficients.","type":"standalone"},{"name":"PARTFIT","optional":true,"description":"Displays fit statistics in the “Fit Statistics” table that are usually produced when your data are partitioned. This option is not required when you specify a PARTITION Procedure. The statistic that is added to the table is the average square error (or Brier score).","type":"standalone"},{"name":"STB","optional":true,"description":"Displays the standardized estimates of the parameters in the \"Parameter Estimates\" table.","type":"standalone"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH="],"description":"Specifies the optimization technique for obtaining maximum likelihood estimates.","help":"TECHNIQUE=CONGRA | DBLDOG | LEVMAR | NEWRAP | NMSIMP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Performs a conjugate-gradient optimization..","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization.","type":"standalone"},{"name":"LEVMAR","description":"Performs a Levenberg-Marquardt nonlinear least-squares minimization. This technique is available only with PROC NLMOD.","type":"standalone"},{"name":"NEWRAP","description":"Performs a Newton-Raphson optimization with line search.","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NRRIDG","description":"Performs a Newton-Raphson optimization with ridging.","type":"standalone"},{"name":"QUANEW","description":"Performs a dual quasi-Newton optimization.","type":"standalone"},{"name":"TRUREG","description":"Performs a trust-region optimization","type":"standalone"},{"name":"NONE","description":"Performs no optimization.","type":"standalone"}]},{"name":"XCONV=","optional":true,"aliases":["XTOL="],"description":"Specifies the relative parameter convergence criterion. Convergence requires a small relative parameter change in subsequent iterations.","type":"value"}]},{"name":"BY","description":"You can specify a BY statement in PROC LOGSELECT to obtain separate analyses of observations in groups that are defined by the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY variables "},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis. You can list the response variable for binary models in the CLASS statement, but this is not required.","help":"CLASS &lt;DESCENDING&gt; &lt;MISSING&gt; &lt;ORDER=&lt;FORMATTED | FREQ | INTERNAL&gt;&gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sort order of the classification variable. If both the DESCENDING and ORDER= options are specified, the procedure orders the categories according to the ORDER= option and then reverse that order.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (“.”, “.A”, . . . , “.Z” for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sort order for the levels of classification variables. This ordering determines which parameters in the model correspond to each level in the data.","help":"ORDER=FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"FORMATTED","followsDelimiter":"/","description":"External formatted values, except for numeric variables that have no explicit format, which are sorted by their unformatted (internal) values. The sort order is machine-dependent. For numeric variables for which you have supplied no explicit format, the levels are ordered by their internal values.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Descending frequency count (levels that have more observations come earlier in the order)","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Unformatted value. The sort order is machine-dependent.","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | GLM | ORDINAL | POLYNOMIAL | REFERENCE | ORTHEFFECT | ORTHORDINAL | ORTHPOLY | ORTHREF","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Specifies effect coding.","type":"standalone"},{"name":"GLM","followsDelimiter":"/","description":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","type":"standalone"},{"name":"ORDINAL","followsDelimiter":"/","aliases":["THERMOMETER"],"description":"Specifies the cumulative parameterization for an ordinal CLASS variable.","type":"standalone"},{"name":"POLYNOMIAL","followsDelimiter":"/","aliases":["POLY"],"description":"Specifies polynomial coding.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","aliases":["REF"],"description":"Specifies reference-cell coding.","type":"standalone"},{"name":"ORTHEFFECT","followsDelimiter":"/","description":"Orthogonalizes PARAM=EFFECT.","type":"standalone"},{"name":"ORTHORDINAL","followsDelimiter":"/","aliases":["ORTHOTHERM"],"description":"Orthogonalizes PARAM=ORDINAL.","type":"standalone"},{"name":"ORTHPOLY","followsDelimiter":"/","description":"Orthogonalizes PARAM=POLYNOMIAL.","type":"standalone"},{"name":"ORTHREF","followsDelimiter":"/","description":"Orthogonalizes PARAM=REFERENCE.","type":"standalone"}]},{"name":"REFERENCE=","optional":true,"followsDelimiter":"/","aliases":["REF="],"description":"Specifies the reference level that is used when you specify a nonsingular parameterization.","help":"REFERENCE=&lt;'*level*'&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"'level'","placeholder":true,"followsDelimiter":"/","description":"Specifies the level of the variable to use as the reference level. Replace <'level'> with an actual value.","type":"value"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first ordered level as reference. You can specify this value either for an individual variable option or for a global-option.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last ordered level as reference. You can specify this value either for an individual variable option or for a global-option.","type":"standalone"}]},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"Specifies that design matrix columns that correspond to any effect that contains a split classification variable can be selected to enter or leave a model independently of the other design columns of that effect.","type":"standalone"}]},{"name":"CODE","description":"The CODE statement writes SAS DATA step code for computing predicted values of the fitted model either to a file or to a catalog entry. This code can then be included in a DATA step to score new data.","help":"CODE &lt;COMMENT&gt; &lt;FILE=filename&gt; &lt;FORMATWIDTH=width&gt; ...","arguments":[{"name":"COMMENT","optional":true,"description":"Adds comments to the generated code.","type":"standalone"},{"name":"FILE=","optional":true,"description":"Names the external file that saves the generated code. When enclosed in a quoted string (for example, FILE=\"c:nmydirnscorecode.sas\"), this option specifies the path and filename for writing the code to an external file. If you do not specify a path but your SAS client has a default path, then the code is written to an external file named filename at that location. You can also specify an unquoted filename of no more than eight characters. If the filename is assigned as a fileref in a Base SAS FILENAME statement, the file specified in the FILENAME statement is opened; otherwise, if your SAS client has a default path, an external file named filename is created.","help":"FILE=*filename*","type":"value"},{"name":"FORMATWIDTH=","optional":true,"description":"Specifies the width to use in formatting derived numbers such as parameter estimates. You can specify a value in the range 4 to 32; the default is 20.","help":"FORMATWIDTH=*width*","type":"value"},{"name":"INDENTSIZE=","optional":true,"description":"Specifies the number of spaces to indent the generated code. You can specify a value in the range 0 to 10; the default is 3.","help":"INDENTSIZE=*n*","type":"value"},{"name":"LABELID=","optional":true,"description":"Specifies a number used to construct array names and statement labels in the generated code. You can specify a value in the range 0 to 1024; the default is randomly chosen.","help":"LABELID=*value*","type":"value"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the line size for the generated code. You can specify a value in the range 64 to 254; the default is 120.","help":"LINESIZE=*value*","type":"value"},{"name":"NOTRIM","optional":true,"description":"Bases comparisons of formatted values on the full format width, including blank padding. By default, blanks at the beginning and end of strings are ignored.","type":"standalone"},{"name":"PCATALL","optional":true,"description":"Generates probabilities for all levels of categorical response variables.","type":"standalone"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of ODS tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all ODS tables are sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to ODS table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all ODS tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the ODS table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates the CAS output tables on all nodes.","type":"standalone"}]},{"name":"EFFECT","description":"The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects that are formed from continuous or classification variables.","help":"EFFECT NAME=COLLECTION|MULTIMEMBER|MM|POLYNOMIAL|POLY...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"NAME=","description":"Replace 'NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set.","help":"NAME=COLLECTION | MULTIMEMBER | POLYNOMIAL | SPLINE","type":"choice","arguments":[{"name":"COLLECTION","description":"Is a collection effect that defines one or more variables as a single effect with multiple degrees of freedom. The variables in a collection are considered as a unit for estimation and inference. Option(s) available (specified after a slash (/) following the variable list): DETAILS Displays the constituents of the collection effect","type":"standalone"},{"name":"MULTIMEMBER","aliases":["MM"],"description":"Is a multimember classification effect whose levels are determined by one or more variables that appear in a CLASS statement. Options available (specified after a slash (/) following the variable list): DETAILS displays the levels of the multimember effect NOEFFECT specifies that observations with all missing levels for the multimember variables should have zero values in the corresponding design matrix columns STDIZE Standardizes the design matrix entries so that each observation has a sum of 1 WEIGHT= specifies the weight variable for the contributions of each of the classification effects","type":"standalone"},{"name":"POLYNOMIAL","aliases":["POLY"],"description":"Is a multivariate polynomial effect in the specified numeric variables. Options available (specified after a slash (/) following the variable list): DEGREE= specifies the degree of the polynomial DETAILS displays details of the specified polynomial MDEGREE= specifies the maximum degree of any variable in a term of the polynomial NOSEPARATE treats the polynomial as a single effect with multiple degrees of freedom STANDARDIZE= specifies centering and scaling suboptions for the variables that define the polynomial","type":"standalone"},{"name":"SPLINE","description":"Is a regression spline effect whose columns are univariate spline expansions of one or more variables. A spline expansion replaces the original variable with an expanded or larger set of new variables. Options available (specified after a slash (/) following the variable list): BASIS= specifies the type of basis (B-spline basis or truncated power function basis) for the spline expansion DATABOUNDARY uses the extremes of the data as boundary knots for a B-spline basis DEGREE= specifies the degree of the spline transformation DETAILS displays the knots and locations for each spline basis function KNOTMAX= requests equally spaced right-side boundary knots starting at the variables’ maximum and ending at the KNOTMAX= value KNOTMETHOD= specifies how to construct the knots for spline effects KNOTMIN= requests equally spaced left-side boundary knots starting at the KNOTMAX= value and ending at the variables’ minimum value","type":"standalone"}]},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NATURALCUBIC","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Uses a natural cubic spline basis for the spline expansion. Natural cubic splines, also known as restricted cubic splines, are cubic splines that are constrained to be linear beyond the extreme knots.","type":"standalone"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. PROC LOGSELECT treats each observation as if it appears f times, where f is the value of the FREQ variable for the observation. If f is not an integer, it is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable "},{"name":"MODEL","description":"The MODEL statement defines the statistical model in terms of a response variable (the target) or an events/trials specification, model effects that are constructed from variables in the input data table, and model-options. An intercept is included in the model by default. You can remove the intercept by specifying the NOINT option. You can specify a single response variable that contains your response values. When you have binomial data, you can specify the events/trials form of the response, where one variable contains the number of positive responses (or events) and another variable contains the number of trials. Note that the values of both events and (trials – events) must be nonnegative and the value of trials must be positive.","help":"MODEL DESCENDING EVENT=&lt;'category'&gt;|FIRST|LAST  ORDER=FORMATTED|FREQ|INTERNAL  ...","arguments":[{"name":"DESCENDING","aliases":["DESC"],"description":"Reverses the order of the response categories. If you specify both the DESCENDING and ORDER= options, PROC LOGSELECT orders the response categories according to the ORDER= option and then reverses that order.","type":"standalone"},{"name":"EVENT=","description":"specifies the event category for the binary response model. PROC LOGSELECT models the probability of the event category. The EVENT= option has no effect when there are more than two response categories.","help":"EVENT=&lt;'*category*'&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"'category'","placeholder":true,"description":"Specifies the value (formatted, if a format is applied) of the event category in quotation marks. Replace <'category'> with an actual value.","type":"value"},{"name":"FIRST","description":"Designates the first ordered category as the event.","type":"standalone"},{"name":"LAST","description":"Designates the last ordered category as the event.","type":"standalone"}]},{"name":"ORDER=","description":"Specifies the sort order for the levels of the response variable. When ORDER=FORMATTED (the default) for numeric variables for which you have supplied no explicit format (that is, for which there is no corresponding FORMAT statement in the current PROC LOGSELECT run or in the DATA step that created the data table), the levels are ordered by their internal (numeric) value.","help":"ORDER=FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"FORMATTED","description":"External formatted values, except for numeric variables that have no explicit format, which are sorted by their unformatted (internal) values. The sort order is machine-dependent. For numeric variables for which you have supplied no explicit format, the levels are ordered by their internal values.","type":"standalone"},{"name":"FREQ","description":"Descending frequency count (levels that have more observations come earlier in the order)","type":"standalone"},{"name":"INTERNAL","description":"Unformatted value. The sort order is machine-dependent.","type":"standalone"}]},{"name":"REF=","description":"Specifies the reference category for the binary response model. Specifying one response category as the reference is the same as specifying the other response category as the event.","help":"REF=&lt;'*category*'&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"'category'","placeholder":true,"description":"Specifies the value (formatted, if a format is applied) of the reference category in quotation marks.","type":"value"},{"name":"FIRST","description":"Designates the first ordered category as the reference.","type":"standalone"},{"name":"LAST","description":"Designates the last ordered category as the reference.","type":"standalone"}]},{"name":"CLB","optional":true,"followsDelimiter":"/","aliases":["CL"],"description":"Constructs confidence limits for each of the parameter estimates. The confidence level is 0.95 by default; you can change it by specifying the ALPHA= option.","type":"standalone"},{"name":"INCLUDE=","optional":true,"followsDelimiter":"/","description":"Forces effects to be included in all models. If you specify INCLUDE=n, then the first n effects that are listed in the MODEL statement are included in all models. If you specify INCLUDE=single-effect or if you specify a list of effects within parentheses, then the specified effects are forced into all models. The effects that you specify in the INCLUDE= option must be explanatory effects that are specified in the MODEL statement before the slash (/).","type":"value"},{"name":"INFORMATIVE","optional":true,"followsDelimiter":"/","description":"Models missing values by using extra model effects. These effects consist of dummy variables that take the value 1 when the value of a continuous model variable involved in the effect is missing, and take the value 0 otherwise. The missing value in the original model effect is replaced by the average value of the effect for the nonmissing values. For continuous-by-class effects, such as A*x, where A is a classification variable and x is a continuous variable, informative missingness creates multiple dummy columns and substitutes the effect mean of x that corresponds to the respective level of A. Missing values for classification variables are treated as valid levels.","type":"standalone"},{"name":"LINK=","optional":true,"followsDelimiter":"/","description":"Specifies the link function for the model. The default link is the logit.","help":"LINK=CLOGLOG | LOGIT | LOGLOG | PROBIT","type":"choice","arguments":[{"name":"CLOGLOG","followsDelimiter":"/","description":"Complementary log-log link function","type":"standalone"},{"name":"LOGIT","followsDelimiter":"/","description":"Logit link function","type":"standalone"},{"name":"LOGLOG","followsDelimiter":"/","description":"Log-log link function","type":"standalone"},{"name":"PROBIT","followsDelimiter":"/","description":"Probit link function","type":"standalone"}]},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept be included in the model. An intercept is included by default. The NOINT option is not available in multinomial models.","type":"standalone"},{"name":"OFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies a variable to be used as an offset to the linear predictor. An offset plays the role of an effect whose coefficient is known to be 1. The offset variable cannot appear in the CLASS statement or elsewhere in the MODEL statement. Observations that have missing values for the offset variable are excluded from the analysis.","help":"OFFSET=*variable*","type":"value"},{"name":"START=","optional":true,"followsDelimiter":"/","description":"Begins the selection process from the designated initial model for the forward selection method. If you specify START=n, then the starting model includes the first n effects that are listed in the MODEL statement. If you specify START=single-effect or START=(effects), then the starting model includes those specified effects. The effects that you specify in the START= option must be explanatory effects that are specified in the MODEL statement before the slash (/). This option is not available when you specify METHOD=BACKWARD in the SELECTION statement.","type":"value"},{"name":"TYPE3","optional":true,"followsDelimiter":"/","description":"Requests that Wald statistics for Type 3 contrasts be computed for each effect that is specified in the MODEL statement.","type":"standalone"}]},{"name":"OUTPUT","description":"however, variables that you specify in the COPYVAR= option are included.","help":"OUTPUT &lt;ALL&gt; &lt;ALPHA=number&gt; &lt;OUT=CAS-libref.data-table&gt; ...","arguments":[{"name":"ALL","optional":true,"aliases":["ALLSTAT"],"description":"Adds all available statistics to the output data table.","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Specifies the significance level for the construction of confidence intervals in the output data table. The confidence level is 1 - number. The value of number must be between 0 and 1. By default, number is equal to the value of the ALPHA= option in the PROC LOGSELECT statement, or 0.05 if that option is not specified.","help":"ALPHA=*number*","type":"value"},{"name":"CBAR","optional":true,"description":"Specifies the confidence interval displacement diagnostic that measures the overall change in the global regression estimates that results from deleting an individual observation. The default name is _CBAR_.","type":"standalone"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Lists one or more variables from the input data table that are transferred to the scored output data table, provided that the output data table produces one or more records per input observation. By default, the KCLUS procedure does not transfer any variables from the input data table to the output data table. The COPYVARS= option accepts numeric and character variables.","type":"value"},{"name":"DIFCHISQ","optional":true,"description":"Specifies the change in the chi-square goodness-of-fit statistic that results from deleting the individual observation. The default name is _DIFCHISQUARE_.","type":"standalone"},{"name":"DIFDEV","optional":true,"description":"Specifies the change in the deviance that results from deleting the individual observation. The default name is _DIFDEVIANCE_.","type":"standalone"},{"name":"FIXEDOFFSET=","optional":true,"description":"Specifies a value to use as an offset to the linear predictor instead of obtaining the value from the offset variable. This option is ignored unless you also specify the OFFSET= variable in the MODEL statement.","help":"FIXEDOFFSET=*number*","type":"value"},{"name":"H","optional":true,"description":"Specifies the diagonal element of the hat matrix (leverage) for detecting extreme points in the design space. The default name is _HATDIAG_.","type":"standalone"},{"name":"INDIVIDUAL","optional":true,"aliases":["IPRED","IPROB","IP"],"description":"Specifies the individual predicted values for multinomial response variables.","type":"standalone"},{"name":"INTO","optional":true,"description":"Names the variable that contains the level of the response into which an observation is classified. The default name is _INTO_.","type":"standalone"},{"name":"LCLM","optional":true,"aliases":["LOWERMEAN","LOWER"],"description":"Specifies the lower confidence limits for the mean. The default name is _LCLM_. You can set the confidence level by specifying the ALPHA= option.","type":"standalone"},{"name":"LCL","optional":true,"aliases":["LOWERXBETA"],"description":"Names the variable that contains the lower confidence limits for the linear predictor. The default name is _LCL_. You can set the confidence level by specifying the ALPHA= option.","type":"standalone"},{"name":"LEVEL","optional":true,"description":"Names the variable that contains the level of the response for a given row of the output. The default name is _LEVEL_.","type":"standalone"},{"name":"OBSCAT","optional":true,"description":"Requests (for multinomial models) that observationwise statistics be produced only for the observed response level.","type":"standalone"},{"name":"OUT=","optional":true,"description":"names the output data table for PROC LOGSELECT to use. CAS-libref.data-table is a two-level name, where CAS-libref refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, which includes a path to where the data table is to be stored, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement.","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"PREDICTED","optional":true,"aliases":["PRED","PROB"],"description":"Specifies the predicted values (predicted probabilities of events) for the response variable. The default name is _PRED_.","type":"standalone"},{"name":"PREDPROBS","optional":true,"description":"Creates variables (for multinomial models) for each response category that corresponds to the requested IPRED and PREDICTED keywords.","type":"standalone"},{"name":"RESCHI","optional":true,"aliases":["PEARSON"],"description":"Specifies the Pearson residual for identifying poorly fitted observations. The default name is _RESCHI_.","type":"standalone"},{"name":"RESDEV","optional":true,"description":"Specifies the deviance residual for identifying poorly fitted observations. The default name is _RESDEV_.","type":"standalone"},{"name":"RESLIK","optional":true,"description":"Specifies the likelihood residual for identifying poorly fitted observations. The default name is _RESLIK_.","type":"standalone"},{"name":"RESRAW","optional":true,"aliases":["RESIDUAL"],"description":"Specifies the raw residual for identifying poorly fitted observations. The default name is _RESRAW_.","type":"standalone"},{"name":"RESWORK","optional":true,"description":"Specifies the working residual for identifying poorly fitted observations. The default name is _RESWORK_.","type":"standalone"},{"name":"ROLE","optional":true,"description":"Specifies the numeric variable that indicates the role played by each observation in fitting the model. The default name is _ROLE_. Table 9.10 shows how this variable is interpreted for each observation.","type":"standalone"},{"name":"STDRESCHI","optional":true,"description":"Specifies the standardized Pearson (chi-square) residual for identifying observations that are poorly accounted for by the model. The default name is _STDRESCHI_.","type":"standalone"},{"name":"STDRESDEV","optional":true,"description":"Specifies the standardized deviance residual for identifying poorly fitted observations. The default name is _STDRESDEV_.","type":"standalone"},{"name":"STDXBETA","optional":true,"description":"Specifies the standard error estimates of XBETA. The default name is _STDXBETA_.","type":"standalone"},{"name":"UCLM","optional":true,"aliases":["UPPERMEAN","UPPER"],"description":"Specifies the variable that contains the upper confidence limits for the mean. The default name is _LCLM_. You can set the confidence level by specifying the ALPHA= option.","type":"standalone"},{"name":"UCL","optional":true,"aliases":["UPPERXBETA"],"description":"Specifies the variable that contains the upper confidence limits for the linear predictor. The default name is _LCL_. You can set the confidence level by specifying the ALPHA= option.","type":"standalone"},{"name":"XBETA","optional":true,"aliases":["LINP"],"description":"Specifies the linear predictor. The default name is _XBETA_.","type":"standalone"}]},{"name":"PARTITION","description":"The PARTITION statement specifies how observations in the input data set are logically partitioned into disjoint subsets for model training, validation, and testing.","help":"PARTITION &lt;FRACTION(&lt; TEST=fraction &gt; &lt; VALIDATE=fraction &gt; &lt; SEED=number &gt;)&gt; &lt;ROLE=|ROLEVAR=variable (&lt; TEST='value' &gt; &lt; TRAIN='value' &gt; &lt; VALIDATE='value' &gt;)&gt; ","arguments":[{"name":"FRACTION=","optional":true,"description":"Randomly assigns specified proportions of the observations in the input data table to the roles. You specify the proportions for testing and validation by using the TEST= and VALIDATE= suboptions. If you specify both the TEST= and VALIDATE= suboptions, then the sum of the specified fractions must be less than 1 and the remaining fraction of the observations are assigned to the training role. The SEED= option specifies an integer that is used to start the pseudorandom number generator for random partitioning of data for training, testing, and validation. If you do not specify SEED=number or if number is less than or equal to 0, the seed is generated by reading the time of day from the computer’s clock.","help":"FRACTION=VALIDATE= | TEST= | SEED=","type":"choice","arguments":[{"name":"VALIDATE=","type":"value"},{"name":"TEST=","type":"value"},{"name":"SEED=","type":"value"}]},{"name":"ROLE=","optional":true,"aliases":["ROLEVAR="],"description":"Names the variable in the input data table whose values are used to assign roles to each observation. This variable cannot also appear as an analysis variable in other statements or options. The TEST=, TRAIN=, and VALIDATE= suboptions specify the formatted values of this variable that are used to assign observation roles. If you do not specify the TRAIN= suboption, then all observations whose role is not determined by the TEST= or VALIDATE= suboption are assigned to the training role.","help":"ROLE=TRAIN= | VALIDATE= | TEST=","type":"choice","arguments":[{"name":"TRAIN=","type":"value"},{"name":"VALIDATE=","type":"value"},{"name":"TEST=","type":"value"}]}]},{"name":"SELECTION","description":"The SELECTION statement performs model selection by examining whether effects should be added to or removed from the model according to rules that are defined by model selection methods.","help":"SELECTION &lt;ADAPTIVE &lt;(GAMMA=nonnegative number)&gt;&gt; &lt;CHOOSE=&lt;AIC | AICC | SBC&gt;&gt; &lt;METHOD=&lt;BACKWARD | FORWARD | FORWARDSWAP&gt;... &gt; ...","arguments":[{"name":"ADAPTIVE=","optional":true,"description":"Applies adaptive weights to each of the coefficients when METHOD=LASSO. Ordinary least squares estimates of the model parameters are used to form the adaptive weights. You use the GAMMA= option to specify the power transformation that is applied to the parameters in forming the adaptive weights. By default, GAMMA=1.","help":"ADAPTIVE=GAMMA=","type":"choice","arguments":[{"name":"GAMMA=","type":"value"}]},{"name":"CHOOSE=","optional":true,"description":"Chooses from the list of models (at each step of the selection process) the model that yields the best value of the specified criterion.","help":"CHOOSE=AIC | AICC | SBC","type":"choice","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"AICC","description":"Specifies the corrected Akaike’s information criterion.","type":"standalone"},{"name":"SBC","description":"Specifies the Schwarz Bayesian information criterion.","type":"standalone"}]},{"name":"COMPETITIVE","optional":true,"description":"[method-option to be enclosed in parenthesis] Is applicable as a method-option only when METHOD=STEPWISE. If you specify the COMPETITIVE option, then the SELECT= criterion is evaluated for all models in which an effect currently in the model is dropped or an effect not yet in the model is added.","type":"standalone"},{"name":"DETAILS=","optional":true,"description":"Specifies the level of detail to be produced about the selection process. The default is DETAILS= SUMMARY.","help":"DETAILS=SUMMARY | STEPS | ALL | NONE","type":"choice","arguments":[{"name":"SUMMARY","description":"Produces a summary table that shows the effect that is added or removed at each step along with the criteria specified in the SELECT=, CHOOSE=, and STOP= method-options. The summary table is produced by default if you do not specify the DETAILS= option.","type":"standalone"},{"name":"STEPS","description":"Syntax: DETAILS=STEPS<(CANDIDATES(ALL | n))> Produces the preceding summary table and displays the results from fitting each model at each step. If you specify STEPS(CANDIDATES(n)), then the best n candidates are shown. If you specify STEPS(CANDIDATES(ALL)), then all candidates are shown.","type":"standalone"},{"name":"ALL","description":"Produces the preceding tables and a detailed listing of all candidates at each step along with their ranking in terms of the selection criterion for addition to or removal from the model.","type":"standalone"},{"name":"NONE","description":"Specifies that no details be produced about the selection process.","type":"standalone"}]},{"name":"FAST","optional":true,"description":"[method-option to be enclosed in parenthesis] Implements the computational algorithm of Lawless and Singhal (1978) to compute a first-order approximation to the remaining slope estimates for each subsequent elimination of a variable from the model. When applied in backward selection, this option essentially leads to approximating the selection process as the selection process of a linear regression model in which the crossproducts matrix equals the Hessian matrix in the full model under consideration. This option is available only when METHOD=BACKWARD is specified. It is computationally efficient because the model is not fit after removal of each effect.","type":"standalone"},{"name":"HIERARCHY=","optional":true,"description":"Specifies whether and how the model hierarchy requirement is applied. You can specify that only classification effects, or both classification and continuous effects, be subject to the hierarchy requirement. This option is ignored unless you also specify one of the following options: METHOD=FORWARD, METHOD=BACKWARD, or METHOD=STEPWISE.","help":"HIERARCHY=NONE | SINGLE | SINGLECLASS","type":"choice","arguments":[{"name":"NONE","description":"Specifies that model hierarchy not be maintained. Any single effect can enter or leave the model at any step of the selection process.","type":"standalone"},{"name":"SINGLE","description":"Specifies that only one effect enter or leave the model at one time, subject to the model hierarchy requirement.","type":"standalone"},{"name":"SINGLECLASS","description":"Is the same as HIERARCHY=SINGLE except that only CLASS effects are subject to the hierarchy requirement.","type":"standalone"}]},{"name":"LSCOEFFS","optional":true,"description":"[method-option to be enclosed in parenthesis] Requests a hybrid version of the LAR and LASSO methods, in which the sequence of models is determined by the LAR or LASSO algorithm but the coefficients of the parameters for the model at any step are determined by using ordinary least squares.","type":"standalone"},{"name":"MAXEFFECTS=","optional":true,"description":"Specifies the maximum number of effects in any model that is considered during the selection process. This option is ignored when METHOD=BACKWARD is specified.","help":"MAXEFFECTS=*n*","type":"value"},{"name":"MAXSTEPS=","optional":true,"description":"Specifies the maximum number of selection steps that are performed. The default value of n is the number of effects in the SCALEMODEL or MODEL statement when METHOD=FORWARD or METHOD=BACKWARD.","help":"MAXSTEPS=*n*","type":"value"},{"name":"METHOD=","optional":true,"aliases":["SELECTION="],"description":"Specifies the selection method to use.","help":"METHOD=BACKWARD | FORWARD | FORWARDSWAP | STEPWISE","type":"choice","arguments":[{"name":"BACKWARD","description":"Specifies the backward elimination method.","type":"standalone"},{"name":"FORWARD","description":"Specifies the forward selection method.","type":"standalone"},{"name":"FORWARDSWAP","description":"Specifies forward-swap selection, which is an extension of the forward selection method.","type":"standalone"},{"name":"STEPWISE","description":"specifies the stepwise regression method.","type":"standalone"}]},{"name":"MINEFFECTS=","optional":true,"description":"Specifies the minimum number of effects in any model that is considered during backward selection. This option is ignored unless METHOD=BACKWARD is specified.","help":"MINEFFECTS=*n*","type":"value"},{"name":"ORDERSELECT","optional":true,"description":"Specifies that effects in the selected model are displayed in the order in which they first entered the model. If you do not specify the ORDERSELECT option, then effects in the selected model are displayed in the order in which they appear in the MODEL statement.","type":"standalone"},{"name":"PLOT=","optional":true,"aliases":["PLOTS="],"description":"Controls the selection process plots that are produced through ODS Graphics. Each global-plot-option applies to all plots that the SELECTION statement generates, unless you alter the option by using a specific plot option that follows a plot-request. You can specify the following global-plot-options:","help":"PLOT=ALL | COEFFICIENTS | CRITERIA | FITBYROLE  | NONE","type":"choice","arguments":[{"name":"ALL","description":"produces all relevant plots.","type":"standalone"},{"name":"COEFFICIENTS","description":"Syntax: COEFFICIENTS | COEFFICIENTPANEL <(UNPACK | UNPACKPANEL)> Creates a panel of two plots. The upper plot shows the progression of the parameter values as the selection process proceeds. The lower plot shows the progression of the CHOOSE= criterion.","type":"standalone"},{"name":"CRITERIA","description":"Syntax: CRITERIA | CRITERIONPANEL <(UNPACK | UNPACKPANEL)> Creates a panel of model fit criteria. If you specify the UNPACK option, then each criterion progression is shown in a separate plot.","type":"standalone"},{"name":"FITBYROLE","description":"Plots the progression of a fit statistic on the training, test, and validation data. The fit statistic that is displayed depends on the type of model that is being fit. The fit by role plot is not produced if you do not specify a PARTITION statement.","help":"FITBYROLE ","type":"standalone"},{"name":"NONE","description":"Suppress all selection process plots, even if you specify other plot options.","type":"standalone"}]},{"name":"SELECT=","optional":true,"aliases":["CRITERION="],"description":"Specifies the criterion that the procedure uses to determine the order in which effects enter or leave at each step of the selection method. For each step, the effect whose addition to or removal from the current model yields the maximum improvement in the specified criterion is selected. You can use the traditional significance-level approach by specifying the SL criterion; for other supported criteria, see the chapter for the relevant procedure. This option is not valid when METHOD=LAR or METHOD=LASSO.","help":"SELECT=AIC | AICC | SBC","type":"choice","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"AICC","description":"Specifies the corrected Akaike’s information criterion.","type":"standalone"},{"name":"SBC","description":"Specifies the Schwarz Bayesian information criterion.","type":"standalone"}]},{"name":"SLENTRY=","optional":true,"aliases":["SLE="],"description":"Specifies the significance level for entry when STOP=SL or SELECT=SL. By default, SLENTRY=0.05.","type":"value"},{"name":"SLSTAY=","optional":true,"aliases":["SLS="],"description":"Specifies the significance level for staying in the model when STOP=SL or SELECT=SL.","type":"value"},{"name":"STOP=","optional":true,"description":"Specifies a criterion that is used to stop the selection process.","help":"STOP=SL | NONE | &lt;*criterion*&gt;","type":"choice","arguments":[{"name":"SL","description":"Stops the selection process at the step where the significance level of the candidate for entry is greater than the SLENTRY= value for addition steps when METHOD=FORWARD or METHOD=STEPWISE and where the significance level of the candidate for removal is greater than the SLSTAY= value when METHOD=BACKWARD or METHOD=STEPWISE.","type":"standalone"},{"name":"NONE","description":"Stops the selection process if no suitable add or drop candidates can be found or if a size-based limit is reached.","type":"standalone"},{"name":"criterion","placeholder":true,"description":"Stops the selection process if the selection process produces a local extremum of this criterion or if a size-based limit is reached.","type":"value"}]},{"name":"STOPHORIZON=","optional":true,"description":"Specifies the number of consecutive steps at which the STOP= criterion must worsen in order for a local extremum to be detected. The stop horizon value is ignored if you also specify STOP=NONE or STOP=SL. For example, suppose that STOP=AIC and the sequence of AIC values at steps 1 to 6 of a selection are 10, 7, 4, 6, 5, 2. If STOPHORIZON=2, then the AIC criterion is deemed to have a local minimum at step 3 because the AIC value at the next two steps are greater than the value 4 that occurs at step 3. However, if STOPHORIZON=3, then the value at step 3 is not deemed to be a local minimum because the AIC value at step 6 is lower than the AIC value at step 3. When METHOD=LAR or METHOD=LASSO, n is ignored and STOPHORIZON=1 is used. By default, STOPHORIZON=3.","help":"STOPHORIZON=*n*","type":"value"}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations that have nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, all observations that are used in the analysis are assigned a weight of 1.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"v_027","docsetTargetFile":"casstat_logselect_toc.htm"}}