{"name":"MBANALYSIS","statements":[{"name":"PROC MBANALYSIS","description":"The MBANALYSIS (market basket analysis) procedure performs association rule mining on a transaction database. Association rules are in the form of if A then B, where A and B are items in the transaction database. Association rules helps determine association or correlation between various items in a database. These rules are used for finding the latest trends and patterns in data and also help in business decision- making processes. The MBANALYSIS procedure uses the frequent-pattern growth (FP-growth) algorithm of Han, Pei, and Yin (2000) for finding frequent item sets and then generates rules that are based on these frequent item sets.","help":"PROC MBANALYSIS <ANTECEDENTLIST=(string <string...>)> <CONF=number> <CONSEQUENTLIST=(string <string...>)> <DATA=CAS-libref.data-table> <ITEMS=number> <LIFT=number> <MAXBSKTSZ=number> <MINBSKTSZ=number> <NLHS_RANGE=(number, number)> <NORM= | > <NRHS_RANGE=(number, number)> <PCTSUP=number | SUPPCT=number | SUP_PCT=number | PCTSUPPORT=number> <SEPARATOR=string> <SUP_LIFT=number>;     \n\tCUSTOMER statement;\n    \n\tHIERARCHY <DATA=CAS-libref.data-table <CAS-libref.data-table...>> ;\n    \n\tID variables;\n    \n\tOUTPUT <OUT=CAS-libref.data-table> <OUTFREQ=CAS-libref.data-table> <OUTRULE=CAS-libref.data-table> ...;\n    \n\tSAVESTATE <RSTORE=CAS-libref.data-table> ;\n    \n\tTARGET variable;\n","arguments":[{"name":"ANTECEDENTLIST=","optional":true,"description":"Specifies the regular expression strings to match in the antecedent (left-hand side) of a rule.","type":"value"},{"name":"CONF=","optional":true,"description":"Specifies the minimum confidence for the rules, where number must be a real number between 0 and 100.","help":"CONF=*number*","type":"value"},{"name":"CONSEQUENTLIST=","optional":true,"description":"Specifies the regular expression strings to match in the consequent (right-hand side) of a rule.","type":"value"},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC MBANALYSIS to use. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"ITEMS=","optional":true,"description":"Specifies the number of items in a rule, where number must be an integer between 1 and 1,000. By default, ITEMS=2 when you specify either an OUT= or OUTRULE= option in the OUTPUT statement; otherwise, ITEMS=1 by default.","help":"ITEMS=*number*","type":"value"},{"name":"LIFT=","optional":true,"description":"Specifies the minimum lift value necessary to generate a rule, where number must be a positive, real number between 0 and 100, inclusive.","help":"LIFT=*number*","type":"value"},{"name":"MAXBSKTSZ=","optional":true,"description":"Specifies the maximum basket size, where number must be a positive integer between 0 and 1,000, inclusive. Baskets whose size is larger than number are rejected.","help":"MAXBSKTSZ=*number*","type":"value"},{"name":"MINBSKTSZ=","optional":true,"description":"Specifies the minimum basket size, where number must be a positive integer between 0 and 20, inclusive. Baskets whose size is smaller than number are rejected.","help":"MINBSKTSZ=*number*","type":"value"},{"name":"NLHS_RANGE=","optional":true,"description":"Specifies the range of number of items in the left-hand side (LHS) of a rule.","type":"value"},{"name":"NORM=","optional":true,"description":"Specifies whether to normalize the values of the items in the output tables that are specified in the OUTPUT statement.","type":"choice"},{"name":"NRHS_RANGE=","optional":true,"description":"Specifies the range of number of items in the right-hand side (RHS) of a rule.","type":"value"},{"name":"PCTSUP=","optional":true,"aliases":["SUPPCT=","SUP_PCT=","PCTSUPPORT="],"description":"Specifies the minimum level of support for a rule as a percentage of the number of baskets in the input data table, where number must be a real number between 0 and 100, inclusive. This option is ignored if the SUPPORT= option is specified.","type":"value"},{"name":"SEPARATOR=","optional":true,"description":"Specifies the separator character in the antecedent (left-hand side) or consequent (right-hand side) of a rule.","help":"SEPARATOR=*string*","type":"value"},{"name":"SUP_LIFT=","optional":true,"description":"Specifies the minimum support lift necessary to generate a rule, where number must be a positive, real number.","help":"SUP_LIFT=*number*","type":"value"}]},{"name":"CUSTOMER","description":"CUSTOMER statement groups one or more specified target variables into a basket. You can also specify this statement as ID variables.","help":"CUSTOMER statement"},{"name":"HIERARCHY","description":"The HIERARCHY statement specifies one or more hierarchical input data tables. If this statement is not specified, then PROC MBANALYSIS performs simple association analysis without a hierarchy. A maximum of five levels of hierarchy is supported. Each level of hierarchy is specified in a separate data table.","help":"HIERARCHY &lt;DATA=CAS-libref.data-table &lt;CAS-libref.data-table...&gt;&gt; ","arguments":[{"name":"DATA=","optional":true,"description":"Specifies one or more data tables that contain the hierarchy data. A maximum of five levels of hierarchy is supported. Each level of hierarchy is specified in a separate data table. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","type":"value"}]},{"name":"ID","description":"The optional ID statement lists one or more variables from the input data set to be copied to the prediction output data set. The ID statement accepts both numeric and character variables. The variables in an ID statement can also appear in any other statements.","help":"ID variables"},{"name":"OUTPUT","description":"The OUTPUT statement specifies output tables that contain result of the MBANALYSIS procedure.","help":"OUTPUT &lt;OUT=CAS-libref.data-table&gt; &lt;OUTFREQ=CAS-libref.data-table&gt; &lt;OUTRULE=CAS-libref.data-table&gt; ...","arguments":[{"name":"OUT=","optional":true,"description":"Creates a data table that contains information about frequent item sets with their transaction counts and support. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"OUTFREQ=","optional":true,"description":"Creates a data table that contains information about the unique frequent items with their transaction counts and support. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTFREQ=*CAS-libref.data-table*","type":"dataSet"},{"name":"OUTRULE=","optional":true,"description":"Creates a data table that contains information about the rules. This table includes variables that identify the left-hand side and right-hand sides of the rule, the support, and the lift. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTRULE=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"SAVESTATE","description":"The SAVESTATE statement creates an analytic store for the model and saves it as a binary object in a data table. You can use the analytic store in the ASTORE procedure to score new data.","help":"SAVESTATE &lt;RSTORE=CAS-libref.data-table&gt; ","arguments":[{"name":"RSTORE=","optional":true,"description":"Specifies a data table in which to save the analytic store for the model. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"RSTORE=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"TARGET","description":"The TARGET statement specifies a single nominal variable to use as the target variable. If this variable is not present in the input data table, then PROC MBANALYSIS exits with an error.","help":"TARGET variable"}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"v_031","docsetTargetFile":"casml_mbanalysis_toc.htm"}}