{"name":"MBC","statements":[{"name":"PROC MBC","description":"The MBC procedure fits mixtures of multivariate Gaussian and uniform distributions to achieve unsupervised and semisupervised clustering of data. It treats the cluster memberships as missing data and uses the expectation-maximization (EM) algorithm to maximize the likelihood. The procedure can produce output data tables that contain cluster membership weights and component log likelihoods. PROC MBC can also store the fitted model for scoring subsequent input data.","help":"PROC MBC <COVSTRUCT=EEE | EEI | EEV... > <CRITERION=AIC | AICC | BIC... > <DATA=CAS-libref.data-table> <ITHIST> <ITHIST=DETAILS | NONE | SUMMARY> <MAXITER=number> <MCRITERION=number> <NCLUSTERS=number | (number <number …number>) | (number to number <by number>)> <NIT=KMEANS | RANDOM> <NOISE=YES | NO> <SEED=integer> <SINGPARM=number> <SINGULAR=number> <TECHNIQUE=EM | CEM> <TOPMODELS=number>;     \n\tBY variables;\n    \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...;\n    \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...;\n    \n\tINIT variables;\n    \n\tOUTPUT <ALL | ALLSTAT> <COPYVAR=variable | COPYVARS=(variables)> <OUT=CAS-libref.data-table> ...;\n    \n\tSTORE <OUT=CAS-libref.data-table> ;\n    \n\tVAR variables;\n","arguments":[{"name":"COVSTRUCT=","optional":true,"description":"Syntax: COVSTRUCT=EEE | EEI | EEV | EII | EVI | EVV | VII | VVI | VVV | (name <name …name>) Specifies the covariance structure for the Gaussian components. By default, COVSTRUCT=VVV.","help":"COVSTRUCT=EEE | EEI | EEV | EII | EVI | EVV | VII | VVI | VVV","type":"choice","arguments":[{"name":"EEE","description":"Co","type":"standalone"},{"name":"EEI","description":"Equal volume, Equal shape, Equal orientation","type":"standalone"},{"name":"EEV","description":"Equal volume, Equal shape, Coordinate axes orientation","type":"standalone"},{"name":"EII","description":"Equal volume, Equal shape, Variable orientation","type":"standalone"},{"name":"EVI","description":"Equal volume, Spherical shape, Coordinate axes orientation","type":"standalone"},{"name":"EVV","description":"Equal volume, Variable shape, Variable orientation","type":"standalone"},{"name":"VII","description":"Variable volume, Spherical shape, Coordinate axes orientation","type":"standalone"},{"name":"VVI","description":"Variable volume, Variable shape, Coordinate axes orientation","type":"standalone"},{"name":"VVV","description":"Variable volume, Variable shape, Variable orientation","type":"standalone"}]},{"name":"CRITERION=","optional":true,"description":"Specifies the model fit criterion to use in model selection. By default, CRITERION=BIC.","help":"CRITERION=AIC | AICC | BIC | LOGL","type":"choice","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"AICC","description":"Specifies Akaike’s information criterion (corrected).","type":"standalone"},{"name":"BIC","description":"Specifies the Bayesian information criterion.","type":"standalone"},{"name":"LOGL","description":"Specifies the log likelihood.","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC MBC to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"ITHIST","optional":true,"description":"Produces the \"Iteration History\" table with basic information about each iteration. This is equivalent to specifying ITHIST=SUMMARY.","type":"standalone"},{"name":"ITHIST=","optional":true,"description":"Produces the \"Iteration History\" table.","help":"ITHIST=DETAILS | NONE | SUMMARY","type":"choice","arguments":[{"name":"DETAILS","description":"Produces a table that contains expanded information about each iteration.","type":"standalone"},{"name":"NONE","description":"Suppresses the production of the table.","type":"standalone"},{"name":"SUMMARY","description":"Produces a table that contains basic information about each iteration.","type":"standalone"}]},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of expectation-maximization (EM) iterations before termination. The EM process terminates after the specified number of iterations, even if the process has not converged. By default, MAXITER=500.","help":"MAXITER=*number*","type":"value"},{"name":"MCRITERION=","optional":true,"description":"Specifies the convergence criterion for the expectation-maximization (EM) technique.","help":"MCRITERION=*number*","type":"value"},{"name":"NCLUSTERS=","optional":true,"description":"Specifies the number of Gaussian components in the model. By default, NCLUSTERS=2. If you specify a list of numbers or a range of numbers, PROC MBC fits a separate model for each value in the list or range and for all values of the NOISE= and COVSTRUCT= options. The procedure identifies the model that has the best fit, where the fit is computed according to the value of the CRITERION= option.","type":"value"},{"name":"NIT=","optional":true,"description":"Specifies which method to use to initialize cluster membership. This option is ignored if you specify initial weights in the INIT statement. By default, INIT=RANDOM.","help":"NIT=KMEANS | RANDOM","type":"choice","arguments":[{"name":"KMEANS","description":"Uses k-means clustering to generate starting values. BY-group processing is not available when you specify this method.","type":"standalone"},{"name":"RANDOM","description":"Specifies the random weight method.","type":"standalone"}]},{"name":"NOISE=","optional":true,"description":"Specifies whether to include a noise component. By default, NOISE=NO. If you specify a list of values, PROC MBC fits a separate model for each distinct value in the list and for all values of the COVSTRUCT= and NCLUSTERS= options. The procedure identifies the model that has the best fit, where the fit is computed according to the value of the CRITERION= option.","help":"NOISE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"Specifies to include a noise component.","type":"standalone"},{"name":"NO","description":"Specifies not to include a noise component.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies the pseudorandom number seed for generating random starting weights. Random starting weights are used only when you do not specify starting weight variables in the INIT statement and when you do not specify INIT=RANDOM.","help":"SEED=*integer*","type":"value"},{"name":"SINGPARM=","optional":true,"description":"Specifies the parameter singularity criterion. If the mixing estimate for a model component is less than or equal to number, it is considered to be zero. In models that have noise components, if the computed noise volume is less than or equal to number, the procedure will not fit the model. The value of number must be greater than zero.","help":"SINGPARM=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Specifies the general singularity criterion to use in matrix operations. The value of number must be greater than or equal to zero. By default, SINGULAR=1E–8.","help":"SINGULAR=*number*","type":"value"},{"name":"TECHNIQUE=","optional":true,"description":"Specifies the expectation-maximization (EM) technique to use.","help":"TECHNIQUE=EM | CEM","type":"choice","arguments":[{"name":"EM","description":"Specifies the traditional EM technique.","type":"standalone"},{"name":"CEM","description":"Specifies the classification EM technique.","type":"standalone"}]},{"name":"TOPMODELS=","optional":true,"description":"Specifies the maximum number of models to include in the FitSummary table. The value of number must be an integer greater than or equal to 1. This option is applicable only when at least one of the NCLUSTERS=, NOISE=, or COVSTRUCT= options has multiple values. The FitSummary table displays summary information for number of models or for as many models as were fit, whichever is smaller.","help":"TOPMODELS=*number*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement in PROC MBC to obtain separate analyses of observations in groups that are defined by the values of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY variables"},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"INIT","description":"The INIT statement specifies the variables that contain initial weights for the mixture components. By convention, if the model includes a noise component, the first variable in the INIT statement list defines the observation’s initial weight for the noise component. If you are fitting many different models by using the NCLUSTERS=, NOISE=, or COVSTRUCT= option, you must supply enough INIT variables for the model combination that has the most components. The INIT statement is not required. Without an INIT statement, PROC MBC uses the default initialization method.","help":"INIT variables"},{"name":"OUTPUT","description":"The OUTPUT statement creates a data table that contains observationwise statistics that PROC MBC computes after fitting the model. The variables in the input data table are not included in the output data table, in order to avoid data duplication for large data tables; however, variables that you specify in the COPYVAR= option are included. The output statistics are computed on the basis of the final parameter estimates. If no model converges, then the output data table is not created.","help":"OUTPUT &lt;ALL | ALLSTAT&gt; &lt;COPYVAR=variable | COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; ...","arguments":[{"name":"ALL","optional":true,"aliases":["ALLSTAT"],"description":"Adds all available statistics to the output data table.","type":"standalone"},{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Transfers one or more variables from the input data table to the output data table.","type":"value"},{"name":"CURRCLUS","optional":true,"description":"Specifies the cluster weights that produce the final parameter estimates. The default name is CURRn, where n indicates the cluster index. You can modify the name by specifying the name option.","type":"standalone"},{"name":"LOGLIK","optional":true,"description":"Specifies the component and total log likelihood by using the final parameter estimates. The default name for the component log likelihoods is LOGLIKn, where n indicates the cluster index. The default name for the total log likelihood is LOGLIK. You can modify this name by specifying the name option.","type":"standalone"},{"name":"MAXPOST","optional":true,"description":"Specifies the identification of the cluster that has the maximum posterior weight by using the final parameter estimates. The default name is MAXPOST. You can modify this name by specifying the name option.","type":"standalone"},{"name":"NEXTCLUS","optional":true,"description":"Specifies the cluster weights that the final parameter estimates produce. The default name is NEXTn, where n indicates the cluster index. You can modify the name by specifying the name option.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC MBC to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"STORE","description":"The STORE statement enables you to save the fitted model to a store. You can then use this store with PROC CAS and an appropriate scoring action to score other data. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"STORE &lt;OUT=CAS-libref.data-table&gt; ","arguments":[{"name":"OUT=","optional":true,"description":"Names the data table for saving the fitted model.","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"VAR","description":"The VAR statement specifies the variables that you want to cluster. This statement is required.","help":"VAR variables"}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"v_030","docsetTargetFile":"casstat_mbc_toc.htm"}}