{"name":"MI","statements":[{"name":"PROC MI","description":"The MI procedure performs multiple imputation of missing data. Missing values are an issue in a substantial number of statistical analyses. Most SAS statistical procedures exclude observations with any missing variable values from the analysis.","help":"PROC MI <ALPHA=α> <DATA=SAS-data-set> <DISPLAYPATTERN=ALL | NOMEANS | NONE> <MAXIMUM=numbers> <MINIMUM=numbers> <MINMAXITER=number> <MU0=numbers> <NIMPUTE=n | PCTMISSING <( range-options )>> <NOPRINT> <OUT=SAS-data-set> <ROUND=numbers> <SEED=number> <SIMPLE> <SINGULAR=p>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCLASS variables;\n    \n\tEM <CONVERGE=p> <INITIAL=<CC | AC | AC(R=r)>> <ITPRINT> ...;\n    \n\tFCS <NBITER=number> <OUTITER <( options )> =SAS-data-set> <PLOTS<TRACE>> ...;\n    \n\tFREQ variable;\n    \n\tMCMC <CHAIN=<SINGLE | MULTIPLE>> <DISPLAYINIT> <IMPUTE=<FULL | MONOTONE>> ...;\n    \n\tMNAR <ADJUST( imputed-variable / adjust-options )ADJUST( imputed-variable (EVENT=’level’) / adjust-options )> <MODEL( imputed-variables / model-options )> ;\n    \n\tMONOTONE DISCRIM <( imputed < = effects> </ options> ) > LOGISTIC <( imputed < = effects> </ options> ) > PROPENSITY <( imputed < = effects> </ options> ) > ...;\n    \n\tTRANSFORM BOXCOX EXP LOG ...;\n    \n\tVAR variables;\n","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies that confidence limits be constructed for the mean estimates with confidence level 100(1 - α)%, where 0 < α < 1. The default is ALPHA=0.05.","type":"value"},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be analyzed by PROC MI. By default, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DISPLAYPATTERN=","optional":true,"description":"Requests (except when DISPLAYPATTERN=NONE is specified) a missing data patterns table","help":"DISPLAYPATTERN=ALL | NOMEANS | NONE","type":"choice","arguments":[{"name":"ALL","description":"Displays both the missing data patterns and the group means in the table.","type":"standalone"},{"name":"NOMEANS","description":"Displays only the missing data patterns in the table.","type":"standalone"},{"name":"NONE","description":"Does not display the missing data patterns table.","type":"standalone"}]},{"name":"MAXIMUM=","optional":true,"description":"Specifies maximum values for imputed variables.","help":"MAXIMUM=*numbers*","type":"value"},{"name":"MINIMUM=","optional":true,"description":"Specifies the minimum values for imputed variables.","help":"MINIMUM=*numbers*","type":"value"},{"name":"MINMAXITER=","optional":true,"description":"Specifies the maximum number of iterations for imputed values to be in the specified range when the option MINIMUM or MAXIMUM is also specified. The default is MINMAXITER=100.","help":"MINMAXITER=*number*","type":"value"},{"name":"MU0=","optional":true,"aliases":["THETA0"],"description":"Specifies the parameter values, µo, under the null hypothesis µ=µo for the population means corresponding to the analysis variables.","help":"MU0=*numbers*","type":"value"},{"name":"NIMPUTE=","optional":true,"description":"Specifies the number of imputations. NIMPUTE=n specifies the number explicitly, and NIMPUTE=PCTMISSING uses the percentage of incomplete cases as the number of imputations. By default, NIMPUTE=25.","help":"NIMPUTE=MIN= | MAX=","type":"choice","arguments":[{"name":"MIN=","type":"value"},{"name":"MAX=","type":"value"}]},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set containing imputation results.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"ROUND=","optional":true,"description":"Specifies the units to round variables in the imputation. For example, with ROUND=0.001, each value is rounded to the nearest multiple of 0.001.","help":"ROUND=*numbers*","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies a positive integer to start the pseudo-random number generator.","help":"SEED=*number*","type":"value"},{"name":"SIMPLE","optional":true,"description":"Displays simple descriptive univariate statistics and pairwise correlations from available cases.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Specifies the criterion for determining the singularity of a covariance matrix based on standardized variables, where 0 < p < 1. The default is SINGULAR=1E-8.","help":"SINGULAR=*p*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC MI to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement specifies the classification variables in the VAR statement. Classification variables can be either character or numeric. The CLASS statement must be used in conjunction with the MONOTONE statement.","help":"CLASS variables"},{"name":"EM","description":"The expectation-maximization (EM) algorithm is a technique for maximum likelihood estimation in parametric models for incomplete data.","help":"EM &lt;CONVERGE=p&gt; &lt;INITIAL=&lt;CC | AC | AC(R=r)&gt;&gt; &lt;ITPRINT&gt; ...","arguments":[{"name":"CONVERGE=","optional":true,"aliases":["XCONV="],"description":"Sets the convergence criterion. The value must be between 0 and 1.","help":"CONVERGE=*p*","type":"value"},{"name":"INITIAL=","optional":true,"description":"Sets the initial estimates for the EM algorithm.","help":"INITIAL=CC | AC | AC(R=r)","type":"choice","arguments":[{"name":"CC","description":"Uses the means and covariances from complete cases","type":"standalone"},{"name":"AC","description":"Uses the means and standard deviations from available cases and the correlations are set to zero","type":"standalone"},{"name":"AC","description":"Uses the means and standard deviations from available cases with correlation r, where -1/(p-1) < R < 1 and p is the number of variables to be analyzed.","help":"AC(R=r)","type":"value"}]},{"name":"ITPRINT","optional":true,"description":"Prints the iteration history in the EM algorithm.","type":"standalone"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations used in the EM algorithm. The default is MAXITER=200.","help":"MAXITER=*number*","type":"value"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set containing results from the EM algorithm.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTEM=","optional":true,"description":"Creates an output SAS data set of TYPE=COV containing the MLE of the parameter vector (µ, Sigma).","help":"OUTEM=*SAS-data-set*","type":"dataSet"},{"name":"OUTITER=","optional":true,"description":"Creates an output SAS data set of TYPE=COV containing parameters for each iteration.","type":"value"}]},{"name":"FCS","description":"(This statement is Experimental under SAS 9.3) The FCS statement specifies a multivariate imputation by fully conditional specification methods. If you specify an FCS statement, you must also specify a VAR statement.","help":"FCS &lt;NBITER=number&gt; &lt;OUTITER &lt;( options )&gt; =SAS-data-set&gt; &lt;PLOTS&lt;TRACE&gt;&gt; ...","arguments":[{"name":"DISCRIM=","optional":true,"description":"Specifies the discriminant function method of classification variables. The available options are as follows: CLASSEFFECTS=EXCLUDE | INCLUDE specifies whether the CLASS variables are used as covariate effects. The CLASSEFFECTS=EXCLUDE option excludes the CLASS variables from covariate effects and the CLASSEFFECTS=INCLUDE option includes the CLASS variables as covariate effects. The default is CLASSEFFECTS=EXCLUDE. DETAILS displays the group means and pooled covariance matrix used in each imputation. PCOV=FIXED | POSTERIOR specifies the pooled covariance used in the discriminant method. The PCOV=FIXED option uses the observed-data pooled covariance matrix for each imputation and the PCOV=POSTERIOR option draws a pooled covariance matrix from its posterior distribution. The default is PCOV=POSTERIOR. PRIOR=EQUAL | JEFFREYS <=c> | PROPORTIONAL | RIDGE <=d> specifies the prior probabilities of group membership.","help":"DISCRIM=CLASSEFFECTS= | DETAILS | PCOV= | PRIOR=","type":"choice","arguments":[{"name":"CLASSEFFECTS=","type":"value"},{"name":"DETAILS","type":"standalone"},{"name":"PCOV=","type":"value"},{"name":"PRIOR=","type":"value"}]},{"name":"LOGISTIC=","optional":true,"description":"Specifies the logistic regression method of classification variables. he available options are as follows: DESCENDING reverses the sort order for the levels of the response variables. DETAILS displays the regression coefficients in the logistic regression model used in each imputation. LIKELIHOOD=NOAUGMENT LIKELIHOOD=AUGMENT <( WEIGHT=w | NPARM <(MULT=m)> )> specifies whether to add new observations to the likelihood function in the computation of maximum likelihood estimates. WEIGHT=w explicitly specifies the total added weight w. WEIGHT=NPARM <(MULT=m)> uses the number of parameters in the logistic regression model as the total added weight. LINK=GLOGIT | LOGIT specifies the link function that links the response probabilities to the linear predictors. ORDER=DATA | FORMATTED | FREQ | INTERNAL specifies the sort order for the levels of the response variable.","help":"LOGISTIC=DETAILS | LIKELIHOOD= | DESCENDING | WEIGHT= | NPARM | MULT= | LINK= | ORDER=","type":"choice","arguments":[{"name":"DETAILS","type":"standalone"},{"name":"LIKELIHOOD=","type":"value"},{"name":"DESCENDING","type":"standalone"},{"name":"WEIGHT=","type":"value"},{"name":"NPARM","type":"standalone"},{"name":"MULT=","type":"value"},{"name":"LINK=","type":"value"},{"name":"ORDER=","type":"value"}]},{"name":"NBITER=","optional":true,"description":"Specifies the number of burn-in iterations before each imputation.","help":"NBITER=*number*","type":"value"},{"name":"OUTITER=","optional":true,"description":"Creates an output SAS data set of TYPE=COV that contains parameters used in the imputation step for each iteration. The data set includes variables named _Imputation_ and _Iteration_ to identify the imputation number and iteration number.","type":"value"},{"name":"PLOTS","optional":true,"description":"Requests statistical graphics of trace plots from iterations via the Output Delivery System (ODS). ODS Graphics must be enabled before requesting plots. For example:","help":"PLOTSTRACE","type":"choice","arguments":[{"name":"TRACE","description":"Syntax: TRACE <(trace-options)> The available trace-options are as follows: MEAN < ( variables ) > displays plots of means for continuous variables in the list. When the MEAN option is specified without variables, all continuous variables are used. STD < ( variables ) > displays plots of standard deviations for continuous variables in the list. When the STD option is specified without variables, all continuous variables are used.","type":"standalone"}]},{"name":"REGPREDMEANMATCH","optional":true,"aliases":["REGPMM"],"description":"Schenker and Taylor 1996).","type":"standalone"},{"name":"REGRESSION=","optional":true,"aliases":["REG"],"description":"Specifies the regression method of continuous variables. The DETAILS option displays the regression coefficients in the regression model used in each imputation.","help":"REGRESSION=DETAILS","type":"choice","arguments":[{"name":"DETAILS","type":"standalone"}]}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"If one variable in your input data set represents the frequency of occurrence of other values in the observation, specify the variable name in a FREQ statement. PROC MI then treats the data set as if each observation appears n times, where n is the value of the FREQ variable for the observation.","help":"FREQ variable"},{"name":"MCMC","description":"The MCMC statement specifies the details of the MCMC method for imputation.","help":"MCMC &lt;CHAIN=&lt;SINGLE | MULTIPLE&gt;&gt; &lt;DISPLAYINIT&gt; &lt;IMPUTE=&lt;FULL | MONOTONE&gt;&gt; ...","arguments":[{"name":"CHAIN=","optional":true,"description":"Specifies whether a single chain is used for all imputations or a separate chain is used for each imputation. The default is CHAIN=SINGLE.","help":"CHAIN=SINGLE | MULTIPLE","type":"choice","arguments":[{"name":"SINGLE","description":"a single chain is used for all imputations.","type":"standalone"},{"name":"MULTIPLE","description":"A separate chain is used for each imputation.","type":"standalone"}]},{"name":"DISPLAYINIT","optional":true,"description":"Displays initial parameter values in the MCMC method for each imputation.","type":"standalone"},{"name":"IMPUTE=","optional":true,"description":"Specifies whether a full-data imputation is used for all missing values or a monotone-data imputation is used for a subset of missing values to make the imputed data sets have a monotone missing pattern.","help":"IMPUTE=FULL | MONOTONE","type":"choice","arguments":[{"name":"FULL","description":"Specifies that a full-data imputation is used for all missing values","type":"standalone"},{"name":"MONOTONE","description":"Specifies that a monotone-data imputation is used for a subset of missing values to make the imputed data sets have a monotone missing pattern.","type":"standalone"}]},{"name":"INEST=","optional":true,"description":"Names a SAS data set of TYPE=EST containing parameter estimates for imputations.","help":"INEST=*SAS-data-set*","type":"dataSet"},{"name":"INITIAL=","optional":true,"description":"Specifies the initial mean and covariance estimates for the MCMC method. The default is INITIAL=EM.","help":"INITIAL=EM | INPUT=","type":"choice","arguments":[{"name":"EM","description":"Syntax: EM <(options)> PROC MI derives parameter estimates for a posterior mode, the highest observed-data posterior density, from the EM algorithm. The following four options are available with INITIAL=EM: BOOTSTRAP <=number> requests bootstrap resampling, which uses a simple random sample with replacement from the input data set for the initial estimate. You can explicitly specify the number of observations in the random sample. CONVERGE=p | XCONV=p sets the convergence criterion. The value must be between 0 and 1. ITPRINT prints the iteration history in the EM algorithm for the posterior mode. MAXITER=number specifies the maximum number of iterations used in the EM algorithm. The default is MAXITER=200.","type":"standalone"},{"name":"INPUT=","description":"Syntax: INITIAL=INPUT=SAS-data-set Reads the initial estimates of the mean and covariance matrix for each imputation from a SAS data set.","type":"value"}]},{"name":"NBITER=","optional":true,"description":"Specifies the number of burn-in iterations before the first imputation in each chain. The default is NBITER=200.","help":"NBITER=*number*","type":"value"},{"name":"NITER=","optional":true,"description":"Specifies the number of iterations between imputations in a single chain. The default is NITER=100.","help":"NITER=*number*","type":"value"},{"name":"OUTEST=","optional":true,"description":"Creates an output SAS data set of TYPE=EST. The data set contains parameter estimates used in each imputation.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"OUTITER=","optional":true,"description":"Creates an output SAS data set of TYPE=COV containing parameters used in the imputation step for each iteration. The data set includes variables named _Imputation_ and _Iteration_ to identify the imputation number and iteration number.","type":"value"},{"name":"PLOTS=","optional":true,"description":"Requests statistical graphics via the Output Delivery System (ODS). Syntax: (1) PLOTS <( LOG )> <= plot-request> (2) PLOTS <( LOG )> <= ( plot-request <...plot-request> )> The global plot option LOG requests that the logarithmic transformations of parameters be used.","help":"PLOTS=ACF | ALL | NONE | TRACE","type":"choice","arguments":[{"name":"ACF","description":"Syntax: ACF<(acf-options)> Displays plots of the autocorrelation function of parameters from iterations. The default is ACF( MEAN). The available acf-options are as follows: NLAG=n specifies the maximum lag of the series. The default is NLAG=20. The autocorrelations at each lag are displayed in the graph. COV < ( < variables > < variable1*variable2 > < ...variable1*variable2 > ) > displays plots of variances for variables in the list and covariances for pairs of variables in the list. MEAN < ( variables ) > displays plots of means for variables in the list. When the option MEAN is specified without variables, all variables are used. WLF displays the plot for the worst linear function.","type":"standalone"},{"name":"ALL","description":"Produces all appropriate plots","type":"standalone"},{"name":"NONE","description":"Suppresses all plots","type":"standalone"},{"name":"TRACE","description":"Syntax: TRACE<(trace-options)> Displays trace plots of parameters from iterations. The default is TRACE( MEAN). The available trace-options are as follows: COV < ( < variables > < variable1*variable2 > < ...variable1*variable2 > ) > displays plots of variances for variables in the list and covariances for pairs of variables in the list. MEAN < ( variables ) > displays plots of means for variables in the list. When the option MEAN is specified without variables, all variables are used. WLF displays the plot for the worst linear function.","type":"standalone"}]},{"name":"PRIOR=","optional":true,"description":"Specifies the prior information for the means and covariances.","help":"PRIOR=JEFFREYS | RIDGE= | INPUT=","type":"choice","arguments":[{"name":"JEFFREYS","description":"Specifies a noninformative prior.","type":"standalone"},{"name":"RIDGE=","description":"[Syntax: RIDGE=number] Specifies a ridge prior.","type":"value"},{"name":"INPUT=","description":"[Syntax: INPUT=SAS-data-set] Specifies a data set containing prior information.","type":"value"}]},{"name":"START=","optional":true,"description":"Specifies that the initial parameter estimates are used either as the starting value (START=VALUE) or as the starting distribution (START=DIST) in the first imputation step of each chain.","help":"START=VALUE | DIST","type":"choice","arguments":[{"name":"VALUE","description":"Specifies that the initial parameter estimates are used as the starting value in the first imputation step of each chain.","type":"standalone"},{"name":"DIST","description":"Specifies that the initial parameter estimates are used as the starting distribution in the first imputation step of each chain.","type":"standalone"}]},{"name":"WLF","optional":true,"description":"Displays the worst linear function of parameters.","type":"standalone"}]},{"name":"MNAR","description":"The MNAR statement imputes missing values by using the pattern-mixture model approach, assuming the missing data are missing not at random (MNAR), which is described in the section Multiple Imputation with Pattern-Mixture Models. By comparing inferential results for these values to results for imputed values that are obtained under the missing at random (MAR) assumption, you can assess the sensitivity of the conclusions to the MAR assumption. The inference under MAR is questionable if it leads to results that are different from the results for a plausible MNAR scenario.","help":"MNAR &lt;ADJUST( imputed-variable / adjust-options )ADJUST( imputed-variable (EVENT=’level’) / adjust-options )&gt; &lt;MODEL( imputed-variables / model-options )&gt; ","arguments":[{"name":"ADJUST=","optional":true,"description":"Specifies an imputed-variable in the VAR statement and the subset of observations from which the imputed values for the variable are to be adjusted. If the imputed-variable is a classification variable, you must specify the EVENT= option to identify the response category to which the adjustments are applied. The adjust-options specify the subset of observations and the adjustment parameters.","help":"ADJUST=EVENT= | ADJUSTOBS= | SCALE= | SHIFT= | DELTA= | SIGMA= | PARMS","type":"choice","arguments":[{"name":"EVENT=","type":"value"},{"name":"ADJUSTOBS=","type":"value"},{"name":"SCALE=","type":"value"},{"name":"SHIFT=","type":"value"},{"name":"DELTA=","type":"value"},{"name":"SIGMA=","type":"value"},{"name":"PARMS","type":"standalone"}]},{"name":"MODEL=","optional":true,"description":"Specifies a set of imputed-variables in the VAR statement and the subset of observations from which the imputation models for these variables are to be derived. You can specify multiple MODEL options in the MNAR statement, but only one MODEL option for each imputed variable.","help":"MODEL=MODELOBS=","type":"choice","arguments":[{"name":"MODELOBS=","type":"value"}]}]},{"name":"MONOTONE","description":"The MONOTONE statement specifies imputation methods for data sets with monotone missingness. You must also specify a VAR statement, and the data set must have a monotone missing pattern with variables ordered in the VAR list.","help":"MONOTONE DISCRIM &lt;( imputed &lt; = effects&gt; &lt;/ options&gt; ) &gt; LOGISTIC &lt;( imputed &lt; = effects&gt; &lt;/ options&gt; ) &gt; PROPENSITY &lt;( imputed &lt; = effects&gt; &lt;/ options&gt; ) &gt; ...","arguments":[{"name":"DISCRIM=","description":"Specifies the discriminant function method of classification variables. The available options are DETAILS, PCOV=, and PRIOR=. The DETAILS option displays the group means and pooled covariance matrix used in each imputation. The PCOV= option specifies the pooled covariance used in the discriminant method. Valid values for the PCOV= option are as follows: FIXED uses the observed-data pooled covariance matrix for each imputation. POSTERIOR draws a pooled covariance matrix from its posterior distribution. The default is PCOV=POSTERIOR. The PRIOR= option specifies the prior probabilities of group membership. Valid values for the PRIOR= option are as follows: EQUAL sets the prior probabilities equal for all groups. PROPORTIONAL sets the prior probabilities proportion to the group sample sizes. JEFFREYS < =c > specifies a noninformative prior, 0 < c < 1. If the number c is not specified, JEFFREYS=0.5.","type":"value"},{"name":"LOGISTIC","description":"Specifies the logistic regression method of classification variables. The available options are DETAILS, ORDER=, and DESCENDING. The DETAILS option displays the regression coefficients in the logistic regression model used in each imputation. When the imputed variable has more than two response levels, the ordinal logistic regression method is used. The ORDER= option specifies the sorting order for the levels of the response variable. Valid values for the ORDER= option are as follows: DATA sorts by the order of appearance in the input data set. FORMATTED sorts by their external formatted values. FREQ sorts by the descending frequency counts.","type":"standalone"},{"name":"PROPENSITY","description":"Specifies the propensity scores method of variables. The available options are DETAILS and NGROUPS=. The DETAILS option displays the regression coefficients in the logistic regression model for propensity scores.","type":"standalone"},{"name":"REGPMM","aliases":["REGPREDMEANMATCH"],"description":"Specifies the predictive mean matching method for continuous variables. This method is similar to the regression method except that it imputes a value randomly from a set of observed values whose predicted values are closest to the predicted value for the missing value from the simulated regression model (Heitjan and Little 1991; Schenker and Taylor 1996).","type":"standalone"},{"name":"REGRESSION","aliases":["REG"],"description":"Specifies the regression method of continuous variables. The DETAILS option displays the regression coefficients in the regression model used in each imputation.","type":"standalone"}]},{"name":"TRANSFORM","description":"The TRANSFORM statement lists the transformations and their associated variables to be transformed.","help":"TRANSFORM BOXCOX EXP LOG ...","arguments":[{"name":"BOXCOX","description":"Specifies the Box-Cox transformation of variables.","type":"standalone"},{"name":"EXP","description":"Specifies the exponential transformation of variables.","type":"standalone"},{"name":"LOG","description":"Specifies the logarithmic transformation of variables.","type":"standalone"},{"name":"LOGIT","description":"Specifies the logit transformation of variables.","type":"standalone"},{"name":"POWER","description":"Specifies the power transformation of variables.","type":"standalone"},{"name":"C=","optional":true,"followsDelimiter":"/","description":"Specifies the c value in the transformation. The default is c = 1 for logit transformation and c = 0 for other transformations.","help":"C=*number*","type":"value"},{"name":"LAMBDA=","optional":true,"followsDelimiter":"/","description":"Specifies the λ value in the power and Box-Cox transformations.","help":"LAMBDA=*number*","type":"value"}]},{"name":"VAR","description":"The VAR statement lists the variables to be analyzed. The variables can be either character or numeric.","help":"VAR variables"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_033","docsetTargetFile":"statug_mi_toc.htm"}}