{"name":"MIANALYZE","statements":[{"name":"PROC MIANALYZE","description":"The MIANALYZE procedure combines the results of the analyses of imputations and generates valid statistical inferences. Multiple imputation provides a useful strategy for analyzing data sets with missing values.","help":"PROC MIANALYZE <ALPHA=α> <BCOV> <COVB<(EFFECTVAR=STACKING | ROWCOL)>= SAS-data-set> <DATA=SAS-data-set> <EDF=number> <MULTIVARIATE> <PARMINFO=SAS-data-set> <PARMS<(CLASSVAR= ctype)>=SAS-data-set> <TCOV> <THETA0=numbers> <WCOV> <XPXI=SAS-data-set>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCLASS variables ;\n    \n\tMODELEFFECTS effects ;\n    \n\tSTDERR variables ;\n    \n\tTEST <BCOV> <MULT> <TCOV> ...;\n","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies that confidence limits are to be constructed for the parameter estimates with confidence level 100(1 - α), where 0 < α < 1. The default is ALPHA=.","type":"value"},{"name":"BCOV","optional":true,"description":"Displays the between-imputation covariance matrix.","type":"standalone"},{"name":"COVB=","optional":true,"description":"Names an input SAS data set that contains covariance matrices of the parameter estimates from imputed data sets. If you provide a COVB= data set, you must also provide a PARMS= data set.","type":"value"},{"name":"DATA=","optional":true,"description":"Names an input SAS data set. If the input DATA= data set is not a specially structured SAS data set, the data set contains both the parameter estimates and associated standard errors. The parameter estimates are specified in the MODELEFFECTS statement and the standard errors are specified in the STDERR statement. If the data set is a specially structured input SAS data set, it must have a TYPE of EST, COV, or CORR that contains estimates from imputed data sets: o If TYPE=EST, the data set contains the parameter estimates and associated covariance matrices. o If TYPE=COV, the data set contains the sample means, sample sizes, and covariance matrices. Each covariance matrix for variables is divided by the sample size n to create the covariance matrix for parameter estimates. o If TYPE=CORR, the data set contains the sample means, sample sizes, standard errors, and correlation matrices. The covariance matrices are computed from the correlation matrices and associated standard errors. Each covariance matrix for variables is divided by the sample size n to create the covariance matrix for parameter estimates.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"EDF=","optional":true,"description":"Specifies the complete-data degrees of freedom for the parameter estimates.","help":"EDF=*number*","type":"value"},{"name":"MULTIVARIATE","optional":true,"aliases":["MULT"],"description":"Requests multivariate inference for the parameters. It is based on Wald tests and is a generalization of the univariate inference.","type":"standalone"},{"name":"PARMINFO=","optional":true,"description":"Names an input SAS data set that contains parameter information associated with variables PRM1, PRM2,..., and so on.","help":"PARMINFO=*SAS-data-set*","type":"dataSet"},{"name":"PARMS=","optional":true,"description":"Names an input SAS data set that contains parameter estimates computed from imputed data sets.","type":"value"},{"name":"TCOV","optional":true,"description":"Displays the total covariance matrix derived by assuming that the population between-imputation and within-imputation covariance matrices are proportional to each other.","type":"standalone"},{"name":"THETA0=","optional":true,"aliases":["MU0="],"description":"Specifies the parameter values θo under the null hypothesis θ=θo in the t tests for location for the effects.","help":"THETA0=*numbers*","type":"value"},{"name":"WCOV","optional":true,"description":"Displays the within-imputation covariance matrices.","type":"standalone"},{"name":"XPXI=","optional":true,"description":"Names an input SAS data set that contains the (X'X)⁻¹ matrices associated with the parameter estimates computed from imputed data sets.","help":"XPXI=*SAS-data-set*","type":"dataSet"}]},{"name":"BY","description":"You can specify a BY statement with PROC MIANALYZE to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement specifies the classification variables in the MODELEFFECTS statement. Classification variables can be either character or numeric.","help":"CLASS variables "},{"name":"MODELEFFECTS","description":"The MODELEFFECTS statement lists the effects in the data set to be analyzed. Each effect is a variable or a combination of variables, and is specified with a special notation that uses variable names and operators.","help":"MODELEFFECTS effects "},{"name":"STDERR","description":"The STDERR statement lists standard errors associated with effects in the MODELEFFECTS statement, when the 1input DATA=data set contains both parameter estimates and standard errors as variables in the data set.","help":"STDERR variables "},{"name":"TEST","description":"The TEST statement tests linear hypotheses about the parameters β. An F test is used to jointly test the null hypotheses (Ho: LB=c) specified in a single TEST statement in which the MULT option is specified.","help":"TEST &lt;BCOV&gt; &lt;MULT&gt; &lt;TCOV&gt; ...","arguments":[{"name":"BCOV","optional":true,"followsDelimiter":"/","description":"Displays the between-imputation covariance matrix.","type":"standalone"},{"name":"MULT","optional":true,"followsDelimiter":"/","description":"Displays the multivariate inference for parameters.","type":"standalone"},{"name":"TCOV","optional":true,"followsDelimiter":"/","description":"Displays the total covariance matrix.","type":"standalone"},{"name":"WCOV","optional":true,"followsDelimiter":"/","description":"Displays the within-imputation covariance matrix.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_022","docsetTargetFile":"statug_mianalyze_toc.htm"}}