{"name":"MIRP","statements":[{"name":"PROC MIRP","description":"The MIRP procedure is designed for inventory replenishment planning. It answers three basic questions about inventory: Where should it be stocked? When should it be stocked? How much of it should be stocked? A replenishment plan consists of control parameters that determine replenishment quantities for each product at each location at each period. The MIRP procedure optimizes these control parameters so that service-level requirements are satisfied at minimum inventory costs.","help":"PROC MIRP *options*  ;    NODE &lt;/ options&gt;;   ARC &lt;/ options&gt;;   DEMAND &lt;/ options&gt;;   INVENTROY &lt;/ options&gt;;   ","arguments":[{"name":"ARCDATA=","optional":true,"description":"names the SAS data set that contains the network specification. Variables in the data set are defined in the section ARC Statement. This option is required unless you specify SINGLEECHELON=YES. When you specify the ARCDATA= option, you must also specify a variable in the NETWORKID= option in the NODE statement and you must group the data by that variable.","help":"ARCDATA=*SAS-data-set*","type":"dataSet"},{"name":"CV2=","optional":true,"description":"specifies whether PROC MIRP uses the classic definition or a customized definition of the coefficient of variation (CV). You can specify the following values: YES uses a classic definition of CV, which is the ratio between the standard deviation (the square root of the variance) of demand and the average of demand. NO uses the customized definition of CV, which is the ratio between the variance and the average of demand. This option applies only when DEMANDMODEL=DISCRETE. If DEMANDMODEL=CONTINUOUS, the classic definition of CV is used. By default, CV2=NO.","help":"CV2=*YES | NO*","type":"value"},{"name":"DEMANDDATA=","optional":true,"description":"names the SAS data set that contains forecasts of customer demand. Variables in the data set are defined in the section DEMAND Statement. This option is required, and the data must be grouped by the variable specified in the NETWORKID= option in the NODE statement.","help":"DEMANDDATA=*SAS-data-set*","type":"dataSet"},{"name":"DEMANDMODEL=","optional":true,"description":"specifies how PROC MIRP is to model the demand forecast. You can specify the following values: DISCRETE models the demand by a set of discrete statistical distributions. More specifically, depending on the ratio between the mean and variance of the demand, the procedure selects from the Bernoulli, binomial, Poisson, negative binomial, or geometric distribution or from any mix of these distributions. This value is recommended for modeling slow-moving items such as spare parts. CONTINUOUS models the demand by either a normal distribution or a mixed-normal distribution. This value is a better fit for fast-moving items. By default, DEMANDMODEL=CONTINUOUS. For more information about the demand distributions, see the section Modeling Demand..","help":"DEMANDMODEL=*DISCRETE | CONTINUOUS*","type":"value"},{"name":"FORECASTINTERVAL=","optional":true,"description":"specifies the number of base periods in each forecast period in the DEMANDDATA= data set. For example, if FORECASTINTERVAL=7, one forecast period is equivalent to seven base periods. By default, FORECASTINTERVAL=1. This option is useful when the forecast period is at a higher granular level than the base period for the inventory replenishment. Quite often the demand forecast is conducted weekly in order to achieve sufficient accuracy, and the inventory is replenished daily. You need to know what daily demand looks like in order to make daily replenishment decisions. To handle the discrepancy in the time scale, you can break down the weekly forecast into a daily forecast (via equal split or through a daily index). PROC MIRP can also break down the forecast, and it uses an equal split.","help":"FORECASTINTERVAL=*i*","type":"value"},{"name":"HORIZON=","optional":true,"description":"specifies the number of base periods for which policy parameters or key performance indicators (KPIs) or both are computed. By default, HORIZON=12.","help":"HORIZON=*i*","type":"value"},{"name":"INVENTORYDATA=","optional":true,"description":"names the SAS data set that contains inventory or policy parameters or both. Variables in this data set are defined in the section INVENTORY Statement. This option is required when you specify one of the following values in the OBJECTIVE= option: CREATEORDER, PREDICTKPI, ORDER_KPI, or POLICY_ORDER_KPI. If you specify this option, you must group the data by the variable specified in the NETWORKID= option in the NODE statement.","help":"INVENTORYDATA=*SAS-data-set*","type":"dataSet"},{"name":"LOOKUPTABLE=","optional":true,"description":"specifies whether to create a lookup table for fast calculation. You can specify the following values: YES creates a lookup table. This option can boost the speed of the MIRP procedure when policy optimization is needed for a large number of SKU-locations. NO does not create a lookup table. By default, LOOKUPTABLE=NO.","help":"LOOKUPTABLE=*YES | NO*","type":"value"},{"name":"MAXCV=","optional":true,"description":"specifies the maximum coefficient of variation (CV) that is allowed in the demand forecast. The definition of CV depends on the CV2= option if DEMANDMODEL=DISCRETE. When PROC MIRP detects any demand forecast that has a CV that exceeds number, it writes a warning message to the log and decreases the variance of the demand to meet number. By default, MAXCV=1.","help":"MAXCV=*i*","type":"value"},{"name":"MAXMESSAGES=","optional":true,"description":"specifies the maximum number of warning and error messages that PROC MIRP writes to the log. If this option is omitted, the procedure displays all messages.","help":"MAXMESSAGES=*i*","type":"value"},{"name":"MESSAGE=","optional":true,"description":"names the output data set to contain any warning or error messages or both. If this option is omitted, this data set is not created. The variables in this data set are defined in the section Variables in the MESSAGE= Data Set. The data are grouped by the variable specified in the NETWORKID= option in the NODE statement.","help":"MESSAGE=*SAS-data-set*","type":"dataSet"},{"name":"MINCV=","optional":true,"description":"specifies the minimum coefficient of variation (CV) that is allowed in the demand forecast. The definition of CV depends on the CV2= option if DEMANDMODEL=DISCRETE. When PROC MIRP detects any demand forecast that has a CV that falls below number, it writes a warning message to the log and increases the variance of the demand to meet number. By default, MINCV=0.1.","help":"MINCV=*i*","type":"value"},{"name":"NETWORKCNT=","optional":true,"description":"specifies the number of networks (NETWORKIDs) to be processed. The first n NETWORKIDs are processed. By default, all NETWORKIDs are processed.","help":"NETWORKCNT=*i*","type":"value"},{"name":"NODEDATA=","optional":true,"description":"names the SAS data set that contains information about each SKU-location. These variables are defined in the section NODE Statement. This option is required, and the data must be grouped by the variable specified in the NETWORKID= option in the NODE statement.","help":"NODEDATA=*SAS-data-set*","type":"dataSet"},{"name":"OBJECTIVE=","optional":true,"description":"specifies how the procedure is used. By default, OBJECTIVE=OPTPOLICY. You can specify one of the following options:","help":"OBJECTIVE=*option*","type":"value","arguments":[{"name":"OPTPOLICY","description":"optimizes reorder and order-up-to levels for all locations at each planning period, subject to their service-levels constraints.","type":"standalone"},{"name":"OPTISL","description":"optimizes service levels of locations that are not customer-facing, subject to service-level constraints at customer-facing locations.","type":"standalone"},{"name":"EVALISL","description":"evaluates costs of a network, subject to service-level constraints at all locations.","type":"standalone"},{"name":"CREATEORDER","description":"determines order quantities for all locations, based on inventory control policies and current on-hand and pipeline inventory.","type":"standalone"},{"name":"PREDICTKPI","description":"estimates key performance indicators (KPIs) for all locations in a network at each planning period, based on inventory control policies and current on-hand and pipeline inventory.","type":"standalone"},{"name":"POLICY_ORDER","description":"is equivalent to the combination of OPTPOLICY and CREATEORDER.","type":"standalone"},{"name":"POLICY_ORDER_KPI","description":"is equivalent to the combination of OPTPOLICY, CREATEORDER, and PREDICTKPI.","type":"standalone"},{"name":"ORDER_KPI","description":"is equivalent to the combination of CREATEORDER and PREDICTKPI.","type":"standalone"},{"name":"OPTIMIZATION","description":"is equivalent to the combination of OPTISL and OPTPOLICY.","type":"standalone"}]},{"name":"OUT=","optional":true,"description":"names the output data set to contain computation results for all SKU-locations. If this option is omitted, PROC MIRP creates a data set and names it according to the DATAn naming convention. The variables in this data set are defined in the section Variables in the OUT= Data Set. The data are grouped by the variable specified in the NETWORKID= option in the NODE statement.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"POLICYPARAM=","optional":true,"description":"specifies the type of reorder and order-up-to levels. You can specify the following values: INTEGER specifies that reorder and order-up-to levels are integers. This value is preferred in discrete manufacturing and distribution applications (such as spare parts management). DOUBLE specifies that reorder and order-up-to levels are doubles. This value is often appropriate in chemical processes. By default, POLICYPARM=INTEGER.","help":"POLICYPARAM=*INTEGER | DOUBLE*","type":"value"},{"name":"REPLICATIONS=","optional":true,"description":"specifies the number of simulation replications to be used in policy optimization and KPI prediction. By default, REPLICATIONS=200. Because PROC MIRP uses simulation in the optimization and prediction steps, the accuracy increases as the number of replications increases. However, the run time also increases.","help":"REPLICATIONS=*i*","type":"value"},{"name":"SINGLEECHELON=","optional":true,"description":"specifies whether SKU-locations that are defined in the NODEDATA= data set are single-echelon. You can specify the following values: YES specifies that SKU-locations are single-echelon. NO specifies that SKU-locations are not single-echelon. By default, SINGLEECHELON=NO.","help":"SINGLEECHELON=*YES | NO*","type":"value"},{"name":"SYSTEM=","optional":true,"description":"specifies whether to push excess inventory to downstream SKU-locations. During a promotional or seasonal sale, for example, you might want to use the push system to transfer excess inventory from a warehouse to retailers even though the retailers already have enough inventory to satisfy forecast demand. You can specify the following values: PULL requests that PROC MIRP attempt to best satisfy the demand at each SKU-location and that any excess inventory at an upstream SKU-location not be distributed to the downstream SKU-locations. PUSH requests that all excess inventory at an upstream SKU-location be distributed among the downstream SKU-locations, subject to any capacity constraints. By default, SYSTEM=PULL. When SYSTEM=PUSH, the variables that are specified in the ORDERMAX= and ORDERMIN= options in the NODE statement are ignored. Instead, you can use the CAPACITY= and BATCHSIZE= options in the NODE statement to specify variables that place bounds on the amount of inventory that can be pushed to a SKU-location.","help":"SYSTEM=*PULL | PUSH*","type":"value"}]},{"name":"ARC","description":"The ARC statement enables you to name variables in the data set that you specify in the ARCDATA= option in the PROC MIRP statement. If you do not specify one of the following options to name a variable, PROC MIRP searches for that variable by its default names.","help":"ARC */options*;","arguments":[{"name":"NETWORKID=","placeholder":true,"description":"identifies a character variable in the ARCDATA= data set that specifies the network ID for each arc.","type":"value"},{"name":"PREDECESSOR=","placeholder":true,"description":"identifies a character variable in the ARCDATA= data set that specifies the SKU-location of the predecessor of each arc. If an arc links a SKU-location to an external supplier, specify PREDECESSOR=EXTERNAL. Note that EXTERNAL is a reserved word and can be used only in this situation.","type":"value"},{"name":"SUCCESSOR=","placeholder":true,"description":"identifies a character variable in the ARCDATA= data set that specifies the SKU-location of the successor of each arc.","type":"value"},{"name":"PIPELINECOST=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the ARCDATA= data set that specifies the unit cost per period of inventory in transit from the predecessor to the successor. Missing values of this variable are assumed to be equal to 0.","type":"value"},{"name":"QUANTITY=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the ARCDATA= data set that specifies the bill of material (BOM) quantity between the predecessor and the successor of each arc. It is the number of units at the predecessor required to produce one unit at the successor. Missing values of this variable are assumed to be equal to 1.","type":"value"}]},{"name":"DEMAND","description":"The DEMAND statement enables you to name variables in the data set that you specify in the DEMANDDATA= option in the PROC MIRP statement. If you do not specify one of the following options to name a variable, PROC MIRP searches for that variable by its default names.","help":"DEMAND */options*;","arguments":[{"name":"MEAN=","placeholder":true,"description":"identifies a numeric variable in the DEMANDDATA= data set that specifies the average of demand. When demand intervals are specified in the NODEDATA= data set, the mean and variance of positive demand should be provided in the DEMANDDATA= data set.","type":"value"},{"name":"NETWORKID=","placeholder":true,"description":"identifies a character variable in the DEMANDDATA= data set that specifies the network ID for each SKU-location.","type":"value"},{"name":"SKULOC=","placeholder":true,"description":"identifies a character variable in the DEMANDDATA= data set that specifies the ID for each SKU-location.","type":"value"},{"name":"VARIANCE=","placeholder":true,"description":"identifies a numeric variable in the DEMANDDATA= data set that specifies the variance of demand. The mean and variance of demand can both be zero. However, a zero mean and a positive variance are not allowed. When demand intervals are specified in the NODEDATA= data set, the mean and variance of positive demand should be provided in the DEMANDDATA= data set.","type":"value"},{"name":"PERIOD","optional":true,"placeholder":true,"description":"identifies a numeric variable in the DEMANDDATA= data set that specifies the time period of demand forecast. Valid values are positive integers (such as 1, 2, 3, ...).","type":"value"},{"name":"PERIODDESC","optional":true,"placeholder":true,"description":"identifies a numeric variable in the DEMANDDATA= data set that specifies the description of the time period of demand forecast as a SAS date.","type":"value"}]},{"name":"INVENTORY","description":"The INVENTORY statement enables you to name variables in the data set that you specify in the INVENTORY= option in the PROC MIRP statement. If you do not specify one of the following options to name a variable, PROC MIRP searches for that variable by its default names. The variables that are specified in the ORDERUPTOLEVEL= and REORDERLEVEL= options are not required when the value of the OBJECTIVE= option in the PROC MIRP statement is OPTPOLICY, POLICY_ORDER, POLICY_ORDER_KPI, or OPTIMIZATION. For all other values of the OBJECTIVE= option, these variables are required.","help":"INVENTORY */options*;","arguments":[{"name":"NETWORKID=","placeholder":true,"description":"identifies a character variable in the INVENTORYDATA= data set that specifies the network ID for each SKU-location.","type":"value"},{"name":"ORDERUPTOLEVEL=","placeholder":true,"description":"identifies a numeric variable in the INVENTORYDATA= data set that specifies the order-up-to level at a SKU-location for a period. This option is required when you specify one of the following values in the OBJECTIVE= option in the PROC MIRP statement: CREATEORDER, PREDICTKPI, or ORDER_KPI. Missing values of this variable are assumed to be equal to 0.","type":"value"},{"name":"REORDERLEVEL=","placeholder":true,"description":"identifies a numeric variable in the INVENTORYDATA= data set that specifies the reorder level at a SKU-location for a period. This option is required when you specify one of the following values in the OBJECTIVE= option in the PROC MIRP statement: CREATEORDER, PREDICTKPI, or ORDER_KPI. Missing values of this variable are assumed to be equal to 0.","type":"value"},{"name":"SKULOC=","placeholder":true,"description":"identifies a character variable in the INVENTORYDATA= data set that specifies the ID for each SKU-location. Copyright © SAS Institute Inc. All rights reserved.","type":"value"},{"name":"AMOUNT=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the INVENTORYDATA= data set that specifies the amount of inventory to arrive at a location for a period. The value of the variable can be negative at period 1 to represent initial backlog. Missing values of this variable are assumed to be equal to 0.","type":"value"},{"name":"ORDERFLAG=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the INVENTORYDATA= data set that specifies the order flag at a SKU-location for a period. If the variable is set to 1, a replenishment order can be placed at the SKU-location at a period. Otherwise, no orders can be placed. Missing values of this variable are not allowed. Not using the variable is equivalent to setting the variable to 1 at all SKU-locations for all periods.","type":"value"},{"name":"PERIDO=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the INVENTORYDATA= data set that specifies the arrival period of inventory at a SKU-location.","type":"value"}]},{"name":"NODE","description":"The NODE statement enables you to name variables in the data set that you specify in the NODEDATA= option in the PROC MIRP statement. If you do not specify one of the following options to name a variable, PROC MIRP searches for that variable by its default names.","help":"NODE */options*;","arguments":[{"name":"HOLDINGCOST=","placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the unit holding cost per period for each SKU-location. This variable is required.","type":"value"},{"name":"LEADTIME=","placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the expected lead time for each SKU-location. This variable is required, and all values of this variable must be nonnegative integers.","type":"value"},{"name":"NETWORKID=","placeholder":true,"description":"identifies a character variable that specifies the network ID for each SKU-location in the NODEDATA= data set. This variable enables you to compute policy parameters for multiple networks by issuing a single call to PROC MIRP, which is illustrated in the section Multiple Networks within a Single Call. This variable is required.","type":"value"},{"name":"SERVICELEVEL=","placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the service-level requirement for each SKU-location. This variable is required.","type":"value"},{"name":"SKULOC=","placeholder":true,"description":"identifies a character variable in the NODEDATA= data set that specifies the ID for each SKU-location. This variable is required.","type":"value"},{"name":"BATCHSIZE=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that contains the batch-size constraint on the size of orders that can be placed at each SKU-location. For example, if the batch size is 12, the order quantity must be an integer multiple of 12. The value of this variable must be 0 or positive. A value of 0 means that there is no batch-size constraint. Missing values of this variable are assumed to be equal to 0.","type":"value"},{"name":"CAPACITY=","optional":true,"placeholder":true,"description":"identifies a variable that specifies the inventory capacity at a particular SKU-location. If SYSTEM=PULL in the PROC MIRP statement, the variable that is specified in the CAPACITY= option is ignored; you can use the variables that are specified in the ORDERMAX=, ORDERMIN=, and BATCHSIZE= options to place bounds on the order size.","type":"value"},{"name":"DEMANDINTERVAL=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that contains the average number of periods between two positive demands. For example, the value of 2 means that the demand comes every two periods on average. This variable is used to model intermittent demand. When this variable is specified, the demand mean and variance in the DEMANDDATA= data set must be the mean and variance of positive demand that can occur in a period. The value of this variable must be 1 or greater. The value of 1 means that the demand mean and variance in the DEMANDDATA= data set are for the demand per period. Missing values of this variable are assumed to be equal to 1.","type":"value"},{"name":"DESCRIPTION=","optional":true,"placeholder":true,"description":"identifies a character variable in the NODEDATA= data set that contains the description for each SKU-location. If this variable is specified in the NODEDATA= data set, the information is stored in the DESCRIPTION variable in the output data set. Otherwise, the output data set does not contain the DESCRIPTION variable.","type":"value"},{"name":"FIXEDCOST=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that contains the fixed ordering cost for each SKU-location. The fixed ordering cost is charged when a replenishment order is placed. It is independent of the order amount. Missing values of this variable are assumed to be equal to 0.","help":"*FIXEDCOST=* ","type":"value"},{"name":"LEADTIMEMAX=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the maximum lead time for each SKU-location. All values of this variable must be nonnegative integers or missing values. Missing values are assumed to be equal to the expected lead time. If a maximum lead time variable is specified in the NODEDATA= data set, then a minimum lead time variable must also be specified by using the LEADTIMEMIN= option. For information about how PROC MIRP uses the minimum lead time and maximum lead time to determine the distribution of lead time, see the LEADTIME= option.","type":"value"},{"name":"LEADTIMEMIN=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the minimum lead time for each SKU-location. All values of this variable must be nonnegative integers or missing values. Missing values are assumed to be equal to the expected lead time. If a minimum lead time variable is specified in the NODEDATA= data set, then a maximum lead time variable must also be specified by using the LEADTIMEMAX= option. For information about how PROC MIRP uses the minimum lead time and maximum lead time to determine the distribution of lead time, see the LEADTIME= option.","type":"value"},{"name":"MPL=","optional":true,"placeholder":true,"description":"identifies a variable that specifies a lower bound on the order-up-to level determined during policy optimization for each SKU-location. This option is used only when the value of the OBJECTIVE= option in the PROC MIRP statement is OPTPOLICY, POLICY_ORDER, POLICY_ORDER_KPI, or OPTIMIZATION. Missing values of this variable are not allowed.","type":"value"},{"name":"NEXTREPLENISH=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies when the first replenishment order can be made for each SKU-location. For example, if the value of the variable is equal to 1, the first replenishment order can be placed in period 1. If the value of the variable is 4, no replenishment order can be placed until period 4. Missing values of this variable are assumed to be equal to 1.","type":"value"},{"name":"ORDERMAX=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the maximum amount of an order that can be placed at each SKU-location. Missing values of this variable are assumed to be the largest double that your operating system supports. If SYSTEM=PUSH in the PROC MIRP statement, the variable that is specified in the ORDERMAX= option is ignored; you can use the variable that is specified in the CAPACITY= option to place bounds on the order size.","type":"value"},{"name":"ORDERMIN=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the minimum amount of an order that can be placed at each SKU-location. Missing values of this variable are assumed to be equal to 0. If SYSTEM=PUSH in the PROC MIRP statement, the variable that is specified in the ORDERMIN= option is ignored; you can use the variable that is specified in the BATCHSIZE= option to place bounds on the order size..","help":"*ORDERMIN=* ","type":"value"},{"name":"PBR=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the number of periods between two replenishment orders for each SKU-location. Missing values of this variable are assumed to be equal to 1. When you specify this option and the variable specified by the POLICYTYPE= variable indicates the base-stock policy, replenishment orders can be placed only once every number of periods specified by the PBR= variable. For example, if the value of the PBR= variable is 4 and the value of the POLICYTYPE= variable is BS to indicate the base-stock policy, then replenishment orders can be placed only once every four periods. When you specify this option and the variable specified by the POLICYTYPE= variable indicates the min-max policy, replenishment orders can be placed in any period. However, the policy parameters are computed such that on average the number of periods between two replenishment orders is not less than the value of the PBR= variable.","type":"value"},{"name":"POLICYTYPE=","optional":true,"placeholder":true,"description":"identifies a character variable in the NODEDATA= data set that specifies the policy type to be used at each SKU-location. The procedure supports two policy types: BS (base-stock policy) and SS (min-max policy). Missing values of this variable are assumed to be BS. The base-stock policy is also called one-to-one replenishment policy, because the order-up-to level is equal to the reorder level plus 1. This policy is recommended when the fixed ordering cost is insignificant compared to the inventory holding cost. The min-max policy is recommended when the fixed ordering cost is significantly higher than the inventory holding cost. In this case, a large amount of inventory should be ordered so that replenishment is less frequent. The order-up-to level in this policy is greater than the reorder level by at least 1. When the difference is exactly 1, this policy is reduced to the base-stock policy.","help":"*POLICYTYPE=* ","type":"value"},{"name":"SERVICETYPE=","optional":true,"placeholder":true,"description":"identifies a numeric variable in the NODEDATA= data set that specifies the type of service level used for each SKU-location. The procedure supports three service types: RR (ready rate), FR (fill rate), and BR (back-order ratio). Missing values of this variable are assumed to be RR. The ready rate is also called the non-stockout probability. It is the probability of not running out of stock (that is, having positive on-hand inventory) at the end of a period. A historical ready rate can be measured as the ratio between the number of periods that have positive on-hand inventory and the total number of periods under consideration. The fill rate is the percentage of demand that is satisfied immediately by on-hand inventory. The back-order ratio is the ratio between the average backlog at the end of a period and the average demand during the period.","type":"value"}]}],"supportSiteInformation":{"docsetId":"irpug","docsetVersion":"1.0","docsetTargetFile":"irpug_mirp_toc.htm"}}