{"name":"MIXED","statements":[{"name":"PROC MIXED","description":"The MIXED procedure fits a variety of mixed linear models to data and enables you to use these fitted models to make statistical inferences about the data. A mixed linear model is a generalization of the standard linear model used in the GLM procedure, the generalization being that the data are permitted to exhibit correlation and nonconstant variability. The mixed linear model, therefore, provides you with the flexibility of modeling not only the means of your data (as in the standard linear model) but their variances and covariances as well. † The primary assumptions underlying the analyses performed by PROC MIXED are as follows: † o The data are normally distributed (Gaussian). † o The means (expected values) of the data are linear in terms of a certain set of parameters. † o The variances and covariances of the data are in terms of a different set of parameters, and they exhibit a structure matching one of those available in PROC MIXED.","help":"PROC MIXED <ABSOLUTE> <ALPHA=number> <ANOVAF> <ASYCORR> ASYCOV <CL<=WALD>> <CONVF<=number>> <CONVG<=number>> <CONVH<=number>> <COVTEST> <DATA=SAS-data-set> <DFBW> <EMPIRICAL> <IC> <INFO> <ITDETAILS> <LOGNOTE> <MAXFUNC=number> <MAXITER=number> <METHOD=REML | ML | MIVQUE0... > <MMEQ> <MMEQSOL> <NAMELEN<=number>> <NOBOUND> <NOCLPRINT<=number>> <NOINFO> <NOITPRINT> <NOPROFILE> <ORD> <ORDER=DATA | FORMATTED | FREQ... > <PLOTS=ALL | BOXPLOT | DISTANCE... > <RANKS> <RATIO> <RIDGE=number> <SCORING<=number>>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <REF=<FIRST | LAST>> <TRUNCATE> ; \n   \n\tCODE <CATALOG=library.catalog.entry.type> <DUMMIES> <NODUMMIES> ...; \n   \n\tCONTRAST <CHISQ> <DF=number> <E> ...; \n   \n\tESTIMATE <ALPHA=number> <CL> <DF=number> ...; \n   \n\tID variables ;     \n\tLSMEANS <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | SCHEFFE>... > <ALPHA=number> ...; \n   \n\tLSMESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tMODEL <ALPHA=number> <ALPHAP=number> <CHISQ> ...; \n   \n\tPARMS <HOLD=value-list> <LOGDETH> <LOWERB=value-list> ...; \n   \n\tPRIOR DATA= FLAT JEFFREYS ...;     \n\tRANDOM <ALPHA=number> <CL> <G> ...; \n   \n\tREPEATED <GROUP=effect> <HLM> <HLPS> ...; \n   \n\tSLICE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tSTORE <LABEL='label'> <OUT=>item-store-name ;     \n\tWEIGHT variable; ","arguments":[{"name":"ASYCOV","description":"Requests that the asymptotic covariance matrix of the covariance parameters be displayed.","type":"standalone"},{"name":"ABSOLUTE","optional":true,"description":"Makes the convergence criterion absolute.","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Requests that confidence limits be constructed for the covariance parameter estimates with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"ANOVAF","optional":true,"description":"The ANOVAF option computes F tests in models with REPEATED statement and without RANDOM statement by a method similar to that of Brunner, Domhof, and Langer (2002).","type":"standalone"},{"name":"ASYCORR","optional":true,"description":"Produces the asymptotic correlation matrix of the covariance parameter estimates.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests confidence limits for the covariance parameter estimates. The optional =WALD specification requests Wald limits for all parameters.","type":"standalone"},{"name":"CONVF","optional":true,"description":"Requests the relative function convergence criterion with tolerance number.","type":"standalone"},{"name":"CONVG","optional":true,"description":"Requests the relative gradient convergence criterion with tolerance number.","type":"standalone"},{"name":"CONVH","optional":true,"description":"Requests the relative Hessian convergence criterion with tolerance number.","type":"standalone"},{"name":"COVTEST","optional":true,"description":"Produces asymptotic standard errors and Wald -tests for the covariance parameter estimates.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be used by PROC MIXED. The default is the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DFBW","optional":true,"description":"Has the same effect as the DDFM=BW option in the MODEL statement.","type":"standalone"},{"name":"EMPIRICAL","optional":true,"description":"Computes the estimated variance-covariance matrix of the fixed-effects parameters by using the asymptotically consistent estimator.","type":"standalone"},{"name":"IC","optional":true,"description":"Displays a table of various information criteria.","type":"standalone"},{"name":"INFO","optional":true,"description":"Is a default option. The creation of the \"Model Information,\" \"Dimensions,\" and \"Number of Observations\" tables can be suppressed by using the NOINFO option.","type":"standalone"},{"name":"ITDETAILS","optional":true,"description":"Displays the parameter values at each iteration and enables the writing of notes to the SAS log pertaining to \"infinite likelihood\" and \"singularities\" during Newton-Raphson iterations.","type":"standalone"},{"name":"LOGNOTE","optional":true,"aliases":["UPDATE"],"description":"Writes periodic notes to the log describing the current status of computations. It is designed for use with analyses requiring extensive CPU resources.","type":"standalone"},{"name":"MAXFUNC=","optional":true,"description":"Specifies the maximum number of likelihood evaluations in the optimization process. The default is 150.","type":"value"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations. The default is 50.","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the estimation method for the covariance parameters.","help":"METHOD=REML | ML | MIVQUE0 | TYPE1 | TYPE2 | TYPE3","type":"choice","arguments":[{"name":"REML","description":"Performs residual (restricted) maximum likelihood, and it is the default method.","type":"standalone"},{"name":"ML","description":"Performs maximum likelihood","type":"standalone"},{"name":"MIVQUE0","description":"Performs minimum variance quadratic unbiased estimation of the covariance parameters.","type":"standalone"},{"name":"TYPE1","description":"The METHOD=TYPE specifications apply only to variance component models with no SUBJECT= effects and no REPEATED statement.","type":"standalone"},{"name":"TYPE2","description":"The METHOD=TYPE specifications apply only to variance component models with no SUBJECT= effects and no REPEATED statement.","type":"standalone"},{"name":"TYPE3","description":"The METHOD=TYPE specifications apply only to variance component models with no SUBJECT= effects and no REPEATED statement.","type":"standalone"}]},{"name":"MMEQ","optional":true,"description":"Requests that coefficients of the mixed model equations be displayed.","type":"standalone"},{"name":"MMEQSOL","optional":true,"description":"Requests that a solution to the mixed model equations be produced, in addition to the inverted coefficients matrix.","type":"standalone"},{"name":"NAMELEN","optional":true,"description":"Specifies the length to which long effect names are shortened. The default and minimum value is 20.","type":"standalone"},{"name":"NOBOUND","optional":true,"description":"Has the same effect as the NOBOUND option in the PARMS statement.","type":"standalone"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the \"Class Level Information\" table if you do not specify number. If you do specify number, only levels with totals that are less than number are listed in the table.","type":"standalone"},{"name":"NOINFO","optional":true,"description":"Suppresses the display of the \"Model Information,\" \"Dimensions,\" and \"Number of Observations\" tables.","type":"standalone"},{"name":"NOITPRINT","optional":true,"description":"Suppresses the display of the \"Iteration History\" table.","type":"standalone"},{"name":"NOPROFILE","optional":true,"aliases":["SIGITER"],"description":"Includes the residual variance as part of the Newton-Raphson iterations. This option applies only to models that have a residual variance parameter. By default, this parameter is profiled out of the likelihood calculations, except when you have specified the HOLD= option in the PARMS statement.","type":"standalone"},{"name":"ORD","optional":true,"description":"Displays ordinates of the relevant distribution in addition to p-values. The ordinate can be viewed as an approximate odds ratio of hypothesis probabilities.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the sorting order for the levels of all CLASS variables.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]},{"name":"PLOTS=","optional":true,"description":"Requests that the MIXED procedure produce statistical graphics via the Output Delivery System. Syntax: (1) PLOTS <(global-plot-options )> <=plot-request <(options )>> (2) PLOTS <(global-plot-options )> <= (plot-request<(options)> <...plot-request<(options)> >)> The global-plot-options supported by the MIXED procedure follow. OBSNO uses the data set observation number to identify observations in tooltips, provided that the observation number can be determined. ONLY suppresses the default plots. Only the plots specifically requested are produced.","help":"PLOTS=ALL | BOXPLOT | DISTANCE | INFLUENCEESTPLOT | INFLUENCESTATPANEL | RESIDUALPANEL | STUDENTPANEL | PEARSONPANEL | PRESS | VCIRYPANEL | NONE","type":"choice","arguments":[{"name":"ALL","description":"Requests that all plots appropriate for the particular analysis be produced.","type":"standalone"},{"name":"BOXPLOT","description":"Requests box plots for the effects in your model that consist of classification effects only. Syntax: BOXPLOT<(boxplot-options)> The available boxplot-options are as follows: CONDITIONAL BLUP constructs box plots from conditional residuals—that is, residuals using the estimated BLUPs of random effects. FIXED produces box plots for all fixed effects (MODEL statement) consisting entirely of classification variables GROUP produces box plots for all GROUP= effects (RANDOM and REPEATED statement) consisting entirely of classification variables MARGINAL NOBLUP constructs box plots from marginal residuals. NPANEL=number provides the ability to break a box plot into multiple graphics. OBSERVED adds box plots of the observed data for the selected effects. RANDOM produces box plots for all random effects (RANDOM statement) consisting entirely of classification variables. REPEATED produces box plots for the repeated effects (REPEATED statement). STUDENT constructs box plots from studentized residuals rather than from raw residuals. SUBJECT produces box plots for all SUBJECT= effects (RANDOM and REPEATED statement) consisting entirely of classification variables. USEINDEX uses as the horizontal axis label the index of the effect level rather than the formatted value(s).","type":"standalone"},{"name":"DISTANCE","description":"Requests a plot of the likelihood or restricted likelihood distance. Syntax: DISTANCE<(USEINDEX)> When influence diagnostics are requested with set selection according to an effect, the USEINDEX option enables you to replace the formatted tick values on the horizontal axis with integer indices of the effect levels in order to reduce the space taken up by the horizontal plot axis.","type":"standalone"},{"name":"INFLUENCEESTPLOT","description":"Syntax: INFLUENCEESTPLOT<(options)> Requests panels of the deletiob estimates in an influence analysis, provided that the INFLUENCE option is specified in the MODEL statement. The FIXED and RANDOM options enable you to select these specific panels. The UNPACK option produces separate plots for each of the parameter estimates. The USEINDEX option replaces formatted tick values for the horizontal axis with integer indices.","type":"standalone"},{"name":"INFLUENCESTATPANEL","description":"Syntax: INFLUENCESTATPANEL<(options)> Requests panels of influence statistics. UNPACK option produces separate plots from the elements in the panel. The USEINDEX option replaces formatted tick values for the horizontal axis with integer indices.","type":"standalone"},{"name":"RESIDUALPANEL","description":"Syntax: RESIDUALPANEL<(residualplot-options)> Requests a panel of raw residuals. The residualplot-options determine both the composition of the panels and the type of residuals being plotted. BOX | BOXPLOT replaces the inset of summary statistics in the lower-right corner of the panel with a box plot of the residual. CONDITIONAL BLUP constructs plots from conditional residuals. MARGINAL NOBLUP constructs plots from marginal residuals. UNPACK produces separate plots from the elements of the panel. The inset statistics are not part of the unpack operation.","type":"standalone"},{"name":"STUDENTPANEL","description":"Syntax: STUDENTPANEL<(residualplot-options)> Requests a panel of studentized residuals. The residualplot-options determine both the composition of the panels and the type of residuals being plotted. BOX | BOXPLOT replaces the inset of summary statistics in the lower-right corner of the panel with a box plot of the residual. CONDITIONAL BLUP constructs plots from conditional residuals. MARGINAL NOBLUP constructs plots from marginal residuals. UNPACK produces separate plots from the elements of the panel. The inset statistics are not part of the unpack operation.","type":"standalone"},{"name":"PEARSONPANEL","description":"Syntax: PEARSONPANEL<(residualplot-options)> Requests a panel of Pearson residuals. The residualplot-options determine both the composition of the panels and the type of residuals being plotted. BOX | BOXPLOT replaces the inset of summary statistics in the lower-right corner of the panel with a box plot of the residual. CONDITIONAL BLUP constructs plots from conditional residuals. MARGINAL NOBLUP constructs plots from marginal residuals. UNPACK produces separate plots from the elements of the panel. The inset statistics are not part of the unpack operation.","type":"standalone"},{"name":"PRESS","description":"Syntax: PRESS<(USEINDEX)> Requests a plot of PRESS residuals or PRESS statistics. These are based on \"leave-one-out\" or \"leave-set-out\" prediction of the marginal mean. When influence diagnostics are requested with set selection according to an effect, the USEINDEX option enables you to replace the formatted tick values on the horizontal axis with integer indices of the effect levels in order to reduce the space taken up by the horizontal plot axis.","type":"standalone"},{"name":"VCIRYPANEL","description":"Syntax: VCIRYPANEL<(residualplot-options)> Requests a panel of residual graphics based on the scaled residuals. The residualplot-options determine both the composition of the panels and the type of residuals being plotted. BOX | BOXPLOT replaces the inset of summary statistics in the lower-right corner of the panel with a box plot of the residual. CONDITIONAL BLUP constructs plots from conditional residuals. MARGINAL NOBLUP constructs plots from marginal residuals. UNPACK produces separate plots from the elements of the panel. The inset statistics are not part of the unpack operation.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"}]},{"name":"RANKS","optional":true,"description":"Displays the ranks of design matrices X and (XZ).","type":"standalone"},{"name":"RATIO","optional":true,"description":"Produces the ratio of the covariance parameter estimates to the estimate of the residual variance when the latter exists in the model.","type":"standalone"},{"name":"RIDGE=","optional":true,"description":"Specifies the starting value for the minimum ridge value used in the Newton-Raphson algorithm. The default is 0.3125.","help":"RIDGE=*number*","type":"value"},{"name":"SCORING","optional":true,"description":"Requests that Fisher scoring be used in association with the estimation method up to iteration number, which is 0 by default.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC MIXED to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: o Sort the data by using the SORT procedure with a similar BY statement. o Specify the NOTSORTED or DESCENDING option in the BY statement for the MIXED procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. o Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. Typical classification variables are Treatment, Sex, Race, Group, and Replication. If you use the CLASS statement, it must appear before the MODEL statement.","help":"CLASS &lt;REF=&lt;FIRST | LAST&gt;&gt; &lt;TRUNCATE&gt; ","arguments":[{"name":"REF=","optional":true,"followsDelimiter":"/","description":"Specifies a level of all classification variables to be put at the end of the list of levels. This level thus corresponds to the reference level in the usual interpretation of the estimates with PROC MIXED's singular parameterization. To specify different reference levels for different classification variables, use REF= options for individual variables.","help":"REF=FIRST | LAST","type":"choice","arguments":[{"name":"FIRST","followsDelimiter":"/","description":"Specify REF=FIRST to designate that the first ordered level for each classification variable serve as the reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Specify REF=LAST to designate that the last ordered level serve as the reference. This option applies to all the variables specified in the CLASS statement.","type":"standalone"}]},{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined by using no more than the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"CODE","description":"The CODE statement writes SAS DATA step code for computing predicted values of the fitted model either to a file or to a catalog entry. This code can then be included in a DATA step to score new data.","help":"CODE &lt;CATALOG=library.catalog.entry.type&gt; &lt;DUMMIES&gt; &lt;NODUMMIES&gt; ...","arguments":[{"name":"CATALOG=","optional":true,"aliases":["CAT="],"description":"Syntax: CATALOG=library.catalog.entry.type CAT=library.catalog.entry.type","type":"value"},{"name":"DUMMIES","optional":true,"description":"Specifies to keep dummy variables that represent the CLASS levels in the data set.","type":"standalone"},{"name":"ERROR","optional":true,"description":"Specifies to generate code to compute the error function.","type":"standalone"},{"name":"FILE=","optional":true,"description":"Names the external file that saves the generated code. When enclosed in a quoted string (for example, FILE=\"c:$\\backslash $mydir$\\backslash $scorecode.sas\"), this option specifies the path for writing the code to an external file. You can also specify unquoted SAS filenames of no more than eight characters for filename. If the filename is assigned as a fileref in a Base SAS FILENAME statement, the file specified in the FILENAME statement is opened. The special filerefs LOG and PRINT are always assigned. If the specified filename is not an assigned fileref, the specified value for filename is concatenated with a .txt extension before the file is opened. For example, if FOO is not an assigned fileref, FILE=FOO causes FOO.txt to be opened. If filename has more than eight characters, an error message is printed.","help":"FILE=*filename*","type":"value"},{"name":"FORMAT=","optional":true,"description":"Specifies the format for the regression coefficients and other numerical values that do not have a format from the input data set. The default format is BEST20.","help":"FORMAT=*format*","type":"value"},{"name":"GROUP=","optional":true,"description":"Specifies the group identifier for group processing. The group-name should be a valid SAS name of no more than 16 characters. It is used to construct array names and statement labels in the generated code.","help":"GROUP=*group-name*","type":"value"},{"name":"IMPUTE","optional":true,"description":"Imputes the predicted values according to an intercept-only model for observations with missing or invalid covariate values. For a continuous response, the predicted value is the mean of the response variable; for a categorical response, the predicted values are the proportions of the response categories. When the IMPUTE option is specified, the scoring code also creates a variable named _WARN_ that contains one or more single-character codes that indicate problems in computing predicted values. The character codes used in _WARN_ go in the following positions:","type":"standalone"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the line size for the generated code. The default is 78. The permissible range is 78 to 254.","type":"value"},{"name":"LOOKUP=","optional":true,"description":"Specifies the algorithm for looking up CLASS levels.","help":"LOOKUP=AUTO | BINARY | LINEAR | SELECT*lookup-method*","type":"value","arguments":[{"name":"AUTO","description":"Selects the LINEAR algorithm if a CLASS variable has fewer than five categories; otherwise, the BINARY algorithm is used. This is the default.","type":"standalone"},{"name":"BINARY","description":"Uses a binary search. This method is fast, but might produce incorrect results and the normalized category values might contain characters that collate in different orders in ASCII and EBCDIC, if you generate the code on an ASCII machine and execute the code on an EBCDIC machine or vice versa.","type":"standalone"},{"name":"LINEAR","description":"Uses a linear search with IF statements that have categories in the order of the class levels. This method is slow if there are many categories.","type":"standalone"},{"name":"SELECT","description":"Uses a SELECT statement.","type":"standalone"}]},{"name":"NODUMMIES","optional":true,"description":"Specifies that dummy variables not be retained. This is the default.","type":"standalone"},{"name":"NOERROR","optional":true,"description":"Specifies that the error function not be generated. This is the default.","type":"standalone"},{"name":"NORESIDUAL","optional":true,"description":"Specifies that the code for residuals not be generated. This is the default.","type":"standalone"},{"name":"RESIDUAL","optional":true,"description":"Specifies to generate code to compute residual values. If you request code for residuals and then score a data set that does not contain target values, the residuals will have missing values.","type":"standalone"}]},{"name":"CONTRAST","description":"The CONTRAST statement provides a mechanism for obtaining custom hypothesis tests. It is patterned after the CONTRAST statement in PROC GLM, although it has been extended to include random effects. This enables you to select an appropriate inference space (McLean, Sanders, and Stroup 1991). The CONTRAST statement has the following arguments: label identifies the contrast in the table. A label is required for every contrast specified. Labels can be up to 200 characters and must be enclosed in quotes. fixed-effect identifies an effect that appears in the MODEL statement. The keyword INTERCEPT can be used as an effect when an intercept is fitted in the model. You do not need to include all effects that are in the MODEL statement. random-effect identifies an effect that appears in the RANDOM statement. The first random effect must follow a vertical bar (|); however, random effects do not have to be specified. values are constants that are elements of the L matrix associated with the fixed and random effects.","help":"CONTRAST &lt;CHISQ&gt; &lt;DF=number&gt; &lt;E&gt; ...","arguments":[{"name":"CHISQ","optional":true,"followsDelimiter":"/","description":"Requests that chi-square tests be performed for all contrasts in addition to any F tests.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the denominator degrees of freedom for the F test.","help":"DF=*number*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the contrast be displayed.","type":"standalone"},{"name":"GROUP","optional":true,"followsDelimiter":"/","aliases":["GRP"],"description":"Sets up random-effect contrasts between different groups when a GROUP= variable appears in the RANDOM statement.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"},{"name":"SUBJECT","optional":true,"followsDelimiter":"/","aliases":["SUB"],"description":"Sets up random-effect contrasts between different subjects when a SUBJECT= variable appears in the RANDOM statement.","type":"standalone"}]},{"name":"ESTIMATE","description":"The ESTIMATE statement is exactly like a CONTRAST statement, except only one-row L matrices are permitted.","help":"ESTIMATE &lt;ALPHA=number&gt; &lt;CL&gt; &lt;DF=number&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"followsDelimiter":"/","description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients be displayed.","type":"standalone"},{"name":"GROUP","optional":true,"followsDelimiter":"/","aliases":["GRP"],"description":"Sets up random-effect contrasts between different groups when a GROUP= variable appears in the RANDOM statement.","type":"standalone"},{"name":"LOWER","optional":true,"followsDelimiter":"/","aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking as documented for the CONTRAST statement.","help":"SINGULAR=*number*","type":"value"},{"name":"SUBJECT","optional":true,"followsDelimiter":"/","aliases":["SUB"],"description":"Sets up random-effect contrasts between different subjects when a SUBJECT= variable appears in the RANDOM statement.","type":"standalone"},{"name":"UPPER","optional":true,"followsDelimiter":"/","aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the t statistic.","type":"standalone"}]},{"name":"ID","description":"The ID statement specifies which variables from the input data set are to be included in the OUTP= and OUTPM= data sets from the MODEL statement.","help":"ID variables "},{"name":"LSMEANS","description":"The LSMEANS statement computes least squares means (LS-means) of fixed effects. As in the GLM procedure, LS-means are predicted population margins—that is, they estimate the marginal means over a balanced population. In a sense, LS-means are to unbalanced designs as class and subclass arithmetic means are to balanced designs. The L matrix constructed to compute them is the same as the L matrix formed in PROC GLM; however, the standard errors are adjusted for the covariance parameters in the model.","help":"LSMEANS &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | SCHEFFE&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the final effect listed in the ESTIMATE statement from the 'Type III Tests of Fixed Effects' table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates.","help":"ADJUST=BON | DUNNETT | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. CVADJUST specifies that the quantile should be estimated by the control variate adjustment method of Hsu and Nelson (1998) instead of simply as the quantile of the simulated sample. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. NSAMP=n specifies the sample size for the simulation. REPORT specifies that a report on the simulation should be displayed, including a listing of the parameters, such as γ, ε, and α, as well as an analysis of various methods for estimating or approximating the quantile. SEED=number specifies an integer used to start the pseudo-random number generator for the simulation.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC MIXED uses the approximation described in Kramer (1956) and identifies the adjustment as 'Tukey-Kramer' in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level 1 - number. The value of number must be between 0 and 1; the default value is 0.05, corresponding to a 95% confidence interval.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Enables you to modify the values of the covariates used in computing LS-means.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the LSMEANS effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the LS-means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the LS-means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences, and it is the default.","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified LSMEANS effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for all LSMEANS effects be displayed.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients.","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"},{"name":"SLICE=","optional":true,"followsDelimiter":"/","description":"Specifies effects by which to partition interaction LSMEANS effects. This can produce what are known as tests of simple effects (Winer 1971). For example, suppose that A*B is significant, and you want to test the effect of A for each level of B. The appropriate LSMEANS statement is as follows: lsmeans A*B / slice=B; This code tests for the simple main effects of A for B, which are calculated by extracting the appropriate rows from the coefficient matrix for the A*B LS-means and by using them to form an F test.","type":"value"}]},{"name":"LSMESTIMATE","description":"The LSMESTIMATE statement provides a mechanism for obtaining custom hypothesis tests among least squares means.","help":"LSMESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt; ...&gt; &lt;ALPHA=number&gt;  ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the LS-mean estimates. The adjusted quantities are produced in addition to the unadjusted p-values and confidence limits. Adjusted confidence limits are produced if the CL or ALPHA= option is in effect.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE | T","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"T","followsDelimiter":"/","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that the procedure compute separate margins for each level of the LSMEANS effect.","type":"standalone"},{"name":"CATEGORY=","optional":true,"followsDelimiter":"/","description":"Specifies how to construct estimates and multiplicity corrections for models with multinomial data (ordinal or nominal). This option is also important for constructing sets of estimable functions for F tests with the JOINT option.","help":"CATEGORY=JOINT | SEPARATE | &lt;*quoted-value-list*&gt;","type":"choice","arguments":[{"name":"JOINT","followsDelimiter":"/","description":"Computes the estimable functions for every nonredundant category and treats them as a set. For example, a three-row LSESTIMATE statement in a model with three response categories leads to six estimable functions.","type":"standalone"},{"name":"SEPARATE","followsDelimiter":"/","description":"Computes the estimable functions for every nonredundant category in turn. For example, a three-row LSESTIMATE statement in a model with three response categories leads to two sets of three estimable functions.","type":"standalone"},{"name":"quoted-value-list","placeholder":true,"followsDelimiter":"/","description":"Computes the estimable functions only for the list of values given. The list must consist of formatted values of the response categories.","type":"value"}]},{"name":"CHISQ","optional":true,"followsDelimiter":"/","description":"Requests that chi-square tests be performed in addition to F tests, when you request an F test with the JOINT option. This option has no effect in procedures that produce chi-square statistics by default.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"followsDelimiter":"/","description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators. If you do not specify value-list, a default value of 1.0 is assumed. Missing values in the value-list are converted to 1.0.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L coefficients of the estimable function be displayed.","type":"standalone"},{"name":"ELSM","optional":true,"followsDelimiter":"/","description":"Requests that the K matrix coefficients be displayed. These are the coefficients that apply to the LS-means. This option is useful to ensure that you assigned the coefficients correctly to the LS-means.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the least squares means estimate. When you model data with the logit link function and the estimate represents a log odds ratio, the EXP option produces an odds ratio. If you specify the CL or ALPHA= option, the (adjusted) confidence limits for the estimate are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"JOINT=","optional":true,"followsDelimiter":"/","description":"Requests that a joint F or chi-square test be produced for the rows of the estimate. You can specify the following joint-test-options in parentheses: ACC=γ specifies the accuracy radius for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of γ must be strictly between 0 and 1; the default value is 0.005. EPS=є specifies the accuracy confidence level for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of є must be strictly between 0 and 1; the default value is 0.01. LABEL='label' assigns an identifying label to the joint test. If you do not specify a label, the first non-default label for the ESTIMATE rows is used to label the joint test. NOEST | ONLY performs only the F or chi-square test and suppresses other results from the ESTIMATE statement. This option is useful for emulating the CONTRAST statement that is available in other procedures. NSAMP=n specifies the number of samples for the simulation-based method of Silvapulle and Sen (2004). CHISQ -- adds a chi-square test if the procedure produces an F test by default.","help":"JOINT=ACC= | EPS= | LABEL= | NOEST | ONLY | NSAMP= | CHISQ | BOUNDS=","type":"choice","arguments":[{"name":"ACC=","type":"value"},{"name":"EPS=","type":"value"},{"name":"LABEL=","type":"value"},{"name":"NOEST","type":"standalone"},{"name":"ONLY","type":"standalone"},{"name":"NSAMP=","type":"value"},{"name":"CHISQ","type":"standalone"},{"name":"BOUNDS=","type":"value"}]},{"name":"LOWER","optional":true,"followsDelimiter":"/","aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic. A two-tailed test is the default. A lower-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"},{"name":"OBSMARGINS","optional":true,"followsDelimiter":"/","aliases":["OM"],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins observed in OM-data-set.","type":"standalone"},{"name":"PLOTS=","optional":true,"followsDelimiter":"/","description":"Produces ODS statistical graphics of the distribution of estimable functions if the procedure performs the analysis in a sampling-based mode.","help":"PLOTS=ALL | BOXPLOT | DISTPLOT | NONE*plot-options*","type":"value","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function's distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function's distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the LSMESTIMATE statement (for example, chi-bar-square statistics and simulated p-values). The value of number must be an integer. The seed is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock. Note that there could be multiple LSMESTIMATE statements with SEED= specifications and there could be other statements that can supply a random number seed. Since the procedure has only one random number stream, the initial seed is shown in the SAS log.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking as documented for the ESTIMATE statement.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion. Step-down methods increase the power of multiple testing procedures by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down-options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60. ORDER=PVALUE ORDER=ROWS specifies the order in which the step-down tests are performed. ORDER=PVALUE is the default, with LS-mean estimates being declared significant only if all LS-mean estimates with smaller (unadjusted) p-values are significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified. REPORT specifies that a report on the step-down adjustment be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | ORDER= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"ORDER=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]},{"name":"TESTVALUE=","optional":true,"followsDelimiter":"/","aliases":["TESTMEAN="],"description":"Specifies the value under the null hypothesis for testing the estimable functions in the LSMESTIMATE statement. The rules for specifying the value-list are very similar to those for specifying the divisor list in the DIVISOR= option. If no TESTVALUE= is specified, all tests are performed as H: Lβ=0. Missing values in the value-list also are translated to zeros. If you specify fewer values than rows in the ESTIMATE statement, the last value in value-list is carried forward. The TESTVALUE= option affects only p-values from individual, joint, and multiplicity-adjusted tests. It does not affect confidence intervals.","help":"TESTVALUE=*value-list*","type":"value"},{"name":"UPPER","optional":true,"followsDelimiter":"/","aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic. A two-tailed test is the default. An upper-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"}]},{"name":"MODEL","description":"The MODEL statement names a single dependent variable and the fixed effects, which determine the X matrix of the mixed model. The specification of effects is the same as in the GLM procedure; however, unlike PROC GLM, you do not specify random effects in the MODEL statement. The MODEL statement is required. An intercept is included in the fixed-effects model by default. If no fixed effects are specified, only this intercept term is fit. The intercept can be removed by using the NOINT option.","help":"MODEL &lt;ALPHA=number&gt; &lt;ALPHAP=number&gt; &lt;CHISQ&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the fixed-effects parameters with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"ALPHAP=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for the predicted values with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHAP=*number*","type":"value"},{"name":"CHISQ","optional":true,"followsDelimiter":"/","description":"Requests that chi-square tests be performed for all specified effects in addition to the F tests. Type 3 tests are the default; you can produce the Type 1 and Type 2 tests by using the HTYPE= option.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the fixed-effects parameter estimates. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CONTAIN","optional":true,"followsDelimiter":"/","description":"Has the same effect as the DDFM=CONTAIN option.","type":"standalone"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Produces the correlation matrix from the approximate covariance matrix of the fixed-effects parameter estimates.","type":"standalone"},{"name":"COVBI","optional":true,"followsDelimiter":"/","aliases":["XPVIX"],"description":"Produces the inverse of the approximate covariance matrix of the fixed-effects parameter estimates.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","aliases":["XPVIXI"],"description":"Produces the approximate variance-covariance matrix of the fixed-effects parameter estimates, β-hat.","type":"standalone"},{"name":"DDF=","optional":true,"followsDelimiter":"/","description":"Enables you to specify your own denominator degrees of freedom for the fixed effects.","help":"DDF=*value-list*","type":"value"},{"name":"DDFM=","optional":true,"followsDelimiter":"/","description":"Specifies the method for computing the denominator degrees of freedom for the tests of fixed effects resulting from the MODEL, CONTRAST, ESTIMATE, LSMEANS, and LSMESTIMATE statements.","help":"DDFM=BETWITHIN | CONTAIN | KENWARDROGER | KENWARDROGER2 | RESIDUAL | SATTERTHWAITE","type":"choice","arguments":[{"name":"BETWITHIN","followsDelimiter":"/","description":"Divides the residual degrees of freedom into between-subject and within-subject portions.","type":"standalone"},{"name":"CONTAIN","followsDelimiter":"/","description":"Invokes the containment method to compute denominator degrees of freedom, and this method is the default when the model contains G-side random effects.","type":"standalone"},{"name":"KENWARDROGER","followsDelimiter":"/","description":"Syntax: KENWARDROGER<(FIRSTORDER)> DDFM=KENWARDROGER<(LINEAR)> The LINEAR suboption is an alias for FIRSTORDER. Applies the (prediction) standard error and degrees-of-freedom correction detailed by Kenward and Roger (1997). The FIRSTORDER suboption eliminates the second derivatives from the calculation of the covariance matrix adjustment.","type":"standalone"},{"name":"KENWARDROGER2","followsDelimiter":"/","description":"Performs all tests by using the residual degrees of freedom, n-rank(X), where n is the sum of the frequencies used.","type":"standalone"},{"name":"RESIDUAL","followsDelimiter":"/","description":"Performs a general Satterthwaite approximation for the denominator degrees of freedom in a generalized linear mixed model.","type":"standalone"},{"name":"SATTERTHWAITE","followsDelimiter":"/","description":"Specifies an improved approximation of the DDFM=KENWARDROGER method that uses a less biased precision estimator, as proposed by Kenward and Roger (2009).","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that Type I, Type II, and Type III L matrix coefficients be displayed for all specified effects. For ODS purposes, the name of the table is \"Coef\".","type":"standalone"},{"name":"E1","optional":true,"followsDelimiter":"/","description":"Requests that Type I L matrix coefficients be displayed for all specified effects. For ODS purposes, the name of the table is \"Coef\".","type":"standalone"},{"name":"E2","optional":true,"followsDelimiter":"/","description":"Requests that Type II L matrix coefficients be displayed for all specified effects. For ODS purposes, the name of the table is \"Coef\".","type":"standalone"},{"name":"E3","optional":true,"followsDelimiter":"/","description":"Requests that Type III L matrix coefficients be displayed for all specified effects. For ODS purposes, the name of the table is \"Coef\".","type":"standalone"},{"name":"FULLX","optional":true,"followsDelimiter":"/","description":"Requests that columns of the X matrix that consist entirely of zeros not be eliminated from X; otherwise, they are eliminated by default.","type":"standalone"},{"name":"HTYPE=","optional":true,"followsDelimiter":"/","description":"Indicates the type of hypothesis test to perform on the fixed effects. Valid entries for value are 1, 2, and 3; the default value is 3. You can specify several types by separating the values with a comma or a space. The ODS table names are \"Tests1\" for the Type 1 tests, \"Tests2\" for the Type 2 tests, and \"Tests3\" for the Type 3 tests.","help":"HTYPE=*value-list*","type":"value"},{"name":"INFLUENCE=","optional":true,"followsDelimiter":"/","description":"You can specify the following influence-options in parentheses: EFFECT=effect specifies an effect according to which observations are grouped. ESTIMATES | EST specifies that the updated parameter estimates should be written to the ODS output data set. ITER=n controls the maximum number of additional iterations PROC MIXED performs to update the fixed-effects and covariance parameter estimates following data point removal. KEEP=n determines how many observations are retained for display and in the output data set or how many tuples if you specify SIZE=. SELECT=value-list specifies which observations or effect levels are chosen for influence calculations.","help":"INFLUENCE=EFFECT= | EST | ESTIMATES | KEEP= | SELECT= | SIZE=","type":"choice","arguments":[{"name":"EFFECT=","type":"value"},{"name":"EST","type":"standalone"},{"name":"ESTIMATES","type":"standalone"},{"name":"KEEP=","type":"value"},{"name":"SELECT=","type":"value"},{"name":"SIZE=","type":"value"}]},{"name":"INTERCEPT","optional":true,"followsDelimiter":"/","description":"Adds a row to the tables for Type I, II, and III tests corresponding to the overall intercept.","type":"standalone"},{"name":"LCOMPONENTS","optional":true,"followsDelimiter":"/","description":"Requests an estimate for each row of the L matrix used to form tests of fixed effects. Components corresponding to Type 3 tests are the default; you can produce the Type 1 and Type 2 component estimates with the HTYPE= option.","type":"standalone"},{"name":"NOCONTAIN","optional":true,"followsDelimiter":"/","description":"Has the same effect as the DDFM=RESIDUAL option.","type":"standalone"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Requests that no intercept be included in the model. An intercept is included by default.","type":"standalone"},{"name":"NOTEST","optional":true,"followsDelimiter":"/","description":"Specifies that no hypothesis tests be performed for the fixed effects.","type":"standalone"},{"name":"OUTP=","optional":true,"followsDelimiter":"/","aliases":["OUTPRED="],"description":"Specifies an output data set containing predicted values and related quantities. This option replaces the P option from SAS 6.","help":"OUTP=*SAS-data-set*","type":"dataSet"},{"name":"OUTPM=","optional":true,"followsDelimiter":"/","aliases":["OUTPREDM="],"description":"Specifies an output data set containing predicted means and related quantities. This option replaces the PM option from SAS 6.","help":"OUTPM=*SAS-data-set*","type":"dataSet"},{"name":"RESIDUAL","optional":true,"followsDelimiter":"/","description":"Requests that Pearson-type and (internally) studentized residuals be added to the OUTP= and OUTPM= data sets.","type":"standalone"},{"name":"SINGCHOL=","optional":true,"followsDelimiter":"/","description":"Tunes the sensitivity in computing Cholesky roots.","help":"SINGCHOL=*number*","type":"value"},{"name":"SINGRES=","optional":true,"followsDelimiter":"/","description":"Sets the tolerance for which the residual variance is considered to be zero. The default is 1E4 times the machine epsilon; this product is approximately 1E12 on most computers.","help":"SINGRES=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the sensitivity in sweeping. If a diagonal pivot element is less than D*number as PROC MIXED sweeps a matrix, the associated column is declared to be linearly dependent upon previous columns, and the associated parameter is set to 0.","help":"SINGULAR=*number*","type":"value"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Requests that a solution for the fixed-effects parameters be produced.","type":"standalone"},{"name":"VCIRY","optional":true,"followsDelimiter":"/","description":"Requests that responses and marginal residuals be scaled by the inverse Cholesky root of the marginal variance-covariance matrix.","type":"standalone"},{"name":"ZETA=","optional":true,"followsDelimiter":"/","description":"Tunes the sensitivity in forming Type 3 functions. Any element in the estimable function basis with an absolute value less than number is set to 0. The default is 1E-8.","help":"ZETA=*number*","type":"value"}]},{"name":"PARMS","description":"The PARMS statement specifies initial values for the covariance parameters, or it requests a grid search over several values of these parameters. You must specify the values in the order in which they appear in the \"Covariance Parameter Estimates\" table. The value-list specification can take any of several forms: m a single value m1,m2,...,mn several values m to n a sequence where m equals the starting value, n equals the ending value, and the increment equals 1 m to n by i a sequence where m equals the starting value, n equals the ending value, and the increment equals i m1,m2 to m3 mixed values and sequences You can use the PARMS statement to input known parameters.","help":"PARMS &lt;HOLD=value-list&gt; &lt;LOGDETH&gt; &lt;LOWERB=value-list&gt; ...","arguments":[{"name":"HOLD=","optional":true,"followsDelimiter":"/","aliases":["EQCONS="],"description":"Specifies which parameter values PROC MIXED should hold equal to the specified values.","help":"HOLD=*value-list*","type":"value"},{"name":"LOGDETH","optional":true,"followsDelimiter":"/","description":"Evaluates the log determinant of the Hessian matrix for each point specified in the PARMS statement.","type":"standalone"},{"name":"LOWERB=","optional":true,"followsDelimiter":"/","description":"Enables you to specify lower boundary constraints for the covariance or scale parameters.","help":"LOWERB=*value-list*","type":"value"},{"name":"NOBOUND","optional":true,"followsDelimiter":"/","description":"Requests the removal of boundary constraints on covariance parameters in mixed models.","type":"standalone"},{"name":"NOITER","optional":true,"followsDelimiter":"/","description":"Requests that no Newton-Raphson iterations be performed and that PROC MIXED use the best value from the grid search to perform inferences.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the \"Parameter Search\" table.","type":"standalone"},{"name":"NOPROFILE","optional":true,"followsDelimiter":"/","description":"Specifies a different computational method for the residual variance during the grid search.","type":"standalone"},{"name":"OLS","optional":true,"followsDelimiter":"/","description":"Requests starting values corresponding to the usual general linear model.","type":"standalone"},{"name":"PARMSDATA=","optional":true,"followsDelimiter":"/","aliases":["PDATA="],"description":"Reads in covariance parameter values from a SAS data set.","help":"PARMSDATA=*SAS-data-set*","type":"dataSet"},{"name":"RATIOS","optional":true,"followsDelimiter":"/","description":"Indicates that ratios with the residual variance are specified instead of the covariance parameters themselves. The default is to use the individual covariance parameters.","type":"standalone"},{"name":"UPPERB=","optional":true,"followsDelimiter":"/","description":"Enables you to specify upper boundary constraints on the covariance parameters. The value-list specification is a list of numbers or missing values (.) separated by commas.","help":"UPPERB=*value-list*","type":"value"}]},{"name":"PRIOR","description":"The PRIOR statement enables you to carry out a sampling-based Bayesian analysis in PROC MIXED. It currently operates only with variance component models. The analysis produces a SAS data set containing a pseudo-random sample from the joint posterior density of the variance components and other parameters in the mixed model.","help":"PRIOR DATA= FLAT JEFFREYS ...","arguments":[{"name":"DATA=","description":"Enables you to input the prior densities of the variance components used by the sampling algorithm.","type":"value"},{"name":"FLAT","description":"Specifies a prior density equal to 1 everywhere, making the likelihood function the posterior.","type":"standalone"},{"name":"JEFFREYS","description":"Specifies a noninformative reference version of Jeffreys' prior constructed by using the square root of the determinant of the expected information matrix.","type":"standalone"},{"name":"ALG=","optional":true,"followsDelimiter":"/","description":"Specifies the algorithm used for generating the posterior sample.","help":"ALG=INDCHAIN | IMPSAMP | REJSAMP | RWCHAIN","type":"choice","arguments":[{"name":"INDCHAIN","followsDelimiter":"/","aliases":["IC"],"description":"Requests an independence chain algorithm, and it is the default.","type":"standalone"},{"name":"IMPSAMP","followsDelimiter":"/","aliases":["IS"],"description":"Requests importance sampling.","type":"standalone"},{"name":"REJSAMP","followsDelimiter":"/","aliases":["RS"],"description":"Requests rejection sampling.","type":"standalone"},{"name":"RWCHAIN","followsDelimiter":"/","aliases":["RWC"],"description":"Requests a random walk chain.","type":"standalone"}]},{"name":"BDATA=","optional":true,"followsDelimiter":"/","description":"Enables you to input the base densities used by the sampling algorithm.","type":"value"},{"name":"GRID=","optional":true,"followsDelimiter":"/","description":"Specifies a grid of values over which to evaluate the posterior density.","type":"value"},{"name":"GRIDT=","optional":true,"followsDelimiter":"/","description":"Specifies a transformed grid of values over which to evaluate the posterior density.","type":"value"},{"name":"LOGNOTE=","optional":true,"followsDelimiter":"/","aliases":["UPDATE="],"description":"Instructs PROC MIXED to write a note to the SAS log after it generates the sample corresponding to each multiple of number. This is useful for monitoring the progress of CPU-intensive runs.","help":"LOGNOTE=*number*","type":"value"},{"name":"LOGRBOUND=","optional":true,"followsDelimiter":"/","description":"Specifies the bounding constant for rejection sampling.","help":"LOGRBOUND=*number*","type":"value"},{"name":"NSAMPLE=","optional":true,"followsDelimiter":"/","description":"Specifies the number of posterior samples to generate. The default is 1000, but more accurate results are obtained with larger samples such as 10000.","help":"NSAMPLE=*number*","type":"value"},{"name":"NSEARCH=","optional":true,"followsDelimiter":"/","description":"Specifies the number of posterior evaluations PROC MIXED makes for each transformed parameter in determining the parameters for the inverted γ densities. The default is 20.","help":"NSEARCH=*number*","type":"value"},{"name":"OUT=","optional":true,"followsDelimiter":"/","description":"Creates an output data set containing the sample from the posterior density.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTG=","optional":true,"followsDelimiter":"/","description":"Creates an output data set from the grid evaluations specified in the GRID= option.","help":"OUTG=*SAS-data-set*","type":"dataSet"},{"name":"OUTGT=","optional":true,"followsDelimiter":"/","description":"Creates an output data set from the transformed grid evaluations specified in the GRIDT= option.","help":"OUTGT=*SAS-data-set*","type":"dataSet"},{"name":"PSEARCH","optional":true,"followsDelimiter":"/","description":"Displays the search used to determine the parameters for the inverted γ densities. For ODS purposes, the name of the table is \"Search.\"","type":"standalone"},{"name":"PTRANS","optional":true,"followsDelimiter":"/","description":"Displays the transformation of the variance components. For ODS purposes, the name of the table is \"Trans\".","type":"standalone"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies an integer used to start the pseudo-random number generator for the simulation.","help":"SEED=*number*","type":"value"},{"name":"SFACTOR=","optional":true,"followsDelimiter":"/","aliases":["IFACTOR="],"description":"Enables you to adjust the range over which PROC MIXED searches the transformed parameters in order to determine the parameters for the inverted γ densities.","help":"SFACTOR=*number*","type":"value"},{"name":"TDATA=","optional":true,"followsDelimiter":"/","description":"Enables you to input the transformation of the covariance parameters used by the sampling algorithm.","type":"value"},{"name":"TRANS=","optional":true,"followsDelimiter":"/","description":"Specifies the particular algorithm used to determine the transformation of the covariance parameters.","help":"TRANS=EXPECTED | MIVQUE0 | OBSERVED","type":"choice","arguments":[{"name":"EXPECTED","followsDelimiter":"/","description":"Indicates a type of Hessian matrix used in constructing the transformation via a Cholesky root.","type":"standalone"},{"name":"MIVQUE0","followsDelimiter":"/","description":"Indicaes a transformation based on the MIVQUE(0) equations.","type":"standalone"},{"name":"OBSERVED","followsDelimiter":"/","description":"Indicates a type of Hessian matrix used in constructing the transformation via a Cholesky root.","type":"standalone"}]}]},{"name":"RANDOM","description":"The RANDOM statement defines the random effects constituting the γ vector in the mixed model. It can be used to specify traditional variance component models (as in the VARCOMP procedure) and to specify random coefficients. The random effects can be classification or continuous, and multiple RANDOM statements are possible. You can specify INTERCEPT (or INT) as a random effect to indicate the intercept. PROC MIXED does not include the intercept in the RANDOM statement by default as it does in the MODEL statement.","help":"RANDOM &lt;ALPHA=number&gt; &lt;CL&gt; &lt;G&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval with confidence level 1-number be constructed for the predictors of G-side random effects in this statement. The value of number must be between 0 and 1; the default is 0.05","help":"ALPHA=*number*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the predictors of random effects in this statement.","type":"standalone"},{"name":"G","optional":true,"followsDelimiter":"/","description":"Requests that the estimated G matrix be displayed for G-side random effects associated with this RANDOM statement.","type":"standalone"},{"name":"GC","optional":true,"followsDelimiter":"/","description":"Displays the lower-triangular Cholesky root of the estimated G matrix according to the rules listed under the G option.","type":"standalone"},{"name":"GCI","optional":true,"followsDelimiter":"/","description":"Displays the inverse Cholesky root of the estimated G matrix for G-side random effects.","type":"standalone"},{"name":"GCORR","optional":true,"followsDelimiter":"/","description":"Displays the correlation matrix that corresponds to the estimated G matrix for G-side random effects.","type":"standalone"},{"name":"GDATA=","optional":true,"followsDelimiter":"/","description":"Requests that the G matrix be read in from a SAS data set.","help":"GDATA=*SAS-data-set*","type":"dataSet"},{"name":"GI","optional":true,"followsDelimiter":"/","description":"Displays the inverse of the estimated G matrix according to the rules listed under the G option.","type":"standalone"},{"name":"GROUP=","optional":true,"followsDelimiter":"/","aliases":["GRP="],"description":"Defines an effect specifying heterogeneity in the covariance structure of G.","help":"GROUP=*effect*","type":"value"},{"name":"LDATA=","optional":true,"followsDelimiter":"/","description":"Reads the coefficient matrices associated with the TYPE=LIN(number) option.","help":"LDATA=*SAS-data-set*","type":"dataSet"},{"name":"NOFULLZ","optional":true,"followsDelimiter":"/","description":"Eliminates the columns in Z corresponding to missing levels of random effects involving CLASS variables. By default, these columns are included in Z. It is sufficient to specify the NOFULLZ option in any RANDOM statement.","type":"standalone"},{"name":"RATIOS","optional":true,"followsDelimiter":"/","description":"Indicates that ratios with the residual variance are specified in the GDATA= data set instead of the covariance parameters themselves.","type":"standalone"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Requests that the solution for the random-effects parameters be produced.","type":"standalone"},{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","aliases":["SUB="],"description":"Identifies the subjects in your mixed model. Complete independence is assumed across subjects; thus, for the RANDOM statement, the SUBJECT= option produces a block-diagonal structure in G with identical blocks.","help":"SUBJECT=*effect*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the covariance structure of G.","help":"TYPE=ANTE(1) | AR(1) | ARH(1) | ARMA(1,1) | CS | CSH | FA(q) | FA0(q) | FA1(q) | HF | LIN(q) | TOEP | TOEP(q) | TOEPH | TOEPH(q) | UN | UN(q) | UNR | UNR(q) | UN@AR(1) | UN@CS | UN@UN | VC | SP(EXP)(c-list) | SP(EXPA)(c-list) | SP(EXPGA)(c1 c2) | SP(GAU)(c-list) | SP(GAUGA)(c1 c2) | SP(LIN)(c-list) | SP(LINL)(c-list) | SP(MATERN)(c-list) | SP(MATHSW)(c-list) | SP(POW)(c-list) | SP(POWA)(c-list) | SP(SPH)(c-list) | SP(SPHGA)(c-list)*covariance-structure*","type":"value","arguments":[{"name":"ANTE(1)","followsDelimiter":"/","description":"Specifies a first-order ante-dependence structure (see Kenward 1987, Patel 1991, and Macchiavelli and Arnold 1994)","type":"standalone"},{"name":"AR(1)","followsDelimiter":"/","description":"Specifies a first-order autoregressive structure.","type":"standalone"},{"name":"ARH(1)","followsDelimiter":"/","description":"Specifies a heterogeneous first-order autoregressive structure.","type":"standalone"},{"name":"ARMA(1,1)","followsDelimiter":"/","description":"Specifies the first-order autoregressive moving-average structure","type":"standalone"},{"name":"CS","followsDelimiter":"/","description":"Specifies the compound-symmetry structure, which has constant variance and constant covariance.","type":"standalone"},{"name":"CSH","followsDelimiter":"/","description":"Specifies the heterogeneous compound-symmetry structure, which is an equi-correlation structure but allows for different variances.","type":"standalone"},{"name":"FA(q)","followsDelimiter":"/","description":"Specifies the factor-analytic structure with q factors (Jennrich and Schluchter 1986).","type":"standalone"},{"name":"FA0(q)","followsDelimiter":"/","description":"Is similar to the FA(q) structure except that no diagonal matrix D is included.","type":"standalone"},{"name":"FA1(q)","followsDelimiter":"/","description":"Is similar to the FA(q) structure except that all of the elements in D are constrained to be equal.","type":"standalone"},{"name":"HF","followsDelimiter":"/","description":"Specifies the Huynh-Feldt covariance structure (Huynh and Feldt 1970). This structure is similar to the CSH structure in that it has the same number of parameters and heterogeneity along the main diagonal. However, it constructs the off-diagonal elements by taking arithmetic rather than geometric means.","type":"standalone"},{"name":"LIN(q)","followsDelimiter":"/","description":"Specifies a general linear covariance structure with q parameters.","type":"standalone"},{"name":"TOEP","followsDelimiter":"/","description":"Specifies a full Toeplitz matrix, which can be viewed as an autoregressive structure with order equal to the dimension of the matrix.","type":"standalone"},{"name":"TOEP(q)","followsDelimiter":"/","description":"Specifies a banded Toeplitz structure. This can be viewed as a moving-average structure with order equal to q-1.","type":"value"},{"name":"TOEPH","followsDelimiter":"/","description":"Specifies a heterogeneous banded Toeplitz structure.","type":"standalone"},{"name":"TOEPH(q)","followsDelimiter":"/","description":"Specifies a heterogeneous banded Toeplitz structure. PROC MIXED estimates only the first q bands of the matrix, setting all higher bands equal to 0.","type":"standaloneOrValue"},{"name":"UN","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized directly in terms of variances and covariances.","type":"standalone"},{"name":"UN(q)","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized directly in terms of variances and covariances. PROC MIXED estimates only the first q bands of the matrix, setting all higher bands equal to 0.","type":"standalone"},{"name":"UNR","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized in terms of variances and correlations.","type":"standalone"},{"name":"UNR(q)","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized in terms of variances and correlations. PROC MIXED estimates only the first q bands of the matrix, setting all higher bands equal to zero.","type":"standalone"},{"name":"UN@AR(1)","followsDelimiter":"/","description":"Specifies direct (Kronecker) product structures designed for multivariate repeated measures (see Galecki 1994).","type":"standalone"},{"name":"UN@CS","followsDelimiter":"/","description":"Specifies direct (Kronecker) product structures designed for multivariate repeated measures (see Galecki 1994).","type":"standalone"},{"name":"UN@UN","followsDelimiter":"/","description":"Specifies direct (Kronecker) product structures designed for multivariate repeated measures (see Galecki 1994).","type":"standalone"},{"name":"VC","followsDelimiter":"/","aliases":["SIMPLE"],"description":"Specifies standard variance components and is the default structure for both the RANDOM and REPEATED statements.","type":"standalone"},{"name":"SP(EXP)(c-list)","followsDelimiter":"/","description":"Exponential spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(EXPA)(c-list)","followsDelimiter":"/","description":"Anisotropic exponential spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(EXPGA)(c1 c2)","followsDelimiter":"/","description":"2D exponential, geometrically anisotropic","type":"standalone"},{"name":"SP(GAU)(c-list)","followsDelimiter":"/","description":"Gaussian spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(GAUGA)(c1 c2)","followsDelimiter":"/","description":"2D Gaussian spatial covariance structure.","type":"standalone"},{"name":"SP(LIN)(c-list)","followsDelimiter":"/","description":"Linear spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(LINL)(c-list)","followsDelimiter":"/","description":"Linear log spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(MATERN)(c-list)","followsDelimiter":"/","description":"Matern spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(MATHSW)(c-list)","followsDelimiter":"/","description":"Matern (Hancock-Stein-Wallis) spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(POW)(c-list)","followsDelimiter":"/","description":"Power spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(POWA)(c-list)","followsDelimiter":"/","description":"Anisotropic power spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(SPH)(c-list)","followsDelimiter":"/","description":"Spherical spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(SPHGA)(c-list)","followsDelimiter":"/","description":"2D spherical, geometrically anisotropic spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"}]},{"name":"V","optional":true,"followsDelimiter":"/","description":"Requests that blocks of the estimated V matrix be displayed. You can optionally use the value-list specification, which indicates the subjects for which blocks of V are to be displayed.","type":"standalone"},{"name":"VC","optional":true,"followsDelimiter":"/","description":"Displays the Cholesky root of the blocks of the estimated V matrix. The value-list specification is the same as in the V= option.","type":"standalone"},{"name":"VCI","optional":true,"followsDelimiter":"/","description":"Displays the inverse of the Cholesky root of the blocks of the estimated V matrix. The value-list specification is the same as in the V= option.","type":"standalone"},{"name":"VCORR","optional":true,"followsDelimiter":"/","description":"Displays the correlation matrix corresponding to the blocks of the estimated V matrix. The value-list specification is the same as in the V= option.","type":"standalone"},{"name":"VI","optional":true,"followsDelimiter":"/","description":"Displays the inverse of the blocks of the estimated V matrix. The value-list specification is the same as in the V= option.","type":"standalone"}]},{"name":"REPEATED","description":"The REPEATED statement is used to specify the R matrix in the mixed model. Its syntax is different from that of the REPEATED statement in PROC GLM. If no REPEATED statement is specified, R is assumed to be equal to σ²I.","help":"REPEATED &lt;GROUP=effect&gt; &lt;HLM&gt; &lt;HLPS&gt; ...","arguments":[{"name":"GROUP=","optional":true,"followsDelimiter":"/","aliases":["GRP="],"description":"Defines an effect specifying heterogeneity in the covariance structure of R.","help":"GROUP=*effect*","type":"value"},{"name":"HLM","optional":true,"followsDelimiter":"/","description":"Produces a table of Hotelling-Lawley-McKeon statistics for all fixed effects whose levels change across data having the same level of the SUBJECT= effect (the within- subject fixed effects)","type":"standalone"},{"name":"HLPS","optional":true,"followsDelimiter":"/","description":"Produces a table of Hotelling-Lawley-Pillai-Samson statistics for all fixed effects whose levels change across data having the same level of the SUBJECT= effect (the within-subject fixed effects).","type":"standalone"},{"name":"LDATA=","optional":true,"followsDelimiter":"/","description":"Reads the coefficient matrices associated with the TYPE=LIN(number) option.","help":"LDATA=*SAS-data-set*","type":"dataSet"},{"name":"LOCAL=","optional":true,"followsDelimiter":"/","description":"Requests that a diagonal matrix be added to R. With just the LOCAL option, this diagonal matrix equals σ²I, and σ² becomes an additional variance parameter that PROC MIXED profiles out of the likelihood provided that you do not specify the NOPROFILE option in the PROC MIXED statement. The LOCAL option is useful if you want to add an observational error to a time series structure (Jones and Boadi- Boateng 1991) or a nugget effect to a spatial structure (Cressie 1993).","help":"LOCAL=POM(*POM-data-set*) | EXP(&lt;*effects*&gt;)","type":"choice","arguments":[{"name":"POM","followsDelimiter":"/","description":"Specifies the power-of-the-mean structure. The SAS data set specified by POM-data-set contains the numeric variable Estimate (in previous releases, the variable name was required to be EST), and it has at least as many observations as there are fixed-effects parameters.","help":"POM(*POM-data-set*)","type":"dataSet"},{"name":"EXP","followsDelimiter":"/","description":"Produces exponential local effects, also known as dispersion effects, in a log-linear variance model.","help":"EXP(&lt;*effects*&gt;)","type":"standaloneOrValue"}]},{"name":"LOCALW","optional":true,"followsDelimiter":"/","description":"Specifies that only the local effects and no others be weighted.","type":"standalone"},{"name":"NONLOCALW","optional":true,"followsDelimiter":"/","description":"Specifies that only the nonlocal effects and no others be weighted.","type":"standalone"},{"name":"R","optional":true,"followsDelimiter":"/","description":"Requests that blocks of the estimated R matrix be displayed.","type":"standalone"},{"name":"RC","optional":true,"followsDelimiter":"/","description":"Produces the Cholesky root of blocks of the estimated R matrix.","type":"standalone"},{"name":"RCI","optional":true,"followsDelimiter":"/","description":"Produces the inverse Cholesky root of blocks of the estimated R matrix.","type":"standalone"},{"name":"RCORR","optional":true,"followsDelimiter":"/","description":"Produces the correlation matrix corresponding to blocks of the estimated R matrix.","type":"standalone"},{"name":"RI","optional":true,"followsDelimiter":"/","description":"Produces the inverse of blocks of the estimated R matrix.","type":"standalone"},{"name":"SSCP","optional":true,"followsDelimiter":"/","description":"Requests that an unstructured R matrix be estimated from the sum-of-squares-and-crossproducts matrix of the residuals.","type":"standalone"},{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","aliases":["SUB="],"description":"Identifies the subjects in your mixed model.","help":"SUBJECT=*effect*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the covariance structure of the R matrix.","help":"TYPE=ANTE(1) | AR(1) | ARH(1) | ARMA(1,1) | CS | CSH | FA(q) | FA0(q) | FA1(q) | HF | LIN(q) | TOEP | TOEP(q) | TOEPH | TOEPH(q) | UN | UN(q) | UNR | UNR(q) | UN@AR(1) | UN@CS | UN@UN | VC | SP(EXP)(c-list) | SP(EXPA)(c-list) | SP(EXPGA)(c1 c2) | SP(GAU)(c-list) | SP(GAUGA)(c1 c2) | SP(LIN)(c-list) | SP(LINL)(c-list) | SP(MATERN)(c-list) | SP(MATHSW)(c-list) | SP(POW)(c-list) | SP(POWA)(c-list) | SP(SPH)(c-list) | SP(SPHGA)(c-list)*covariance-structure*","type":"value","arguments":[{"name":"ANTE(1)","followsDelimiter":"/","description":"Specifies a first-order ante-dependence structure (see Kenward 1987, Patel 1991, and Macchiavelli and Arnold 1994)","type":"standalone"},{"name":"AR(1)","followsDelimiter":"/","description":"Specifies a first-order autoregressive structure.","type":"standalone"},{"name":"ARH(1)","followsDelimiter":"/","description":"Specifies a heterogeneous first-order autoregressive structure.","type":"standalone"},{"name":"ARMA(1,1)","followsDelimiter":"/","description":"Specifies the first-order autoregressive moving-average structure","type":"standalone"},{"name":"CS","followsDelimiter":"/","description":"Specifies the compound-symmetry structure, which has constant variance and constant covariance.","type":"standalone"},{"name":"CSH","followsDelimiter":"/","description":"Specifies the heterogeneous compound-symmetry structure, which is an equi-correlation structure but allows for different variances.","type":"standalone"},{"name":"FA(q)","followsDelimiter":"/","description":"Specifies the factor-analytic structure with q factors (Jennrich and Schluchter 1986).","type":"standalone"},{"name":"FA0(q)","followsDelimiter":"/","description":"Is similar to the FA(q) structure except that no diagonal matrix D is included.","type":"standalone"},{"name":"FA1(q)","followsDelimiter":"/","description":"Is similar to the FA(q) structure except that all of the elements in D are constrained to be equal.","type":"standalone"},{"name":"HF","followsDelimiter":"/","description":"Specifies the Huynh-Feldt covariance structure (Huynh and Feldt 1970). This structure is similar to the CSH structure in that it has the same number of parameters and heterogeneity along the main diagonal. However, it constructs the off-diagonal elements by taking arithmetic rather than geometric means.","type":"standalone"},{"name":"LIN(q)","followsDelimiter":"/","description":"Specifies a general linear covariance structure with q parameters.","type":"standalone"},{"name":"TOEP","followsDelimiter":"/","description":"Specifies a full Toeplitz matrix, which can be viewed as an autoregressive structure with order equal to the dimension of the matrix.","type":"standalone"},{"name":"TOEP(q)","followsDelimiter":"/","description":"Specifies a banded Toeplitz structure. This can be viewed as a moving-average structure with order equal to q-1.","type":"standalone"},{"name":"TOEPH","followsDelimiter":"/","description":"Specifies a heterogeneous banded Toeplitz structure.","type":"standalone"},{"name":"TOEPH(q)","followsDelimiter":"/","description":"Specifies a heterogeneous banded Toeplitz structure. PROC MIXED estimates only the first q bands of the matrix, setting all higher bands equal to 0.","type":"standalone"},{"name":"UN","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized directly in terms of variances and covariances.","type":"standalone"},{"name":"UN(q)","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized directly in terms of variances and covariances. PROC MIXED estimates only the first q bands of the matrix, setting all higher bands equal to 0.","type":"standalone"},{"name":"UNR","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized in terms of variances and correlations.","type":"standalone"},{"name":"UNR(q)","followsDelimiter":"/","description":"Specifies a completely general (unstructured) covariance matrix parameterized in terms of variances and correlations. PROC MIXED estimates only the first q bands of the matrix, setting all higher bands equal to zero.","type":"standalone"},{"name":"UN@AR(1)","followsDelimiter":"/","description":"Specifies direct (Kronecker) product structures designed for multivariate repeated measures (see Galecki 1994).","type":"standalone"},{"name":"UN@CS","followsDelimiter":"/","description":"Specifies direct (Kronecker) product structures designed for multivariate repeated measures (see Galecki 1994).","type":"standalone"},{"name":"UN@UN","followsDelimiter":"/","description":"Specifies direct (Kronecker) product structures designed for multivariate repeated measures (see Galecki 1994).","type":"standalone"},{"name":"VC","followsDelimiter":"/","aliases":["SIMPLE"],"description":"Specifies standard variance components and is the default structure for both the RANDOM and REPEATED statements.","type":"standalone"},{"name":"SP(EXP)(c-list)","followsDelimiter":"/","description":"Exponential spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(EXPA)(c-list)","followsDelimiter":"/","description":"Anisotropic exponential spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(EXPGA)(c1 c2)","followsDelimiter":"/","description":"2D exponential, geometrically anisotropic","type":"standalone"},{"name":"SP(GAU)(c-list)","followsDelimiter":"/","description":"Gaussian spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(GAUGA)(c1 c2)","followsDelimiter":"/","description":"2D Gaussian spatial covariance structure.","type":"standalone"},{"name":"SP(LIN)(c-list)","followsDelimiter":"/","description":"Linear spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(LINL)(c-list)","followsDelimiter":"/","description":"Linear log spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(MATERN)(c-list)","followsDelimiter":"/","description":"Matern spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(MATHSW)(c-list)","followsDelimiter":"/","description":"Matern (Hancock-Stein-Wallis) spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(POW)(c-list)","followsDelimiter":"/","description":"Power spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(POWA)(c-list)","followsDelimiter":"/","description":"Anisotropic power spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(SPH)(c-list)","followsDelimiter":"/","description":"Spherical spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"},{"name":"SP(SPHGA)(c-list)","followsDelimiter":"/","description":"2D spherical, geometrically anisotropic spatial covariance structure. c-list contains the names of the numeric variables used as coordinates of the location of the observation in space.","type":"standalone"}]}]},{"name":"SLICE","description":"The SLICE statement provides a general mechanism for performing a partitioned analysis of the LS-means for an interaction. This analysis is also known as an analysis of simple effects. The SLICE statement uses the same options as the LSMEANS statement.","help":"SLICE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the SLICE model-effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified SLICE effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the SLICE effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means.","type":"standalone"},{"name":"NOF","optional":true,"followsDelimiter":"/","description":"Suppresses the F test for testing the mutual equality of the estimable functions in the partition.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the SLICE statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this SLICE statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFF","DIFFOGRAM"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function's distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function's distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the SLICE statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"SLICEBY=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"STORE","aliases":["ITEMSTORE"],"description":"The STORE statement requests that the procedure save the context and results of the statistical analysis. The resulting item store is a binary file format that cannot be modified. The contents of the item store can be processed with the PLM procedure. The item-store-name is a usual one- or two-level SAS name, like the names that are used for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session. Since item stores usually are used to perform postprocessing tasks, typical usage specifies a two-level name of the form libname.membername. If an item store by the same name as specified in the STORE statement already exists, the existing store is replaced.","help":"STORE &lt;LABEL='label'&gt; &lt;OUT=&gt;item-store-name ","arguments":[{"name":"OUT=","description":"Specifies the store item name.","type":"value"},{"name":"LABEL=","optional":true,"followsDelimiter":"/","description":"Adds a custom label. When the PLM procedure processes an item store, the label appears in the PROC PLM output along with other identifying information.","help":"LABEL='*label*'","type":"value"}]},{"name":"WEIGHT","description":"If you do not specify a REPEATED statement, the WEIGHT statement operates exactly like the one in PROC GLM. In this case PROC MIXED replaces X'X and Z'Z with X'WX and Z'WZ, where W is the diagonal weight matrix.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_033","docsetTargetFile":"statug_mixed_toc.htm"}}