{"name":"MKTATTRIBUTION","statements":[{"name":"PROC MKTATTRIBUTION","description":"The PROC MKTATTRIBUTION statement invokes the MKTATTRIBUTION procedure.","help":"PROC MKTATTRIBUTION   DATA=*libref.data-table*;","arguments":[{"name":"DATA=","description":"names the input data table for PROC MKTATTRIBUTION to use. libref.data-table is a two-level name, where \"libref\" refers to a refers to a collection of information that is defined in the LIBNAME statement and includes the library, which includes a path to the data, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement, and \"data-table\" specifies the name of the input data table.","help":"DATA=*libref.data-table*","type":"dataSet"}]},{"name":"ID","description":"The ID statement identifies observations in the input data table by specifying two variables for the cross-sectional time series data. That is, for each observation, the combination of the two variables’ values must be unique.","help":"ID  TIME=*variable* SECTION=*variable* ;","arguments":[{"name":"TIME=","description":"specifies the temporal or sequential order of the observations. The variable cannot have missing values.","help":"TIME=*variable*","type":"value"},{"name":"SECTION=","description":"identifies the section or customer ID of each observation. The variable cannot have missing values.","help":"SECTION=*variable*","type":"value"}]},{"name":"MODEL","description":"The MODEL statement specifies the channel variable and the number of channels for the market attribution model. Only one MODEL statement is allowed.","help":"MODEL *channel-variable*&lt; / options&gt; ;","arguments":[{"name":"channel-variable","description":"Specifies the channel variable.","type":"standalone"},{"name":"HALFLIFE=","optional":true,"followsDelimiter":"/","description":"Specifies the half-life the decaying attribution value for the time-decay attribution model. The number must be a positive number. By default, the value of the HALFLIFE= option is 1.","help":"HALFLIFE=*number*","type":"value"},{"name":"NCHANNEL=","optional":true,"followsDelimiter":"/","description":"specifies the number of channels for the market attribution model. The number must be a positive integer. The number must be greater than the value the channel variable takes. If you specify a number greater than the maximum value of the channel variable in the input data set, the procedure produces useless information in the TPM. If you specify a number less than the maximum value of the channel variable in the input data set, the procedure stops running. By default, the value of the NCHANNEL= option is the maximum value of the channel variable in the input data set.","help":"NCHANNEL=*number*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement saves the estimation results to the specified output data tables.","help":"OUTPUT &lt;options&gt; ;","arguments":[{"name":"OUTCONTRIBUTION=","optional":true,"description":"writes the contribution results to the specified output data table. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table.","help":"OUTCONTRIBUTION=*libref.data-table*","type":"dataSet"},{"name":"OUTREMOVAL=","optional":true,"description":"writes the removal effects to the specified output data table. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table.","help":"OUTREMOVAL=*libref.data-table*","type":"dataSet"},{"name":"OUTTPM=","optional":true,"description":"writes the estimated transition probability matrix to the specified output data table. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table.","help":"OUTTPM=*libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casecon","docsetVersion":"latest","docsetTargetFile":"casecon_marketattribution_toc.htm"}}