{"name":"MODECLUS","statements":[{"name":"PROC MODECLUS","description":"The MODECLUS procedure clusters observations in a SAS data set by using any of several algorithms based on nonparametric density estimates.","help":"PROC MODECLUS <ALL> <AM> <BOUNDARY> <CASCADE=n> <CK=n> <CLUSTER=name> <CORE> <CR=n> <CROSS> <CROSSLIST> <DATA=SAS-data-set> <DENSITY=name> <DIMENSION=n> <DK=n> <DOCK=n> <DR=n> <EARLY> <HM> <JOIN<=p>> <K=n> <LIST> <LOCAL> <MAXCLUSTERS=n> <METHOD=0 | 1 | 2... > <MODE=n> <NEIGHBOR> <NOPRINT> <NOSUMMARY> <OUT=SAS-data-set> <OUTCLUS=SAS-data-set> <OUTLENGTH=n> <OUTSUM=SAS-data-set> <POWER=n> <R=n> <SHORT> <SIMPLE> <STANDARD> <SUM> <TEST> <THRESHOLD=n> <TRACE>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tFREQ variable;\n    \n\tID variables ;\n    \n\tVAR variables ;\n","arguments":[{"name":"ALL","optional":true,"description":"Produces all optional output.","type":"standalone"},{"name":"AM","optional":true,"description":"Specifies arithmetic means for cascading density estimates.","type":"standalone"},{"name":"BOUNDARY","optional":true,"description":"Displays the density and cluster membership of observations with neighbors belonging to a different cluster.","type":"standalone"},{"name":"CASCADE=","optional":true,"aliases":["CASC="],"description":"Specifies the number of times the density estimates are to be cascaded. The default value 0 performs no cascading.","help":"CASCADE=*n*","type":"value"},{"name":"CK=","optional":true,"description":"Specifies the number of neighbors to use for clustering. The number of neighbors should be at least two but less than the number of observations.","help":"CK=*n*","type":"value"},{"name":"CLUSTER=","optional":true,"description":"Provides a name for the variable in the OUT= and OUTCLUS= data sets identifying clusters. The default name is CLUSTER.","help":"CLUSTER=*name*","type":"value"},{"name":"CORE","optional":true,"description":"Keeps the neighbor lists for each observation in the computer memory to make small problems run faster.","type":"standalone"},{"name":"CR=","optional":true,"description":"Specifies the radius of the neighborhood for clustering.","help":"CR=*n*","type":"value"},{"name":"CROSS","optional":true,"description":"Computes the likelihood cross validation criterion (Silverman 1986, pp. 52–55). This option appears to be of limited usefulness.","type":"standalone"},{"name":"CROSSLIST","optional":true,"description":"Displays the cross validated log density of each observation.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the input data set containing observations to be clustered.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DENSITY=","optional":true,"description":"Provides a name for the variable in the OUT= data set containing density estimates. The default name is DENSITY.","help":"DENSITY=*name*","type":"value"},{"name":"DIMENSION=","optional":true,"aliases":["DIM="],"description":"Specifies the dimensionality to be used when computing density estimates. The default is the number of variables if the data are coordinates; the default is 1 if the data are distances.","help":"DIMENSION=*n*","type":"value"},{"name":"DK=","optional":true,"description":"Specifies the number of neighbors to use for th-nearest-neighbor density estimation.","help":"DK=*n*","type":"value"},{"name":"DOCK=","optional":true,"description":"Dissolves clusters with n or fewer members by making the members unassigned.","help":"DOCK=*n*","type":"value"},{"name":"DR=","optional":true,"description":"Specifies the radius of the sphere of support for uniform-kernel density estimation.","help":"DR=*n*","type":"value"},{"name":"EARLY","optional":true,"description":"Stops the cluster analysis after obtaining either a solution with no cluster or a solution with one cluster to which all observations are assigned.","type":"standalone"},{"name":"HM","optional":true,"description":"Uses harmonic means for cascading density estimates. See the description of the CASCADE= option for details.","type":"standalone"},{"name":"JOIN","optional":true,"description":"Requests that nonsignificant clusters be hierarchically joined. The JOIN option implies the TEST option.","type":"standalone"},{"name":"K=","optional":true,"description":"Specifies the number of neighbors to use for th-nearest-neighbor density estimation and clustering.","help":"K=*n*","type":"value"},{"name":"LIST","optional":true,"description":"Displays the estimated density and cluster membership of each observation.","type":"standalone"},{"name":"LOCAL","optional":true,"description":"Requests estimates of local dimensionality.","type":"standalone"},{"name":"MAXCLUSTERS=","optional":true,"aliases":["MAXC="],"description":"Specifies the maximum number of clusters to be obtained with the METHOD=6 option. By default, there is no fixed limit.","help":"MAXCLUSTERS=*n*","type":"value"},{"name":"METHOD=","optional":true,"aliases":["MET=","M="],"description":"Specifies what clustering method to use. Since these methods do not have widely recognized names, the methods are indicated by numbers from 0 to 6.","help":"METHOD=0 | 1 | 2 | 3 | 4 | 5 | 6","type":"choice","arguments":[{"name":"0","description":"This method does not use density estimates.","type":"standalone"},{"name":"1","description":"This method is similar to the classification or assignment stage of algorithms described by Gitman (1973) and Huizinga (1978).","type":"standalone"},{"name":"2","description":"This method is similar to the first stage of an algorithm proposed by Mizoguchi and Shimura (1980).","type":"standalone"},{"name":"3","description":"This method was invented by Koontz, Narendra, and Fukunaga (1976).","type":"standalone"},{"name":"4","description":"This method is equivalent to the first stage of two-stage density linkage without the use of the MODE=option.","type":"standalone"},{"name":"5","description":"This method is equivalent to the first stage of two-stage density linkage with the use of the MODE=option.","type":"standalone"},{"name":"6","description":"This method is related to a method invented by Koontz and Fukunaga (1972a) and discussed by Koontz and Fukunaga (1972b).","type":"standalone"}]},{"name":"MODE=","optional":true,"description":"Specifies that when two clusters are joined using the METHOD=5 option (no other methods are affected by the MODE= option), each must have at least n members for either cluster to be designated a modal cluster.","help":"MODE=*n*","type":"value"},{"name":"NEIGHBOR","optional":true,"description":"Displays the neighbors of each observation in a table called \"Nearest Neighbor List.\"","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of the output.","type":"standalone"},{"name":"NOSUMMARY","optional":true,"description":"Suppresses the display of the summary of the number of clusters, number of unassigned observations, and maximum -value for each analysis.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies the output data set containing the input data plus density estimates, cluster membership, and variables identifying the type of solution.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTCLUS=","optional":true,"aliases":["OUTC="],"description":"Specifies the output data set containing an observation corresponding to each cluster in each solution.","help":"OUTCLUS=*SAS-data-set*","type":"dataSet"},{"name":"OUTLENGTH=","optional":true,"aliases":["OUTL="],"description":"Specifies the length of those output variables that are not copied from the input data set but are created by PROC MODECLUS.","help":"OUTLENGTH=*n*","type":"value"},{"name":"OUTSUM=","optional":true,"aliases":["OUTS="],"description":"Specifies the output data set containing an observation corresponding to each cluster solution, giving the number of clusters and the number of unclassified observations for that solution.","help":"OUTSUM=*SAS-data-set*","type":"dataSet"},{"name":"POWER=","optional":true,"description":"Specifies the power of the density used with the METHOD=6 option. The default value is 2.","help":"POWER=*n*","type":"value"},{"name":"R=","optional":true,"description":"Specifies the radius of the sphere of support for uniform-kernel density estimation and the neighborhood for clustering.","help":"R=*n*","type":"value"},{"name":"SHORT","optional":true,"description":"Suppresses the display of statistics for each cluster.","type":"standalone"},{"name":"SIMPLE","optional":true,"description":"Displays means, standard deviations, skewness, kurtosis, and a coefficient of bimodality. The SIMPLE option applies only to coordinate data.","type":"standalone"},{"name":"STANDARD","optional":true,"aliases":["STD"],"description":"Standardizes the variables to mean 0 and standard deviation 1. The STANDARD option applies only to coordinate data.","type":"standalone"},{"name":"SUM","optional":true,"description":"Uses sums for cascading density estimates.","type":"standalone"},{"name":"TEST","optional":true,"description":"Performs approximate significance tests for the number of clusters.","type":"standalone"},{"name":"THRESHOLD=","optional":true,"aliases":["THR="],"description":"Specifies the assignment threshold used with the METHOD=6 option. The default is 0.5.","help":"THRESHOLD=*n*","type":"value"},{"name":"TRACE","optional":true,"description":"Traces the process of cluster assignments when METHOD=6 is specified.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC MODECLUS to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"If one variable in the input data set represents the frequency of occurrence for other values in the observation, specify the variable’s name in a FREQ statement. PROC MODECLUS then treats the data set as if each observation appeared n times, where n is the value of the FREQ variable for the observation.","help":"FREQ variable"},{"name":"ID","description":"The values of the ID variable identify observations in the displayed results and in the OUT= data set. If you omit the ID statement, each observation is identified by its observation number, and a variable called _OBS_ is written to the OUT= data set containing the original observation numbers.","help":"ID variables "},{"name":"VAR","aliases":["VARIABLE","VARIABLES"],"description":"The VAR statement specifies numeric variables to be used in the cluster analysis. If you omit the VAR statement, all numeric variables not specified in other statements are used.","help":"VAR variables "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_021","docsetTargetFile":"statug_modeclus_toc.htm"}}