{"name":"MTS","statements":[{"name":"PROC MTS","description":"invokes the MTS procedure.","help":"PROC MTS  DATA=table &lt;options&gt;;                                \t  ","arguments":[{"name":"COV=","optional":true,"description":"specifies an optional input covariance matrix.","help":"COV=*table*","type":"dataSet"},{"name":"MEAN=","optional":true,"description":"specifies an optional means matrix.","help":"MEAN=*table*","type":"dataSet"},{"name":"NOPLOT","optional":true,"description":"suppresses the generation of ODS graphical output.","type":"standalone"}]},{"name":"BY","description":"The BY statement specifies the name of a single numeric variable to be used for BY-group processing in training.","help":"BY *numeric-variable*;                     "},{"name":"ID","description":"The ID statement specifies the name of a single numeric ID variable for identifying an observation during training.","help":"ID *numeric-variable*;                     "},{"name":"INPUT","description":"The INPUT statement specifies the names of variables to be used in training. Only numeric variables are accepted. There must be only one INPUT statement, and it is required.","help":"INPUT *variable-list*;                     "},{"name":"OUTLIER","description":"The OUTLIER statement performs outlier detection for training data by using the support vector data description algorithm.","help":"OUTLIER &lt;options&gt;;                                \t  ","arguments":[{"name":"CUTOFF=","optional":true,"description":"specifies the fraction of the SVDD’s R-squared distance range between its minimum and maximum to indicate outliers. By default, CUTOFF=0.05.","help":"CUTOFF=*number*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement generates output tables that show the training results.","help":"OUTLIER &lt;options&gt;;                                \t  ","arguments":[{"name":"COV","optional":true,"description":"specifies the name of the data table in which to store the covariance matrix for all input variables.","help":"COV|OUTCOV=*table*","type":"dataSet"},{"name":"MEAN","optional":true,"description":"specifies the name of the data table in which to store the for all input variables.","help":"MEAN|OUTMEAN=*table*","type":"dataSet"},{"name":"OUT=","optional":true,"description":"specifies the name of the data table in which to store the Mahalnobis distances for each observation during training. This table will also store the BY and ID variables (if any), the INPUT variables, the normalized and unnormalized Mahalnobis distances and an indicator column that signals whether an observation was included in training","help":"OUT=*table*","type":"dataSet"},{"name":"SCOREINFO","optional":true,"description":"names the output data table in which to store scoring information, such as names of input variables and a rank of the covariance matrix","help":"SCOREINFO|SCORE|SI=*table*","type":"dataSet"},{"name":"STAT","optional":true,"description":"names the output data table in which to store the summary status of the training. The table has the following columns: BY-group variable (if specified), number of observations read from the input data, number of observations used by MTS training, training status, status message to collect any warning or error messages during the training, and internal return code.","help":"STAT|OUTSTAT=*table*","type":"dataSet"}]},{"name":"SAVESTATE","description":"The SAVESTATE statement creates a data-only analytic store for the model and saves it as a binary object in a data table. You can use the analytic store in the MTSSCORE procedure for fault detection and diagnostics.","help":"SAVESTATE  RSTORE=*table*;                     "}]}