{"name":"NESTED","statements":[{"name":"PROC NESTED","description":"The NESTED procedure performs random-effects analysis of variance for data from an experiment with a nested (hierarchical) structure. † Note that PROC NESTED is appropriate for models with only classification effects; it does not handle models that contain continuous covariates. For random effects models with covariates, use either the GLM or MIXED procedure.","help":"PROC NESTED <AOV> <DATA=SAS-data-set>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCLASS <TRUNCATE> ;\n    \n\tVAR variables ;\n","arguments":[{"name":"AOV","optional":true,"description":"Displays only the analysis of variance statistics when there is more than one dependent variable. The \"analysis of covariation\" statistics are suppressed","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be used by PROC NESTED. By default, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","aliases":["CLASSES"],"description":"You must include a CLASS statement with PROC NESTED specifying the classification variables for the analysis.","help":"CLASS &lt;TRUNCATE&gt; ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined by using no more than the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"VAR","description":"The VAR statement lists the dependent variables for the analysis. The dependent variables must be numeric variables. If you do not specify a VAR statement, PROC NESTED performs an analysis of variance for all numeric variables in the data set, except those already specified in the CLASS statement.","help":"VAR variables "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_026","docsetTargetFile":"statug_nested_toc.htm"}}