{"name":"NPAR1WAY","statements":[{"name":"PROC NPAR1WAY","description":"PROC NPAR1WAY performs tests for location and scale differences based on the following scores of a response variable: Wilcoxon, median, Van der Waerden (normal), Savage, Siegel-Tukey, Ansari-Bradley, Klotz, Mood, and Conover. Additionally, PROC NPAR1WAY provides tests that use the raw input data as scores. When the data are classified into two samples, tests are based on simple linear rank statistics. When the data are classified into more than two samples, tests are based on one-way ANOVA statistics. Both asymptotic and exact p-values are available for these tests. PROC NPAR1WAY also provides Hodges-Lehmann estimation, including exact confidence limits for the location shift. † PROC NPAR1WAY computes empirical distribution function (EDF) statistics, which test whether the distribution of a variable is the same across different groups. These include the Kolmogorov-Smirnov test, the Cramer-von Mises test, and, when the data are classified into only two samples, the Kuiper test. Exact p-values are available for the two-sample Kolmogorov-Smirnov test.","help":"PROC NPAR1WAY <AB < (ADJUST) >> <ADJUST> <ALIGN=STRATA < (option)>> <ALPHA=α> <ANOVA> <CONOVER> <CORRECT=NO> <D> <DATA=SAS-data-set> <DSCF> <EDF> <FP < (REFCLASS = class-number | 'class-value' ) >> <HL < (REFCLASS = class-number | 'class-value' ) >> <KLOTZ < (ADJUST)>> <MEDIAN> <MISSING> <MOOD < (ADJUST)>> <NOPRINT> <PLOTS=ABBOXPLOT | ANOVABOXPLOT|ANOVA | CONOVERBOXPLOT|CONOVER... > <SAVAGE> <SCORES=DATA> <ST < (ADJUST)>> <VW> <WILCOXON>;     \n\tBY variables;     \n\tCLASS variable ;     \n\tEXACT AB CONOVER HL ...; \n   \n\tFREQ variable;     \n\tOUTPUT <AB> <ANOVA> <OUT=SAS-data-set> ...; \n   \n\tSTRATA <MEDIAN> <RANKS=<STRATUM | OVERALL>> <SAVAGE> ...; \n   \n\tVAR variables ; ","arguments":[{"name":"AB=","optional":true,"description":"Requests an analysis of Ansari-Bradley scores.","help":"AB=ADJUST","type":"choice","arguments":[{"name":"ADJUST","type":"standalone"}]},{"name":"ADJUST","optional":true,"description":"Adjusts for location differences among classes before performing tests for scale differences. The ADJUST option applies to the following analyses: Ansari-Bradley (AB), Klotz (KLOTZ), Mood (MOOD), and Siegel-Tukey (ST). If you specify the ADJUST option, PROC NPAR1WAY subtracts the corresponding class median from each observation before scoring the data and performing the scale tests that you request.","type":"standalone"},{"name":"ALIGN=","optional":true,"description":"Aligns the response variable values by strata (Hodges and Lehmann 1962; Mehrotra, Lu, and Li 2010) before performing the analyses that you request. You can specify one of the following options:","help":"ALIGN=STRATA","type":"value"},{"name":"ALPHA=","optional":true,"description":"Specifies the level of the confidence limits for location shift, which you request with the HL option. The value of α must be between 0 and 1, and the default is 0.05.","type":"value"},{"name":"ANOVA","optional":true,"description":"Requests a standard analysis of variance on the raw data.","type":"standalone"},{"name":"CONOVER","optional":true,"description":"[Requests an analysis of Conover scores.","type":"standalone"},{"name":"CORRECT=","optional":true,"description":"Suppresses the continuity correction for the Wilcoxon two-sample test and the Siegel-Tukey two-sample test.","help":"CORRECT=NO","type":"value"},{"name":"D","optional":true,"description":"Requests the one-sided Kolmogorov-Smirnov D+ and D- statistics and their asymptotic p-values, in addition to the two-sided D statistic produced by the EDF option for two-sample data.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be analyzed by PROC NPAR1WAY. If you omit the DATA= option, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DSCF","optional":true,"description":"Requests the Dwass, Steel, Critchlow-Fligner multiple comparison procedure, which is based on pairwise two-sample rankings. This procedure is available for multisample data, where the number of CLASS variable levels is greater than 2.","type":"standalone"},{"name":"EDF","optional":true,"aliases":["KS"],"description":"Requests statistics based on the empirical distribution function. These include the Kolmogorov-Smirnov and Cramer-von Mises tests and, if there are only two classification levels, the Kuiper test.","type":"standalone"},{"name":"FP=","optional":true,"description":"Requests the Fligner-Policello test for two-sample data.","help":"FP=REFCLASS=","type":"choice","arguments":[{"name":"REFCLASS=","type":"value"}]},{"name":"HL=","optional":true,"description":"Requests Hodges-Lehmann estimation of the location shift for two-sample data. The HL option provides asymptotic confidence limits for the location shift. These are sometimes known as Moses confidence limits. You can specify the level of the confidence limits by using the ALPHA= option. The default of ALPHA=0.5 produces 95% confidence limits for the location shift. The REFCLASS= option specifies which of the two CLASS variable levels (samples) to use as the reference class X for the location shift, Y – X. REFCLASS=1 refers to the first class that is listed in the “Wilcoxon Scores” table, and REFCLASS=2 refers to the second class listed. The table displays class levels in the order in which they appear in the input data set. REFCLASS=class-value identifies the reference class by the formatted value of the CLASS variable.","help":"HL=REFCLASS=","type":"choice","arguments":[{"name":"REFCLASS=","type":"value"}]},{"name":"KLOTZ=","optional":true,"description":"Requests an analysis of Klotz scores. If you specify the ADJUST option, PROC NPAR1WAY subtracts the corresponding class median from each observation before performing the analysis.","help":"KLOTZ=ADJUST","type":"choice","arguments":[{"name":"ADJUST","type":"standalone"}]},{"name":"MEDIAN","optional":true,"description":"Requests an analysis of median scores.","type":"standalone"},{"name":"MISSING","optional":true,"description":"Treats missing values of the CLASS variable as a valid class level.","type":"standalone"},{"name":"MOOD","optional":true,"description":"Requests an analysis of Mood scores. If you specify the ADJUST option, PROC NPAR1WAY subtracts the corresponding class median from each observation before performing the analysis.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output.","type":"standalone"},{"name":"PLOTS=","optional":true,"description":"Requests plots for PROC NPAR1WAY to produce by using ODS Graphics. When you specify only one plot-request, you can omit the parentheses around the request. Syntax: (1) PLOTS < ( global-plot-options ) > < = plot-request < (plot-option) > > (2) PLOTS < ( global-plot-options ) > < = ( plot-request < (plot-option) > <...plot-request < (plot-option) >> )> The following global-plot-options are available with the PLOTS= option: NOSTATS suppresses the p-values that are displayed on the plots by default. ONLY suppresses the default plots and requests only the plots specified as plot-requests.","help":"PLOTS=ABBOXPLOT | ANOVABOXPLOT | CONOVERBOXPLOT | DATASCORESBOXPLOT | EDFPLOT | FPBOXPLOT | KLOTZBOXPLOT | MEDIANPLOT | MOODBOXPLOT | NONE | SAVAGEBOXPLOT | STBOXPLOT | VWBOXPLOT | WILCOXONBOXPLOT | ALL","type":"choice","arguments":[{"name":"ABBOXPLOT","description":"Requests a box plot of Ansari-Bradley scores.","type":"standalone"},{"name":"ANOVABOXPLOT","aliases":["ANOVA"],"description":"Requests a box plot of the raw data.","type":"standalone"},{"name":"CONOVERBOXPLOT","aliases":["CONOVER"],"description":"Requests a box plot of Conover scores.","type":"standalone"},{"name":"DATASCORESBOXPLOT","aliases":["DATASCORES"],"description":"Requests a box plot of raw data scores.","type":"standalone"},{"name":"EDFPLOT","aliases":["EDF"],"description":"Requests an empirical distribution plot.","type":"standalone"},{"name":"FPBOXPLOT","aliases":["FP"],"description":"Requests a box plot of Fligner-Policello placements.","type":"standalone"},{"name":"KLOTZBOXPLOT","aliases":["KLOTZ"],"description":"Requests a box plot of Klotz scores.","type":"standalone"},{"name":"MEDIANPLOT","aliases":["MEDIAN"],"description":"Requests a stacked bar chart showing the frequencies above and below the overall median.","type":"standalone"},{"name":"MOODBOXPLOT","aliases":["MOOD"],"description":"Requests a box plot of Mood scores.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"SAVAGEBOXPLOT","aliases":["SAVAGE"],"description":"Requests a box plot of Savage scores.","type":"standalone"},{"name":"STBOXPLOT","aliases":["ST"],"description":"Requests a box plot of Siegel-Tukey scores.","type":"standalone"},{"name":"VWBOXPLOT","aliases":["VW","NORMALBOXPLOT","NORMAL"],"description":"Requests a box plot of Van der Waerden (normal) scores.","type":"standalone"},{"name":"WILCOXONBOXPLOT","aliases":["WILCOXON"],"description":"Requests a box plot of Wilcoxon scores.","type":"standalone"},{"name":"ALL","description":"Requests all plots associated with the specified analyses.","type":"standalone"}]},{"name":"SAVAGE","optional":true,"description":"Requests an analysis of Savage scores.","type":"standalone"},{"name":"SCORES=","optional":true,"aliases":["PERM"],"description":"Requests an analysis that uses input data as scores. This option gives you the flexibility to construct any scores for your data with the DATA step and then analyze these scores with PROC NPAR1WAY.","help":"SCORES=DATA","type":"value"},{"name":"ST=","optional":true,"description":"Requests an analysis of Siegel-Tukey scores. If you specify the ADJUST option, PROC NPAR1WAY subtracts the corresponding class median from each observation before performing the analysis.","help":"ST=ADJUST","type":"choice","arguments":[{"name":"ADJUST","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC NPAR1WAY to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY variables"},{"name":"CLASS","description":"The CLASS statement, which is required, names one and only one classification variable. The variable can be character or numeric. The variable can be character or numeric. The CLASS variable identifies groups (or samples) in the data, and PROC NPAR1WAY provides analyses to examine differences among these groups. There can be two or more groups in the data.","help":"CLASS variable "},{"name":"EXACT","description":"The EXACT statement requests exact tests or confidence limits for the specified statistics.","help":"EXACT AB CONOVER HL ...","arguments":[{"name":"AB","description":"Requests an exact Ansari-Bradley test.","type":"standalone"},{"name":"CONOVER","description":"Requests an exact Conover test.","type":"standalone"},{"name":"HL","description":"Requests exact Hodges-Lehmann confidence limits for the location shift for two-sample data.","type":"standalone"},{"name":"KLOTZ","description":"Requests an exact Klotz test.","type":"standalone"},{"name":"KS","aliases":["EDF"],"description":"Requests an exact Kolmogorov-Smirnov two-sample test.","type":"standalone"},{"name":"MEDIAN","description":"Requests an exact median test.","type":"standalone"},{"name":"MOOD","description":"Requests an exact Mood test.","type":"standalone"},{"name":"SAVAGE","description":"Requests an exact Savage test.","type":"standalone"},{"name":"SCORES=","description":"Requests an exact test that uses the input data as scores. For two-sample data, the test is based on the rank-sum statistic. For multisample data, the test is based on the one-way ANOVA statistic.","help":"SCORES=DATA","type":"value"},{"name":"ST","description":"Requests an exact Siegel-Tukey test.","type":"standalone"},{"name":"VW","aliases":["NORMAL"],"description":"Requests an exact Van der Waerden (normal scores) test.","type":"standalone"},{"name":"WILCOXON","description":"Requests an exact Wilcoxon test. When the data consist of two classification levels (samples), the exact test is based on the Wilcoxon rank-sum statistic. When the data consist of more than two levels (multisample data), the exact test is based on the one-way ANOVA statistic for Wilcoxon scores, which is the Kruskal-Wallis statistic.","type":"standalone"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the level of the confidence limits for Monte Carlo p-value estimates.","type":"value"},{"name":"MAXTIME=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum clock time (in seconds) that PROC FREQ can use to compute an exact p-value.","help":"MAXTIME=*value*","type":"value"},{"name":"MC","optional":true,"followsDelimiter":"/","description":"Requests Monte Carlo estimation of exact p-values instead of direct exact p-value computation.","type":"standalone"},{"name":"MIDP","optional":true,"followsDelimiter":"/","description":"Requests exact mid p-values for the exact tests. The exact mid p-value is defined as the exact p-value minus half the exact point probability. For two-sample data, PROC NPAR1WAY provides exact mid p-values for the one-sided tests of the linear rank statistics. For multisample data, PROC NPAR1WAY provides exact mid p-values for the one-way ANOVA tests.","type":"standalone"},{"name":"N=","optional":true,"followsDelimiter":"/","description":"Specifies the number of samples for Monte Carlo estimation.","help":"N=*n*","type":"value"},{"name":"PFORMAT=","optional":true,"followsDelimiter":"/","description":"Specifies the display format for exact p-values. PROC NPAR1WAY applies this format to one- and two-sided exact p-values, exact point probabilities, and exact mid p-values. By default, PROC NPAR1WAY displays exact p-values in the PVALUE6.4 format. You can provide a format-name or you can specify PFORMAT=EXACT to control the format of exact p-values. The value of format-name can be any standard SAS numeric format or a user-defined format. The format length must not exceed 24.","type":"value"},{"name":"POINT","optional":true,"followsDelimiter":"/","description":"Requests exact point probabilities for the test statistics.","type":"standalone"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the initial seed for random number generation for Monte Carlo estimation.","type":"value"}]},{"name":"FREQ","description":"The FREQ statement names a numeric variable that provides a frequency for each observation in the input data set. If you use a FREQ statement, PROC NPAR1WAY assumes that an observation occurs n times, where n is the value of the FREQ variable for the observation.","help":"FREQ variable"},{"name":"OUTPUT","description":"The OUTPUT statement creates a SAS data set that contains statistics that PROC NPAR1WAYcomputes.","help":"OUTPUT &lt;AB&gt; &lt;ANOVA&gt; &lt;OUT=SAS-data-set&gt; ...","arguments":[{"name":"AB","optional":true,"description":"Includes statistics from the Ansari-Bradley analysis in the output data set. The AB option in the PROC NPAR1WAY statement requests analysis of Ansari-Bradley scores.","type":"standalone"},{"name":"ANOVA","optional":true,"description":"Includes analysis of variance statistics in the output data set. The ANOVA option in the PROC NPAR1WAY statement requests a standard analysis of variance for the raw data.","type":"standalone"},{"name":"CONOVER","optional":true,"description":"Includes statistics from the Conover analysis in the output data set. The CONOVER option in the PROC NPAR1WAY statement requests analysis of Conover scores.","type":"standalone"},{"name":"EDF","optional":true,"aliases":["KS"],"description":"Includes empirical distribution function statistics in the output data set. The EDF option in the PROC NPAR1WAY statement requests computation of these statistics, which include the Kolmogorov-Smirnov test, the Cramér–von Mises test, and the Kuiper test for two sample-data.","type":"standalone"},{"name":"FP","optional":true,"description":"Includes the Fligner-Policello test in the output data set. The FP option in the PROC NPAR1WAY statement requests the Fligner-Policello test, which is available for two-sample data.","type":"standalone"},{"name":"HL","optional":true,"description":"Includes the Hodges-Lehmann estimate and confidence limits in the output data set. The HL option in the PROC NPAR1WAY statement requests Hodges-Lehmann estimation, which is available for two-sample data.","type":"standalone"},{"name":"KLOTZ","optional":true,"description":"Includes statistics from the Klotz analysis in the output data set. The KLOTZ option in the PROC NPAR1WAY statement requests analysis of Klotz scores.","type":"standalone"},{"name":"MEDIAN","optional":true,"description":"Includes statistics from the median analysis in the output data set. The MEDIAN option in the PROC NPAR1WAY statement requests analysis of median scores.","type":"standalone"},{"name":"MOOD","optional":true,"description":"Includes statistics from the Mood analysis in the output data set. The MOOD option in the PROC NPAR1WAY statement requests analysis of Mood scores.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Names the output data set. If you omit the OUT= option, the data set is named DATAn, where n is the smallest integer that makes the name unique.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"SAVAGE","optional":true,"description":"Includes statistics from the Savage analysis in the output data set. The SAVAGE option in the PROC NPAR1WAY statement requests analysis of SAVAGE scores.","type":"standalone"},{"name":"SCORES=","optional":true,"description":"Includes statistics from the analysis of data scores in the output data set. The SCORES=DATA option in the PROC NPAR1WAY statement requests an analysis that uses the raw input data as scores.","help":"SCORES=DATA","type":"value"},{"name":"ST","optional":true,"description":"Includes statistics from the Siegel-Tukey analysis in the output data set. The ST option in the PROC NPAR1WAY statement requests analysis of Siegel-Tukey scores.","type":"standalone"},{"name":"VW","optional":true,"aliases":["NORMAL"],"description":"Includes statistics from the Van der Waerden (normal scores) analysis in the output data set. The VW (NORMAL) option in the PROC NPAR1WAY statement requests analysis of Van der Waerden scores.","type":"standalone"},{"name":"WILCOXON","optional":true,"description":"Includes statistics from the Wilcoxon analysis in the output data set. The WILCOXON option in the PROC NPAR1WAY statement requests analysis of Wilcoxon scores. For two-sample data, this analysis includes the Wilcoxon rank-sum test. For all data (two-sample and multisample), the analysis includes the Kruskal-Wallis test.","type":"standalone"}]},{"name":"STRATA","description":"The STRATA statement names one or more variables that define the strata. The levels of the STRATA variables combine to form the strata, which are nonoverlapping subgroups.","help":"STRATA &lt;MEDIAN&gt; &lt;RANKS=&lt;STRATUM | OVERALL&gt;&gt; &lt;SAVAGE&gt; ...","arguments":[{"name":"MEDIAN","optional":true,"followsDelimiter":"/","description":"Requests a stratified analysis of median scores.","type":"standalone"},{"name":"RANKS=","optional":true,"followsDelimiter":"/","description":"Specifies the type of ranking to be used for stratified analysis. RANKS=STRATUM ranks (and scores) the observations separately within each stratum. RANKS=OVERALL ranks (and scores) the observations overall (without regard to stratum classification) before stratified analysis is performed. By default, RANKS=STRATUM.","help":"RANKS=STRATUM | OVERALL","type":"choice","arguments":[{"name":"STRATUM","followsDelimiter":"/","description":"RANKS=STRATUM ranks (and scores) the observations separately within each stratum. This is the default.","type":"standalone"},{"name":"OVERALL","followsDelimiter":"/","description":"RANKS=OVERALL ranks (and scores) the observations overall (without regard to stratum classification) before stratified analysis is performed.","type":"standalone"}]},{"name":"SAVAGE","optional":true,"followsDelimiter":"/","description":"Requests a stratified analysis of Savage scores.","type":"standalone"},{"name":"SCORES=","optional":true,"followsDelimiter":"/","description":"Requests a stratified analysis of the raw (unscored) values of the analysis variable. This option enables you to construct any scores for your data (for example, by using the DATA step) and analyze the scores by using PROC NPAR1WAY.","type":"value"},{"name":"VW","optional":true,"followsDelimiter":"/","aliases":["NORMAL"],"description":"Requests a stratified analysis of Van der Waerden (normal) scores.","type":"standalone"},{"name":"WEIGHTS=","optional":true,"followsDelimiter":"/","description":"Specifies the stratum weights for stratified analysis. WEIGHTS=STRATUM weights the stratum statistics by stratum size; the weight of stratum i is 1/(n_i+1), where n_i is the number of observations (frequency) in stratum i. WEIGHTS=EQUAL weights the stratum statistics equally; the weight of each stratum is 1.","help":"WEIGHTS=STRATUM | EQUAL","type":"choice","arguments":[{"name":"STRATUM","followsDelimiter":"/","description":"WEIGHTS=STRATUM weights the stratum statistics by stratum size; the weight of stratum i is 1/(n_i+1), where n_i is the number of observations (frequency) in stratum i.","type":"standalone"},{"name":"EQUAL","followsDelimiter":"/","description":"WEIGHTS=EQUAL weights the stratum statistics equally; the weight of each stratum is 1.","type":"standalone"}]},{"name":"WILCOXON","optional":true,"followsDelimiter":"/","description":"Requests a stratified analysis of Wilcoxon scores.","type":"standalone"}]},{"name":"VAR","description":"The VAR statement names the response (dependent) variables to be included in the analysis. These variables must be numeric.","help":"VAR variables "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_026","docsetTargetFile":"statug_npar1way_toc.htm"}}