{"name":"OPTBINNING","statements":[{"name":"PROC OPTBINNING","description":"The OPTBINNING procedure is an enhancement of a traditional binning algorithm for fitting a credit scoring model. Credit scoring can be defined as a statistical modeling technique that is used to assign risk to credit applicants or to existing credit accounts.","help":"PROC OPTBINNING ADJUSTFACTOR=numberDATA=libref.data-tableLOGLEVEL=0|1MAXTIME=numberOUTPUT=libref.data-tablePARAM=libref.data-tablePRINTLEVEL=numberSTATUS=libref.data-table ;\n\tCode File=filename  ;\n\tSAVESTATE RSTORE=libref.data-table;","arguments":[{"name":"ADJUSTFACTOR=","optional":true,"description":"specifies the adjustment factor for WOE. Its range is [0, 10]. By default, ADJUSTFACTOR = 0.5.","help":"ADJUSTFACTOR=*number*","type":"value"},{"name":"DATA=","optional":true,"description":"names the input data table for PROC OPTBINNING to use. The default is the most recently created data table. libref.data-table is a two-level name, where libref refers to a collection of information that is defined in the LIBNAME statement and includes the library, which includes a path to the data, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement. For more information about libref, see the section Using CAS Sessions and CAS Engine Librefs. data-table specifies the name of the input data table.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"LOGLEVEL=","optional":true,"description":"controls the amount of information for the SAS log to display. You can specify the following values: 0 turns of the display. 1 displays the log. LOGLEVEL=0 will turn off all solver-related messages in SAS log. LOGLEVEL=1 will display solver-related messages, including the warnings and errors. By default, LOGLEVEL = 1.","help":"LOGLEVEL=0 | 1","type":"choice","arguments":[{"name":"0","type":"standalone"},{"name":"1","type":"standalone"}]},{"name":"MAXTIME=","optional":true,"description":"specifies an upper limit of number of seconds of run time. By default, MAXTIME = 100.","help":"MAXTIME=*number*","type":"value"},{"name":"OUTPUT=","optional":true,"description":"names the output data table. It is optional. When you specify PRINTLEVEL=2, the ODS table Output is displayed. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table. For more information about this two-level name, see the section Using CAS Sessions and CAS Engine Librefs.","help":"OUTPUT=*libref.data-table*","type":"dataSet"},{"name":"PARAM=","optional":true,"description":"names the parameter input data table. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the input data table. For more information about this two-level name, see the section Using CAS Sessions and CAS Engine Librefs.","help":"PARAM=*libref.data-table*","type":"dataSet"},{"name":"PRINTLEVEL=","optional":true,"description":"specifies the ODS table display level. Its range is [0, 2]. When the value is positive, it displays the summary of the output tables. When PRINTLEVEL=2, it displays the OUTPUT and STATUS ODS tables. By default, PRINTLEVEL = 1.","help":"PRINTLEVEL=*number*","type":"value"},{"name":"STATUS=","optional":true,"description":"names the status output data table. It is optional. When you specify PRINTLEVEL=2, the ODS table Status is displayed. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table. For more information about this two-level name, see the section Using CAS Sessions and CAS Engine Librefs.","help":"STATUS=*libref.data-table*","type":"dataSet"}]},{"name":"CODE","description":"The CODE statement generates SAS DATA step code and stores it in a file that can be used for scoring. The CODE statement is optional. Another, preferable way to save the scoring model is by using an analytic store. For more information, see the section SAVESTATE Statement.","help":"Code *FILE=filename*;","arguments":[{"name":"FILE=","description":"specifies the name of the file to write the SAS scoring code to.","help":"FILE=*filename*","type":"value"}]},{"name":"SAVESTATE","description":"The SAVESTATE statement creates an analytic store for the model and saves it as a binary object in a data table. You can use the analytic store in the ASTORE procedure to score new data. For more information, see Chapter 4, ASTORE Procedure.The SAVESTATE statement is optional.","help":"SAVESTATE *RSTORE=libref.data-table*;","arguments":[{"name":"RSTORE=","description":"specifies a data table in which to save the analytic store for the model. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table. For more information about this two-level name, see the DATA= option and the section Using CAS Sessions and CAS Engine Librefs.","help":"RSTORE=*libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"latest","docsetTargetFile":"casml_optbinning_toc.htm"}}