{"name":"OPTQP","statements":[{"name":"PROC OPTQP","description":"The OPTQP procedure solves quadratic programs - problems with quadratic objective function and a collection of linear constraints, including lower and/or upper bounds on the decision variables.","help":"PROC OPTQP <DATA=SAS-data-set> <DUALITYGAP=δ> <DUALOUT=SAS-data-set> <DUALTOL=β | OPTTOL=β> <IIS=FALSE | TRUE> <LOGFREQ=k | PRINTFREQ=k> <LOGLEVEL=NONE | BASIC | MODERATE... > <MAXITER=k> <MAXTIME=k> <NTHREADS=k | NUMTHREADS=k> <OBJSENSE=MIN | MAX> <PRESOLVER=NONE | AUTOMATIC | BASIC... > <PRIMALOUT=SAS-data-set> <PRIMALTOL=α | FEASTOL=α> <PRINTLEVEL=0 | 1 | 2> <SAVE_ONLY_IF_OPTIMAL> <STOP_DG=δ> <STOP_DI=β> <STOP_PI=α> <TIMETYPE=CPU | REAL>;     \n\tPERFORMANCE <DETAILS> <NTHREADS=<<num> | CPUCOUNT>> <PARALLELMODE=<DETERMINISTIC|0 | NONDETERMINISTIC|1>> ...; ","arguments":[{"name":"DATA=","optional":true,"aliases":["TABLE=","INSTANCE="],"description":"Specifies the input SAS data set. This data set can also be created from a QPS-format flat file by using the SAS macro %MPS2SASD. If the DATA= option is not specified, PROC OPTQP uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DUALITYGAP=","optional":true,"description":"Specifies the desired relative duality gap, δ ϵ [1E–9, 1E–4]. This is the relative difference between the primal and dual objective function values and is the primary solution quality parameter.","type":"value"},{"name":"DUALOUT=","optional":true,"aliases":["DOUT="],"description":"Specifies the output data set containing the dual solution.","help":"DUALOUT=*SAS-data-set*","type":"dataSet"},{"name":"DUALTOL=","optional":true,"aliases":["OPTOL="],"description":"Specifies the maximum relative dual constraints violation, β ϵ [1E–9, 1E–4].","type":"value"},{"name":"IIS=","optional":true,"description":"Specifies whether to attempt to identify a set of constraints and variables that form an irreducible infeasible set (IIS).","help":"IIS=FALSE | TRUE","type":"choice","arguments":[{"name":"FALSE","description":"Disables IIS detection.","type":"standalone"},{"name":"TRUE","description":"Enables IIS detection.","type":"standalone"}]},{"name":"LOGFREQ=","optional":true,"aliases":["PRINTFREQ="],"description":"Specifies that the printing of the solution progress to the iteration log should occur after every k iterations. The print frequency, k, is an integer between zero and the largest four-byte, signed integer, which is 2³¹ - 1. The value k = 0 disables the printing of the progress of the solution. The default value of this option is 1.","type":"value"},{"name":"LOGLEVEL=","optional":true,"aliases":["PRINTLEVEL2="],"description":"Controls the amount of information that is displayed in the SAS log.","help":"LOGLEVEL=NONE | BASIC | MODERATE | AGGRESSIVE","type":"choice","arguments":[{"name":"NONE","description":"Turns off all solver-related messages in SAS log.","type":"standalone"},{"name":"BASIC","description":"Displays a solver summary after stopping.","type":"standalone"},{"name":"MODERATE","description":"Prints a solver summary and an iteration log by using the interval dictated by the LOGFREQ= option.","type":"standalone"},{"name":"AGGRESSIVE","description":"Prints a detailed solver summary and an iteration log by using the interval dictated by the LOGFREQ= option.","type":"standalone"}]},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of predictor-corrector iterations performed by the interior point algorithm. The value k is an integer between 1 and the largest four-byte, signed integer, which is 2³¹ - 1. If you do not specify this option, the procedure does not stop based on the number of iterations performed.","help":"MAXITER=*k*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies an upper limit of t seconds of time for reading in the data and performing the optimization process. The value of the TIMETYPE= option determines the type of units used. If you do not specify this option, the procedure does not stop based on the amount of time elapsed. The value of t can be any positive number; the default value is the positive number that has the largest absolute value that can be represented in your operating environment.","help":"MAXTIME=*k*","type":"value"},{"name":"NTHREADS=","optional":true,"aliases":["NUMTHREADS="],"description":"Specifies the number of threads that PROC OPTQP can use, where k can be any integer between 1 and 256, inclusive. This option overrides the THREADS | NOTHREADS SAS system option. The default value of this option is the value of the CPUCOUNT= SAS system option.","type":"value"},{"name":"OBJSENSE=","optional":true,"description":"Specifies whether the QP model is a minimization or a maximization problem. You specify OBJSENSE= MIN for a minimization problem and OBJSENSE=MAX for a maximization problem. Alternatively, you can specify the objective sense in the input data set. If the objective sense is specified differently in these two places, this option supersedes the objective sense specified in the input data set. If the objective sense is not specified anywhere, then PROC OPTQP interprets and solves the quadratic program as a minimization problem.","help":"OBJSENSE=MIN | MAX*option*","type":"value","arguments":[{"name":"MIN","description":"For a minimization problem.","type":"standalone"},{"name":"MAX","description":"For a maximization problem.","type":"standalone"}]},{"name":"PRESOLVER=","optional":true,"aliases":["PRESOL="],"description":"Specifies a presolve option.","help":"PRESOLVER=NONE | AUTOMATIC | BASIC | MODERATE | AGGRESSIVE","type":"choice","arguments":[{"name":"NONE","description":"Disables the presolver.","type":"standalone"},{"name":"AUTOMATIC","description":"Applies the presolver by using default setting.","type":"standalone"},{"name":"BASIC","description":"Applies the basic presolver.","type":"standalone"},{"name":"MODERATE","description":"Applies the moderate presolver.","type":"standalone"},{"name":"AGGRESSIVE","description":"Applies the aggressive presolver.","type":"standalone"}]},{"name":"PRIMALOUT=","optional":true,"aliases":["POUT="],"description":"Specifies the output data set containing the primal solution.","help":"PRIMALOUT=*SAS-data-set*","type":"dataSet"},{"name":"PRIMALTOL=","optional":true,"aliases":["FEASTOL="],"description":"Specifies the maximum relative bound and primal constraints violation, α ϵ [1E–9, 1E–4].","type":"value"},{"name":"PRINTLEVEL=","optional":true,"description":"Specifies whether a summary of the problem and solution should be printed.","help":"PRINTLEVEL=0 | 1 | 2","type":"choice","arguments":[{"name":"0","description":"Does not produce or print any ODS tables.","type":"standalone"},{"name":"1","description":"Produces and prints the following ODS tables: ProblemSummary, SolutionSummary, and optional OutputCasTables.","type":"standalone"},{"name":"2","description":"Produces and prints the following ODS tables: ProblemSummary, SolutionSummary, ProblemStatistics, Timing, and optional OutputCasTables.","type":"standalone"}]},{"name":"SAVE_ONLY_IF_OPTIMAL","optional":true,"description":"Specifies that the PRIMALOUT= and DUALOUT= data sets be saved only if the final solution obtained by the solver at termination is optimal. If the PRIMALOUT= or DUALOUT= option is specified, and this option is not specified, then the output data sets will only contain solution values at optimality. If the SAVE_ONLY_IF_OPTIMAL option is not specified, the output data sets will not contain an intermediate solution.","type":"standalone"},{"name":"STOP_DG=","optional":true,"description":"Specifies the desired relative duality gap, δ Є[1E–9, 1E–4]. This is the relative difference between the primal and dual objective function values and is the primary solution quality parameter. The default value is 1E–6.","type":"value"},{"name":"STOP_DI=","optional":true,"description":"Specifies the maximum allowed relative dual constraints violation, β Є[1E–9, 1E–4]. The default value is 1E–6.","type":"value"},{"name":"STOP_PI=","optional":true,"description":"Specifies the maximum allowed relative bound and primal constraints violation, α Є[1E–9, 1E–4]. The default value is 1E–6.","type":"value"},{"name":"TIMETYPE=","optional":true,"description":"Specifies whether CPU time or real time is used for the MAXTIME= option and the _OROPTQP_ macro variable in a PROC OPTQP call.","help":"TIMETYPE=CPU | REAL","type":"choice","arguments":[{"name":"CPU","description":"Specifies that units are in CPU time.","type":"standalone"},{"name":"REAL","description":"Specifies that units are in real time.","type":"standalone"}]}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement defines performance parameters for multithreaded and distributed computing, passes variables about the distributed computing environment, and requests detailed results about the performance characteristics of a High-Performance Analytics procedure. With the PERFORMANCE statement, you can also control whether the HPNLIN procedure executes in SMP or MPP mode.","help":"PERFORMANCE &lt;DETAILS&gt; &lt;NTHREADS=&lt;&lt;num&gt; | CPUCOUNT&gt;&gt; &lt;PARALLELMODE=&lt;DETERMINISTIC|0 | NONDETERMINISTIC|1&gt;&gt; ...","arguments":[{"name":"DETAILS","optional":true,"description":"Requests that the procedure produce the Timing ODS table. This table shows a breakdown of the time used in each step of the procedure.","type":"standalone"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads that a procedure can use. It overrides the SAS system option THREADS | NOTHREADS. The value of number can be any integer between 1 and 256 inclusive. The default value is CPUCOUNT, which sets the thread count to the number that is determined by the SAS system option CPUCOUNT=.","help":"NTHREADS=&lt;*num*&gt; | CPUCOUNT","type":"choice","arguments":[{"name":"num","placeholder":true,"description":"Replace <num> with an actual number. The value of number can be any integer between 1 and 256 inclusive. The default value is CPUCOUNT, which sets the thread count to the number that is determined by the SAS system option CPUCOUNT=.","type":"value"},{"name":"CPUCOUNT","description":"The default value is CPUCOUNT, which sets the thread count to the number that is determined by the SAS system option CPUCOUNT=","type":"standalone"}]},{"name":"PARALLELMODE=","optional":true,"description":"Specifies the parallel processing mode. This mode determines the solution results that are obtained from running the same model with the same option values on the same platform multiple times.","help":"PARALLELMODE=DETERMINISTIC | NONDETERMINISTIC","type":"choice","arguments":[{"name":"DETERMINISTIC","aliases":["0"],"description":"Requires algorithms to produce the same results every time.","type":"standalone"},{"name":"NONDETERMINISTIC","aliases":["1"],"description":"Permits algorithms to produce different solution results. This mode requires less synchronization and might attain better performance than DETERMINISTIC mode.","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"casmopt","docsetVersion":"v_024","docsetTargetFile":"casmopt_optqp_toc.htm"}}