{"name":"ORTHOREG","statements":[{"name":"PROC ORTHOREG","description":"The ORTHOREG procedure fits general linear models by the method of least squares. Other SAS/STAT software procedures, such as GLM and REG, fit the same types of models, but PROC ORTHOREG can produce more accurate estimates than other regression procedures when your data are ill conditioned. Instead of collecting crossproducts, PROC ORTHOREG uses Gentleman-Givens transformations to update and compute the upper triangular matrix R of the QR decomposition of the data matrix, with special care for scaling (Gentleman; 1972, 1973). This method has the advantage over other orthogonalization methods (for example, Householder transformations) of not requiring the data matrix to be stored in memory.","help":"PROC ORTHOREG <DATA=SAS-data-set> <NOPRINT> <ORDER=DATA | FORMATTED | FREQ... > <OUTEST=SAS-data-set> <SINGULAR=s>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <TRUNCATE> ; \n   \n\tEFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tEFFECTPLOT BOX CONTOUR FIT ...;     \n\tESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tLSMEANS <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tLSMESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tMODEL <NOINT> ; \n   \n\tSLICE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tSTORE <LABEL='label'> ; \n   \n\tTEST <CHISQ> <DDF=value-list> <E> ...; \n   \n\tWEIGHT variable ; ","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set to use. By default, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results. Note that this option temporarily disables the Output Delivery System (ODS).","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the order in which to sort the levels of the classification variables (which are specified in the CLASS statement).","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels sorted by the unformatted value.","type":"standalone"}]},{"name":"OUTEST=","optional":true,"description":"Produces an output data set containing the parameter estimates, the BY variables, and the special variables _TYPE_ (value \"PARMS\"), _NAME_ (blank), and _RMSE_ (root mean squared error).","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"SINGULAR=","optional":true,"description":"Specifies a singularity criterion (s ≥ 0) for the inversion of the triangular matrix R. By default, SINGULAR=10E-12.","help":"SINGULAR=*s*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC ORTHOREG to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the model. Typical classification variables are Treatment, Sex, Race, Group, and Replication. If you use the CLASS statement, it must appear before the MODEL statement.","help":"CLASS &lt;TRUNCATE&gt; ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined by using only up to the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"EFFECT","description":"The name of the effect is specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. The effect-type is specified after an equal sign, followed by a list of variables within parentheses which are used in constructing the effect. Effect-options that are specific to an effect-type can be specified after a slash (/) following the variable list. The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects formed from continuous or classification variables.","help":"EFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"EFFECT-NAME=","placeholder":true,"description":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. These values can be used: COLLECTION, LAG, MULTIMEMBER, POLYNOMIAL, or SPLINE.","type":"value"},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"EFFECTPLOT","description":"The EFFECTPLOT statement produces a display of the fitted model and provides options for changing and enhancing the displays.","help":"EFFECTPLOT BOX CONTOUR FIT ...","arguments":[{"name":"BOX=","description":"Displays a box plot of continuous response data at each level of a CLASS effect, with predicted values superimposed and connected by a line. This is an alternative to the INTERACTION plot-type.","help":"BOX=PLOTBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"CONTOUR=","description":"Displays a contour plot of predicted values against two continuous covariates.","help":"CONTOUR=PLOTBY= | X= | Y=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"},{"name":"Y=","type":"value"}]},{"name":"FIT=","description":"Displays a curve of predicted values versus a continuous variable.","help":"FIT=PLOTBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"INTERACTION=","description":"Displays a curve of predicted values versus a continuous variable grouped by the levels of a CLASS effect.","help":"INTERACTION=PLOTBY= | SLICEBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"SLICEBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"SLICEFIT=","description":"","help":"SLICEFIT=PLOTBY= | SLICEBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"SLICEBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the significance level, 0 ≥ value ≥ 1, for producing 100(1-value/2)% prediction and confidence limits. By default, value=0.05.","help":"ALPHA=*value*","type":"value"},{"name":"AT","optional":true,"followsDelimiter":"/","description":"where contopt= MEAN | MIN | MAX | MIDRANGE classopt= ALL | REF varopt= contopts | number-list | classopts | ’class-level’...’class-level’]","type":"standalone"},{"name":"ATLEN=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum length (1 < n < 256) of the levels of the AT variables that are displayed in footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed, and the continuous AT levels are displayed with a BEST format that has a width greater than or equal to 5, which distinguishes each level. Caution:If the levels of your AT variables are not unique when the first n characters are displayed, then the levels are combined in the plots but not in the underlying computations. Also, at most n characters for continuous AT variables are displayed.","help":"ATLEN=*n*","type":"value"},{"name":"ATORDER=","optional":true,"followsDelimiter":"/","description":"Uses the AT values for continuous variables in ascending or descending order as specified. By default, values are used in the order of their first appearance in the AT option.","help":"ATORDER=ASCENDING | DESCENDING","type":"choice","arguments":[{"name":"ASCENDING","followsDelimiter":"/","description":"Uses the AT values for continuous variables in ascending order","type":"standalone"},{"name":"DESCENDING","followsDelimiter":"/","description":"Uses the AT values for continuous variables in descending order","type":"standalone"}]},{"name":"CLI","optional":true,"followsDelimiter":"/","description":"Displays normal (Wald) prediction limits. This option is available only for normal distributions with identity links. If your model is from a Bayesian analysis, then sampling-based intervals are computed.","type":"standalone"},{"name":"CLM","optional":true,"followsDelimiter":"/","description":"Displays confidence limits. These are computed as the normal (Wald) confidence limits for the linear predictor, and if the ILINK option is specified, the limits are also back-transformed by the inverse link function. If your model is from a Bayesian analysis, then sampling-based intervals are computed.","type":"standalone"},{"name":"CLUSTER","optional":true,"followsDelimiter":"/","description":"Modifies the BOX and INTERACTION plot-types by displaying the levels of the SLICEBY= effect in a side-by-side fashion. You can specify percent as a percentage of half the distance between X levels. The percent value must be between 0.1 and 1; the default percent depends on the number of X levels, the number of SLICEBY levels, and the number of PLOTBY levels for INTERACTION plot-types. Default clustering can be removed by specifying the NOCLUSTER option.","type":"standalone"},{"name":"CONNECT","optional":true,"followsDelimiter":"/","description":"Modifies the BOX and INTERACTION plot-types by connecting the predicted values with a line. Default connecting lines can be removed by specifying the NOCONNECT option.","type":"standalone"},{"name":"EXTEND=","optional":true,"followsDelimiter":"/","description":"Extends continuous covariate axes by value x ½range in both directions, where range is the range of the X axis.","help":"EXTEND=DATA | &lt;*value*&gt;","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Displays curves to the range of the data within the appropriate SLICEBY=, PLOTBY=, and AT level.","type":"standalone"},{"name":"value","placeholder":true,"followsDelimiter":"/","description":"Replace <value> with an actual value.","type":"value"}]},{"name":"GRIDSIZE=","optional":true,"followsDelimiter":"/","description":"Specifies the resolution of curves by computing the predicted values at n equally spaced x-values and specifies the resolution of surfaces by computing the predicted values on an nxn grid of points. Default values are n=200 for curves and bands, n=50 for surfaces, and n=2 for lines. If results of a Bayesian or bootstrap analysis are being displayed, then the defaults are n=500000/B, where B is the number of samples, the upper limit is equal to the usual defaults, and the lower limit equal to 20.","help":"GRIDSIZE=*n*","type":"value"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Displays the fit on the scale of the inverse link function. In particular, the results are displayed on the probability scale for logistic regression. By default, a procedure displays the fit on either the link or inverse link scale.","type":"standalone"},{"name":"INDIVIDUAL","optional":true,"followsDelimiter":"/","description":"Displays individual probabilities for polytomous response models with cumulative links on the scale of the inverse link function. This option is not available when the LINK option is specified, and confidence limits are not available with this option.","type":"standalone"},{"name":"LIMITS","optional":true,"followsDelimiter":"/","description":"Invokes the CLI and CLM options.","type":"standalone"},{"name":"LINK","optional":true,"followsDelimiter":"/","description":"Displays the fit on the scale of the link function; that is, the linear predictor. Note that probabilities or observed proportions near 0 and 1 are transformed to . By default, a procedure displays the fit on either the link or inverse link scale.","type":"standalone"},{"name":"MOFF","optional":true,"followsDelimiter":"/","description":"Moves the offset for a Poisson regression model to the response side of the equation. If the ILINK option is also in effect, then the rate is displayed on the Y axis, while the LINK option displays the log of the rate on the Y axis. Without this option, the predicted values are computed and displayed only for the observations.","type":"standalone"},{"name":"NCOLS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of columns in a paneled plot. This option is not available with the BOX plot-type. The default choice of NROWS= and NCOLS= is based on the number of PLOTBY= and AT levels. If there is only one plot being displayed in a panel, then NROWS=1 and NCOLS=1 and the plots are produced as if you specified only the UNPACK option. If only two plots are displayed in a panel, then NROWS=1 and NCOLS=2. For all other cases, a 2x2, 2x3, or 3x3 panel is chosen based on how much of the last panel is used, with ties going to the larger panels. For example, if 14 plots are being created, then this requires either four 2x2 panels with 50% of the last panel filled, three 2x3 panels with 33% of the last panel filled, or two 3x3 panels with 55% of the last panel filled; in this case, the 3x3 panels are chosen.","help":"NCOLS=*n*","type":"value"},{"name":"NOCLI","optional":true,"followsDelimiter":"/","description":"Suppresses the prediction limits.","type":"standalone"},{"name":"NOCLM","optional":true,"followsDelimiter":"/","description":"Suppresses the confidence limits.","type":"standalone"},{"name":"NOLIMITS","optional":true,"followsDelimiter":"/","description":"Invokes the NOCLI and NOCLM options.","type":"standalone"},{"name":"NOOBS","optional":true,"followsDelimiter":"/","description":"Suppresses the display of observations and overrides the specification of the OBS= option.","type":"standalone"},{"name":"NROWS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of rows in a paneled plot. This option is not available with the BOX plot-type. See the NCOLS= option for more details.","help":"NROWS=*n*","type":"value"},{"name":"OBS=","optional":true,"followsDelimiter":"/","description":"Displays observations on the effect plots. An input data set is required; hence the OBS option is not available with PROC PLM. The OBS option is overridden by the NOOBS option. When the ILINK option is specified with binary response variables, then either the observed proportions or a coded value of the response is displayed. For polytomous response variables, the observed values are overlaid onto the fitted curves unless the LOCATION= option is specified. Whether observations are displayed by default or not depends upon the procedure. If the PLOTBY= option is specified, then the observations displayed on each plot are from the corresponding PLOTBY= level for classification effects; for continuous effects, all observations are displayed on every plot. The following options are available: BYAT -- subsets the observations by AT level and by the PLOTBY= level. CDISPLAY=NONE | OUTLINE | GRADIENT | OUTLINEGRADIENT controls the display of observations on contour plots. CGRADIENT=RESIDUAL | DEPENDENT specifies what the gradient-shading of the observed values on the CONTOUR plot-type represents. DEPTH=depth (you can specify 1 ≤ depth ≤ 100. By default, DEPTH=1) specifies the number of overlapping observations that can be distinguished by adjusting their transparency. DISTANCE displays observations on FIT plot-types with a color-gradient that indicates how far the observation is from the AT and PLOTBY= level. FITATCLASS -- computes fitted values only for class levels that are observed in the data set. FRINGE -- displays observations in a fringe (rug) plot at the bottom of the plot. JITTER<(FACTOR=factor SEED=seed X=x-jitter Y=y-jitter)> -- shifts (jitters) the observations. LABEL<=OBS> -- labels markers with their observation number.","help":"OBS=BYAT | CDISPLAY= | CGRADIENT= | DEPTH= | DISTANCE | FITATCLASS | FRINGE | JITTER | FACTOR= | SEED= | X= | Y= | LABEL | LABEL= | LOCATION=","type":"choice","arguments":[{"name":"BYAT","type":"standalone"},{"name":"CDISPLAY=","type":"value"},{"name":"CGRADIENT=","type":"value"},{"name":"DEPTH=","type":"value"},{"name":"DISTANCE","type":"standalone"},{"name":"FITATCLASS","type":"standalone"},{"name":"FRINGE","type":"standalone"},{"name":"JITTER","type":"standalone"},{"name":"FACTOR=","type":"value"},{"name":"SEED=","type":"value"},{"name":"X=","type":"value"},{"name":"Y=","type":"value"},{"name":"LABEL","type":"standalone"},{"name":"LABEL=","type":"value"},{"name":"LOCATION=","type":"value"}]},{"name":"PLOTBY=","optional":true,"followsDelimiter":"/","description":"Specifies a variable or CLASS effect at whose levels the predicted values are computed and the plots are displayed. You can specify the response variable as the effect for polytomous response models. The panel-type argument specifies the method in which the plots are grouped for the display. The following panel-types are available. COLUMNS specifies that the columns within each panel correspond to different levels of the PLOTBY= effect and hence the rows correspond to different AT levels. PACK specifies that plots be displayed in the panels as they are produced with no control over the placement of the PLOTBY= and AT levels. PANELS | LEVELS specifies that each level of the PLOTBY= effect begin a new panel of plots and the AT levels define the plots within the panels. ROWS specifies that the rows within each panel correspond to different levels of the PLOTBY= effect and hence the columns correspond to different AT levels.","help":"PLOTBY=COLUMNS | PACK | PANELS | LEVELS | ROWS","type":"choice","arguments":[{"name":"COLUMNS","type":"standalone"},{"name":"PACK","type":"standalone"},{"name":"PANELS","type":"standalone"},{"name":"LEVELS","type":"standalone"},{"name":"ROWS","type":"standalone"}]},{"name":"PLOTBYLEN=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum length (1 ≤ n ≤ 256) of the levels of the PLOTBY= variables, which are displayed in footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed.","help":"PLOTBYLEN=*n*","type":"value"},{"name":"POLYBAR","optional":true,"followsDelimiter":"/","description":"Displays polytomous response data as a stacked histogram with bar heights defined by the individual predicted value. Your response variable must be the SLICEBY= variable, and the INDIVIDUAL and ILINK options must be in effect; otherwise, the option is ignored. Confidence limits are ignored.","type":"standalone"},{"name":"PREDLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label to be displayed on the Y axis. The default Y axis label is determined by your model. For the CONTOUR plot-type, this option changes the title to \"label for Y.\"","help":"PREDLABEL=*label*","type":"value"},{"name":"SHOWCLEGEND","optional":true,"followsDelimiter":"/","description":"Displays the gradient-legend for the CONTOUR plot-type. This option has no effect when the OBS(CGRADIENT=RESIDUAL) option is also specified.","type":"standalone"},{"name":"SLICEBY=","optional":true,"followsDelimiter":"/","description":"Displays the fitted values at the different levels of the specified variable or CLASS effect.","help":"SLICEBY=NONE | effect&lt;=numeric-list&gt;","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Preventing the INTERACTION plot-type from slicing by a second class covariate. Note that the SLICEBY=NONE option is not available for the SLICEFIT plot-type, since that is the same as the FIT plot-type.","type":"standalone"},{"name":"effect","followsDelimiter":"/","description":"You can specify the response variable as the effect for polytomous response models. Use this option to modify SLICEFIT and INTERACTION plot-types. If you specify a continuous variable as the effect, then you can either specify a numeric-list of values at which to display that variable or, by default, five equally spaced values from the minimum variable value to its maximum are displayed.","help":"effect&lt;=numeric-list&gt;","type":"value"}]},{"name":"SMOOTH","optional":true,"followsDelimiter":"/","description":"Overlays a loess smooth on the FIT plot-type for models that have only one continuous predictor. This option is not available for binary or polytomous response models.","type":"standalone"},{"name":"UNPACK","optional":true,"followsDelimiter":"/","description":"Suppresses paneling. By default, multiple plots can appear in some output panels. Specify UNPACK to display each plot separately.]","type":"standalone"},{"name":"X=","optional":true,"followsDelimiter":"/","description":"Specifies values to display on the X axis. For BOX and INTERACTION plot-types, effect can be a CLASS effect in the MODEL statement. For FIT, SLICEFIT, and CONTOUR plot-types, effect can be any continuous variable in the model.","help":"X=*effect*","type":"value"},{"name":"Y=","optional":true,"followsDelimiter":"/","description":"Specifies values to display on the Y axis for the CONTOUR plot-type. The Y= argument can be any continuous variable in the model.","help":"Y=*args*","type":"value"},{"name":"YRANGE=","optional":true,"followsDelimiter":"/","description":"Displays the predicted values on the Y axis in the range [min,max]. By default, when the Y axis displays predicted probabilities, the entire Y axis, [0,1], is displayed. This option is useful if your predicted probabilities are all contained in some subset of this range. This option is not available with the CONTOUR plot-type.","help":"YRANGE=CLIP | &lt;(&lt;*min*&gt;&lt;,*max*&gt;)&gt;","type":"choice","arguments":[{"name":"CLIP","followsDelimiter":"/","description":"Has the same effect as specifying the minimum predicted value as min and the maximum predicted value as max.","type":"standalone"},{"name":"(min,max)","placeholder":true,"followsDelimiter":"/","description":"Replace min and max with actual values.","type":"standaloneOrValue"}]}]},{"name":"ESTIMATE","description":"The ESTIMATE statement provides a mechanism for obtaining custom hypothesis tests. Estimates are formed as linear estimable functions of the form Lβ. You can perform hypothesis tests for the estimable functions, construct confidence limits, and obtain specific nonlinear transformations. The basic element of the ESTIMATE statement is the estimate-specification, which consists of model effects and their coefficients. A estimate-specification takes the general form effect name <effect values ...> The following variables can appear in the ESTIMATE statement: label is an optional label that identifies the particular row of the estimate in the output. effect identifies an effect that appears in the MODEL statement. The keyword INTERCEPT can be used as an effect when an intercept is fitted in the model. You do not need to include all effects that are in the MODEL statement. values are constants that are elements of the L matrix and are associated with the fixed and random effects.","help":"ESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the final effect listed in the ESTIMATE statement from the 'Type III' table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE&lt;(simoptions)&gt; | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector.","help":"SIMULATE&lt;(simoptions)&gt;","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CATEGORY=","optional":true,"description":"Specifies how to construct estimates and multiplicity corrections for models with multinomial data (ordinal or nominal). This option is also important for constructing sets of estimable functions for F or chi-square tests with the JOINT option.","help":"CATEGORY=JOINT | SEPARATE | &lt;*quoted-value-list*&gt;","type":"choice","arguments":[{"name":"JOINT","description":"Computes the estimable functions for every nonredundant category and treats them as a set. For example, a three-row ESTIMATE statement in a model with three response categories leads to six estimable functions.","type":"standalone"},{"name":"SEPARATE","description":"Computes the estimable functions for every nonredundant category in turn. For example, a three-row ESTIMATE statement in a model with three response categories leads to two sets of three estimable functions.","type":"standalone"},{"name":"quoted-value-list","placeholder":true,"description":"Computes the estimable functions only for the list of values given. The list must consist of formatted values of the response categories.","type":"value"}]},{"name":"CHISQ","optional":true,"description":"Requests that chi-square tests be performed in addition to F tests, when you request an F test with the JOINT option. This option has no effect in procedures that produce chi-square statistics by default.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed. If the procedure shows the degrees of freedom in the \"Estimates\" table as infinite, then the confidence limits are z intervals. The confidence level is 0.95 by default, and you can change the confidence level with the ALPHA= option. The confidence intervals are adjusted for multiplicity when you specify the ADJUST= option. However, if a step-down p-value adjustment is requested with the STEPDOWN option, only the p-values are adjusted for multiplicity.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits. This option is not supported by the procedures that perform chi-square-based inference (LOGISTIC, PHREG, and SUVEYLOGISTIC).","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators. If you do not specify value-list, a default value of 1.0 is assumed. Missing values in the value-list are converted to 1.0. If the number of elements in value-list exceeds the number of rows of the estimate, the extra values are ignored. If the number of elements in value-list is less than the number of rows of the estimate, the last value in value-list is copied forward. If you specify a row-specific divisor as part of the specification of the estimate row, this value multiplies the corresponding divisor that is implied by the value-list. For example, the following statement divides the coefficients in the first row by 8, and the coefficients in the third and fourth row by 3: estimate 'One vs. two' A 2 -2 (divisor=2), 'One vs. three' A 1 0 -1 , 'One vs. four' A 3 0 0 -3 , 'One vs. five' A 1 0 0 0 -1 / divisor=4,.,3;","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L matrix coefficients be displayed.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the estimate. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, this option produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"JOINT=","optional":true,"description":"Requests that a joint F or chi-square test be produced for the rows of the estimate. The JOINT option in the ESTIMATE statement essentially replaces the CONTRAST statement. When the LOWERTAILED or the UPPERTAILED options are in effect, or if the BOUNDS option described below is in effect, the JOINT option produces the chi-bar-square statistic according to Silvapulle and Sen (2004). This statistic uses a simulation-based approach to compute p-values in situations where the alternative hypotheses of the estimable functions are not simple two-sided hypotheses. You can specify the following joint-test-options in parentheses: ACC=γ specifies the accuracy radius for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of γ must be strictly between 0 and 1; the default value is 0.005. EPS=є specifies the accuracy confidence level for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of є must be strictly between 0 and 1; the default value is 0.01. LABEL='label' assigns an identifying label to the joint test. If you do not specify a label, the first non-default label for the ESTIMATE rows is used to label the joint test. NOEST | ONLY performs only the F or chi-square test and suppresses other results from the ESTIMATE statement. This option is useful for emulating the CONTRAST statement that is available in other procedures. NSAMP=n specifies the number of samples for the simulation-based method of Silvapulle and Sen (2004). CHISQ -- adds a chi-square test if the procedure produces an F test by default.","help":"JOINT=ACC= | EPS= | LABEL= | NOEST | ONLY | NSAMP= | CHISQ | BOUNDS=","type":"choice","arguments":[{"name":"ACC=","type":"value"},{"name":"EPS=","type":"value"},{"name":"LABEL=","type":"value"},{"name":"NOEST","type":"standalone"},{"name":"ONLY","type":"standalone"},{"name":"NSAMP=","type":"value"},{"name":"CHISQ","type":"standalone"},{"name":"BOUNDS=","type":"value"}]},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic. A two-tailed test is the default. A lower-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"},{"name":"NOFILL","optional":true,"description":"Suppresses the automatic fill-in of coefficients of higher-order effects.","type":"standalone"},{"name":"PLOTS=","optional":true,"description":"Produces ODS statistical graphics of the distribution of estimable functions if the procedure performs the analysis in a sampling-based mode.","help":"PLOTS=ALL | BOXPLOT | DISTPLOT | NONE","type":"choice","arguments":[{"name":"ALL","description":"Produces all possible plots with their default settings.","type":"standalone"},{"name":"BOXPLOT","description":"Syntax: BOXPLOT<(boxplot-options)> Produces box plots of the distribution of the estimable function across the posterior sample. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"DISTPLOT","aliases":["DIST"],"description":"Syntax: DISTPLOT<(distplot-options)> Generates panels of histograms with a kernel density overlaid. A separate plot in each panel contains the results for each estimable function. You can specify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"NONE","description":"Does not produce any plots.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies the seed for the sampling-based components of the computations for the ESTIMATE statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock. There could be multiple ESTIMATE statements with SEED= specifications and there could be other statements that can supply a random number seed. Since the procedure has only one random number stream, the initial seed is shown in the SAS log.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion. Step-down methods increase the power of multiple testing procedures by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down-options in parentheses after the STEPDOWN option: MAXTIME=n specifies the time (in seconds) to be spent computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60. ORDER=PVALUE | ORDER=ROWS specifies the order in which the step-down tests to be performed. ORDER=PVALUE is the default, with estimates being declared significant only if all estimates with smaller (unadjusted) p-values are significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified in the syntax. REPORT specifies that a report on the step-down adjustment be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","type":"standalone"},{"name":"TESTVALUE=","optional":true,"aliases":["TESTMEAN="],"description":"Specifies the value under the null hypothesis for testing the estimable functions in the ESTIMATE statement. The rules for specifying the value-list are very similar to those for specifying the divisor list in the DIVISOR= option. If no TESTVALUE= is specified, all tests are performed as H: Lβ=0. Missing values in the value-list also are translated to zeros. If you specify fewer values than rows in the ESTIMATE statement, the last value in value-list is carried forward. The TESTVALUE= option affects only p-values from individual, joint, and multiplicity-adjusted tests. It does not affect confidence intervals.","help":"TESTVALUE=*value-list*","type":"value"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic. A two-tailed test is the default. An upper-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"}]},{"name":"LSMEANS","description":"The LSMEANS statement computes and compares least squares means (LS-means) of fixed effects. LS-means are predicted population margins—that is, they estimate the marginal means over a balanced population. In a sense, LS-means are to unbalanced designs as class and subclass arithmetic means are to balanced designs.","help":"LSMEANS &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the LSMEANS effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified LSMEANS effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the LSMEANS effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the LSMEANS statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the LSMEANS statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"LSMESTIMATE","description":"The LSMESTIMATE statement provides a mechanism for obtaining custom hypothesis tests among least squares means.","help":"LSMESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the LS-mean estimates. The adjusted quantities are produced in addition to the unadjusted p-values and confidence limits. Adjusted confidence limits are produced if the CL or ALPHA= option is in effect.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"description":"Modifies the values of the covariates used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"description":"Requests that the procedure compute separate margins for each level of the LSMEANS effect.","type":"standalone"},{"name":"CATEGORY=","optional":true,"description":"Specifies how to construct estimates and multiplicity corrections for models with multinomial data (ordinal or nominal). This option is also important for constructing sets of estimable functions for F tests with the JOINT option.","help":"CATEGORY=JOINT | SEPARATE | &lt;*quoted-value-list*&gt;","type":"choice","arguments":[{"name":"JOINT","description":"Computes the estimable functions for every nonredundant category and treats them as a set. For example, a three-row LSESTIMATE statement in a model with three response categories leads to six estimable functions.","type":"standalone"},{"name":"SEPARATE","description":"Computes the estimable functions for every nonredundant category in turn. For example, a three-row LSESTIMATE statement in a model with three response categories leads to two sets of three estimable functions.","type":"standalone"},{"name":"quoted-value-list","placeholder":true,"description":"Computes the estimable functions only for the list of values given. The list must consist of formatted values of the response categories.","type":"value"}]},{"name":"CHISQ","optional":true,"description":"Requests that chi-square tests be performed in addition to F tests, when you request an F test with the JOINT option. This option has no effect in procedures that produce chi-square statistics by default.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"description":"Displays the estimated correlation matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"COV","optional":true,"description":"Displays the estimated covariance matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators. If you do not specify value-list, a default value of 1.0 is assumed. Missing values in the value-list are converted to 1.0.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L coefficients of the estimable function be displayed.","type":"standalone"},{"name":"ELSM","optional":true,"description":"Requests that the K matrix coefficients be displayed. These are the coefficients that apply to the LS-means. This option is useful to ensure that you assigned the coefficients correctly to the LS-means.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the least squares means estimate. When you model data with the logit link function and the estimate represents a log odds ratio, the EXP option produces an odds ratio. If you specify the CL or ALPHA= option, the (adjusted) confidence limits for the estimate are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"JOINT=","optional":true,"description":"Requests that a joint F or chi-square test be produced for the rows of the estimate. You can specify the following joint-test-options in parentheses: ACC=γ specifies the accuracy radius for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of γ must be strictly between 0 and 1; the default value is 0.005. EPS=є specifies the accuracy confidence level for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of є must be strictly between 0 and 1; the default value is 0.01. LABEL='label' assigns an identifying label to the joint test. If you do not specify a label, the first non-default label for the ESTIMATE rows is used to label the joint test. NOEST | ONLY performs only the F or chi-square test and suppresses other results from the ESTIMATE statement. This option is useful for emulating the CONTRAST statement that is available in other procedures. NSAMP=n specifies the number of samples for the simulation-based method of Silvapulle and Sen (2004). CHISQ -- adds a chi-square test if the procedure produces an F test by default.","help":"JOINT=ACC= | EPS= | LABEL= | NOEST | ONLY | NSAMP= | CHISQ | BOUNDS=","type":"choice","arguments":[{"name":"ACC=","type":"value"},{"name":"EPS=","type":"value"},{"name":"LABEL=","type":"value"},{"name":"NOEST","type":"standalone"},{"name":"ONLY","type":"standalone"},{"name":"NSAMP=","type":"value"},{"name":"CHISQ","type":"standalone"},{"name":"BOUNDS=","type":"value"}]},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic. A two-tailed test is the default. A lower-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins observed in OM-data-set.","type":"value"},{"name":"PLOTS=","optional":true,"description":"Produces ODS statistical graphics of the distribution of estimable functions if the procedure performs the analysis in a sampling-based mode.","help":"PLOTS=ALL | BOXPLOT | DISTPLOT | NONE","type":"choice","arguments":[{"name":"ALL","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"BOXPLOT","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"DISTPLOT","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"NONE","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking as documented for the ESTIMATE statement.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion. Step-down methods increase the power of multiple testing procedures by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down-options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60. ORDER=PVALUE ORDER=ROWS specifies the order in which the step-down tests are performed. ORDER=PVALUE is the default, with LS-mean estimates being declared significant only if all LS-mean estimates with smaller (unadjusted) p-values are significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified. REPORT specifies that a report on the step-down adjustment be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","type":"standalone"},{"name":"TESTVALUE=","optional":true,"aliases":["TESTMEAN="],"description":"Specifies the value under the null hypothesis for testing the estimable functions in the LSMESTIMATE statement. The rules for specifying the value-list are very similar to those for specifying the divisor list in the DIVISOR= option. If no TESTVALUE= is specified, all tests are performed as H: Lβ=0. Missing values in the value-list also are translated to zeros. If you specify fewer values than rows in the ESTIMATE statement, the last value in value-list is carried forward. The TESTVALUE= option affects only p-values from individual, joint, and multiplicity-adjusted tests. It does not affect confidence intervals.","help":"TESTVALUE=*value-list*","type":"value"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic. A two-tailed test is the default. An upper-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"}]},{"name":"MODEL","description":"The MODEL statement names the dependent variable and the independent effects. Only one MODEL statement is allowed. The specification of effects and the parameterization of the linear model are the same as in the GLM procedure.","help":"MODEL &lt;NOINT&gt; ","arguments":[{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Omits the intercept term from the model.","type":"standalone"}]},{"name":"SLICE","description":"The SLICE statement provides a general mechanism for performing a partitioned analysis of the LS-means for an interaction. This analysis is also known as an analysis of simple effects. The SLICE statement uses the same options as the LSMEANS statement.","help":"SLICE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the SLICE model-effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified SLICE effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the SLICE effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means.","type":"standalone"},{"name":"NOF","optional":true,"followsDelimiter":"/","description":"Suppresses the F test for testing the mutual equality of the estimable functions in the partition.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the SLICE statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this SLICE statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the SLICE statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"SLICEBY=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"STORE","aliases":["ITEMSTORE"],"description":"The STORE statement requests that the procedure save the context and results of the statistical analysis. The resulting item store is a binary file format that cannot be modified. The contents of the item store can be processed with the PLM procedure. The item-store-name is a usual one- or two-level SAS name, like the names that are used for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session. Since item stores usually are used to perform postprocessing tasks, typical usage specifies a two-level name of the form libname.membername. If an item store by the same name as specified in the STORE statement already exists, the existing store is replaced.","help":"STORE &lt;LABEL='label'&gt; ","arguments":[{"name":"LABEL=","optional":true,"followsDelimiter":"/","description":"Adds a custom label. When the PLM procedure processes an item store, the label appears in the PROC PLM output along with other identifying information.","help":"LABEL='*label*'","type":"value"}]},{"name":"TEST","description":"The TEST statement enables you to perform F tests for model effects that test Type I, II, or Type III hypotheses.","help":"TEST &lt;CHISQ&gt; &lt;DDF=value-list&gt; &lt;E&gt; ...","arguments":[{"name":"CHISQ","optional":true,"followsDelimiter":"/","description":"Requests that chi-square tests be performed for the relevant effects in addition to the F tests. Type III tests are the default; you can produce the Type I and Type II tests by using the HTYPE= option. This option has no effect when the procedure produces chi-square statistics by default.","type":"standalone"},{"name":"DDF=","optional":true,"followsDelimiter":"/","aliases":["DF="],"description":"Specifies the denominator degrees of freedom for the fixed effects. The value-list specification is a list of numbers or missing values (.) separated by commas. The order of degrees of freedom should match the order of the fixed effects that are specified in the TEST statement; otherwise it should match the order in which the effects appear in the \"Type III Tests of Fixed Effects\" table.","help":"DDF=*value-list*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that Type I, Type II, and Type III L matrix coefficients be displayed for all relevant effects.","type":"standalone"},{"name":"E1","optional":true,"followsDelimiter":"/","aliases":["EI"],"description":"Requests that Type I L matrix coefficients be displayed for all relevant effects.","type":"standalone"},{"name":"E2","optional":true,"followsDelimiter":"/","aliases":["EII"],"description":"Requests that Type II L matrix coefficients be displayed for all relevant effects.]","type":"standalone"},{"name":"E3","optional":true,"followsDelimiter":"/","aliases":["EIII"],"description":"Requests that Type III L matrix coefficients be displayed for all relevant effects.","type":"standalone"},{"name":"HTYPE=","optional":true,"followsDelimiter":"/","description":"Indicates the type of hypothesis test to perform on the fixed effects. Valid entries for values in the value-list are 1, 2, and 3, which correspond to Type I, Type II, and Type III tests, respectively. The default value is 3.","help":"HTYPE=*value-list*","type":"value"},{"name":"INTERCEPT","optional":true,"followsDelimiter":"/","aliases":["INT"],"description":"Adds a row to the tables for Type I, II, and III tests that correspond to the overall intercept.","type":"standalone"}]},{"name":"WEIGHT","aliases":["WGT"],"description":"A WEIGHT statement names a variable in the input data set whose values are relative weights for a weighted least squares regression.","help":"WEIGHT variable "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_026","docsetTargetFile":"statug_orthoreg_toc.htm"}}