{"name":"PARETO","statements":[{"name":"PROC PARETO","description":"The PARETO procedure creates Pareto charts, which display the relative frequency of quality-related problems in a process or operation. The frequencies are represented by bars that are ordered in decreasing magnitude. Thus, a Pareto chart can be used to decide which subset of problems should be solved first or which problem areas deserve the most attention. Pareto charts provide a tool for visualizing the Pareto principle, which states that a small subset of problems tend to occur much more frequently than the remaining problems. In Japanese industry, the Pareto chart is one of the \"seven basic QC tools\" heavily used by workers and engineers. † You can use the PARETO procedure to: † o construct Pareto charts from unsorted raw data (for instance, a set of quality problems that have not been classified into categories) or from a set of distinct categories and corresponding frequencies o construct Pareto charts based on the percentage of occurrence of each problem, the frequency (number of occurrences), or a weighted frequency (such as frequency weighted by the cost of each problem) o add a curve indicating the cumulative percentage across categories o construct side-by-side Pareto charts or stacked Pareto charts o construct comparative Pareto charts that enable you to compare the Pareto frequencies across levels of one or two classification variables. For example, you can compare the frequencies of problems encountered with three different machines for five consecutive days. o highlight the \"vital few\" and the \"useful many\"* categories by using different colors for bars corresponding to the n most frequently occurring categories or the m least frequently occurring categories. o create charts with bars oriented vertically or horizontally o highlight special categories by using different colors for specific bars o create charts as traditional graphics, ODS Graphics output, or legacy line printer charts o annotate traditional graphics charts o inset summary statistics in graphical output o save traditional graphics output in a graphics catalog for subsequent replay o display sample sizes on Pareto charts o display frequencies above the bars o define characters used for features of line printer charts o save information associated with the categories (such as the frequencies) in an output data set o restrict the number of categories displayed to the n most frequently occurring categories","help":"PROC PARETO <ANNOTATE2=SAS-data-set> <ANNOTATE=SAS-data-set> <DATA=SAS-data-set> <FORMCHAR='string'> <GOUT=graphics-catalog> <LINEPRINTER>;     \n\tHBAR <ANCHOR=<BR | LC | RC>... > <ANGLE=value> <ANNOKEY> ...; \n   \n\tINSET <CFILL=color | BLANK> <CFILL=BLANK> <CFILLH=color> ...; \n   \n\tVBAR <ANCHOR=<BC | BL | TC>... > <ANGLE=value> <ANNOKEY> ...; ","arguments":[{"name":"ANNOTATE2=","optional":true,"aliases":["ANNO2="],"description":"Specifies an input data set that contains annotate variables. You can use this data set to customize traditional graphics charts with features such as labels explaining critical categories.","help":"ANNOTATE2=*SAS-data-set*","type":"dataSet"},{"name":"ANNOTATE=","optional":true,"aliases":["ANNO="],"description":"Specifies an input data set that contains appropriate annotate variables.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"DATA=","optional":true,"description":"Specifies an input data set that contains the process variables and related variables.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"FORMCHAR=","optional":true,"description":"Specifies a form character list that enhances the appearance of line printer charts with corner characters and other special characters.","help":"FORMCHAR='*string*'","type":"value"},{"name":"GOUT=","optional":true,"description":"Specifies the graphics catalog in which to save traditional graphics output.","help":"GOUT=*graphics-catalog*","type":"dataSet"},{"name":"LINEPRINTER","optional":true,"description":"Requests that line printer charts be produced. By default, the procedure creates traditional graphics.","type":"standalone"}]},{"name":"HBAR","description":"The HBAR statement creates a Pareto chart with horizontal bars representing the frequencies of problems in a process or operation.","help":"HBAR &lt;ANCHOR=&lt;BR | LC | RC&gt;... &gt; &lt;ANGLE=value&gt; &lt;ANNOKEY&gt; ...","arguments":[{"name":"ANCHOR=","optional":true,"followsDelimiter":"/","description":"Specifies where the Pareto curve is anchored to the topmost bar on the chart.","help":"ANCHOR=BR | LC | RC | TL","type":"choice","arguments":[{"name":"BR","followsDelimiter":"/","description":"Bottom right cornerr","type":"standalone"},{"name":"LC","followsDelimiter":"/","description":"Left center","type":"standalone"},{"name":"RC","followsDelimiter":"/","description":"Right center","type":"standalone"},{"name":"TL","followsDelimiter":"/","description":"Top left corner","type":"standalone"}]},{"name":"ANGLE=","optional":true,"followsDelimiter":"/","description":"Specifies an angle in degrees for rotating the Pareto category labels on the vertical axis. The value is the angle between the baseline of the label and the horizontal axis.","help":"ANGLE=*value*","type":"value"},{"name":"ANNOKEY","optional":true,"followsDelimiter":"/","description":"Specifies that annotation requested with the ANNOTATE= and ANNOTATE2= options is to be applied only to the key cell in a comparative Pareto chart.","type":"standalone"},{"name":"ANNOTATE2=","optional":true,"followsDelimiter":"/","aliases":["ANNO2="],"description":"Specifies an input data set that contains annotate variables. This data set is associated with the secondary vertical axis.","help":"ANNOTATE2=*SAS-data-set*","type":"dataSet"},{"name":"ANNOTATE=","optional":true,"followsDelimiter":"/","aliases":["ANNO="],"description":"Specifies an input data set that contains annotate variables. This data set is associated with the primary vertical axis.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"AXISFACTOR=","optional":true,"followsDelimiter":"/","description":"Specifies a factor used in scaling the primary horizontal axis.","help":"AXISFACTOR=*value*","type":"value"},{"name":"BARLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies that a label is to be displayed to the right of each bar.","help":"BARLABEL=VALUE | CMPCT | (*variable*)","type":"choice","arguments":[{"name":"VALUE","followsDelimiter":"/","description":"The label indicates the length of the bar in the units used by the primary horizontal axis.","type":"standalone"},{"name":"CMPCT","followsDelimiter":"/","description":"The label indicates the cumulative percent for that bar.","type":"standalone"},{"name":"(variable)","placeholder":true,"followsDelimiter":"/","description":"The label indicates the values of the variable specified in parentheses.","type":"value"}]},{"name":"BARLABPOS=","optional":true,"followsDelimiter":"/","description":"Specifies the position for labels requested with the BARLABEL= option.","help":"BARLABPOS=HBAR | HFIT | HRIGHT","type":"choice","arguments":[{"name":"HBAR","followsDelimiter":"/","description":"Displays the labels on the bars.","type":"standalone"},{"name":"HFIT","followsDelimiter":"/","description":"Displays the labels on or to the right of the bars, depending on the available space.","type":"standalone"},{"name":"HRIGHT","followsDelimiter":"/","description":"Displays the labels to the right of the bars.","type":"standalone"}]},{"name":"BARLEGEND=","optional":true,"followsDelimiter":"/","description":"Specifies that a legend is to be added to the chart to explain colors for bars specified with the CBARS=(variable-list) options, or patterns for bars specified with the PBARS=(variable-list) option. The variable-list must be enclosed in parentheses even if only one variable is specified.","type":"value"},{"name":"BARLEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies the label displayed to the left of the legend created with the BARLEGEND= option.","help":"BARLEGLABEL='*label*'","type":"value"},{"name":"BARS=","optional":true,"followsDelimiter":"/","description":"Groups bars of the Pareto chart for display using colors from the current ODS style.","type":"value"},{"name":"BARWIDTH=","optional":true,"followsDelimiter":"/","description":"Specifies the width of the bars in percent screen units. By default, the bars are as wide as possible.","help":"BARWIDTH=*value*","type":"value"},{"name":"CATLEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label for the category legend that is added when there is insufficient space to label the categories along the horizontal axis. The label can be up to 16 characters and must be enclosed in quotes.","help":"CATLEGLABEL='*label*'","type":"value"},{"name":"CAXIS2=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the tick mark labels and axis label associated with the secondary axis.","type":"value"},{"name":"CAXIS=","optional":true,"followsDelimiter":"/","aliases":["CAXES=","CA="],"description":"Specifies the color for the axis line and tick marks on the chart.","help":"CAXIS=*color*","type":"color"},{"name":"CBARLINE=","optional":true,"followsDelimiter":"/","description":"Specifies the color for bar outlines.","help":"CBARLINE=*color*","type":"color"},{"name":"CBARS=","optional":true,"followsDelimiter":"/","description":"Specifies how the bars of the Pareto chart are to be colored.","help":"CBARS=*color*","type":"color"},{"name":"CCONNECT=","optional":true,"followsDelimiter":"/","description":"Specifies the color for line segments connecting points on the cumulative percent curve.","help":"CCONNECT=*color*","type":"color"},{"name":"CFRAME=","optional":true,"followsDelimiter":"/","description":"Specifies the color for filling the area enclosed by the axes and the frame. The CFRAME= option cannot be used in conjunction with the NOFRAME option or the CTILES= option.","help":"CFRAME=*color*","type":"color"},{"name":"CFRAMENLEG","optional":true,"followsDelimiter":"/","description":"Specifies that the legend requested with the NLEGEND option be framed and that the frame be filled with a color from the ODS style.","type":"color"},{"name":"CFRAMENLEG=","optional":true,"followsDelimiter":"/","description":"Specifies that the legend requested with the NLEGEND option be framed and that the frame be filled with the color indicated.","help":"CFRAMENLEG=*color*","type":"color"},{"name":"CFRAMESIDE=","optional":true,"followsDelimiter":"/","description":"Specifies the color for filling the frame area for the row labels displayed along the left side of a comparative Pareto chart requested with the CLASS= option.","help":"CFRAMESIDE=*color*","type":"color"},{"name":"CFRAMETOP=","optional":true,"followsDelimiter":"/","description":"Specifies the color for filling the frame area for the column labels displayed across the top of a comparative Pareto chart requested with the CLASS= option.","help":"CFRAMETOP=*color*","type":"color"},{"name":"CGRID2=","optional":true,"followsDelimiter":"/","description":"Specifies the color for grid lines requested with the GRID2 option.","type":"value"},{"name":"CGRID=","optional":true,"followsDelimiter":"/","description":"Specifies the color for grid lines requested with the GRID option.","help":"CGRID=*color*","type":"color"},{"name":"CHIGH=","optional":true,"followsDelimiter":"/","description":"Specifies the color used to fill the bars with the n highest values.","type":"value"},{"name":"CHREF=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the lines requested with the HREF= option.","help":"CHREF=*color*","type":"color"},{"name":"CLASS=","optional":true,"followsDelimiter":"/","description":"Creates a comparative Pareto chart using the levels of the variables. You must enclose two variables in parentheses.","type":"value"},{"name":"CLASSKEY=","optional":true,"followsDelimiter":"/","description":"Specifies the key cell in a comparative Pareto chart requested with the CLASS= option.","type":"value"},{"name":"CLIPREF","optional":true,"followsDelimiter":"/","description":"Draws reference lines requested with the HREF= and VREF= options behind the bars on the Pareto chart.","type":"standalone"},{"name":"CLOW","optional":true,"followsDelimiter":"/","description":"Specifies to fill the bars with the n lowest values with a color from the ODS style.","type":"color"},{"name":"CLOW=","optional":true,"followsDelimiter":"/","description":"Specifies the color used to fill the bars with the n lowest values.","type":"value"},{"name":"CMPCTLABEL","optional":true,"followsDelimiter":"/","description":"Labels points on the cumulative percent curve with their values. By default, the points are not labeled.","type":"standalone"},{"name":"COTHER=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the bar defined by the OTHER= option.","help":"COTHER=*color*","type":"color"},{"name":"CPROP","optional":true,"followsDelimiter":"/","description":"Requests a proportion-of-frequency bar filled with a color from the ODS style to be displayed vertically along the right side of each tile in a comparative Pareto chart.","type":"color"},{"name":"CPROP=","optional":true,"followsDelimiter":"/","description":"Requests a proportion-of-frequency bar of the specified color displayed vertically along the right side of each tile in a comparative Pareto chart.","help":"CPROP=*color*","type":"color"},{"name":"CTEXT=","optional":true,"followsDelimiter":"/","aliases":["CT="],"description":"Specifies the color for text, such as tick mark labels, axis labels, and legends.","help":"CTEXT=*color*","type":"color"},{"name":"CTEXTSIDE=","optional":true,"followsDelimiter":"/","description":"Specifies the color for row labels displayed along the left side of a comparative Pareto chart requested with the CLASS= option.","help":"CTEXTSIDE=*color*","type":"color"},{"name":"CTEXTTOP=","optional":true,"followsDelimiter":"/","description":"Specifies the color for column labels displayed across the top of a comparative Pareto chart requested with the CLASS= option.","help":"CTEXTTOP=*color*","type":"color"},{"name":"CTILES=","optional":true,"followsDelimiter":"/","description":"Specifies a character variable of length eight whose values are the fill colors for the tiles in a comparative Pareto chart.","type":"value"},{"name":"CVREF=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the lines requested by the VREF= and VREF2= options.","help":"CVREF=*color*","type":"color"},{"name":"DESCRIPTION=","optional":true,"followsDelimiter":"/","aliases":["DES="],"description":"Specifies a descriptive string, up to 256 characters, that appears in the description field of the PROC GREPLAY master menu for traditional graphics output.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"FONT=","optional":true,"followsDelimiter":"/","description":"Specifies a software font for text used in labels and legends.","help":"FONT=*font*","type":"value"},{"name":"FREQ=","optional":true,"followsDelimiter":"/","description":"Specifies a frequency variable whose value provides the counts (numbers of occurrences) of the values of the process variable.","help":"FREQ=*variable*","type":"value"},{"name":"FRONTREF","optional":true,"followsDelimiter":"/","description":"Draws reference lines specified with the HREF= and VREF= options in front of the bars on the Pareto chart.","type":"standalone"},{"name":"GRID","optional":true,"followsDelimiter":"/","description":"Adds a grid to the Pareto chart corresponding to the primary vertical axis.","type":"standalone"},{"name":"GRID2","optional":true,"followsDelimiter":"/","description":"Adds a grid to the Pareto chart corresponding to the secondary vertical axis.","type":"standalone"},{"name":"HAXIS2=","optional":true,"followsDelimiter":"/","description":"Specifies tick mark values for the secondary horizontal axis.","type":"value"},{"name":"HAXIS2LABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label, up to 40 characters, for the secondary horizontal axis.","type":"value"},{"name":"HAXIS=","optional":true,"followsDelimiter":"/","description":"Specifies tick mark values for the primary horizontal axis.","help":"HAXIS=*value-list*","type":"value"},{"name":"HAXISLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label, up to 40 characters, for the primary horizontal axis.","help":"HAXISLABEL='*label*'","type":"value"},{"name":"HEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies the height in percent screen units of text for labels and legends.","help":"HEIGHT=*value*","type":"value"},{"name":"HLLEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label displayed to the left of the legend that is automatically created when you use a combination of the CHIGH, CLOW, PHIGH, and PLOW options.","help":"HLLEGLABEL='*label*'","type":"value"},{"name":"HOFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies the length (in percent screen units) of the offset at the right end of the primary horizontal axis. You can eliminate the offset by specifying HOFFSET=0.","help":"HOFFSET=*value*","type":"value"},{"name":"HREF2=","optional":true,"followsDelimiter":"/","description":"Specifies where reference lines perpendicular to the secondary horizontal axis are to appear on the chart. Character values can be up to 64 characters and must be enclosed in quotes.","type":"value"},{"name":"HREF2LABELS=","optional":true,"followsDelimiter":"/","description":"Specifies labels for the lines requested with the HREF2= option.","type":"value"},{"name":"HREF=","optional":true,"followsDelimiter":"/","description":"Specifies where reference lines perpendicular to the primary horizontal axis are to appear on the chart. Character values can be up to 64 characters and must be enclosed in quotes.","help":"HREF='*value-list*'","type":"value"},{"name":"HREFLABELS=","optional":true,"followsDelimiter":"/","description":"Specifies labels for the lines requested with the HREF= option.","type":"value"},{"name":"HREFLABPOS=","optional":true,"followsDelimiter":"/","description":"Specifies the vertical position of the HREFLABELS= labels.","help":"HREFLABPOS=1 | 2 | 3 | 4","type":"choice","arguments":[{"name":"1","followsDelimiter":"/","description":"Along top of chart","type":"standalone"},{"name":"2","followsDelimiter":"/","description":"Staggered from top to bottom of chart","type":"standalone"},{"name":"3","followsDelimiter":"/","description":"Along bottom of chart","type":"standalone"},{"name":"4","followsDelimiter":"/","description":"Staggered from bottom to top of chart","type":"standalone"}]},{"name":"HTML=","optional":true,"followsDelimiter":"/","description":"Specifies URLs as values of the specified character variable (or formatted values of a numeric variable). These URLs are associated with bars on the Pareto chart when traditional graphics output is directed into HTML.","help":"HTML=*variable*","type":"value"},{"name":"INFONT=","optional":true,"followsDelimiter":"/","description":"Specifies a software font for text used inside the frame of the chart, such as sample size legends.","help":"INFONT=*font*","type":"value"},{"name":"INHEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies the height in percent screen units of text used inside the frame of the chart, such as sample size legends and bar labels.","type":"value"},{"name":"INTERBAR=","optional":true,"followsDelimiter":"/","description":"Specifies the distance in percent screen units between bars on the chart.","help":"INTERBAR=*value*","type":"value"},{"name":"INTERTILE=","optional":true,"followsDelimiter":"/","description":"Specifies the distance in horizontal percent screen units between tiles (cells) in a comparative Pareto chart.","help":"INTERTILE=*value*","type":"value"},{"name":"LABOTHER=","optional":true,"followsDelimiter":"/","description":"Is used in conjunction with the BARLABEL=(variable) option and specifies a label for the \"other\" category that is optionally specified with the OTHER= option.","type":"value"},{"name":"LAST=","optional":true,"followsDelimiter":"/","description":"Specifies that the bar corresponding to the category is to be displayed at the bottom of the chart regardless of the percent associated with this category","help":"LAST='*category*'","type":"value"},{"name":"LGRID2=","optional":true,"followsDelimiter":"/","description":"Specifies the line type for the grid requested with the GRID2 option.","type":"value"},{"name":"LGRID=","optional":true,"followsDelimiter":"/","description":"Specifies the line type for the grid requested with the GRID option.","help":"LGRID=*line-type*","type":"value"},{"name":"LHREF=","optional":true,"followsDelimiter":"/","aliases":["LH="],"description":"Specifies the line type for lines requested with the HREF= option.","help":"LHREF=*line-type*","type":"value"},{"name":"LOTHER=","optional":true,"followsDelimiter":"/","description":"Specifies a label for the bar defined with the OTHER= option.","help":"LOTHER='*label*'","type":"value"},{"name":"LVREF=","optional":true,"followsDelimiter":"/","aliases":["LV="],"description":"Specifies the line type for lines requested by the VREF= and VREF2= options.","help":"LVREF=*line-type*","type":"value"},{"name":"MARKERS","optional":true,"followsDelimiter":"/","description":"Specifies that the points on the cumulative percent curve be plotted with markers in ODS Graphics output.","type":"standalone"},{"name":"MAXCMPCT=","optional":true,"followsDelimiter":"/","description":"Specifies that only the Pareto categories with the n highest frequency counts are to be displayed, where the sum of the n corresponding percents is less than or equal to the specified percent.","help":"MAXCMPCT=*percent*","type":"value"},{"name":"MAXNCAT=","optional":true,"followsDelimiter":"/","description":"Specifies that only the Pareto categories with the n highest frequencies are to be displayed.","help":"MAXNCAT=*n*","type":"value"},{"name":"MINPCT=","optional":true,"followsDelimiter":"/","description":"Specifies that only the Pareto categories with frequency percents greater than or equal to the specified percent are to be displayed.","help":"MINPCT=*percent*","type":"value"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Specifies that missing values of the process variable are to be treated as a Pareto category represented with a bar on the chart.","type":"standalone"},{"name":"MISSING1","optional":true,"followsDelimiter":"/","description":"Specifies that missing values of the first CLASS= variable are to be treated as a level of the CLASS= variable.","type":"standalone"},{"name":"MISSING2","optional":true,"followsDelimiter":"/","description":"Specifies that missing values of the second CLASS= variable are to be treated as a level of the CLASS= variable.","type":"standalone"},{"name":"NAME=","optional":true,"followsDelimiter":"/","description":"Specifies a name for a traditional graphics chart, up to eight characters, that appears in the PROC GREPLAY master menu. The default name is 'PARETO'.","help":"NAME='*string*'","type":"value"},{"name":"NCOLS=","optional":true,"followsDelimiter":"/","aliases":["NCOL="],"description":"Specifies the number of columns in a comparative Pareto chart.","help":"NCOLS=*n*","type":"value"},{"name":"NLEGEND","optional":true,"followsDelimiter":"/","description":"Requests a sample size legend and specifies its form as N=n, where n is the total count for the Pareto categories. In a comparative Pareto chart, a legend is displayed in each tile, and n is the total count for that particular cell.","type":"standalone"},{"name":"NLEGEND=","optional":true,"followsDelimiter":"/","description":"Requests a sample size legend and specifies its form as label=n, where n is the total count for the Pareto categories. If you specify the NLEGEND=(variable) option, the legend is the value of the variable, which must be a variable in the DATA= data set whose formatted length does not exceed 32.","type":"value"},{"name":"NOCHART","optional":true,"followsDelimiter":"/","description":"Suppresses the creation of a Pareto chart.","type":"standalone"},{"name":"NOCURVE","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the cumulative percent curve and the secondary vertical axis.","type":"standalone"},{"name":"NOFRAME","optional":true,"followsDelimiter":"/","description":"Suppresses the frame that is drawn around the chart by default","type":"standalone"},{"name":"NOHLABEL","optional":true,"followsDelimiter":"/","description":"Suppresses the label for the primary horizontal axis.","type":"standalone"},{"name":"NOHLABEL2","optional":true,"followsDelimiter":"/","description":"Suppresses the label for the secondary horizontal axis.","type":"standalone"},{"name":"NOHLLEG","optional":true,"followsDelimiter":"/","description":"Suppresses the legend generated by the CHIGH(n)=, CLOW(n)=, PHIGH(n)=, and PLOW(n)= options.","type":"standalone"},{"name":"NOHTICK","optional":true,"followsDelimiter":"/","description":"Suppresses the primary horizontal axis label, tick marks, and tick mark labels.","type":"standalone"},{"name":"NOHTICK2","optional":true,"followsDelimiter":"/","description":"Suppresses the secondary horizontal axis label, tick marks, and tick mark labels.","type":"standalone"},{"name":"NOKEYMOVE","optional":true,"followsDelimiter":"/","description":"Suppresses the rearrangement of cells within a comparative Pareto chart that occurs when you use the CLASSKEY= option.","type":"standalone"},{"name":"NOVLABEL","optional":true,"followsDelimiter":"/","description":"Suppresses the label for the vertical axis.","type":"standalone"},{"name":"NROWS=","optional":true,"followsDelimiter":"/","aliases":["NROW="],"description":"Specifies the number of rows in a comparative Pareto chart.","help":"NROWS=*n*","type":"value"},{"name":"ORDER1=","optional":true,"followsDelimiter":"/","description":"Specifies the display order for the values of the first CLASS= variable.","help":"ORDER1=INTERNAL | FORMATTED | DATA | FREQ","type":"choice","arguments":[{"name":"INTERNAL","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the internal, or unformatted, values of the first CLASS= variable.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the formatted values of the first CLASS= variable.","type":"standalone"},{"name":"DATA","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in the order in which the values of the first CLASS= variable first appear in the input data set.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in order of decreasing frequency count.","type":"standalone"}]},{"name":"ORDER2=","optional":true,"followsDelimiter":"/","description":"Specifies the display order for the values of the second CLASS= variable.","help":"ORDER2=INTERNAL | FORMATTED | DATA | FREQ","type":"choice","arguments":[{"name":"INTERNAL","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the internal, or unformatted, values of the first CLASS= variable.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the formatted values of the first CLASS= variable.","type":"standalone"},{"name":"DATA","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in the order in which the values of the first CLASS= variable first appear in the input data set.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in order of decreasing frequency count.","type":"standalone"}]},{"name":"OTHER=","optional":true,"followsDelimiter":"/","description":"Specifies a new category that merges all categories not selected with the MAXNCAT=, MINPCT=, or MAXCMPCT= options.","help":"OTHER='*category*'","type":"value"},{"name":"OTHERCVAL=","optional":true,"followsDelimiter":"/","description":"Specifies the internal (unformatted) value for a character process variable in the OUT= data set that corresponds to the category created with the OTHER= option.","help":"OTHERCVAL='*value*'","type":"value"},{"name":"OTHERNVAL=","optional":true,"followsDelimiter":"/","description":"Specifies the internal (unformatted) value for a numeric process variable in the OUT= data set that corresponds to the category created with the OTHER= option.","help":"OTHERNVAL=*value*","type":"value"},{"name":"OUT=","optional":true,"followsDelimiter":"/","description":"Creates an output data set that contains the information displayed in the Pareto chart.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PBARS=","optional":true,"followsDelimiter":"/","description":"Specifies pattern fills for the bars.","type":"value"},{"name":"PHIGH=","optional":true,"followsDelimiter":"/","description":"Specifies the pattern used to fill the bars with the n highest values.","type":"value"},{"name":"PLOW=","optional":true,"followsDelimiter":"/","description":"Specifies the pattern used to fill the bars with the n lowest values.","type":"value"},{"name":"POTHER=","optional":true,"followsDelimiter":"/","description":"Specifies the pattern used for the bar defined by the OTHER= option.","help":"POTHER=*pattern*","type":"value"},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Specifies the scale for the primary horizontal axis.","help":"SCALE=PERCENT | COUNT | WEIGHT","type":"choice","arguments":[{"name":"PERCENT","followsDelimiter":"/","description":"The scale is percent of total frequency; this is the default.","type":"standalone"},{"name":"COUNT","followsDelimiter":"/","description":"The scale is counts.","type":"standalone"},{"name":"WEIGHT","followsDelimiter":"/","description":"The vertical axis is scaled in the same units as the WEIGHT= variable.","type":"standalone"}]},{"name":"TILELEGEND=","optional":true,"followsDelimiter":"/","description":"Specifies a variable used to add a legend for CTILES= colors.","type":"value"},{"name":"TILELEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label displayed to the left of the legend that is created when you specify a TILELEGEND= variable.","help":"TILELEGLABEL='*label*'","type":"value"},{"name":"VOFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies the length in percent screen units of the offset at both ends of the vertical axis.","help":"VOFFSET=*value*","type":"value"},{"name":"VREF=","optional":true,"followsDelimiter":"/","description":"Specifies where reference lines perpendicular to the vertical (Pareto category) axis are to appear on the chart.","help":"VREF=*value-list*","type":"value"},{"name":"VREFLABELS=","optional":true,"followsDelimiter":"/","description":"Specifies labels for the lines requested with the VREF= option.","type":"value"},{"name":"VREFLABPOS=","optional":true,"followsDelimiter":"/","description":"Specifies the vertical positioning of the VREFLABEL= and VREF2LABEL= labels.","help":"VREFLABPOS=1 | 2 | 3","type":"choice","arguments":[{"name":"1","followsDelimiter":"/","description":"Left-justified in chart","type":"standalone"},{"name":"2","followsDelimiter":"/","description":"Right-justified in chart","type":"standalone"},{"name":"3","followsDelimiter":"/","description":"Left-justified in right margin","type":"standalone"}]},{"name":"WAXIS=","optional":true,"followsDelimiter":"/","description":"Specifies the line thickness (in pixels) for the axes and frame.","help":"WAXIS=*n*","type":"value"},{"name":"WBARLINE=","optional":true,"followsDelimiter":"/","description":"Specifies the width for bar outlines.","help":"WBARLINE=*n*","type":"value"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies weight variables used to construct weighted Pareto charts.","help":"WEIGHT=*variable-list*","type":"value"},{"name":"WGRID2=","optional":true,"followsDelimiter":"/","description":"Specifies the width of the secondary chart grid lines.","type":"value"},{"name":"WGRID=","optional":true,"followsDelimiter":"/","description":"Specifies the width of the primary chart grid lines.","help":"WGRID=*n*","type":"value"}]},{"name":"INSET","description":"The INSET statement enables you to enhance a Pareto chart by adding a box or table (referred to as an inset) of summary statistics directly to the graph.","help":"INSET &lt;CFILL=color | BLANK&gt; &lt;CFILL=BLANK&gt; &lt;CFILLH=color&gt; ...","arguments":[{"name":"N","description":"Sample size","type":"standalone"},{"name":"NEXCL","description":"Observations excluded in restricted Pareto chart","type":"standalone"},{"name":"NOTHER","description":"Number of observations in OTHER= category","type":"standalone"},{"name":"NOTHERCAT","description":"Number of categories merged to form OTHER= category in restricted Pareto chart","type":"standalone"},{"name":"SUMWGTS","description":"Sum across all categories of weighted frequencies","type":"standalone"},{"name":"CFILL=","optional":true,"followsDelimiter":"/","description":"Specifies the color of the background (including the header background if you do not specify the CFILLH= option). CFILL=BLANK leaves the background uncolored and prevents items from showing through the inset.","help":"CFILL=*color* | BLANK","type":"choice","arguments":[{"name":"color","placeholder":true,"followsDelimiter":"/","description":"Specifies the color of the background (including the header background if you do not specify the CFILLH= option).","type":"color"},{"name":"BLANK","followsDelimiter":"/","description":"Leaves the background uncolored and prevents items from showing through the inset.","type":"standalone"}]},{"name":"CFILLH=","optional":true,"followsDelimiter":"/","description":"Specifies the color of the header background. By default, if you do not specify a CFILLH= color, the CFILL= color is used.","help":"CFILLH=*color*","type":"color"},{"name":"CFRAME=","optional":true,"followsDelimiter":"/","description":"Specifies the color of the frame. By default, the frame is the same color as the axis of the plot.","help":"CFRAME=*color*","type":"color"},{"name":"CHEADER=","optional":true,"followsDelimiter":"/","description":"Specifies the color of the header text. By default, if you do not specify a CHEADER= color, the CTEXT= color is used.","help":"CHEADER=*color*","type":"color"},{"name":"CSHADOW=","optional":true,"followsDelimiter":"/","description":"Specifies the color of the drop shadow.","help":"CSHADOW=*color*","type":"color"},{"name":"CTEXT=","optional":true,"followsDelimiter":"/","description":"Specifies the color of the text. By default, the inset text color is the same as the other text on the plot.","help":"CTEXT=*color*","type":"color"},{"name":"DATA","optional":true,"followsDelimiter":"/","description":"Specifies that data coordinates are to be used in positioning the inset with the POSITION= option.","type":"standalone"},{"name":"DATA=","optional":true,"followsDelimiter":"/","description":"(label, value) pairs from SAS-data-set","type":"value"},{"name":"FONT=","optional":true,"followsDelimiter":"/","description":"Specifies the font of the text. By default, the font is SIMPLEX if the inset is located in the interior of the plot, and the font is the same as the other text displayed on the plot if the inset is located in the exterior of the plot.","help":"FONT=*font*","type":"value"},{"name":"FORMAT=","optional":true,"followsDelimiter":"/","description":"Specifies a format for all the values displayed in an inset.","help":"FORMAT=*format*","type":"value"},{"name":"HEADER=","optional":true,"followsDelimiter":"/","description":"Specifies the header text. The string cannot exceed 40 characters.","type":"value"},{"name":"HEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies the height of the text in screen percent units.","help":"HEIGHT=*value*","type":"value"},{"name":"NOFRAME","optional":true,"followsDelimiter":"/","description":"Suppresses the frame drawn around the text.","type":"standalone"},{"name":"POSITION=","optional":true,"followsDelimiter":"/","description":"Determines the position of the inset. The position can be a compass point keyword, a margin keyword, or a pair of coordinates (x,y). You can specify coordinates in axis percent units or axis data units.","help":"POSITION=*position*","type":"value"},{"name":"REFPOINT=","optional":true,"followsDelimiter":"/","description":"Specifies the reference point for an inset that is positioned by a pair of coordinates with the POSITION= option.","help":"REFPOINT=BR | BL | TR | TL","type":"choice","arguments":[{"name":"BR","followsDelimiter":"/","description":"Bottom right","type":"standalone"},{"name":"BL","followsDelimiter":"/","description":"Bottom left","type":"standalone"},{"name":"TR","followsDelimiter":"/","description":"Top right","type":"standalone"},{"name":"TL","followsDelimiter":"/","description":"Top left","type":"standalone"}]}]},{"name":"VBAR","description":"The VBAR statement creates a Pareto chart with vertical bars representing the frequencies of problems in a process or operation. A vertical Pareto chart has one horizontal axis on which the Pareto categories are listed.","help":"VBAR &lt;ANCHOR=&lt;BC | BL | TC&gt;... &gt; &lt;ANGLE=value&gt; &lt;ANNOKEY&gt; ...","arguments":[{"name":"ANCHOR=","optional":true,"followsDelimiter":"/","description":"Specifies where the Pareto curve is anchored to the leftmost bar on the chart.","help":"ANCHOR=BC | BL | TC | TR","type":"choice","arguments":[{"name":"BC","followsDelimiter":"/","description":"Bottom center","type":"standalone"},{"name":"BL","followsDelimiter":"/","description":"Bottom left corner","type":"standalone"},{"name":"TC","followsDelimiter":"/","description":"Top center","type":"standalone"},{"name":"TR","followsDelimiter":"/","description":"Top right corner","type":"standalone"}]},{"name":"ANGLE=","optional":true,"followsDelimiter":"/","description":"Specifies an angle in degrees for rotating the Pareto category labels on the horizontal axis. The value is the angle between the baseline of the label and the horizontal axis.","help":"ANGLE=*value*","type":"value"},{"name":"ANNOKEY","optional":true,"followsDelimiter":"/","description":"Specifies that annotation requested with the ANNOTATE= and ANNOTATE2= options is to be applied only to the key cell in a comparative Pareto chart.","type":"standalone"},{"name":"ANNOTATE2=","optional":true,"followsDelimiter":"/","aliases":["ANNO2="],"description":"Specifies an input data set that contains annotate variables. This data set is associated with the secondary vertical axis.","help":"ANNOTATE2=*SAS-data-set*","type":"dataSet"},{"name":"ANNOTATE=","optional":true,"followsDelimiter":"/","aliases":["ANNO="],"description":"Specifies an input data set that contains annotate variables. This data set is associated with the primary vertical axis.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"AXISFACTOR=","optional":true,"followsDelimiter":"/","description":"Specifies a factor used in scaling the primary vertical axis.","help":"AXISFACTOR=*value*","type":"value"},{"name":"BARLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies that a label is to be displayed above each bar.","help":"BARLABEL=VALUE | CMPCT | (*variable*)","type":"choice","arguments":[{"name":"VALUE","followsDelimiter":"/","description":"The label indicates the height of the bar in the units used by the primary vertical axis.","type":"standalone"},{"name":"CMPCT","followsDelimiter":"/","description":"The label indicates the cumulative percent for that bar.","type":"standalone"},{"name":"(variable)","placeholder":true,"followsDelimiter":"/","description":"The label indicates the values of the variable specified in parentheses.","type":"value"}]},{"name":"BARLABPOS=","optional":true,"followsDelimiter":"/","description":"Specifies the position for labels requested with the BARLABEL= option.","help":"BARLABPOS=VFIT | HCENTER | VBAR | LJUST","type":"choice","arguments":[{"name":"VFIT","followsDelimiter":"/","description":"Displays the labels vertically on or above the bars, depending on the available space (the labels are truncated if necessary).","type":"standalone"},{"name":"HCENTER","followsDelimiter":"/","description":"Centers the labels horizontally above the bars.","type":"standalone"},{"name":"VBAR","followsDelimiter":"/","description":"Displays the labels vertically on the bars (the labels are truncated if necessary).","type":"standalone"},{"name":"LJUST","followsDelimiter":"/","description":"Left-justifies the labels horizontally above the bars.","type":"standalone"}]},{"name":"BARLEGEND=","optional":true,"followsDelimiter":"/","description":"Specifies that a legend is to be added to the chart to explain colors for bars specified with the BARS= or CBARS=(variable-list) options, or patterns for bars specified with the PBARS=(variable-list) option. The variable-list must be enclosed in parentheses even if only one variable is specified.","type":"value"},{"name":"BARLEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies the label displayed to the left of the legend created with the BARLEGEND= option.","help":"BARLEGLABEL='*label*'","type":"value"},{"name":"BARS=","optional":true,"followsDelimiter":"/","description":"Groups bars of the Pareto chart for display using colors from the current ODS style.","type":"value"},{"name":"BARWIDTH=","optional":true,"followsDelimiter":"/","description":"Specifies the width of the bars in percent screen units. By default, the bars are as wide as possible.","help":"BARWIDTH=*value*","type":"value"},{"name":"CATLEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label for the category legend that is added when there is insufficient space to label the categories along the horizontal axis. The label can be up to 16 characters and must be enclosed in quotes.","help":"CATLEGLABEL='*label*'","type":"value"},{"name":"CAXIS2=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the tick mark labels and axis label associated with the secondary axis.","type":"value"},{"name":"CAXIS=","optional":true,"followsDelimiter":"/","aliases":["CAXES=","CA="],"description":"Specifies the color for the axis line and tick marks on the chart.","help":"CAXIS=*color*","type":"color"},{"name":"CBARLINE=","optional":true,"followsDelimiter":"/","description":"Specifies the color for bar outlines.","help":"CBARLINE=*color*","type":"color"},{"name":"CBARS=","optional":true,"followsDelimiter":"/","description":"Specifies how the bars of the Pareto chart are to be colored.","help":"CBARS=*color*","type":"color"},{"name":"CCONNECT=","optional":true,"followsDelimiter":"/","description":"Specifies the color for line segments connecting points on the cumulative percent curve.","help":"CCONNECT=*color*","type":"color"},{"name":"CFRAME=","optional":true,"followsDelimiter":"/","description":"Specifies the color for filling the area enclosed by the axes and the frame. The CFRAME= option cannot be used in conjunction with the NOFRAME option or the CTILES= option.","help":"CFRAME=*color*","type":"color"},{"name":"CFRAMENLEG","optional":true,"followsDelimiter":"/","description":"Specifies that the legend requested with the NLEGEND option be framed and that the frame be filled with a color from the ODS style.","type":"color"},{"name":"CFRAMENLEG=","optional":true,"followsDelimiter":"/","description":"Specifies that the legend requested with the NLEGEND option be framed and that the frame be filled with the color indicated.","help":"CFRAMENLEG=*color*","type":"color"},{"name":"CFRAMESIDE=","optional":true,"followsDelimiter":"/","description":"Specifies the color for filling the frame area for the row labels displayed along the left side of a comparative Pareto chart requested with the CLASS= option.","help":"CFRAMESIDE=*color*","type":"color"},{"name":"CFRAMETOP=","optional":true,"followsDelimiter":"/","description":"Specifies the color for filling the frame area for the column labels displayed across the top of a comparative Pareto chart requested with the CLASS= option.","help":"CFRAMETOP=*color*","type":"color"},{"name":"CGRID2=","optional":true,"followsDelimiter":"/","description":"Specifies the color for grid lines requested with the GRID2 option.","type":"value"},{"name":"CGRID=","optional":true,"followsDelimiter":"/","description":"Specifies the color for grid lines requested with the GRID option.","help":"CGRID=*color*","type":"color"},{"name":"CHIGH=","optional":true,"followsDelimiter":"/","description":"Specifies the color used to fill the bars with the n highest values.","type":"value"},{"name":"CHREF=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the lines requested with the HREF= option.","help":"CHREF=*color*","type":"color"},{"name":"CLASS=","optional":true,"followsDelimiter":"/","description":"Creates a comparative Pareto chart using the levels of the variables. You must enclose two variables in parentheses.","type":"value"},{"name":"CLASSKEY=","optional":true,"followsDelimiter":"/","description":"Specifies the key cell in a comparative Pareto chart requested with the CLASS= option.","type":"value"},{"name":"CLIPCHAR=","optional":true,"followsDelimiter":"/","description":"Specifies a plot character that identifies clipped points, as requested with the CLIPFACTOR= option.","help":"CLIPCHAR='*character*'","type":"value"},{"name":"CLIPREF","optional":true,"followsDelimiter":"/","description":"Draws reference lines requested with the HREF= and VREF= options behind the bars on the Pareto chart.","type":"standalone"},{"name":"CLOW=","optional":true,"followsDelimiter":"/","description":"Specifies the color used to fill the bars with the n lowest values.","type":"value"},{"name":"CMPCTLABEL","optional":true,"followsDelimiter":"/","description":"Labels points on the cumulative percent curve with their values. By default, the points are not labeled.","type":"standalone"},{"name":"CONNECTCHAR=","optional":true,"followsDelimiter":"/","aliases":["CCHAR="],"description":"Specifies the plot character for line segments that connect points on the cumulative percent curve. The default character is a plus sign (+).","help":"CONNECTCHAR='*character*'","type":"value"},{"name":"COTHER=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the bar defined by the OTHER= option.","help":"COTHER=*color*","type":"color"},{"name":"CPROP=","optional":true,"followsDelimiter":"/","description":"Requests a proportion-of-frequency bar of the specified color displayed horizontally across the top of each tile in a comparative Pareto chart.","help":"CPROP=*color*","type":"color"},{"name":"CTEXT=","optional":true,"followsDelimiter":"/","aliases":["CT="],"description":"Specifies the color for text, such as tick mark labels, axis labels, and legends.","help":"CTEXT=*color*","type":"color"},{"name":"CTEXTSIDE=","optional":true,"followsDelimiter":"/","description":"Specifies the color for row labels displayed along the left side of a comparative Pareto chart requested with the CLASS= option.","help":"CTEXTSIDE=*color*","type":"color"},{"name":"CTEXTTOP=","optional":true,"followsDelimiter":"/","description":"Specifies the color for column labels displayed across the top of a comparative Pareto chart requested with the CLASS= option.","help":"CTEXTTOP=*color*","type":"color"},{"name":"CTILES=","optional":true,"followsDelimiter":"/","description":"Specifies a character variable of length eight whose values are the fill colors for the tiles in a comparative Pareto chart.","type":"value"},{"name":"CVREF=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the lines requested by the VREF= and VREF2= options.","help":"CVREF=*color*","type":"color"},{"name":"DESCRIPTION=","optional":true,"followsDelimiter":"/","description":"Specifies a descriptive string, up to 256 characters, that appears in the description field of the PROC GREPLAY master menu for traditional graphics output.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"FONT=","optional":true,"followsDelimiter":"/","description":"Specifies a software font for text used in labels and legends.","help":"FONT=*font*","type":"value"},{"name":"FREQ=","optional":true,"followsDelimiter":"/","description":"Specifies a frequency variable whose value provides the counts (numbers of occurrences) of the values of the process variable.","help":"FREQ=*variable*","type":"value"},{"name":"FRONTREF","optional":true,"followsDelimiter":"/","description":"Draws reference lines specified with the HREF= and VREF= options in front of the bars on the Pareto chart.","type":"standalone"},{"name":"GRID","optional":true,"followsDelimiter":"/","description":"Adds a grid to the Pareto chart corresponding to the primary vertical axis.","type":"standalone"},{"name":"GRID2","optional":true,"followsDelimiter":"/","description":"Adds a grid to the Pareto chart corresponding to the secondary vertical axis.","type":"standalone"},{"name":"HEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies the height in percent screen units of text for labels and legends.","help":"HEIGHT=*value*","type":"value"},{"name":"HLLEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label displayed to the left of the legend that is automatically created when you use a combination of the CHIGH, CLOW, PHIGH, and PLOW options.","help":"HLLEGLABEL='*label*'","type":"value"},{"name":"HOFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies the length (in percent screen units) of the offset at both ends of the horizontal axis. You can eliminate the offset by specifying HOFFSET=0.","help":"HOFFSET=*value*","type":"value"},{"name":"HREF=","optional":true,"followsDelimiter":"/","description":"Specifies where reference lines perpendicular to the horizontal (Pareto category) axis are to appear on the chart. Character values can be up to 64 characters and must be enclosed in quotes.","help":"HREF='*value-list*'","type":"value"},{"name":"HREFCHAR=","optional":true,"followsDelimiter":"/","description":"Specifies the plot character used to form the lines requested with the HREF= option. The default character is a vertical bar (|).","help":"HREFCHAR='*character*'","type":"value"},{"name":"HREFLABELS=","optional":true,"followsDelimiter":"/","description":"Specifies labels for the lines requested with the HREF= option.","type":"value"},{"name":"HREFLABPOS=","optional":true,"followsDelimiter":"/","description":"Specifies the vertical position of the HREFLABEL= labels.","help":"HREFLABPOS=1 | 2 | 3 | 4","type":"choice","arguments":[{"name":"1","followsDelimiter":"/","description":"Along top of chart","type":"standalone"},{"name":"2","followsDelimiter":"/","description":"Staggered from top to bottom of chart","type":"standalone"},{"name":"3","followsDelimiter":"/","description":"Along bottom of chart","type":"standalone"},{"name":"4","followsDelimiter":"/","description":"Staggered from bottom to top of chart","type":"standalone"}]},{"name":"HTML=","optional":true,"followsDelimiter":"/","description":"Specifies URLs as values of the specified character variable (or formatted values of a numeric variable). These URLs are associated with bars on the Pareto chart when traditional graphics output is directed into HTML.","help":"HTML=*variable*","type":"value"},{"name":"INFONT=","optional":true,"followsDelimiter":"/","description":"Specifies a software font for text used inside the frame of the chart, such as sample size legends.","help":"INFONT=*font*","type":"value"},{"name":"INHEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies the height in percent screen units of text used inside the frame of the chart, such as sample size legends and bar labels.","type":"value"},{"name":"INTERBAR=","optional":true,"followsDelimiter":"/","description":"Specifies the distance in percent screen units between bars on the chart.","help":"INTERBAR=*value*","type":"value"},{"name":"INTERTILE=","optional":true,"followsDelimiter":"/","description":"Specifies the distance in horizontal percent screen units between tiles (cells) in a comparative Pareto chart.","help":"INTERTILE=*value*","type":"value"},{"name":"LABOTHER=","optional":true,"followsDelimiter":"/","description":"Is used in conjunction with the BARLABEL=(variable) option and specifies a label for the \"other\" category that is optionally specified with the OTHER= option.","type":"value"},{"name":"LAST=","optional":true,"followsDelimiter":"/","description":"Specifies that the bar corresponding to the category is to be displayed at the right end of the chart regardless of the percent associated with this category","help":"LAST='*category*'","type":"value"},{"name":"LGRID2=","optional":true,"followsDelimiter":"/","description":"Specifies the line type for the grid requested with the GRID2 option.","type":"value"},{"name":"LGRID=","optional":true,"followsDelimiter":"/","description":"Specifies the line type for the grid requested with the GRID option.","help":"LGRID=*line-type*","type":"value"},{"name":"LHREF=","optional":true,"followsDelimiter":"/","aliases":["LH="],"description":"Specifies the line type for lines requested with the HREF= option.","help":"LHREF=*line-type*","type":"value"},{"name":"LOTHER=","optional":true,"followsDelimiter":"/","description":"Specifies a label for the bar defined with the OTHER= option.","help":"LOTHER='*label*'","type":"value"},{"name":"LVREF=","optional":true,"followsDelimiter":"/","aliases":["LV="],"description":"Specifies the line type for lines requested by the VREF= and VREF2= options.","help":"LVREF=*line-type*","type":"value"},{"name":"MARKERS","optional":true,"followsDelimiter":"/","description":"Specifies that the points on the cumulative percent curve be plotted with markers in ODS Graphics output.","type":"standalone"},{"name":"MAXCMPCT=","optional":true,"followsDelimiter":"/","description":"Specifies that only the Pareto categories with the n highest frequency counts are to be displayed, where the sum of the n corresponding percents is less than or equal to the specified percent.","help":"MAXCMPCT=*percent*","type":"value"},{"name":"MAXNCAT=","optional":true,"followsDelimiter":"/","description":"Specifies that only the Pareto categories with the n highest frequencies are to be displayed.","help":"MAXNCAT=*n*","type":"value"},{"name":"MINPCT=","optional":true,"followsDelimiter":"/","description":"Specifies that only the Pareto categories with frequency percents greater than or equal to the specified percent are to be displayed.","help":"MINPCT=*percent*","type":"value"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Specifies that missing values of the process variable are to be treated as a Pareto category represented with a bar on the chart.","type":"standalone"},{"name":"MISSING1","optional":true,"followsDelimiter":"/","description":"Specifies that missing values of the first CLASS= variable are to be treated as a level of the CLASS= variable.","type":"standalone"},{"name":"MISSING2","optional":true,"followsDelimiter":"/","description":"Specifies that missing values of the second CLASS= variable are to be treated as a level of the CLASS= variable.","type":"standalone"},{"name":"NAME=","optional":true,"followsDelimiter":"/","description":"Specifies a name for a traditional graphics chart, up to eight characters, that appears in the PROC GREPLAY master menu. The default name is 'PARETO'.","help":"NAME='*string*'","type":"value"},{"name":"NCOLS=","optional":true,"followsDelimiter":"/","aliases":["NCOL="],"description":"Specifies the number of columns in a comparative Pareto chart.","help":"NCOLS=*n*","type":"value"},{"name":"NLEGEND","optional":true,"followsDelimiter":"/","description":"Requests a sample size legend and specifies its form as N=n, where n is the total count for the Pareto categories. In a comparative Pareto chart, a legend is displayed in each tile, and n is the total count for that particular cell.","type":"standalone"},{"name":"NLEGEND=","optional":true,"followsDelimiter":"/","description":"Requests a sample size legend and specifies its form as label=n, where n is the total count for the Pareto categories. If you specify the NLEGEND=(variable) option, the legend is the value of the variable, which must be a variable in the DATA= data set whose formatted length does not exceed 32.","type":"value"},{"name":"NOCHART","optional":true,"followsDelimiter":"/","description":"Suppresses the creation of a Pareto chart.","type":"standalone"},{"name":"NOCTL2","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the central line in a secondary chart.","type":"standalone"},{"name":"NOCURVE","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the cumulative percent curve and the secondary vertical axis.","type":"standalone"},{"name":"NOFRAME","optional":true,"followsDelimiter":"/","description":"Suppresses the frame that is drawn around the chart by default","type":"standalone"},{"name":"NOHLABEL","optional":true,"followsDelimiter":"/","description":"Suppresses the label for the horizontal axis.","type":"standalone"},{"name":"NOHLLEG","optional":true,"followsDelimiter":"/","description":"Suppresses the legend generated by the CHIGH(n)=, CLOW(n)=, PHIGH(n)=, and PLOW(n)= options.","type":"standalone"},{"name":"NOKEYMOVE","optional":true,"followsDelimiter":"/","description":"Suppresses the rearrangement of cells within a comparative Pareto chart that occurs when you use the CLASSKEY= option.","type":"standalone"},{"name":"NOVLABEL","optional":true,"followsDelimiter":"/","description":"Suppresses the label for the primary vertical axis.","type":"standalone"},{"name":"NOVLABEL2","optional":true,"followsDelimiter":"/","description":"Suppresses the label for the secondary vertical axis.","type":"standalone"},{"name":"NOVTICK","optional":true,"followsDelimiter":"/","description":"Suppresses the primary vertical axis label, tick marks, and tick mark labels.","type":"standalone"},{"name":"NROWS=","optional":true,"followsDelimiter":"/","aliases":["NROW="],"description":"Specifies the number of rows in a comparative Pareto chart.","help":"NROWS=*n*","type":"value"},{"name":"ORDER1=","optional":true,"followsDelimiter":"/","description":"Specifies the display order for the values of the first CLASS= variable.","help":"ORDER1=INTERNAL | FORMATTED | DATA | FREQ","type":"choice","arguments":[{"name":"INTERNAL","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the internal, or unformatted, values of the first CLASS= variable.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the formatted values of the first CLASS= variable.","type":"standalone"},{"name":"DATA","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in the order in which the values of the first CLASS= variable first appear in the input data set.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in order of decreasing frequency count.","type":"standalone"}]},{"name":"ORDER2=","optional":true,"followsDelimiter":"/","description":"Specifies the display order for the values of the second CLASS= variable.","help":"ORDER2=INTERNAL | FORMATTED | DATA | FREQ","type":"choice","arguments":[{"name":"INTERNAL","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the internal, or unformatted, values of the first CLASS= variable.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in increasing order of the formatted values of the first CLASS= variable.","type":"standalone"},{"name":"DATA","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in the order in which the values of the first CLASS= variable first appear in the input data set.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"The rows (columns) are displayed from top to bottom (left to right) in order of decreasing frequency count.","type":"standalone"}]},{"name":"OTHER=","optional":true,"followsDelimiter":"/","description":"Specifies a new category that merges all categories not selected with the MAXNCAT=, MINPCT=, or MAXCMPCT= options.","help":"OTHER='*category*'","type":"value"},{"name":"OTHERCVAL=","optional":true,"followsDelimiter":"/","description":"Specifies the internal (unformatted) value for a character process variable in the OUT= data set that corresponds to the category created with the OTHER= option.","help":"OTHERCVAL='*value*'","type":"value"},{"name":"OTHERNVAL=","optional":true,"followsDelimiter":"/","description":"Specifies the internal (unformatted) value for a numeric process variable in the OUT= data set that corresponds to the category created with the OTHER= option.","help":"OTHERNVAL=*value*","type":"value"},{"name":"OUT=","optional":true,"followsDelimiter":"/","description":"Creates an output data set that contains the information displayed in the Pareto chart.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PBARS=","optional":true,"followsDelimiter":"/","description":"Specifies pattern fills for the bars.","type":"value"},{"name":"PHIGH=","optional":true,"followsDelimiter":"/","description":"Specifies the pattern used to fill the bars with the n highest values.","type":"value"},{"name":"PLOW=","optional":true,"followsDelimiter":"/","description":"Specifies the pattern used to fill the bars with the n lowest values.","type":"value"},{"name":"POTHER=","optional":true,"followsDelimiter":"/","description":"Specifies the pattern used for the bar defined by the OTHER= option.","help":"POTHER=*pattern*","type":"value"},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Specifies the scale for the primary vertical axis.","help":"SCALE=PERCENT | COUNT | WEIGHT","type":"choice","arguments":[{"name":"PERCENT","followsDelimiter":"/","description":"The scale is percent of total frequency; this is the default.","type":"standalone"},{"name":"COUNT","followsDelimiter":"/","description":"The scale is counts.","type":"standalone"},{"name":"WEIGHT","followsDelimiter":"/","description":"The vertical axis is scaled in the same units as the WEIGHT= variable.","type":"standalone"}]},{"name":"SYMBOLCHAR=","optional":true,"followsDelimiter":"/","description":"Specifies the plot character for points on the cumulative percent curve. The default character is an asterisk (*).","help":"SYMBOLCHAR='*character*'","type":"value"},{"name":"TILELEGEND=","optional":true,"followsDelimiter":"/","description":"Specifies a variable used to add a legend for CTILES= colors.","type":"value"},{"name":"TILELEGLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label displayed to the left of the legend that is created when you specify a TILELEGEND= variable.","help":"TILELEGLABEL='*label*'","type":"value"},{"name":"TURNVLABEL","optional":true,"followsDelimiter":"/","aliases":["TURNVLABELS"],"description":"Turns and strings out vertically the characters in the labels for the primary and secondary vertical axes.","type":"standalone"},{"name":"VAXIS2=","optional":true,"followsDelimiter":"/","description":"Specifies tick mark values for the secondary vertical axis.","help":"VAXIS2=*value-list*","type":"value"},{"name":"VAXIS2LABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label, up to 40 characters, for the secondary vertical axis.","type":"value"},{"name":"VAXIS=","optional":true,"followsDelimiter":"/","description":"Specifies tick mark values for the primary vertical axis.","help":"VAXIS=*value-list*","type":"value"},{"name":"VAXISLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label, up to 40 characters, for the primary vertical axis.","help":"VAXISLABEL='*label*'","type":"value"},{"name":"VOFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies the length in percent screen units of the offset at the upper end of the primary vertical axis.","help":"VOFFSET=*value*","type":"value"},{"name":"VREF2=","optional":true,"followsDelimiter":"/","description":"Specifies where reference lines perpendicular to the secondary vertical axis are to appear on the chart.","help":"VREF2=*value-list*","type":"value"},{"name":"VREF2LABELS=","optional":true,"followsDelimiter":"/","description":"Specifies labels for the lines requested with the VREF2= option.","type":"value"},{"name":"VREF=","optional":true,"followsDelimiter":"/","description":"Specifies where reference lines perpendicular to the primary vertical axis are to appear on the chart.","help":"VREF=*value-list*","type":"value"},{"name":"VREFCHAR=","optional":true,"followsDelimiter":"/","description":"Specifies the character used to form the lines requested with the VREF= and VREF2= options. The default character is a dash (-).","help":"VREFCHAR='*character*'","type":"value"},{"name":"VREFLABELS=","optional":true,"followsDelimiter":"/","description":"Specifies labels for the lines requested with the VREF= option.","type":"value"},{"name":"VREFLABPOS=","optional":true,"followsDelimiter":"/","description":"Specifies the vertical positioning of the VREFLABEL= and VREF2LABEL= labels.","help":"VREFLABPOS=1 | 2 | 3","type":"choice","arguments":[{"name":"1","followsDelimiter":"/","description":"Left-justified in chart","type":"standalone"},{"name":"2","followsDelimiter":"/","description":"Right-justified in chart","type":"standalone"},{"name":"3","followsDelimiter":"/","description":"Left-justified in right margin","type":"standalone"}]},{"name":"WAXIS=","optional":true,"followsDelimiter":"/","description":"Specifies the line thickness (in pixels) for the axes and frame.","help":"WAXIS=*n*","type":"value"},{"name":"WBARLINE=","optional":true,"followsDelimiter":"/","description":"Specifies the width for bar outlines.","help":"WBARLINE=*n*","type":"value"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies weight variables used to construct weighted Pareto charts.","help":"WEIGHT=*variable-list*","type":"value"},{"name":"WGRID2=","optional":true,"followsDelimiter":"/","description":"Specifies the width of the secondary chart grid lines.","type":"value"},{"name":"WGRID=","optional":true,"followsDelimiter":"/","description":"Specifies the width of the primary chart grid lines.","help":"WGRID=*n*","type":"value"}]}],"supportSiteInformation":{"docsetId":"qcug","docsetVersion":"v_002","docsetTargetFile":"qcug_pareto_toc.htm"}}