{"name":"PHREG","statements":[{"name":"PROC PHREG","description":"RANDOM variable </ options> ; SLICE model-effect </ options> ; STORE <OUT=> item-store-name </ LABEL='label'> ; STRATA variable <(list)> <...variable <(list)>> < / option> ; <label:>TEST equation <,..., equation >< / options> ; WEIGHT variable </ option> ; † The analysis of survival data requires special techniques because the data are almost always incomplete and familiar parametric assumptions might be unjustifiable. Investigators follow subjects until they reach a prespecified endpoint (for example, death). However, subjects sometimes withdraw from a study, or the study is completed before the endpoint is reached. In these cases, the survival times (also known as failure times) are censored; subjects survived to a certain time beyond which their status is unknown. The uncensored survival times are sometimes referred to as event times. Methods of survival analysis must account for both censored and uncensored data. † The PHREG procedure performs regression analysis of survival data based on the Cox proportional hazards model.","help":"PROC PHREG <ALPHA=number> <ATRISK> <COVM> <COVOUT> <COVSANDWICH <(AGGREGATE)>> <DATA=SAS-data-set> <INEST=SAS-data-set> <MULTIPASS> <NAMELEN=n> <NOPRINT> <NOSUMMARY> <OUTEST=SAS-data-set> <PLOTS=CUMHAZ | MCF | NONE... > <SIMPLE>;     \n\tABORT <ABEND> <CANCEL> <CANCEL FILE> ...;     \n\tARRAY <_ALL_> <_NUMERIC_> <_TEMPORARY_> ...; \n   \n\tASSESS <NPATHS=n> PROPORTIONALHAZARDS VAR=(variable-list) ...;     \n\tBASELINE COVARIATES=SAS-data-set OUT=SAS-data-set OUTDIFF=SAS-data-set ...;     \n\tBAYES <COEFFPRIOR=<UNIFORM | NORMAL | ZELLNER>> <DIAGNOSTICS=<ALL | NONE | AUTOCORR>... > <DISPERSIONPRIOR=<GAMMA | IGAMMA | IMPROPER>> ...; \n   \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCALL routine(parameter-1<, ...parameter-n>); \n   \n\tCLASS <CPREFIX=n> <DESCENDING> <LPREFIX=n> ...; \n   \n\tCONTRAST <ALPHA=p> <E> <SINGULAR=number> ...; \n   \n\tDO <OVER> <> <> ...; \n   \n\tEFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tELSE <DO> <IF> <THEN> ...; \n   \n\tEND;     \n\tESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tFREQ <NOTRUNCATE> ; \n   \n\tGOTO label;     \n\tHAZARDRATIO <ALPHA=number> <AT (variable=ALL | REF | list <...variable=ALL | REF| list> )> <CL=<WALD | PL | BOTH>> ...; \n   \n\tID variables ;     \n\tIF <DO> <THEN> <WHEN> ...; \n   \n\tLINK statement-label;     \n\tLSMEANS <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tLSMESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tMODEL <ABSFCONV=value | CONVERGELIKE=value> <ALPHA=number> <BEST=n> ...; \n   \n\tOUTPUT ATRISK= DFBETA= OUT=SAS-data-set ...; \n   \n\tPUT <_PAGE_> ;  \n  \n\tRANDOM <ABSPCONV=r> <ALPHA=value> <DIST=<GAMMA | LOGNORMAL>> ...; \n   \n\tRETURN;     \n\t; \n   \n\tSLICE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tSTORE <LABEL='label'> OUT=item-store-name ;     \n\tSTRATA <MISSING> ; \n   \n\tTEST <AVERAGE> <E> <PRINT> ...; \n   \n\tWEIGHT <NORMALIZE> ; ","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance α for 100(1 - α)% confidence intervals. The value number must be between 0 and 1; the default value is 0.05, which results in 95% intervals.","help":"ALPHA=*number*","type":"value"},{"name":"ATRISK","optional":true,"description":"Displays a table that contains the number of units at risk at each event time and the corresponding number of events in the risk sets.","type":"standalone"},{"name":"COVM","optional":true,"description":"Requests that the model-based covariance matrix (which is the inverse of the observed information matrix) be used in the analysis if the COVS option is also specified.","type":"standalone"},{"name":"COVOUT","optional":true,"description":"Adds the estimated covariance matrix to the OUTEST= data set. For the COVOUT option to have an effect, the OUTEST= option must be specified.","type":"standalone"},{"name":"COVSANDWICH=","optional":true,"aliases":["COVS"],"description":"Requests the robust sandwich estimate of Lin and Wei (1989) for the covariance matrix.","help":"COVSANDWICH=AGGREGATE","type":"choice","arguments":[{"name":"AGGREGATE","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Names the SAS data set containing the data to be analyzed. If you omit the DATA= option, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"INEST=","optional":true,"description":"Names the SAS data set that contains initial estimates for all the parameters in the model.","help":"INEST=*SAS-data-set*","type":"dataSet"},{"name":"MULTIPASS","optional":true,"description":"Requests that, for each Newton-Raphson iteration, PROC PHREG recompile the risk sets corresponding to the event times for the (start,stop) style of response and recomputes the values of the time- dependent variables defined by the programming statements for each observation in the risk sets.","type":"standalone"},{"name":"NAMELEN=","optional":true,"description":"Specifies the maximum length of effect names in tables and output data sets to be n characters, where n is a value between 20 and 200. The default length is 20 characters.","help":"NAMELEN=*n*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses all displayed output. Note that this option temporarily disables the Output Delivery System (ODS).","type":"standalone"},{"name":"NOSUMMARY","optional":true,"description":"Suppresses the summary display of the event and censored observation frequencies.","type":"standalone"},{"name":"OUTEST=","optional":true,"description":"Creates an output SAS data set that contains estimates of the regression coefficients.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Controls the baseline functions plots produced through ODS Graphics. Syntax: (1) PLOTS<(global-plot-options)> = plot-request (2) PLOTS<(global-plot-options)> = (plot-request <...<plot-request>>) The following global-plot-options are available: CL<=EQTAIL | HPD> displays the pointwise interval limits for the specified curves","help":"PLOTS=CUMHAZ | MCF | NONE | SURVIVAL","type":"choice","arguments":[{"name":"CUMHAZ","description":"Plots the estimated cumulative hazard function for each set of covariates in the COVARIATES= data set in the BASELINE statement.","type":"standalone"},{"name":"MCF","description":"Plots the estimated mean cumulative function for each set of covariates in the COVARIATES= data set in the BASELINE statement.","type":"standalone"},{"name":"NONE","description":"Suppresses all the plots in the procedure. Specifying this option is equivalent to disabling ODS Graphics for the entire procedure.","type":"standalone"},{"name":"SURVIVAL","description":"Plots the estimated survivor function for each set of covariates in the COVARIATES= data set in the BASELINE statement.","type":"standalone"}]},{"name":"SIMPLE","optional":true,"description":"Displays simple descriptive statistics (mean, standard deviation, minimum and maximum) for each explanatory variable in the MODEL statement.","type":"standalone"}]},{"name":"ABORT","description":"Stops executing the current DATA step, SAS job, or SAS session.","help":"ABORT &lt;ABEND&gt; &lt;CANCEL&gt; &lt;CANCEL FILE&gt; ...","arguments":[{"name":"ABEND","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the ABEND option of the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment; further action is based on how your operating environment and your site treat jobs that end abnormally. o windowing environment and interactive line mode","type":"standalone"},{"name":"CANCEL","optional":true,"description":"Causes the cancellation of the current submitted statements. The results depend on the method of operation: o batch mode and noninteractive mode o The entire SAS program and SAS system are terminated. o The error message is written to the SAS log. o windowing environment and interactive line mode o It only clears the current submitted program. o Other subsequent submitted programs are not affected. o The error message is written to the SAS log. o workspace server and stored process server o It only clears currently submitted program. o Other subsequent submit calls are not affected. o The error message is written to the SAS log. o SAS IntrNet application server","type":"standalone"},{"name":"CANCEL FILE","optional":true,"description":"Causes only the contents of the autoexec file or %INCLUDE file to be cleared by the %ABORT statement. Other submitted source statements will be executed after the autoexec or %INCLUDE file.","type":"standalone"},{"name":"NOLIST","optional":true,"description":"suppresses the output of all variables to the SAS log.","type":"standalone"},{"name":"RETURN","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the RETURN option in the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment with a condition code indicating an error. o windowing environment and interactive line mode","type":"standalone"}]},{"name":"ARRAY","description":"Defines the elements of an array.","help":"ARRAY &lt;_ALL_&gt; &lt;_NUMERIC_&gt; &lt;_TEMPORARY_&gt; ...","arguments":[{"name":"_ALL_","optional":true,"description":"Specifies all variables.","type":"standalone"},{"name":"_CHARACTER_","optional":true,"description":"Specifies all character variables.","type":"standalone"},{"name":"_NUMERIC_","optional":true,"description":"Specifies all numeric variables.","type":"standalone"},{"name":"_TEMPORARY_","optional":true,"description":"Creates a list of temporary data elements.","type":"standalone"}]},{"name":"ASSESS","description":"The ASSESS statement performs the graphical and numerical methods of Lin, Wei, and Ying (1993) for checking the adequacy of the Cox regression model. The methods are derived from cumulative sums of martingale residuals over follow-up times or covariate values. You can assess the functional form of a covariate or you can check the proportional hazards assumption for each covariate in the Cox model.","help":"ASSESS &lt;NPATHS=n&gt; PROPORTIONALHAZARDS VAR=(variable-list) ...","arguments":[{"name":"PROPORTIONALHAZARDS","aliases":["PH"],"description":"Requests the checking of the proportional hazards assumption.","type":"standalone"},{"name":"VAR=","description":"Specifies the list of explanatory variables for which their functional forms are assessed.","type":"value"},{"name":"CRPANEL","optional":true,"followsDelimiter":"/","description":"Requests that a plot with four panels, each containing the observed cumulative martingale residuals and two simulated residual patterns, be created.","type":"standalone"},{"name":"NPATHS=","optional":true,"followsDelimiter":"/","description":"Specifies the number of simulated residual patterns to be displayed in a cumulative martingale residual plot or a score process plot. The default is n=20.","help":"NPATHS=*n*","type":"value"},{"name":"RESAMPLE=","optional":true,"followsDelimiter":"/","description":"Requests that the Kolmogorov-type supremum test be computed on 1,000 simulated patterns or on n simulated patterns if n is specified.","type":"value"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies an integer seed for the random number generator used in creating simulated realizations for plots and for the Kolmogorov-type supremum tests.","help":"SEED=*n*","type":"value"}]},{"name":"BASELINE","description":"The BASELINE statement creates a new SAS data set that contains the baseline function estimates at the event times of each stratum for every set of covariates (x) given in the COVARIATES= data set.","help":"BASELINE COVARIATES=SAS-data-set OUT=SAS-data-set OUTDIFF=SAS-data-set ...","arguments":[{"name":"CMF=","aliases":["MCF="],"description":"Specifies the cumulative mean function estimate for recurrent events data.","help":"CMF=&lt;*name*&gt; | _ALL_","type":"choice","arguments":[{"name":"name","placeholder":true,"description":"Replace <name> with the name of the variable for the statistic.","type":"value"},{"name":"_ALL_","description":"Equivalent to specifying CMF=CMF, STDCMF=StdErrCMF, LOWERCMF=LowerCMF, and UPPERCMF=UpperCMF. Nelson (2002) refers to the mean function estimate as MCF (mean cumulative function).","type":"standalone"}]},{"name":"COVARIATES=","description":"Names the SAS data set that contains the sets of explanatory variable values for which the quantities of interest are estimated.","help":"COVARIATES=*SAS-data-set*","type":"dataSet"},{"name":"CUMHAZ=","description":"Specifies the cumulative hazard function estimate.","type":"value"},{"name":"LOGLOGS=","description":"Specifies the log of the negative log of SURVIVAL.","help":"LOGLOGS=*name*","type":"value"},{"name":"LOGSURV=","description":"Specifies the log of SURVIVAL.","type":"value"},{"name":"LOWER=","aliases":["L="],"description":"Specifies the lower pointwise confidence limit for the survivor function. For a Bayesian analysis, this is the lower limit of the equal-tail credible interval for the survivor function. The confidence level is determined by the ALPHA= option.","help":"LOWER=*name*","type":"value"},{"name":"LOWERCMF=","aliases":["LOWERMCF="],"description":"Specifies the lower pointwise confidence limit for the cumulative mean function. The confidence level is determined by the ALPHA= option.","type":"value"},{"name":"LOWERCUMHAZ=","description":"Specifies the lower pointwise confidence limit for the cumulative hazard function. For a Bayesian analysis, this is the lower limit of the equal-tail credible interval for the cumulative hazard function. The confidence level is determined by the ALPHA= option.","help":"LOWERCUMHAZ=*name*","type":"value"},{"name":"LOWERHPD=","description":"Specifies the lower limit of the HPD interval for the survivor function. The confidence level is determined by the ALPHA= option.","help":"LOWERHPD=*name*","type":"value"},{"name":"LOWERHPDCUMHAZ=","description":"Specifies the lower limit of the HPD interval for the cumulative hazard function. The confidence level is determined by the ALPHA= option.","help":"LOWERHPDCUMHAZ=*name*","type":"value"},{"name":"OUT=","description":"Names the output BASELINE data set. If you omit the OUT= option, the data set is created and given a default name by using the DATAn convention.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTDIFF=","description":"Names the output data set that contains all pairwise differences of direct adjusted probabilities between groups if the GROUP= variable is specified, or between strata if the GROUP= variable is not specified. It is required that the DIRADJ option be specified to use the OUTDIFF= option.","help":"OUTDIFF=*SAS-data-set*","type":"dataSet"},{"name":"STDCMF=","aliases":["STDMCF="],"description":"Specifies the estimated standard error of the cumulative mean function estimator.","type":"value"},{"name":"STDCUMHAZ=","description":"Specifies the estimated standard error of the cumulative hazard function estimator. For a Bayesian analysis, this is the standard deviation of the posterior distribution of the cumulative hazard function.","help":"STDCUMHAZ=*name*","type":"value"},{"name":"STDERR=","description":"Specifies the standard error of the survivor function estimator. For a Bayesian analysis, this is the standard deviation of the posterior distribution of the survivor function.","help":"STDERR=*name*","type":"value"},{"name":"STDXBETA=","description":"Specifies the estimated standard error of the linear predictor estimator. For a Bayesian analysis, this is the standard deviation of the posterior distribution of the linear predictor.","help":"STDXBETA=*name*","type":"value"},{"name":"SURVIVAL=","description":"Specifies a survivor function estimate.","help":"SURVIVAL=&lt;*name*&gt; | _ALL_","type":"choice","arguments":[{"name":"name","placeholder":true,"description":"Replace <name> with the name of the variable for the statistic.","type":"value"},{"name":"_ALL_","description":"Equivalent to specifying SURVIVAL=Survival, STDERR=StdErrSurvival, LOWER=LowerSurvival, and UPPER=UpperSurvival; and for a Bayesian analyis, SURVIVAL=_ALL_ also specifies LOWERHPD= LowerHPDSurvival and UPPERHPD=UpperHPDSurvival.","type":"standalone"}]},{"name":"TIMELIST=","description":"Specifies a list of time points at which the survival function estimates, cumulative function estimates, or MCF estimates are computed.","help":"TIMELIST=*list*","type":"value"},{"name":"UPPER=","aliases":["U="],"description":"Specifies the upper pointwise confidence limit for the survivor function. For a Bayesian analysis, this is the upper limit of the equal-tail credible interval for the survivor function. The confidence level is determined by the ALPHA= option.","help":"UPPER=*name*","type":"value"},{"name":"UPPERCMF=","aliases":["UPPERMCF="],"description":"Specifies the upper pointwise confidence limit for the cumulative mean function. The confidence level is determined by the ALPHA= option.","help":"UPPERCMF=*name*","type":"value"},{"name":"UPPERCUMHAZ=","description":"Specifies the upper pointwise confidence limit for the cumulative hazard function. For a Bayesian analysis, this is the upper limit of the equal-tail credible interval for the cumulative hazard function. The confidence level is determined by the ALPHA= option.","help":"UPPERCUMHAZ=*name*","type":"value"},{"name":"UPPERHPD=","description":"Specifies the upper limit of the equal-tail credible interval for the survivor function. The confidence level is determined by the ALPHA= option.","help":"UPPERHPD=*name*","type":"value"},{"name":"UPPERHPDCUMHAZ=","description":"Specifies the upper limit of the equal-tail credible interval for the cumulative hazard function. The confidence level is determined by the ALPHA= option.","type":"value"},{"name":"XBETA=","description":"Specifies the estimate of the linear predictor x'β.","help":"XBETA=*name*","type":"value"},{"name":"ALPHA=","optional":true,"description":"Specifies the significance level of the confidence interval for the survivor function. The value must be between 0 and 1.","help":"ALPHA=*value*","type":"value"},{"name":"CLTYPE=","optional":true,"description":"Specifies the method used to compute the confidence limits for S(t,z), the survivor function for a subject with a fixed covariate vector z at event time t.","help":"CLTYPE=LOG | LOGLOG | NORMAL","type":"choice","arguments":[{"name":"LOG","description":"Specifies that the confidence limits for log(S(t,z)) be computed using the normal theory approximation.","type":"standalone"},{"name":"LOGLOG","description":"Specifies that the confidence limits for the log(-log(S(t,z))) be computed using normal theory approximation.","type":"standalone"},{"name":"NORMAL","description":"Specifies that the confidence limits for S(t,z) be computed directly using normal theory approximation.","type":"standalone"}]},{"name":"DIRADJ","optional":true,"description":"Computes direct adjusted survival curves (Makuch 1982; Gail and Byar 1986; Zhang et al. 2007) by averaging the estimated survival curves for the observations in the COVARIATES= data set. If the COVARIATES= data set is not specified, the input data set specified in the DATA= option in the PROC PHREG statement is used instead. If you also specify the GROUP= option, PROC PHREG computes an adjusted survival curve for each value of the GROUP= variable.","type":"standalone"},{"name":"GROUP=","optional":true,"description":"Names a numeric variable in the COVARIATES= data set to group the baseline function curves for the observations into separate plots.","help":"GROUP=*variable*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the method used to compute the survivor function estimates.","help":"METHOD=BRESLOW | FH | PL","type":"choice","arguments":[{"name":"BRESLOW","aliases":["CH","EMP"],"description":"Specifies that the Breslow (1972) method be used to compute the survivor function—that is, that the survivor function be estimated by exponentiating the negative empirical cumulative hazard function.","type":"standalone"},{"name":"FH","description":"Specifies that the Fleming-Harrington (FH) estimates be computed. The FH estimator is a tie-breaking modification of the Breslow estimator. If there are no tied event times, this estimator is the same as the Breslow estimator.","type":"standalone"},{"name":"PL","description":"Specifies that the product-limit estimate of the survivor function be computed. This estimator is not available if you use the model syntax that allows two time variables for counting process style of input; in such a case the Breslow estimator (METHOD=BRESLOW) is used instead.","type":"standalone"}]},{"name":"ROWID=","optional":true,"aliases":["ID=","ROW="],"description":"Names a variable in the COVARIATES= data set for identifying the baseline function curves in the plots.","help":"ROWID=*variable*","type":"value"}]},{"name":"BAYES","description":"The BAYES statement requests a Bayesian analysis of the regression model by using Gibbs sampling. The Bayesian posterior samples (also known as the chain) for the regression parameters can be output to a SAS data set.","help":"BAYES &lt;COEFFPRIOR=&lt;UNIFORM | NORMAL | ZELLNER&gt;&gt; &lt;DIAGNOSTICS=&lt;ALL | NONE | AUTOCORR&gt;... &gt; &lt;DISPERSIONPRIOR=&lt;GAMMA | IGAMMA | IMPROPER&gt;&gt; ...","arguments":[{"name":"COEFFPRIOR=","optional":true,"aliases":["CPRIOR=","COEFF="],"description":"Specifies the prior distribution for the regression coefficients.","help":"COEFFPRIOR=UNIFORM | NORMAL | ZELLNER","type":"choice","arguments":[{"name":"UNIFORM","description":"Specifies a flat prior—that is, the prior that is proportional to a constant.","type":"standalone"},{"name":"NORMAL","description":"Syntax: NORMAL<(normal-option)< Specifies a normal distribution. The normal-options include the following: INPUT=SAS-data-set specifies a SAS data set containing the mean and covariance information of the normal prior. RELVAR<=c> specifies a normal prior N(O,cJ), where J is a diagonal matrix with diagonal elements equal to the variances of the corresponding ML estimator. VAR=c specifies the normal prior N(O,cI), where I is the identity matrix.","type":"standalone"},{"name":"ZELLNER","description":"Syntax: ZELLNER<(g= g-option)> Specifies the Zellner g-prior for the regression coefficients. The g-prior is a multivariate normal prior distribution with mean zero and covariance matrix equal to (gX'X)ˉ¹, where you can specify one of the following g-options: number specifies a constant number for g. The default is 1E-6. GAMMA<SHAPE=a ISCALE=b)> specifies that g has a gamma distibution","type":"standalone"}]},{"name":"DIAGNOSTICS=","optional":true,"aliases":["DIAG=","DIAGNOSTIC="],"description":"Controls the number of diagnostics produced.","help":"DIAGNOSTICS=ALL | NONE | AUTOCORR | ESS | MCSE | HEIDELBERGER | GELMAN | GEWEKE | RAFTERY","type":"choice","arguments":[{"name":"ALL","description":"Requests all the diagnostics.","type":"standalone"},{"name":"NONE","description":"Specify this if you do not want any of the diagnostics.","type":"standalone"},{"name":"AUTOCORR","description":"Syntax: AUTOCORR<(LAGS= numeric-list)> Computes the autocorrelations of lags given by LAGS= list for each parameter.","type":"standalone"},{"name":"ESS","description":"Computes the effective sample size of Kass et al. (1998), the correlation time, and the efficiency of the chain for each parameter.","type":"standalone"},{"name":"MCSE","description":"Computes the Monte Carlo standard error for each parameter.","type":"standalone"},{"name":"HEIDELBERGER","description":"Syntax: HEIDELBERGER<(heidel-options)> Computes the Heidelberger and Welch tests for each parameter. Optionally, you can specify one or more of the following heidel-options: SALPHA=value specifies the α level (0 < α < 1) for the stationarity test. HALPHA=value specifies the α level (0 < α < 1) for the halfwidth test. EPS=value specifies a small positive number ε such that if the halfwidth is less than ε times the sample mean of the retaining samples, the halfwidth test is passed.","type":"standalone"},{"name":"GELMAN","description":"Syntax: GELMAN<=(gelman-options)> Computes the Gelman and Rubin convergence diagnostics. You can specify one or more of the following gelman-options: NCHAIN=number specifies the number of parallel chains used to compute the diagnostic and has to be 2 or larger. ALPHA=value specifies the significance level for the upper bound.","type":"standalone"},{"name":"GEWEKE","description":"Syntax: GEWEKE<=geweke-options> Computes the Geweke diagnostics. The diagnostic is essentially a two-sample t-test between the first f1 portion and the last f2 portion of the chain. The default is f1=0.1 and f2=0.5, but you can choose other fractions by using the following geweke-options: FRAC1=value specifies the early f1 fraction of the Markov chain. FRAC2=value specifies the latter f2 fraction of the Markov chain.","type":"standalone"},{"name":"RAFTERY","description":"Syntax: RAFTERY<(raftery-options)> Computes the Raftery and Lewis diagnostics. The following are available raftery-options: QUANTILE=value Q=value specifies the order (a value between 0 and 1) of the quantile of interest. The default is 0.025. ACCURACY=value R=value specifies a small positive number as the margin of error for measuring the accuracy of estimation of the quantile. The default is 0.005. PROBABILITY=value value specifies the probability of attaining the accuracy of the estimation of the quantile. The default is 0.95. EPSILON=value EPS=value specifies the tolerance level (a small positive number) for the test. The default is 0.001.","type":"standalone"}]},{"name":"DISPERSIONPRIOR=","optional":true,"aliases":["DPRIOR="],"description":"for lognormal frailty, the dispersion parameter is the variance of the normal random component. The default is DISPERSIONPRIOR=IMPROPER.","help":"DISPERSIONPRIOR=GAMMA | IGAMMA | IMPROPER","type":"choice","arguments":[{"name":"GAMMA","description":"Syntax: GAMMA<(options)> Specifies the gamma prior. You can use the following gamma-options enclosed in parentheses to specify the hyperparameters: SHAPE=α and ISCALE=b results in a G(a,b) prior when both gamma-options are specified. SHAPE=c results in G(c,c) prior when specified alone. ISCALE=c results in G(c,c) prior when specified alone. The default is SHAPE=1E–4 and ISCALE=1E–4.","type":"standalone"},{"name":"IGAMMA","description":"Syntax: IGAMMA<(options)> Specifies the inverse-gamma prior. You can use the following gamma-options enclosed in parentheses to specify the hyperparameters: SHAPE=α and ISCALE=b results in a IG(a,b) prior when both gamma-options are specified. SHAPE=c results in IG(c,c) prior when specified alone. ISCALE=c results in IG(c,c) prior when specified alone. The default is SHAPE=2.001 AND SCALE=0.01.","type":"standalone"},{"name":"IMPROPER","description":"Specifies the improper prior, which has a density f(θ) proportional to θ⁻ⁿ (where n=1).","type":"standalone"}]},{"name":"INITIAL=","optional":true,"description":"Specifies the SAS data set that contains the initial values of the Markov chains.","help":"INITIAL=*SAS-data-set*","type":"dataSet"},{"name":"NBI=","optional":true,"description":"Specifies the number of burn-in iterations before the chains are saved. The default is 2000.","help":"NBI=*number*","type":"value"},{"name":"NMC=","optional":true,"description":"Specifies the number of iterations after the burn-in. The default is 10000.","help":"NMC=*number*","type":"value"},{"name":"OUTPOST=","optional":true,"aliases":["OUT="],"description":"Names the SAS data set that contains the posterior samples.","help":"OUTPOST=*SAS-data-set*","type":"dataSet"},{"name":"PIECEWISE=","optional":true,"description":"Specifies that the piecewise constant baseline hazard model be used in the Bayesian analysis. Specifying PIECEWISE by itself is the same as specifying PIECEWISE=LOGHAZARD.","help":"PIECEWISE=HAZARD&lt;(&lt;NINTERVAL=number&gt; &lt;INTERVAL=(numeric-list)&gt; &lt;PRIOR=option&gt;)&gt;&gt; | LOGHAZARD&lt;(&lt;NINTERVAL=number&gt; &lt;INTERVAL=(numeric-list)&gt; &lt;PRIOR=option&gt;)&gt;&gt;","type":"choice","arguments":[{"name":"HAZARD","description":"Syntax: HAZARD<(<NINTERVAL=number> <INTERVAL=(numeric-list)> <PRIOR=option>)>> Models the baseline hazard parameters in the original scale. Hazard parameters are named Lambda1, Lambda2, ..., and so on. Use the following two options to specify the partition of the time axis into intervals of constant baseline hazards: NINTERVAL=number | N=number -- specifies the number of intervals with constant baseline hazard rates. PROC PHREG partitions the time axis into the given number of intervals with approximately equal number of events in each interval. INTERVAL=(numeric-list) -- specifies the list of numbers that partition the time axis into disjoint intervals with constant baseline hazard in each interval. For example, INTERVAL=(100, 150, 200, 250, 300) specifies a model with a constant hazard in the intervals [0,100), [100,150), [150,200), [200,250), [250,300), and [300,∞). PRIOR = IMPROPER | UNIFORM | GAMMA<(gamma-option)> | ARGAMMA<(argamma-option)> The default is PRIOR=IMPROPER. The available prior options include the following: IMPROPER -- specifies a noninformative and improper prior. UNIFORM -- specifies a uniform prior on the real line. GAMMA <(gamma-option)> -- specifies an independent gamma prior G(a,b) which can be followed by one of the following gamma-options: INPUT=SAS-data-set -- specifies a data set containing the hyperparameters of the independent gamma prior. RELSHAPE<=c> -- specifies independent G(cλj,c) distribution, where λj’s are the MLEs of the hazard rates. default, c=10⁻⁴. SHAPE=a and SCALE=b -- together specify the Gamma prior. SHAPE=c ISCALE=c -- specifies the G(c,c) prior. ARGAMMA <(argamma-option)> -- specifies an autoregressive gamma prior of order 1, which can be followed by one of the following argamma-options. INPUT=SAS-data-set -- specifies a data set containing the hyperparameters of the correlated gamma prior. SHAPE=a and SCALE=b -- together specify that λ1 ~ G(a,b) and λj ~ G(a,b/λj-1) for 2 ≤ j ≤ J. SHAPE=c ISCALE=c -- specifies that λ1 ~ G(c,c) and λj ~ G(c,c/λj-1) for 2 ≤ j ≤ J.","help":"HAZARD&lt;(&lt;NINTERVAL=number&gt; &lt;INTERVAL=(numeric-list)&gt; &lt;PRIOR=option&gt;)&gt;&gt;","type":"value"},{"name":"LOGHAZARD","description":"Syntax: LOGHAZARD<(<NINTERVAL=number> <INTERVAL=(numeric-list)> <PRIOR=option>)>> Models the baseline hazard parameters in the log scale. The log-hazard parameters are named Alpha1, Alpha2, ..., and so on. Use the following two options to specify the partition of the time axis into intervals of constant baseline hazards: NINTERVAL=number | N=number -- specifies the number of intervals with constant baseline hazard rates. PROC PHREG partitions the time axis into the given number of intervals with approximately equal number of events in each interval. INTERVAL=(numeric-list) -- specifies the list of numbers that partition the time axis into disjoint intervals with constant baseline hazard in each interval. For example, INTERVAL=(100, 150, 200, 250, 300) specifies a model with a constant hazard in the intervals [0,100), [100,150), [150,200), [200,250), [250,300), and [300,∞). To specify the prior for α1,...,αj, the hazard parameters in the log scale, you specifying the following: PRIOR=UNIFORM | NORMAL<(normal-option)< The default is PRIOR=UNIFORM. The available prior options are as follows: UNIFORM -- specifies the uniform prior on the real line; NORMAL<(normal-option)< specifies a normal prior distribution on the log-hazard parameters. The normal options include the following: INPUT=SAS-data-set -- specifies a SAS data set containing the mean and covariance information of the normal prior. RELVAR <=c< -- specifies the normal prior N(0,cJ), where J is a diagonal matrix with diagonal elements equal to the variances of the corresponding ML estimator. By default, c=10⁶. VAR=c -- specifies the normal prior N(0,cI), where I is the identity matrix.","help":"LOGHAZARD&lt;(&lt;NINTERVAL=number&gt; &lt;INTERVAL=(numeric-list)&gt; &lt;PRIOR=option&gt;)&gt;&gt;","type":"value"}]},{"name":"PLOTS=","optional":true,"description":"Controls the display of diagnostic plots. Syntax: PLOTS <(global-plot-options)> = plot-request PLOTS <(global-plot-options)> = (plot-requests) The global plot options include the following: FRINGE creates a fringe plot on the X axis of the density plot. GROUPBY = PARAMETER | TYPE specifies how the plots are to be grouped when there is more than one type of plots. The choices are as follows: TYPE specifies that the plots be grouped by type. PARAMETER specifies that the plots be grouped by parameter. GROUPBY=PARAMETER is the default. SMOOTH displays a fitted penalized B-spline curve each trace plot.","help":"PLOTS=ALL | AUTOCORR | DENSITY | NONE | TRACE","type":"choice","arguments":[{"name":"ALL","description":"Specifies all types of plots.","type":"standalone"},{"name":"AUTOCORR","description":"Displays the autocorrelation function plots for the parameters.","type":"standalone"},{"name":"DENSITY","description":"Displays the kernel density plots for the parameters.","type":"standalone"},{"name":"NONE","description":"Suppresses all diagnostic plots.","type":"standalone"},{"name":"TRACE","description":"Displays the trace plots for the parameters.","type":"standalone"}]},{"name":"SAMPLING=","optional":true,"description":"Specifies the sampling algorithm used in the Markov chain Monte Carlo (MCMC) simulations.","help":"SAMPLING=ARMS | RWM","type":"choice","arguments":[{"name":"ARMS","description":"Requests the use of the adaptive rejection Metropolis sampling (ARMS) algorithm to draw the Gibbs samples. ALGORITHM=ARMS is the default.","type":"standalone"},{"name":"RWM","description":"Requests the use of the random walk Metropolis (RWM) algorithm to draw the samples.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies an integer seed in the range 1 to 2³¹-1 for the random number generator in the simulation.","help":"SEED=*number*","type":"value"},{"name":"STATISTICS=","optional":true,"aliases":["STATS="],"description":"Controls the number of posterior statistics produced. Syntax: (1) STATISTICS <(global-options)> = ALL | NONE | keyword | (keyword-list) (2) STATS <(global-statoptions)> = ALL | NONE | keyword | (keyword-list) The global-options include the following: ALPHA=numeric-list controls the probabilities of the credible intervals. The ALPHA= values must be between 0 and 1.","help":"STATISTICS=ALL | NONE | CORR | COV | SUMMARY | INTERVAL | &lt;(keyword-list)&gt;","type":"choice","arguments":[{"name":"ALL","description":"Requests all posterior statistics. Equivalent to specifying STATISTICS= (SUMMARY INTERVAL COV CORR).","type":"standalone"},{"name":"NONE","description":"Requests no posterior statistics","type":"standalone"},{"name":"CORR","description":"Produces the posterior correlation matrix.","type":"standalone"},{"name":"COV","description":"Produces the posterior covariance matrix.","type":"standalone"},{"name":"SUMMARY","description":"Produces the means, standard deviations, and percentile points for the posterior samples. The default is to produce the 25th, 50th, and 75th percentile points, but you can use the global PERCENT= option to request specific percentile points.","type":"standalone"},{"name":"INTERVAL","description":"Produces equal-tail credible intervals and HPD intervals. The defult is to produce the 95% equal-tail credible intervals and 95% HPD intervals, but you can use the global ALPHA= option to request intervals of any probabilities.","type":"standalone"},{"name":"<(keyword-list)>","description":"If you want some but not all of the posterior statistics, specify a subset of the following keywords: SUMMARY INTERVAL COV CORR","type":"standalone"}]},{"name":"THINNING=","optional":true,"aliases":["THIN="],"description":"Controls the thinning of the Markov chain.","help":"THINNING=*number*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC PHREG to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CALL","description":"Invokes a SAS CALL routine.","help":"CALL routine(parameter-1&lt;, ...parameter-n&gt;)"},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. The CLASS statement must precede the MODEL statement.","help":"CLASS &lt;CPREFIX=n&gt; &lt;DESCENDING&gt; &lt;LPREFIX=n&gt; ...","arguments":[{"name":"CPREFIX=","optional":true,"followsDelimiter":"/","description":"Specifies that, at most, the first n characters of a CLASS variable name be used in creating names for the corresponding design variables.","help":"CPREFIX=*n*","type":"value"},{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sorting order of the classification variable.","type":"standalone"},{"name":"LPREFIX=","optional":true,"followsDelimiter":"/","description":"Specifies that, at most, the first n characters of a CLASS variable name be used in creating labels for the corresponding design variables.","help":"LPREFIX=*n*","type":"value"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing value (\".\", \".A\", ..., \".Z\" for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sorting order for the levels of classification variables.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Levels sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"Levels sorted by the external formatted values, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) values.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Levels sorted by the descending frequency count; levels with more observations come earlier in the order.","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Levels sorted by the unformatted value.","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | GLM | ORDINAL | POLYNOMIAL | REFERENCE | ORTHEFFECT | ORTHORDINAL | ORTHPOLY | ORTHREF","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Specifies effect coding.","type":"standalone"},{"name":"GLM","followsDelimiter":"/","description":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","type":"standalone"},{"name":"ORDINAL","followsDelimiter":"/","aliases":["THERMOMETER"],"description":"Specifies the cumulative parameterization for an ordinal CLASS variable.","type":"standalone"},{"name":"POLYNOMIAL","followsDelimiter":"/","aliases":["POLY"],"description":"Specifies polynomial coding.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","aliases":["REF"],"description":"Specifies reference cell coding.","type":"standalone"},{"name":"ORTHEFFECT","followsDelimiter":"/","description":"Orthogonalizes PARAM=EFFECT.","type":"standalone"},{"name":"ORTHORDINAL","followsDelimiter":"/","description":"Orthogonalizes PARAM=ORDINAL.","type":"standalone"},{"name":"ORTHPOLY","followsDelimiter":"/","description":"Orthogonalizes PARAM=POLYNOMIAL.","type":"standalone"},{"name":"ORTHREF","followsDelimiter":"/","description":"Orthogonalizes PARAM=REFERENCE.","type":"standalone"}]},{"name":"REF=","optional":true,"followsDelimiter":"/","description":"Specifies the reference level for PARAM=EFFECT, PARAM=REFERENCE, and their orthogonalizations.","help":"REF=&lt;*level*&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"level","placeholder":true,"followsDelimiter":"/","description":"Specifies the level of the variable to use as the reference level. Replace <level> with an actual value.","type":"value"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first ordered level as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last ordered level as reference.","type":"standalone"}]},{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that length n of CLASS variable values to use in determining CLASS variable levels. The default is to use the full formatted length of the CLASS variable. If you specify TRUNCATE without the length n, the first 16 characters of the formatted values are used.","type":"standalone"}]},{"name":"CONTRAST","description":"where a row-description is: effect values <,...effect values> The CONTRAST statement provides a mechanism for obtaining customized hypothesis tests. It is similar to the CONTRAST statement in PROC GLM and PROC CATMOD, depending on the coding schemes used with any categorical variables involved.","help":"CONTRAST &lt;ALPHA=p&gt; &lt;E&gt; &lt;SINGULAR=number&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the level of significance p for the 100(1 - p)% confidence interval for each contrast when the ESTIMATE option is specified. The value p must be between 0 and 1. By default, p is equal to the value of the ALPHA= option in the PROC PHREG statement, or 0.05 if that option is not specified.","help":"ALPHA=*p*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix be displayed.","type":"standalone"},{"name":"ESTIMATE=","optional":true,"followsDelimiter":"/","description":"Requests that each individual contrast or exponentiated contrast be estimated and tested.","help":"ESTIMATE=PARM | EXP | BOTH","type":"choice","arguments":[{"name":"PARM","followsDelimiter":"/","description":"Specifies that the contrast itself be estimated.","type":"standalone"},{"name":"EXP","followsDelimiter":"/","description":"Specifies that the exponentiated contrast be estimated.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Specifies that both the contrast and the exponentiated contrast be estimated.","type":"standalone"}]},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking.","help":"SINGULAR=*number*","type":"value"},{"name":"TEST=","optional":true,"followsDelimiter":"/","description":"Requests a Type 3 test for each contrast. The default is to use the Wald statistic, but you can requests other statistics by specifying one or more of the following keywords: ALL requests the likelihood ratio tests, the score tests, and the Wald tests. Specifying TEST(ALL) is equivalent to specifying TEST=(LR SCORE WALD). NONE suppresses the Type 3 analysis. Even if the TEST option is not specified, PROC PHREG displays the Wald test results for each model effect if a CLASS variable is involved in a MODEL effect. The NONE option can be used to suppress such display. LR requests the likelihood ratio tests. This request is not honored if the COVS option is also specified. SCORE requests the score tests. This request is not honored if the COVS option is also specified.","help":"TEST=ALL | NONE | LR | SCORE | WALD","type":"choice","arguments":[{"name":"ALL","type":"standalone"},{"name":"NONE","type":"standalone"},{"name":"LR","type":"standalone"},{"name":"SCORE","type":"standalone"},{"name":"WALD","type":"standalone"}]}]},{"name":"DO","description":"","help":"DO &lt;OVER&gt; &lt;&gt; &lt;&gt; ...","arguments":[{"name":"BY","optional":true,"description":"Precedes an increment integer (other than 0) or an expression that generates an integer to be added to the value of the index variable in each iteration of the DO loop.","type":"standalone"},{"name":"OVER","optional":true,"description":"","type":"standalone"},{"name":"TO","optional":true,"description":"Separates the start and stop integers or expressions that control the number of times the portion of the DATA step between the iterative DO and END statements is processed.","type":"standalone"},{"name":"UNTIL","optional":true,"description":"...more SAS statements... END","type":"standalone"},{"name":"WHILE","optional":true,"description":"","type":"standalone"}]},{"name":"EFFECT","description":"The name of the effect is specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. The effect-type is specified after an equal sign, followed by a list of variables within parentheses which are used in constructing the effect. Effect-options that are specific to an effect-type can be specified after a slash (/) following the variable list. The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects formed from continuous or classification variables.","help":"EFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"EFFECT-NAME=","description":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set.","help":"*EFFECT-NAME*=COLLECTION | LAG | MULTIMEMBER | POLYNOMIAL | SPLINE","type":"value","arguments":[{"name":"COLLECTION","description":"Is a collection effect that defines one or more variables as a single effect with multiple degrees of freedom. The variables in a collection are considered as a unit for estimation and inference. Option(s) available (specified after a slash (/) following the variable list): DETAILS Displays the constituents of the collection effect","type":"standalone"},{"name":"LAG","description":"Is a classification effect in which the level that is used for a given period corresponds to the level in the preceding period. Options available (specified after a slash (/) following the variable list): DESIGNROLE= Names a variable that controls to which lag design an observation is assigned DETAILS Displays the lag design of the lag effect NLAG= Specifies the number of periods in the lag PERIOD= Names the variable that defines the period WITHIN= Names the variable or variables that define the group within which each period is defined","type":"standalone"},{"name":"MULTIMEMBER","aliases":["MM"],"description":"Is a multimember classification effect whose levels are determined by one or more variables that appear in a CLASS statement. Options available (specified after a slash (/) following the variable list): NOEFFECT Specifies that observations with all missing levels for the multimember variables should have zero values in the corresponding design matrix columns WEIGHT= Specifies the weight variable for the contributions of each of the classification effects","type":"standalone"},{"name":"POLYNOMIAL","aliases":["POLY"],"description":"Is a multivariate polynomial effect in the specified numeric variables. Options available (specified after a slash (/) following the variable list): DEGREE= Specifies the degree of the polynomial MDEGREE= Specifies the maximum degree of any variable in a term of the polynomial STANDARDIZE= Specifies centering and scaling suboptions for the variables that define the polynomial","type":"standalone"},{"name":"SPLINE","description":"Is a regression spline effect whose columns are univariate spline expansions of one or more variables. A spline expansion replaces the original variable with an expanded or larger set of new variables. Options available (specified after a slash (/) following the variable list): BASIS= Specifies the type of basis (B-spline basis or truncated power function basis) for the spline expansion DEGREE= Specifies the degree of the spline transformation KNOTMETHOD= Specifies how to construct the knots for spline effects","type":"standalone"}]},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"ELSE","description":"If the condition in a IF-THEN statement is false and an ELSE statement is present, then the ELSE action is carried out.","help":"ELSE &lt;DO&gt; &lt;IF&gt; &lt;THEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"IF","optional":true,"description":"Executes a SAS statement for observations that meet specific conditions.","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"}]},{"name":"END","description":"Ends a DO group or SELECT group processing.","help":"END"},{"name":"ESTIMATE","description":"The ESTIMATE statement provides a mechanism for obtaining custom hypothesis tests. Estimates are formed as linear estimable functions of the form Lβ. You can perform hypothesis tests for the estimable functions, construct confidence limits, and obtain specific nonlinear transformations. The basic element of the ESTIMATE statement is the estimate-specification, which consists of model effects and their coefficients. A estimate-specification takes the general form effect name <effect values ...> The following variables can appear in the ESTIMATE statement: label is an optional label that identifies the particular row of the estimate in the output. effect identifies an effect that appears in the MODEL statement. The keyword INTERCEPT can be used as an effect when an intercept is fitted in the model. You do not need to include all effects that are in the MODEL statement. values are constants that are elements of the L matrix and are associated with the fixed and random effects.","help":"ESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the final effect listed in the ESTIMATE statement from the 'Type III' table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE&lt;(simoptions)&gt; | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector.","help":"SIMULATE&lt;(simoptions)&gt;","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CATEGORY=","optional":true,"description":"Specifies how to construct estimates and multiplicity corrections for models with multinomial data (ordinal or nominal). This option is also important for constructing sets of estimable functions for F or chi-square tests with the JOINT option.","help":"CATEGORY=JOINT | SEPARATE | &lt;*quoted-value-list*&gt;","type":"choice","arguments":[{"name":"JOINT","description":"Computes the estimable functions for every nonredundant category and treats them as a set. For example, a three-row ESTIMATE statement in a model with three response categories leads to six estimable functions.","type":"standalone"},{"name":"SEPARATE","description":"Computes the estimable functions for every nonredundant category in turn. For example, a three-row ESTIMATE statement in a model with three response categories leads to two sets of three estimable functions.","type":"standalone"},{"name":"quoted-value-list","placeholder":true,"description":"Computes the estimable functions only for the list of values given. The list must consist of formatted values of the response categories.","type":"value"}]},{"name":"CHISQ","optional":true,"description":"Requests that chi-square tests be performed in addition to F tests, when you request an F test with the JOINT option. This option has no effect in procedures that produce chi-square statistics by default.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed. If the procedure shows the degrees of freedom in the \"Estimates\" table as infinite, then the confidence limits are z intervals. The confidence level is 0.95 by default, and you can change the confidence level with the ALPHA= option. The confidence intervals are adjusted for multiplicity when you specify the ADJUST= option. However, if a step-down p-value adjustment is requested with the STEPDOWN option, only the p-values are adjusted for multiplicity.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits. This option is not supported by the procedures that perform chi-square-based inference (LOGISTIC, PHREG, and SUVEYLOGISTIC).","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators. If you do not specify value-list, a default value of 1.0 is assumed. Missing values in the value-list are converted to 1.0. If the number of elements in value-list exceeds the number of rows of the estimate, the extra values are ignored. If the number of elements in value-list is less than the number of rows of the estimate, the last value in value-list is copied forward. If you specify a row-specific divisor as part of the specification of the estimate row, this value multiplies the corresponding divisor that is implied by the value-list. For example, the following statement divides the coefficients in the first row by 8, and the coefficients in the third and fourth row by 3: estimate 'One vs. two' A 2 -2 (divisor=2), 'One vs. three' A 1 0 -1 , 'One vs. four' A 3 0 0 -3 , 'One vs. five' A 1 0 0 0 -1 / divisor=4,.,3;","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L matrix coefficients be displayed.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the estimate. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, this option produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"JOINT=","optional":true,"description":"Requests that a joint F or chi-square test be produced for the rows of the estimate. The JOINT option in the ESTIMATE statement essentially replaces the CONTRAST statement. When the LOWERTAILED or the UPPERTAILED options are in effect, or if the BOUNDS option described below is in effect, the JOINT option produces the chi-bar-square statistic according to Silvapulle and Sen (2004). This statistic uses a simulation-based approach to compute p-values in situations where the alternative hypotheses of the estimable functions are not simple two-sided hypotheses. You can specify the following joint-test-options in parentheses: ACC=γ specifies the accuracy radius for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of γ must be strictly between 0 and 1; the default value is 0.005. EPS=є specifies the accuracy confidence level for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of є must be strictly between 0 and 1; the default value is 0.01. LABEL='label' assigns an identifying label to the joint test. If you do not specify a label, the first non-default label for the ESTIMATE rows is used to label the joint test. NOEST | ONLY performs only the F or chi-square test and suppresses other results from the ESTIMATE statement. This option is useful for emulating the CONTRAST statement that is available in other procedures. NSAMP=n specifies the number of samples for the simulation-based method of Silvapulle and Sen (2004). CHISQ -- adds a chi-square test if the procedure produces an F test by default.","help":"JOINT=ACC= | EPS= | LABEL= | NOEST | ONLY | NSAMP= | CHISQ | BOUNDS=","type":"choice","arguments":[{"name":"ACC=","type":"value"},{"name":"EPS=","type":"value"},{"name":"LABEL=","type":"value"},{"name":"NOEST","type":"standalone"},{"name":"ONLY","type":"standalone"},{"name":"NSAMP=","type":"value"},{"name":"CHISQ","type":"standalone"},{"name":"BOUNDS=","type":"value"}]},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic. A two-tailed test is the default. A lower-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"},{"name":"NOFILL","optional":true,"description":"Suppresses the automatic fill-in of coefficients of higher-order effects.","type":"standalone"},{"name":"PLOTS=","optional":true,"description":"Produces ODS statistical graphics of the distribution of estimable functions if the procedure performs the analysis in a sampling-based mode.","help":"PLOTS=ALL | BOXPLOT | DISTPLOT | NONE*plot-options*","type":"value","arguments":[{"name":"ALL","description":"Produces all possible plots with their default settings.","type":"standalone"},{"name":"BOXPLOT","description":"Syntax: BOXPLOT<(boxplot-options)> Produces box plots of the distribution of the estimable function across the posterior sample. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"DISTPLOT","aliases":["DIST"],"description":"Syntax: DISTPLOT<(distplot-options)> Generates panels of histograms with a kernel density overlaid. A separate plot in each panel contains the results for each estimable function. You can specify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"NONE","description":"Does not produce any plots.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies the seed for the sampling-based components of the computations for the ESTIMATE statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock. There could be multiple ESTIMATE statements with SEED= specifications and there could be other statements that can supply a random number seed. Since the procedure has only one random number stream, the initial seed is shown in the SAS log.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion. Step-down methods increase the power of multiple testing procedures by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down-options in parentheses after the STEPDOWN option: MAXTIME=n specifies the time (in seconds) to be spent computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60. ORDER=PVALUE | ORDER=ROWS specifies the order in which the step-down tests to be performed. ORDER=PVALUE is the default, with estimates being declared significant only if all estimates with smaller (unadjusted) p-values are significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified in the syntax. REPORT specifies that a report on the step-down adjustment be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","type":"standalone"},{"name":"TESTVALUE=","optional":true,"aliases":["TESTMEAN="],"description":"Specifies the value under the null hypothesis for testing the estimable functions in the ESTIMATE statement. The rules for specifying the value-list are very similar to those for specifying the divisor list in the DIVISOR= option. If no TESTVALUE= is specified, all tests are performed as H: Lβ=0. Missing values in the value-list also are translated to zeros. If you specify fewer values than rows in the ESTIMATE statement, the last value in value-list is carried forward. The TESTVALUE= option affects only p-values from individual, joint, and multiplicity-adjusted tests. It does not affect confidence intervals.","help":"TESTVALUE=*value-list*","type":"value"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic. A two-tailed test is the default. An upper-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies the variable (in the input data set) containing the frequency of occurrence of each observation. PROC PHREG treats each observation as if it appears n times, where n is the value of the FREQ variable for the observation.","help":"FREQ &lt;NOTRUNCATE&gt; ","arguments":[{"name":"NOTRUNCATE","optional":true,"aliases":["NOTRUNC"],"description":"Specifies that frequency values are not truncated to integers.","type":"standalone"}]},{"name":"GOTO","description":"Jumps to a new statement.","help":"GOTO label"},{"name":"HAZARDRATIO","description":"The HAZARDRATIO statement enables you to request hazard ratios for any variable in the model at customized settings.","help":"HAZARDRATIO &lt;ALPHA=number&gt; &lt;AT (variable=ALL | REF | list &lt;...variable=ALL | REF| list&gt; )&gt; &lt;CL=&lt;WALD | PL | BOTH&gt;&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the alpha level of the interval estimates for the hazard ratios. The value must be between 0 and 1. The default is the value of the ALPHA= option in the PROC PHREG statement, or 0.05 if that option is not specified.","help":"ALPHA=*number*","type":"value"},{"name":"AT","optional":true,"followsDelimiter":"/","description":"Specifies the variables that interact with the variable of interest and the corresponding values of the interacting variables. If the interacting variable is continuous and a numeric list is specified after the equal sign, hazard ratios are computed for each value in the list. If the interacting variable is a CLASS variable, you can specify, after the equal sign, a list of quoted strings corresponding to various levels of the CLASS variable, or you can specify the keyword ALL or REF. Hazard ratios are computed at each value of the list if the list is specified, or at each level of the interacting variable if ALL is specified, or at the reference level of the interacting variable if REF is specified.","type":"standalone"},{"name":"CL=","optional":true,"followsDelimiter":"/","description":"Specifies whether to create the Wald or profile-likelihood confidence limits, or both for the classical analyis.","help":"CL=WALD | PL | BOTH","type":"choice","arguments":[{"name":"WALD","followsDelimiter":"/","description":"Specifies to create the Wald confidence limits for the classical analyis..","type":"standalone"},{"name":"PL","followsDelimiter":"/","description":"Specifies to create the profile-likelihood confidence limits for the classical analyis..","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Specifies to create both the Wald and profile-likelihood confidence limits for the classical analyis.","type":"standalone"}]},{"name":"DIFF=","optional":true,"followsDelimiter":"/","description":"Specifies which differences to consider for the level comparisons of a CLASS variable. The default is DIFF=ALL.","help":"DIFF=ALL | REF","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all differences.","type":"standalone"},{"name":"REF","followsDelimiter":"/","description":"Requests comparisons between the reference level and all other levels of the CLASS variable.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Displays the vector h of linear coefficients such that h'β is the log-hazard ratio, with β being the vector of regression coefficients.","type":"standalone"},{"name":"PLCONV=","optional":true,"followsDelimiter":"/","description":"Controls the convergence criterion for the profile-likelihood confidence limits.","help":"PLCONV=*value*","type":"value"},{"name":"PLMAXIT=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of iterations to achieve the convergence of the profile-likelihood confidence limits.","help":"PLMAXIT=*n*","type":"value"},{"name":"PLSINGULAR=","optional":true,"followsDelimiter":"/","description":"Specifies the tolerance for testing the singularity of the Hessian matrix in the computation of the profile-likelihood confidence limits.","help":"PLSINGULAR=*value*","type":"value"},{"name":"UNITS=","optional":true,"followsDelimiter":"/","description":"Specifies the units of change in the continuous explanatory variable for which the customized hazard ratio is estimated.","help":"UNITS=*value*","type":"value"}]},{"name":"ID","description":"The ID statement specifies additional variables for identifying observations in the input data. These variables are placed in the OUT= data set created by the OUTPUT statement. In the computation of the robust sandwich variance estimate, you can aggregate over distinct values of these ID variables. Only variables in the input data set can be included in the ID statement.","help":"ID variables "},{"name":"IF","description":"","help":"IF &lt;DO&gt; &lt;THEN&gt; &lt;WHEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"GO","optional":true,"aliases":["GOTO"],"description":"Jumps to a new statement.","help":"GO TO","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"PUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"SET","optional":true,"description":"Reads an observation from one or more SAS data sets.","type":"standalone"},{"name":"STOP","optional":true,"description":"Action statement in an IF-THEN construct. Stops execution of the current DATA step.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"},{"name":"WHEN","optional":true,"description":"WHEN statement in an IF-THEN-WHEN construct.","type":"standalone"}]},{"name":"LINK","description":"Directs program execution immediately to the statement label that is specified and, if followed by a RETURN statement, returns execution to the statement that follows the LINK statement.","help":"LINK statement-label"},{"name":"LSMEANS","description":"The LSMEANS statement computes and compares least squares means (LS-means) of fixed effects. LS-means are predicted population margins—that is, they estimate the marginal means over a balanced population. In a sense, LS-means are to unbalanced designs as class and subclass arithmetic means are to balanced designs.","help":"LSMEANS &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the LSMEANS effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified LSMEANS effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the LSMEANS effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the LSMEANS statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the LSMEANS statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"LSMESTIMATE","description":"The LSMESTIMATE statement provides a mechanism for obtaining custom hypothesis tests among least squares means.","help":"LSMESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the LS-mean estimates. The adjusted quantities are produced in addition to the unadjusted p-values and confidence limits. Adjusted confidence limits are produced if the CL or ALPHA= option is in effect.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"description":"Modifies the values of the covariates used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"description":"Requests that the procedure compute separate margins for each level of the LSMEANS effect.","type":"standalone"},{"name":"CATEGORY=","optional":true,"description":"Specifies how to construct estimates and multiplicity corrections for models with multinomial data (ordinal or nominal). This option is also important for constructing sets of estimable functions for F tests with the JOINT option.","help":"CATEGORY=JOINT | SEPARATE | &lt;*quoted-value-list*&gt;","type":"choice","arguments":[{"name":"JOINT","description":"Computes the estimable functions for every nonredundant category and treats them as a set. For example, a three-row LSESTIMATE statement in a model with three response categories leads to six estimable functions.","type":"standalone"},{"name":"SEPARATE","description":"Computes the estimable functions for every nonredundant category in turn. For example, a three-row LSESTIMATE statement in a model with three response categories leads to two sets of three estimable functions.","type":"standalone"},{"name":"quoted-value-list","placeholder":true,"description":"Computes the estimable functions only for the list of values given. The list must consist of formatted values of the response categories.","type":"value"}]},{"name":"CHISQ","optional":true,"description":"Requests that chi-square tests be performed in addition to F tests, when you request an F test with the JOINT option. This option has no effect in procedures that produce chi-square statistics by default.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"description":"Displays the estimated correlation matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"COV","optional":true,"description":"Displays the estimated covariance matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators. If you do not specify value-list, a default value of 1.0 is assumed. Missing values in the value-list are converted to 1.0.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L coefficients of the estimable function be displayed.","type":"standalone"},{"name":"ELSM","optional":true,"description":"Requests that the K matrix coefficients be displayed. These are the coefficients that apply to the LS-means. This option is useful to ensure that you assigned the coefficients correctly to the LS-means.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the least squares means estimate. When you model data with the logit link function and the estimate represents a log odds ratio, the EXP option produces an odds ratio. If you specify the CL or ALPHA= option, the (adjusted) confidence limits for the estimate are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"JOINT=","optional":true,"description":"Requests that a joint F or chi-square test be produced for the rows of the estimate. You can specify the following joint-test-options in parentheses: ACC=γ specifies the accuracy radius for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of γ must be strictly between 0 and 1; the default value is 0.005. EPS=є specifies the accuracy confidence level for determining the necessary sample size in the simulation-based approach of Silvapulle and Sen (2004) for tests with order restrictions. The value of є must be strictly between 0 and 1; the default value is 0.01. LABEL='label' assigns an identifying label to the joint test. If you do not specify a label, the first non-default label for the ESTIMATE rows is used to label the joint test. NOEST | ONLY performs only the F or chi-square test and suppresses other results from the ESTIMATE statement. This option is useful for emulating the CONTRAST statement that is available in other procedures. NSAMP=n specifies the number of samples for the simulation-based method of Silvapulle and Sen (2004). CHISQ -- adds a chi-square test if the procedure produces an F test by default.","help":"JOINT=ACC= | EPS= | LABEL= | NOEST | ONLY | NSAMP= | CHISQ | BOUNDS=","type":"choice","arguments":[{"name":"ACC=","type":"value"},{"name":"EPS=","type":"value"},{"name":"LABEL=","type":"value"},{"name":"NOEST","type":"standalone"},{"name":"ONLY","type":"standalone"},{"name":"NSAMP=","type":"value"},{"name":"CHISQ","type":"standalone"},{"name":"BOUNDS=","type":"value"}]},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic. A two-tailed test is the default. A lower-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins observed in OM-data-set.","type":"value"},{"name":"PLOTS=","optional":true,"description":"Produces ODS statistical graphics of the distribution of estimable functions if the procedure performs the analysis in a sampling-based mode.","help":"PLOTS=ALL | BOXPLOT | DISTPLOT | NONE*plot-options*","type":"value","arguments":[{"name":"ALL","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"BOXPLOT","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"DISTPLOT","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"NONE","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking as documented for the ESTIMATE statement.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion. Step-down methods increase the power of multiple testing procedures by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down-options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60. ORDER=PVALUE ORDER=ROWS specifies the order in which the step-down tests are performed. ORDER=PVALUE is the default, with LS-mean estimates being declared significant only if all LS-mean estimates with smaller (unadjusted) p-values are significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified. REPORT specifies that a report on the step-down adjustment be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","type":"standalone"},{"name":"TESTVALUE=","optional":true,"aliases":["TESTMEAN="],"description":"Specifies the value under the null hypothesis for testing the estimable functions in the LSMESTIMATE statement. The rules for specifying the value-list are very similar to those for specifying the divisor list in the DIVISOR= option. If no TESTVALUE= is specified, all tests are performed as H: Lβ=0. Missing values in the value-list also are translated to zeros. If you specify fewer values than rows in the ESTIMATE statement, the last value in value-list is carried forward. The TESTVALUE= option affects only p-values from individual, joint, and multiplicity-adjusted tests. It does not affect confidence intervals.","help":"TESTVALUE=*value-list*","type":"value"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic. A two-tailed test is the default. An upper-tailed confidence limit is also produced if you specify the CL or ALPHA= option.","type":"standalone"}]},{"name":"MODEL","description":"","help":"MODEL &lt;ABSFCONV=value | CONVERGELIKE=value&gt; &lt;ALPHA=number&gt; &lt;BEST=n&gt; ...","arguments":[{"name":"ABSFCONV=","optional":true,"followsDelimiter":"/","aliases":["CONVERGELIKE="],"description":"Specifies the absolute function convergence criterion.","type":"value"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Sets the significance level used for the confidence limits for the hazard ratios. The value of number must be between 0 and 1.","help":"ALPHA=*number*","type":"value"},{"name":"BEST=","optional":true,"followsDelimiter":"/","description":"Is used exclusively with the SCORE model selection method. Specifies that n models with the highest score chi-square statistics are to be displayed for each model size.","help":"BEST=*n*","type":"value"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the parameter estimates.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the parameter estimates.","type":"standalone"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"Produces a detailed display at each step of the model-building process.","type":"standalone"},{"name":"ENTRYTIME=","optional":true,"followsDelimiter":"/","aliases":["ENTRY="],"description":"Specifies the name of the variable that represents the left truncation time.","help":"ENTRYTIME=*variable*","type":"value"},{"name":"FAST","optional":true,"followsDelimiter":"/","description":"Uses a computational algorithm of Lawless and Singhal (1978) to compute a first-order approximation to the remaining slope estimates for each subsequent elimination of a variable from the model.","type":"standalone"},{"name":"FCONV=","optional":true,"followsDelimiter":"/","description":"Specifies the relative function convergence criterion.","help":"FCONV=*value*","type":"value"},{"name":"FIRTH","optional":true,"followsDelimiter":"/","description":"Performs Firth’s penalized maximum likelihood estimation to reduce bias in the parameter estimates.","type":"standalone"},{"name":"GCONV=","optional":true,"followsDelimiter":"/","description":"Specifies the relative gradient convergence criterion.","help":"GCONV=*value*","type":"value"},{"name":"HIERARCHY=","optional":true,"followsDelimiter":"/","aliases":["HIER="],"description":"Specifies whether and how the model hierarchy requirement is applied and whether a single effect or multiple effects are allowed to enter or leave the model in one step.","help":"HIERARCHY=NONE | SINGLE | SINGLECLASS | MULTIPLE | MULTIPLECLASS","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Indicates that the model hierarchy is not maintained.","type":"standalone"},{"name":"SINGLE","followsDelimiter":"/","description":"Indicates that only one effect can enter or leave the model at one time, subject to the model hierarchy requirement.","type":"standalone"},{"name":"SINGLECLASS","followsDelimiter":"/","description":"Is the same as HIERARCHY=SINGLE except that only CLASS effects are subject to the hierarchy requirement.","type":"standalone"},{"name":"MULTIPLE","followsDelimiter":"/","description":"Indicates that more than one effect can enter or leave the model at one time","type":"standalone"},{"name":"MULTIPLECLASS","followsDelimiter":"/","description":"Is the same as HIERARCHY=MULTIPLE except that only CLASS effects are subject to the hierarchy requirement.","type":"standalone"}]},{"name":"INCLUDE=","optional":true,"followsDelimiter":"/","description":"Includes the first n effects in the MODEL statement in every model.","help":"INCLUDE=*n*","type":"value"},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"Displays the iteration history, including the last evaluation of the gradient vector.","type":"standalone"},{"name":"MAXITER=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of iterations allowed. By default, MAXITER=25.","help":"MAXITER=*number*","type":"value"},{"name":"MAXSTEP=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of times the explanatory variables can move in and out of the model before the STEPWISE model-building process ends.","help":"MAXSTEP=*n*","type":"value"},{"name":"NODUMMYPRINT","optional":true,"followsDelimiter":"/","aliases":["NODESIGNPRINT","NODP"],"description":"Suppresses the \"Class Level Information\" table, which shows how the design matrix columns for the CLASS variables are coded.","type":"standalone"},{"name":"NOFIT","optional":true,"followsDelimiter":"/","description":"Performs the global score test, which tests the joint significance of all the explanatory variables in the MODEL statement.","type":"standalone"},{"name":"OFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies the name of an offset variable, which is an explanatory variable with a regression coefficient fixed as one.","help":"OFFSET=*name*","type":"value"},{"name":"PLCONV=","optional":true,"followsDelimiter":"/","description":"Controls the convergence criterion for confidence intervals based on the profile-likelihood function. The quantity value must be a positive number, with a default value of 1E–4.","help":"PLCONV=*value*","type":"value"},{"name":"RIDGEINIT=","optional":true,"followsDelimiter":"/","description":"Specifies the initial ridge value. The maximum ridge value is 2000 times the maximum of 1 and the initial ridge value.","help":"RIDGEINIT=*value*","type":"value"},{"name":"RIDGING=","optional":true,"followsDelimiter":"/","description":"Specifies the technique used to improve the log-likelihood function when its value is worse than that of the previous step.","help":"RIDGING=ABSOLUTE | RELATIVE | NONE","type":"choice","arguments":[{"name":"ABSOLUTE","followsDelimiter":"/","description":"The diagonal elements of the negative (expected) Hessian are inflated by adding the ridge value.","type":"standalone"},{"name":"RELATIVE","followsDelimiter":"/","description":"The diagonal elements are inflated by a factor of 1 plus the ridge value. This is the default.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"The crude line search method of taking half a step is used instead of ridging.","type":"standalone"}]},{"name":"RISKLIMITS=","optional":true,"followsDelimiter":"/","aliases":["RL="],"description":"Produces confidence intervals for hazard ratios of main effects not involved in interactions or nestings.","help":"RISKLIMITS=PL | WALD | BOTH","type":"choice","arguments":[{"name":"PL","followsDelimiter":"/","description":"Requests profile-likelihood confidence limits.","type":"standalone"},{"name":"WALD","followsDelimiter":"/","description":"Requests confidence limits based on the Wald tests.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Request both profile-likelihood and Wald confidence limits.","type":"standalone"}]},{"name":"SELECTION=","optional":true,"followsDelimiter":"/","description":"Specifies the method used to select the variables in the model.","help":"SELECTION=BACKWARD | FORWARD | NONE | STEPWISE | SCORE","type":"choice","arguments":[{"name":"BACKWARD","followsDelimiter":"/","aliases":["B"],"description":"Requests backward elimination","type":"standalone"},{"name":"FORWARD","followsDelimiter":"/","aliases":["F"],"description":"Requests forward selection","type":"standalone"},{"name":"NONE","followsDelimiter":"/","aliases":["N"],"description":"Fits the complete model specified in the MODEL statement. This is the default.","type":"standalone"},{"name":"STEPWISE","followsDelimiter":"/","aliases":["S"],"description":"Requests stepwise selection","type":"standalone"},{"name":"SCORE","followsDelimiter":"/","description":"Requests best subset selection","type":"standalone"}]},{"name":"SEQUENTIAL","optional":true,"followsDelimiter":"/","description":"Forces variables to be added to the model in the order specified in the MODEL statement or eliminated from the model in the reverse order of that specified in the MODEL statement.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Specifies the singularity criterion for determining linear dependencies in the set of explanatory variables.","help":"SINGULAR=*value*","type":"value"},{"name":"SLENTRY=","optional":true,"followsDelimiter":"/","aliases":["SLE="],"description":"Specifies the significance level (a value between 0 and 1) for entering an explanatory variable into the model in the FORWARD or STEPWISE method.","help":"SLENTRY=*value*","type":"value"},{"name":"SLSTAY=","optional":true,"followsDelimiter":"/","aliases":["SLS="],"description":"Specifies the significance level (a value between 0 and 1) for removing an explanatory variable from the model in the BACKWARD or STEPWISE method.","help":"SLSTAY=*value*","type":"value"},{"name":"START=","optional":true,"followsDelimiter":"/","description":"Begins the FORWARD, BACKWARD, or STEPWISE effect selection process with the first n effects listed in the MODEL statement.","help":"START=*n*","type":"value"},{"name":"STOP=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum (FORWARD method) or minimum (BACKWARD method) number of effects to be included in the final model.","help":"STOP=*n*","type":"value"},{"name":"STOPRES","optional":true,"followsDelimiter":"/","aliases":["SR"],"description":"Specifies that the addition and deletion of variables be based on the result of the likelihood score test for testing the joint significance of variables not in the model.","type":"standalone"},{"name":"TIES=","optional":true,"followsDelimiter":"/","description":"Specifies the optimization technique for estimating the regression parameters.","help":"TIES=BRESLOW | DISCRETE | EFRON | EXACT","type":"choice","arguments":[{"name":"BRESLOW","followsDelimiter":"/","description":"Uses the approximate likelihood of Breslow (1974). This is the default value.","type":"standalone"},{"name":"DISCRETE","followsDelimiter":"/","description":"Replaces the proportional hazards model by the discrete logistic model","type":"standalone"},{"name":"EFRON","followsDelimiter":"/","description":"Uses the approximate likelihood of Efron (1977).","type":"standalone"},{"name":"EXACT","followsDelimiter":"/","description":"Computes the exact conditional probability under the proportional hazards assumption that all tied event times occur before censored times of the same value or before larger values.","type":"standalone"}]},{"name":"TYPE1","optional":true,"followsDelimiter":"/","description":"Requests that a Type 1 (sequential) analysis of likelihood ratio test be performed. This consists of sequentially fitting models, beginning with the null model and continuing up to the model specified in the MODEL statement. The likelihood ratio statistic for each successive pair of models is computed and displayed in a table.","type":"standalone"},{"name":"TYPE3","optional":true,"followsDelimiter":"/","description":"Requests a Type 3 test for each effect that is specified in the MODEL statement. The default is to use the Wald statistic, but you can requests other statistics by specifying one or more of the following keywords: ALL requests the likelihood ratio tests, the score tests, and the Wald tests. Specifying TYPE3(ALL) is equivalent to specifying TYPE3=(LR SCORE WALD). NONE suppresses the Type 3 analysis. Even if the TYPE3 option is not specified, PROC PHREG displays the Wald test results for each model effect if a CLASS variable is involved in a MODEL effect. The NONE option can be used to suppress such display. LR requests the likelihood ratio tests. This request is not honored if the COVS option is also specified. SCORE requests the score tests. This request is not honored if the COVS option is also specified.","type":"standalone"},{"name":"XCONV=","optional":true,"followsDelimiter":"/","aliases":["CONVEREPARM="],"description":"Specifies the relative parameter convergence criterion.","help":"XCONV=*value*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set containing statistics calculated for each observation.","help":"OUTPUT ATRISK= DFBETA= OUT=SAS-data-set ...","arguments":[{"name":"ATRISK=","description":"Specifies the number of subjects at risk at the observation time ti (or at the right endpoint of the at-risk interval when a counting process MODEL specification is used).","type":"value"},{"name":"DFBETA=","description":"Specifies the approximate changes in the parameter estimates (β-β(j)) when the j-th observation is omitted.","type":"value"},{"name":"LD=","description":"Specifies the approximate likelihood displacement when the observation is left out.","type":"value"},{"name":"LMAX=","description":"Specifies the relative influence of observations on the overall fit of the model.","type":"value"},{"name":"LOGLOGS=","description":"Specifies the log of the negative log of SURVIVAL.","type":"value"},{"name":"LOGSURV=","description":"Specifies the log of SURVIVAL.","type":"value"},{"name":"OUT=","description":"Names the output data set. If you omit the OUT= option, the output data set is created and given a default name by using the DATAn convention.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"RESDEV=","description":"Specifies the deviance residual Dj","type":"value"},{"name":"RESMART=","description":"Specifies the martingale residual Mj.","type":"value"},{"name":"RESSCH=","description":"Specifies the Schoenfeld residuals.","type":"value"},{"name":"RESSCO=","description":"Specifies the score residuals.","type":"value"},{"name":"STDXBETA=","description":"Specifies the standard error of an estimated linear predictor.","type":"value"},{"name":"SURVIVAL=","description":"Specifies the survivor function estimate.","type":"value"},{"name":"WTRESSCH=","description":"Specifies the weighted Schoenfeld residuals.","type":"value"},{"name":"XBETA=","description":"Specifies the estimate of the linear predictor, zj'β","type":"value"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"Specifies the method used to compute the survivor function estimates. The default is METHOD=BRESLOW.","help":"METHOD=BRESLOW | FH | PL","type":"choice","arguments":[{"name":"BRESLOW","followsDelimiter":"/","aliases":["CH","EMP"],"description":"Specifies that the empirical cumulative hazard function estimate of the survivor function be computed; that is, the survivor function is estimated by exponentiating the negative empirical cumulative hazard function.","type":"standalone"},{"name":"FH","followsDelimiter":"/","description":"Specifies that the Fleming-Harrington (FH) estimates be computed. The FH estimator is a tie-breaking modification of the Breslow estimator. If there are no tied event times, this estimator is the same as the Breslow estimator.","type":"standalone"},{"name":"PL","followsDelimiter":"/","description":"Specifies that the product-limit estimate of the survivor function be computed. This estimator is not available if you use the model syntax that allows two time variables for the counting process style of input; in such a case, the Breslow estimator (METHOD=BRESLOW) is used instead.","type":"standalone"}]},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the order of the observations in the OUTPUT data set.","help":"ORDER=DATA | SORTED","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Requests that the output observations be sorted the same as the input data set.","type":"standalone"},{"name":"SORTED","followsDelimiter":"/","description":"Requests that the output observations be sorted by strata and descending order of the time variable within each stratum.","type":"standalone"}]}]},{"name":"PUT","description":"The PUT statement writes text data to the current output file.","help":"PUT &lt;_PAGE_&gt; ","arguments":[{"name":"_PAGE_","optional":true,"description":"Outputs any pending line data and moves to the top of the next page.","type":"standalone"}]},{"name":"RANDOM","description":"The RANDOM statement enables you to fit a shared frailty model for clustered data with normal distributed random effects (see the section The Frailty Model for details). The variable that represents the clusters must be a CLASS variable (declared in the CLASS statement). Currently, Bayesian analysis is not available for the frailty model.","help":"RANDOM &lt;ABSPCONV=r&gt; &lt;ALPHA=value&gt; &lt;DIST=&lt;GAMMA | LOGNORMAL&gt;&gt; ...","arguments":[{"name":"ABSPCONV=","optional":true,"followsDelimiter":"/","description":"Specifies an absolute variance estimate convergence criterion for the doubly iterative estimation process. The PHREG procedure applies this criterion to the variance parameter estimate of the random effects.","help":"ABSPCONV=*r*","type":"value"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the α level of the confidence limits for the random effects. The default is the value of the ALPHA= option in the PROC PHREG statement, or 0.05 if that option is not specified. This option is ignored if the SOLUTION option is not also specified.","help":"ALPHA=*value*","type":"value"},{"name":"DIST=","optional":true,"followsDelimiter":"/","description":"Specifies the distribution of the shared frailty. DIST=GAMMA specifies a gamma frailty model. DIST=LOGNORMAL specifies a lognormal frailty model; that is, the log-frailty random variable has a normal distribution with mean zero. The default is DIST=LOGNORMAL.","help":"DIST=GAMMA | LOGNORMAL","type":"choice","arguments":[{"name":"GAMMA","followsDelimiter":"/","description":"Specifies a gamma frailty model.","type":"standalone"},{"name":"LOGNORMAL","followsDelimiter":"/","description":"Specifies a lognormal frailty model; that is, the log-frailty random variable has a normal distribution with mean zero.","type":"standalone"}]},{"name":"INITIALVARIANCE=","optional":true,"followsDelimiter":"/","aliases":["INITIAL="],"description":"Specifies an inital value of the variance estimate. The default is INITIAL=1.","type":"value"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"Specifies the estimation method for the variance parameter. The REML specifications performs the residual maximum likelihood; this is the default method. The ML specification performs maximum likelihood.","help":"METHOD=REML | ML","type":"choice","arguments":[{"name":"REML","followsDelimiter":"/","description":"Performs the residual maximum likelihood; this is the default method.","type":"standalone"},{"name":"ML","followsDelimiter":"/","description":"Performs maximum likelihood.","type":"standalone"}]},{"name":"NOCLPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the \"Class Level Information for Random Effects\" table.","type":"standalone"},{"name":"PCONV=","optional":true,"followsDelimiter":"/","description":"Specifies the variance estimate convergence criterion for the doubly iterative estimation process. The PHREG procedure applies this criterion to the variance estimate of the random effects.","help":"PCONV=*r*","type":"value"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Displays estimates of the normal random effects. Also displayed are estimates of the lognormal frailites, which are the exponentiated estimates of the normal random effects.","type":"standalone"}]},{"name":"RETURN","description":"Stops executing statements at the current point in the DATA step and returns to a predetermined point in the step.","help":"RETURN"},{"name":"SELECT","description":"","help":""},{"name":"SLICE","description":"The SLICE statement provides a general mechanism for performing a partitioned analysis of the LS-means for an interaction. This analysis is also known as an analysis of simple effects. The SLICE statement uses the same options as the LSMEANS statement.","help":"SLICE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the SLICE model-effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified SLICE effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the SLICE effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means.","type":"standalone"},{"name":"NOF","optional":true,"followsDelimiter":"/","description":"Suppresses the F test for testing the mutual equality of the estimable functions in the partition.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the SLICE statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this SLICE statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the SLICE statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"SLICEBY","optional":true,"followsDelimiter":"/","aliases":["SIMPLE"],"description":"","type":"standalone"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"STORE","aliases":["ITEMSTORE"],"description":"The STORE statement requests that the procedure save the context and results of the statistical analysis. The resulting item store is a binary file format that cannot be modified. The contents of the item store can be processed with the PLM procedure. The item-store-name is a usual one- or two-level SAS name, like the names that are used for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session. Since item stores usually are used to perform postprocessing tasks, typical usage specifies a two-level name of the form libname.membername. If an item store by the same name as specified in the STORE statement already exists, the existing store is replaced.","help":"STORE &lt;LABEL='label'&gt; OUT=item-store-name ","arguments":[{"name":"OUT=","description":"The item-store-name is a usual one- or two-level SAS name, like the names that are used for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session.","help":"OUT=*item-store-name*","type":"value"},{"name":"LABEL=","optional":true,"followsDelimiter":"/","description":"Adds a custom label. When the PLM procedure processes an item store, the label appears in the PROC PLM output along with other identifying information.","help":"LABEL='*label*'","type":"value"}]},{"name":"STRATA","aliases":["STRATUM"],"description":"The proportional hazards assumption might not be realistic for all data. If so, it might still be reasonable to perform a stratified analysis. The STRATA statement names the variables that determine the stratification. Strata are formed according to the nonmissing values of the STRATA variables unless the MISSING option is specified. In the STRATA statement, variable is a variable with values that are used to determine the strata levels, and list is an optional list of values for a numeric variable. Multiple variables can appear in the STRATA statement.","help":"STRATA &lt;MISSING&gt; ","arguments":[{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (‘.’,‘.A’,...,‘.Z’ for numeric variables and blanks for character variables) as valid STRATA variable values.","type":"standalone"}]},{"name":"TEST","description":"The TEST statement tests linear hypotheses about the regression coefficients. PROC PHREG performs a Wald test for the joint hypothesis specified in a single TEST statement.","help":"TEST &lt;AVERAGE&gt; &lt;E&gt; &lt;PRINT&gt; ...","arguments":[{"name":"AVERAGE","optional":true,"followsDelimiter":"/","description":"Enables you to assess the average effect of the variables in the given TEST statement.","type":"standalone"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Specifies that the linear coefficients and constants be printed.","type":"standalone"},{"name":"PRINT","optional":true,"followsDelimiter":"/","description":"Displays intermediate calculations.","type":"standalone"}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement identifies the variable in the input data set that contains the case weights. When a WEIGHT statement appears, each observation in the input data set is weighted by the value of the WEIGHT variable.","help":"WEIGHT &lt;NORMALIZE&gt; ","arguments":[{"name":"NORMALIZE","optional":true,"followsDelimiter":"/","description":"Causes the weights specified by the WEIGHT variable to be normalized so that they add up to the actual sample size.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_017","docsetTargetFile":"statug_phreg_toc.htm"}}