{"name":"PLS","statements":[{"name":"PROC PLS","description":"The PLS procedure fits models by using any one of a number of linear predictive methods, including partial least squares (PLS). Ordinary least squares regression, as implemented in SAS/STAT procedures such as PROC GLM and PROC REG, has the single goal of minimizing sample response prediction error, seeking linear functions of the predictors that explain as much variation in each response as possible. The techniques implemented in the PLS procedure have the additional goal of accounting for variation in the predictors, under the assumption that directions in the predictor space that are well sampled should provide better prediction for new observations when the predictors are highly correlated. All of the techniques implemented in the PLS procedure work by extracting successive linear combinations of the predictors, called factors (also called components, latent vectors, or latent variables), which optimally address one or both of these two goals—explaining response variation and explaining predictor variation. In particular, the method of partial least squares balances the two objectives, seeking factors that explain both response and predictor variation.","help":"PROC PLS <CENSCALE> <CV=ONE | SPLIT | BLOCK... > <CVTEST <(cvtest-options)>> <DATA=SAS-data-set> <DETAILS> <METHOD=PLS | SIMPLS | PCR... > <MISSING=NONE | AVG | EM<(EM-options)>> <NFAC=n> <NOCENTER> <NOCVSTDIZE> <NOPRINT> <NOSCALE> <PLOTS=ALL | CORRLOAD | CVPLOT... > <VARSCALE> <VARSS>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <TRUNCATE> ; \n   \n\tEFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tID variables ;     \n\tMODEL <INTERCEPT> <SOLUTION> ; \n   \n\tOUTPUT <OUT= SAS-data-set> <PREDICTED=> <YRESIDUAL=> ...; ","arguments":[{"name":"CENSCALE","optional":true,"description":"Lists the centering and scaling information for each response and predictor.","type":"standalone"},{"name":"CV=","optional":true,"description":"Specifies the cross validation method to be used. By default, no cross validation is performed.","help":"CV=ONE | SPLIT | BLOCK | RANDOM | TESTSET","type":"choice","arguments":[{"name":"ONE","description":"Requests one-at-a-time cross validation","type":"standalone"},{"name":"SPLIT","description":"Syntax: SPLIT<(n)> Requests that every n-th observation be excluded","type":"standalone"},{"name":"BLOCK","description":"Syntax: BLOCK<(n)> Requests that n blocks of consecutive observations be excluded","type":"standalone"},{"name":"RANDOM","description":"Syntax: RANDOM<(cv-random-opts)> Requests that observations be excluded at random. You can specify the following optional cv-random-options in parentheses: NITER=n specifies the number of random subsets to exclude. The default value is 10. NTEST=n specifies the number of observations in each random subset chosen for exclusion. SEED=n specifies an integer used to start the pseudo-random number generator for selecting the random test set.","type":"standalone"},{"name":"TESTSET","description":"Syntax: TESTSET(SAS-data-set) Specifies a test set of observations to be used for validation (formally, this is called \"test set validation\" rather than \"cross validation\").","type":"standalone"}]},{"name":"CVTEST=","optional":true,"description":"Specifies that van der Voet’s (1994) randomization-based model comparison test be performed to test models with different numbers of extracted factors against the model that minimizes the predicted residual sum of squares. You can specify the following cv-test-options: PVAL=n specifies the cutoff probability for declaring an insignificant difference. The default value is 0.10. STAT=test-statistic specifies the test statistic for the model comparison. NSAMP=n specifies the number of randomizations to perform. The default value is 1000.","help":"CVTEST=PVAL= | STAT= | NSAMP= | SEED=","type":"choice","arguments":[{"name":"PVAL=","type":"value"},{"name":"STAT=","type":"value"},{"name":"NSAMP=","type":"value"},{"name":"SEED=","type":"value"}]},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be used by PROC PLS. The default is the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DETAILS","optional":true,"description":"Lists the details of the fitted model for each successive factor.","type":"standalone"},{"name":"METHOD=","optional":true,"description":"Specifies the general factor extraction method to be used.","help":"METHOD=PLS | SIMPLS | PCR | RRR","type":"choice","arguments":[{"name":"PLS","description":"Syntax: PLS<(PLS-options)> Requests partial least squares. You can specify the following optional PLS-options in parentheses: ALGORITHM=NIPALS | SVD | EIG | RLGW names the specific algorithm used to compute extracted PLS factors. NIPALS requests the usual iterative NIPALS algorithm, SVD bases the extraction on the singular value decomposition of X'Y, EIG bases the extraction on the eigenvalue decomposition of Y'XX'Y, and RLGW is an iterative approach that is efficient when there are many predictors. MAXITER=n specifies the maximum number of iterations for the NIPALS and RLGW algorithms. The default value is 200. EPSILON=n specifies the convergence criterion for the NIPALS and RLGW algorithms. The default value is 10⁻¹².","type":"standalone"},{"name":"SIMPLS","description":"Requests the SIMPLS method of de Jong (1993)","type":"standalone"},{"name":"PCR","description":"Requests principal components regression","type":"standalone"},{"name":"RRR","description":"Requests reduced rank regression","type":"standalone"}]},{"name":"MISSING=","optional":true,"description":"Specifies how observations with missing values are to be handled in computing the fit.","help":"MISSING=NONE | AVG | EM&lt;(EM-options)&gt;","type":"choice","arguments":[{"name":"NONE","description":"Observations with any missing variables (dependent or independent) are excluded from the analysis.","type":"standalone"},{"name":"AVG","description":"Specifies that the fit be computed by filling in missing values with the average of the nonmissing values for the corresponding variable.","type":"standalone"},{"name":"EM","description":"The procedure first computes the model with MISSING=AVG and then fills in missing values by their predicted values based on that model and computes the model again. You can specify the following optional EM-options in parentheses: MAXITER=n specifies the maximum number of iterations for the imputation/fit loop. EPSILON=n specifies the convergence criterion for the imputation/fit loop. The default value for is 10⁻⁸.","help":"EM&lt;(EM-options)&gt;","type":"standalone"}]},{"name":"NFAC=","optional":true,"description":"Specifies the number of factors to extract.","help":"NFAC=*n*","type":"value"},{"name":"NOCENTER","optional":true,"description":"Suppresses centering of the responses and predictors before fitting. This is useful if the analysis variables are already centered and scaled.","type":"standalone"},{"name":"NOCVSTDIZE","optional":true,"description":"Suppresses re-centering and rescaling of the responses and predictors before each model is fit in the cross validation.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results.","type":"standalone"},{"name":"NOSCALE","optional":true,"description":"Suppresses scaling of the responses and predictors before fitting. This is useful if the analysis variables are already centered and scaled.","type":"standalone"},{"name":"PLOTS=","optional":true,"description":"Controls the plots produced through ODS Graphics. Syntax: (1) PLOTS <(global-plot-options)> <= plot-request <(options)>> (2)PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> The global plot options include the following: FLIP interchanges the X-axis and Y-axis dimensions for the score, weight, and loading plots. ONLY suppresses the default plots. Only plots specifically requested are displayed.","help":"PLOTS=ALL | CORRLOAD | CVPLOT | DIAGNOSTICS | DMOD | DMODX | DMODXY | DMODY | FIT | NONE | PARMPROFILES | SCORES | RESIDUALS | VIP | WEIGHTS | XLOADINGPLOT | XLOADINGPROFILES | XSCORES | XWEIGHTPLOT | XWEIGHTPROFILES | XYSCORES | YSCORES | YWEIGHTPLOT","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"CORRLOAD","description":"Syntax: CORRLOAD<(TRACE = ON | OFF)> Produces a correlation loading plot (default).","type":"standalone"},{"name":"CVPLOT","description":"Produces a cross validation and R-square analysis.","type":"standalone"},{"name":"DIAGNOSTICS","description":"Syntax: DIAGNOSTICS<(UNPACK)> Produces a summary panel of the fit for each dependent variable.","type":"standalone"},{"name":"DMOD","description":"Produces the DMODX, DMODY, and DMODXY plots.","type":"standalone"},{"name":"DMODX","description":"Produces a plot of the distance of each observation to the X model.","type":"standalone"},{"name":"DMODXY","description":"Produces plots of the distance of each observation to the X and Y models.","type":"standalone"},{"name":"DMODY","description":"Produces a plot of the distance of each observation to the Y model.","type":"standalone"},{"name":"FIT","description":"Produces both the fit diagnostics and the ParmProfiles plot.","type":"standalone"},{"name":"NONE","description":"Suppresses the display of graphics.","type":"standalone"},{"name":"PARMPROFILES","description":"Produces profiles of the regression coefficients.","type":"standalone"},{"name":"SCORES","description":"Syntax: SCORES<(UNPACK|FLIP)> Produces the XScores, YScores, XYScores, and DModXY plots.","type":"standalone"},{"name":"RESIDUALS","description":"Syntax: RESIDUALS<(UNPACK)> Plots the residuals for each dependent variable against each independent variable.","type":"standalone"},{"name":"VIP","description":"Produces profiles of variable importance factors.","type":"standalone"},{"name":"WEIGHTS","description":"Syntax: WEIGHTS<(UNPACK|FLIP)> Produces all X and Y loading and weight plots, as well as the VIP plot.","type":"standalone"},{"name":"XLOADINGPLOT","description":"Syntax: XLOADINGPLOT<(UNPACK|FLIP)> Produces a scatter plot matrix of X-loadings against each other.","type":"standalone"},{"name":"XLOADINGPROFILES","description":"Produces profiles of the X-loadings.","type":"standalone"},{"name":"XSCORES","description":"Syntax: XSCORES<(UNPACK|FLIP)> Produces a scatter plot matrix of X-scores against each other.","type":"standalone"},{"name":"XWEIGHTPLOT","description":"Syntax: XWEIGHTPLOT<(UNPACK|FLIP)> Produces a scatter plot matrix of X-weights against each other.","type":"standalone"},{"name":"XWEIGHTPROFILES","description":"","type":"standalone"},{"name":"XYSCORES","description":"Syntax: XYSCORES<(UNPACK)> Produces profiles of the X-weights.","type":"standalone"},{"name":"YSCORES","description":"YSCORES<(UNPACK|FLIP)> Produces a scatter plot matrix of Y-scores against each other.","type":"standalone"},{"name":"YWEIGHTPLOT","description":"Syntax: YWEIGHTPLOT<(UNPACK|FLIP)> Produces a scatter plot matrix of Y-weights against each other.","type":"standalone"}]},{"name":"VARSCALE","optional":true,"description":"Specifies that continuous model variables be centered and scaled prior to centering and scaling the model effects in which they are involved.","type":"standalone"},{"name":"VARSS","optional":true,"description":"Lists, in addition to the average response and predictor sum of squares accounted for by each successive factor, the amount of variation accounted for in each response and predictor.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC PLS to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. The CLASS statement must precede the MODEL statement.","help":"CLASS &lt;TRUNCATE&gt; ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined by using no more than the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"EFFECT","description":"The name of the effect is specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. The effect-type is specified after an equal sign, followed by a list of variables within parentheses which are used in constructing the effect. Effect-options that are specific to an effect-type can be specified after a slash (/) following the variable list. The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects formed from continuous or classification variables.","help":"EFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"EFFECT-NAME=","description":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. These values can be used: COLLECTION, MULTIMEMBER, POLYNOMIAL, or SPLINE.","type":"value"},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"ID","description":"The ID statement names variables whose values are used to label observations in plots. If you do not specify an ID statement, then each observations is labeled in plots by its corresponding observation number.","help":"ID variables "},{"name":"MODEL","description":"The MODEL statement names the responses and the predictors, which determine the Y and X matrices of the model, respectively. Usually you simply list the names of the predictor variables as the model effects, but you can also use the effects notation of PROC GLM to specify polynomial effects and interactions. The MODEL statement is required. You can specify only one MODEL statement (in contrast to the REG procedure, for example, which allows several MODEL statements in the same PROC REG run).","help":"MODEL &lt;INTERCEPT&gt; &lt;SOLUTION&gt; ","arguments":[{"name":"INTERCEPT","optional":true,"followsDelimiter":"/","description":"By default, the responses and predictors are centered; thus, no intercept is required in the model. You can specify the INTERCEPT option to override the default.","type":"standalone"},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Lists the coefficients of the final predictive model for the responses.","type":"standalone"}]},{"name":"OUTPUT","description":"You use the OUTPUT statement to specify a data set to receive quantities that can be computed for every input observation, such as extracted factors and predicted values.","help":"OUTPUT &lt;OUT= SAS-data-set&gt; &lt;PREDICTED=&gt; &lt;YRESIDUAL=&gt; ...","arguments":[{"name":"H=","optional":true,"description":"Approximate leverage","type":"value"},{"name":"OUT=","optional":true,"description":"Specifies the output data set.","type":"value"},{"name":"PREDICTED=","optional":true,"description":"Predicted values for responses","type":"value"},{"name":"PRESS=","optional":true,"description":"Approximate predicted residuals","type":"value"},{"name":"STDX=","optional":true,"description":"Standardized (centered and scaled) predictors","type":"value"},{"name":"STDXSSE","optional":true,"description":"Sum of squares of residuals for standardized predictors","type":"standalone"},{"name":"STDY=","optional":true,"description":"Standardized (centered and scaled) responses","type":"value"},{"name":"STDYSSE=","optional":true,"description":"Sum of squares of residuals for standardized responses","type":"value"},{"name":"TSQUARE=","optional":true,"description":"Scaled sum of squares of score values","type":"value"},{"name":"XRESIDUAL=","optional":true,"description":"Residuals for predictors","type":"value"},{"name":"XSCORE=","optional":true,"description":"Extracted factors (X-scores, latent vectors, latent variables, T)","type":"value"},{"name":"YRESIDUAL=","optional":true,"description":"Residuals for responses","type":"value"},{"name":"YSCORE=","optional":true,"description":"Extracted responses (Y-scores, U)","type":"value"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_029","docsetTargetFile":"statug_pls_toc.htm"}}