{"name":"POWER","statements":[{"name":"PROC POWER","description":"Power and sample size analysis optimizes the resource usage and design of a study, improving chances of conclusive results with maximum efficiency. The POWER procedure performs prospective power and sample size analyses for a variety of goals, such as the following: o determining the sample size required to get a significant result with adequate probability (power) o characterizing the power of a study to detect a meaningful effect o conducting what-if analyses to assess sensitivity of the power or required sample size to other factors † Here prospective indicates that the analysis pertains to planning for a future study. This is in contrast to retrospective power analysis for a past study, which is not supported by the procedure. † A variety of statistical analyses are covered: o tests, equivalence tests, and confidence intervals for means o tests, equivalence tests, and confidence intervals for binomial proportions o multiple regression o tests of correlation and partial correlation o one-way analysis of variance o rank tests for comparing two survival curves o logistic regression with binary response o Wilcoxon-Mann-Whitney (rank-sum) test","help":"PROC POWER <PLOTONLY>;     \n\tCOXREG <ALPHA=number-list> <EVENTPROB=number-list> <EVENTSTOTAL=number-list | EVENTTOTAL=number-list | EETOTAL=number-list> ...; \n   \n\tLOGISTIC <ALPHA=number-list> <CORR=number-list> <COVARIATES=grouped-name-list> ...; \n   \n\tMULTREG <ALPHA=number-list> <MODEL=<FIXED|CONDITIONAL | RANDOM|UNCONDITIONAL>> <NFRACTIONAL> ...; \n   \n\tONECORR <ALPHA=number-list> <CORR=number-list> <DIST=<FISHERZ | T>> ...; \n   \n\tONESAMPLEFREQ <ALPHA=number-list> <CI=<AGRESTICOULL|AC | JEFFREYS | EXACT|CLOPPERPEARSON|CP>... > <EQUIVBOUNDS=grouped-number-list> ...; \n   \n\tONESAMPLEMEANS <ALPHA=number-list> <CI> <CI=<T>> ...; \n   \n\tONEWAYANOVA <ALPHA=number-list> <CONTRAST= ( values ) < ( ...values ) >> <GROUPMEANS=grouped-number-list> ...; \n   \n\tPAIREDFREQ <ALPHA=number-list> <CORR=number-list> <DISCPROPORTIONS=grouped-number-list> ...; \n   \n\tPAIREDMEANS <ALPHA=number-list> <CI | CI=DIFF> <CORR=number-list> ...; \n   \n\tPLOT INTERPOL=JOIN|NONE  KEY=BYCURVE|BYFEATURE|ONCURVES  MARKERS=ANALYSIS|COMPUTED|NICE...  ...;     \n\tTWOSAMPLEFREQ <ALPHA=number-list> <GROUPNS=grouped-number-list> <GROUPNS=grouped-number-list> ...; \n   \n\tTWOSAMPLEMEANS <ALPHA=number-list> <CI | CI=DIFF> <CV=number-list> ...; \n   \n\tTWOSAMPLESURVIVAL <ACCRUALRATEPERGROUP=number-list> <ACCRUALRATETOTAL=number-list> <ACCRUALTIME=<<number-list> | MAX>> ...; \n   \n\tTWOSAMPLEWILCOXON <ALPHA=number-list> <GROUPNS=grouped-number-list> <GROUPWEIGHTS=grouped-number-list> ...; ","arguments":[{"name":"PLOTONLY","optional":true,"description":"Specifies that only graphical results from the PLOT statement be produced.","type":"standalone"}]},{"name":"COXREG","description":"The COXREG statement performs power and sample size analyses for the score test of a single scalar predictor in Cox proportional hazards regression for survival data, possibly in the presence of one or more covariates that might be correlated with the tested predictor.","help":"COXREG &lt;ALPHA=number-list&gt; &lt;EVENTPROB=number-list&gt; &lt;EVENTSTOTAL=number-list | EVENTTOTAL=number-list | EETOTAL=number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"EVENTPROB=","optional":true,"description":"Specifies the probability that an uncensored event occurs. You must specify this option when you use the NTOTAL= option, and it is ignored when you use the EVENTSTOTAL= option.","help":"EVENTPROB=*number-list*","type":"value"},{"name":"EVENTSTOTAL=","optional":true,"aliases":["EVENTTOTAL=","EETOTAL="],"description":"Specifies the expected number of uncensored events, or requests a solution for this parameter by specifying a missing value (EVENTSTOTAL= .). The NFRACTIONAL option is automatically enabled when you use the EVENTSTOTAL= option. You must use either the EVENTSTOTAL= option or the NTOTAL= option, and you cannot use both.","type":"value"},{"name":"HAZARDRATIO=","optional":true,"aliases":["HR="],"description":"Specifies the hazard ratio for a one-unit increase in the predictor of interest x1, holding any other predictors constant. The hazard ratio is equal to exp(β1), where β1 is the regression coefficient of x1.","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.). The minimum acceptable value for the sample size depends on the MODEL=, NOINT, NFULLPREDICTORS=, NTESTPREDICTORS=, and NREDUCEDPREDICTORS= options. It ranges from p+1 to p+3, where p is the value of the NFULLPREDICTORS option.","help":"NTOTAL=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: •SIDES= •ALPHA= •EVENTPROB= •RSQUARE= •HAZARDRATIO= •STDDEV= •NTOTAL= •EVENTSTOTAL= •POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the COXREG statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the COXREG statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage.","help":"POWER=*number-list*","type":"value"},{"name":"RSQUARE=","optional":true,"description":"","help":"RSQUARE=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval.","help":"SIDES=12 |  | U | L*keyword-list*","type":"value","arguments":[{"name":"12","description":"Specifies a one-sided test, with the alternative hypothesis in the same direction as the effect.","type":"standalone"},{"name":"U","description":"Specifies an upper one-sided test, with the alternative hypothesis indicating a positive correlation between the tested predictor and survival—that is, a hazard ratio less than 1.","type":"standalone"},{"name":"L","description":"Specifies a lower one-sided test, with the alternative hypothesis indicating a negative correlation between the tested predictor and survival—that is, a hazard ratio greater than 1.","type":"standalone"}]},{"name":"STDDEV=","optional":true,"aliases":["STD="],"description":"Specifies the standard deviation of the predictor of interest.","type":"value"},{"name":"TEST=","optional":true,"description":"Specifies the type of test in Cox proportional hazards regression.","help":"TEST=SCORE*SCORE*","type":"value","arguments":[{"name":"SCORE","description":"Specifies the score test in Cox proportional hazards regression. This is the default test option.","type":"standalone"}]}]},{"name":"LOGISTIC","description":"The LOGISTIC statement performs power and sample size analyses for the likelihood ratio chi-square test of a single predictor in binary logistic regression, possibly in the presence of one or more covariates. All predictor variables are assumed to be independent of each other. So, this analysis is not applicable to studies with correlated predictors—for example, most observational studies (as opposed to randomized studies).","help":"LOGISTIC &lt;ALPHA=number-list&gt; &lt;CORR=number-list&gt; &lt;COVARIATES=grouped-name-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CORR=","optional":true,"description":"Specifies the multiple correlation (ρ) between the tested predictor and the covariates. If you also specify the COVARIATES= option, then the sample size is either multiplied (if you are computing power) or divided (if you are computing sample size) by a factor of (1-ρ²).","help":"CORR=*number-list*","type":"value"},{"name":"COVARIATES=","optional":true,"description":"Specifies the distributions of any predictor variables in the model but not being tested, using labels specified with the VARDIST= option. The distributions are assumed to be independent of each other and of the tested predictor. If this option is omitted, then the tested predictor specified by the TESTEDPREDICTOR= option is assumed to be the only predictor in the model.","help":"COVARIATES=*grouped-name-list*","type":"value"},{"name":"COVODDSRATIOS=","optional":true,"description":"Specifies the odds ratios for the covariates in the full model (including variables in the TESTPREDICTOR= and COVARIATES= options). The ordering of the values corresponds to the ordering in the COVARIATES= option. If the response variable is coded as Y=1 for success and Y=0 for failure, then the odds ratio for each covariate X is the odds of Y=1 when X=a divided by the odds of Y=1 when X=b, where a and b are determined from the DEFAULTUNIT= and UNITS= options. Values must be greater than zero.","help":"COVODDSRATIOS=*grouped-number-list*","type":"value"},{"name":"COVREGCOEFFS=","optional":true,"description":"Specifies the regression coefficients for the covariates in the full model including the test predictor (as specified by the TESTPREDICTOR= option). The ordering of the values corresponds to the ordering in the COVARIATES= option.","help":"COVREGCOEFFS=*grouped-number-list*","type":"value"},{"name":"DEFAULTNBINS=","optional":true,"description":"Specifies the default number of categories (or \"bins\") into which the distribution for each predictor variable is divided in internal calculations. Higher values increase computational time and memory requirements but generally lead to more accurate results. Each test predictor or covariate that is absent from the NBINS= option derives its bin number from the DEFAULTNBINS= option. The default value is DEFAULTNBINS=10.","help":"DEFAULTNBINS=*number*","type":"value"},{"name":"DEFAULTUNIT=","optional":true,"description":"Specifies the default change in the predictor variables assumed for odds ratios specified with the COVODDSRATIOS= and TESTODDSRATIO= options. Each test predictor or covariate that is absent from the UNITS= option derives its change value from the DEFAULTUNIT= option. The value must be nonzero. The default value is DEFAULTUNIT=1. This option can be used only if at least one of the COVODDSRATIOS= and TESTODDSRATIO= options is used. Valid specifications for change-spec are as follows: number defines the odds ratio as the ratio of the response variable odds when X=a to the odds when X=a-number for any constant a. <+ | ->SD defines the odds ratio as the ratio of the odds when X=a to the odds when X=a-σ (or X=a+σ, if SD is preceded by a minus sign (–)) for any constant a, where σ is the standard deviation of X (as determined from the VARDIST= option). multiple*SD defines the odds ratio as the ratio of the odds when X=a to the odds when X=a-multiple*σ for any constant a, where σ is the standard deviation of X (as determined from the VARDIST= option).","help":"DEFAULTUNIT=*change-spec*","type":"value"},{"name":"INTERCEPT=","optional":true,"description":"Specifies the intercept in the full model (including variables in the TESTPREDICTOR= and COVARIATES= options).","help":"INTERCEPT=*number-list*","type":"value"},{"name":"NBINS=","optional":true,"description":"Specifies the number of categories (or \"bins\") into which the distribution for each predictor variable (identified by its name from the VARDIST= option) is divided in internal calculations. Higher values increase computational time and memory requirements but generally lead to more accurate results. Each predictor variable that is absent from the NBINS= option derives its bin number from the DEFAULTNBINS= option.","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.). Values must be at least one.","help":"NTOTAL=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: DEFAULTNBINS= NBINS= ALPHA= RESPONSEPROB= INTERCEPT= TESTPREDICTOR= TESTODDSRATIO= TESTREGCOEFF= COVARIATES= COVODDSRATIOS= COVREGCOEFFS= NTOTAL= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the LOGISTIC statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the LOGISTIC statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage.","help":"POWER=*number-list*","type":"value"},{"name":"RESPONSEPROB=","optional":true,"description":"Specifies the response probability in the full model when all predictor variables (including variables in the TESTPREDICTOR= and COVARIATES= options) are equal to their means. The log odds of this probability are equal to the intercept in the full model where all predictor are centered at their means. If the response variable is coded as Y=1 for success and Y=0 for failure, then this probability is equal to the mean of Y in the full model when all Xs are equal to their means. Values must be strictly between zero and one.","help":"RESPONSEPROB=*number-list*","type":"value"},{"name":"TEST=","optional":true,"description":"Specifies a test of a single model parameter in binary logistic regression.","help":"TEST=LRCHI","type":"choice","arguments":[{"name":"LRCHI","description":"Specifies the likelihood ratio chi-square test of a single model parameter in binary logistic regression. This is the default test option.","type":"standalone"}]},{"name":"TESTODDSRATIO=","optional":true,"description":"Specifies the odds ratio for the predictor variable being tested in the full model (including variables in the TESTPREDICTOR= and COVARIATES= options). If the response variable is coded as Y=1 for success and Y=0 for failure, then the odds ratio for the X being tested is the odds of Y=1 when X=a divided by the odds of Y=1 when X=b, where a and b are determined from the DEFAULTUNIT= and UNITS= options. Values must be greater than zero.","help":"TESTODDSRATIO=*number-list*","type":"value"},{"name":"TESTPREDICTOR=","optional":true,"description":"Specifies the distribution of the predictor variable being tested, using labels specified with the VARDIST= option. This distribution is assumed to be independent of the distributions of the covariates as defined in the COVARIATES= option.","help":"TESTPREDICTOR=*name-list*","type":"value"},{"name":"TESTREGCOEFF=","optional":true,"description":"Specifies the regression coefficient for the predictor variable being tested in the full model including the covariates specified by the COVARIATES= option.","help":"TESTREGCOEFF=*number-list*","type":"value"},{"name":"UNITS=","optional":true,"description":"Specifies the changes in the predictor variables assumed for odds ratios specified with the COVODDSRATIOS= and TESTODDSRATIO= options. Each predictor variable whose name (from the VARDIST= option) is absent from the UNITS option derives its change value from the DEFAULTUNIT= option. This option can be used only if at least one of the COVODDSRATIOS= and TESTODDSRATIO= options is used. Valid specifications for change-spec are as follows: number defines the odds ratio as the ratio of the response variable odds when X=a to the odds when X=a-number for any constant a. <+ | ->SD defines the odds ratio as the ratio of the odds when X=a to the odds when X=a-σ (or X=a+σ, if SD is preceded by a minus sign (–)) for any constant a, where σ is the standard deviation of X (as determined from the VARDIST= option). multiple*SD defines the odds ratio as the ratio of the odds when X=a to the odds when X=a-multiple*σ for any constant a, where σ is the standard deviation of X (as determined from the VARDIST= option).","type":"value"},{"name":"VARDIST=","optional":true,"description":"Defines a distribution for a predictor variable, where label identifies the variable distribution in the output and with the COVARIATES= and TESTPREDICTOR= options. distribution specifies the distributional form of the variable.","help":"VARDIST=ORDINAL | BETA | BINOMIAL | EXPONENTIAL | GAMMA | LAPLACE | LOGISTIC | LOGNORMAL | NORMAL | POISSON | UNIFORM","type":"choice","arguments":[{"name":"ORDINAL","description":"Syntax: ORDINAL((values) : (probabilities)) Is an ordered categorical distribution. The values are any numbers separated by spaces. The probabilities are numbers between 0 and 1 (inclusive) separated by spaces. Their sum must be exactly 1. The number of probabilities must match the number of values.","type":"standalone"},{"name":"BETA","description":"Syntax: BETA (a, b <, l, r >) Is a beta distribution with shape parameters a and b and optional location parameters l and r. The values of a and b must be greater than 0, and l must be less than r. The default values for l and r are 0 and 1, respectively.","type":"standalone"},{"name":"BINOMIAL","description":"Syntax: BINOMIAL(p, n) Is a binomial distribution with probability of success p and number of independent Bernoulli trials n. The value of p must be greater than 0 and less than 1, and n must be an integer greater than 0.","type":"standalone"},{"name":"EXPONENTIAL","description":"Syntax: EXPONENTIAL(λ) Is an exponential distribution with scale λ, which must be greater than 0.","type":"standalone"},{"name":"GAMMA","description":"Syntax: GAMMA (α, λ) is a gamma distribution with shape α and scale λ. The values of a and λ must be greater than 0.","type":"standalone"},{"name":"LAPLACE","description":"Syntax: LAPLACE(θ, λ) Is a Laplace distribution with location θ and scale λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"LOGISTIC","description":"Syntax: LOGISTIC(θ, λ) Is a logistic distribution with location θ and scale λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"LOGNORMAL","description":"Syntax: LOGNORMAL(θ, λ) Is a lognormal distribution with location θ and scale λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"NORMAL","description":"Syntax: NORMAL(θ, λ) Is a normal distribution with mean θ and standard deviation λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"POISSON","description":"Syntax: POISSON(m) Is a Poisson distribution with mean m. The value of m must be greater than 0.","type":"standalone"},{"name":"UNIFORM","description":"Syntax: UNIFORM(l, r) Is a uniform distribution on the interval [l,r], where l < r.","type":"standalone"}]}]},{"name":"MULTREG","description":"The MULTREG statement performs power and sample size analyses for Type III F tests of sets of predictors in multiple linear regression, assuming either fixed or normally distributed predictors.","help":"MULTREG &lt;ALPHA=number-list&gt; &lt;MODEL=&lt;FIXED|CONDITIONAL | RANDOM|UNCONDITIONAL&gt;&gt; &lt;NFRACTIONAL&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"MODEL=","optional":true,"description":"Specifies the assumed distribution of the tested predictors.","help":"MODEL=FIXED | RANDOM","type":"choice","arguments":[{"name":"FIXED","aliases":["CONDITIONAL"],"description":"Indicates a fixed predictor distribution.","type":"standalone"},{"name":"RANDOM","aliases":["UNCONDITIONAL"],"description":"Indicates a joint multivariate normal distribution for the response and tested predictors.","type":"standalone"}]},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NFULLPREDICTORS=","optional":true,"aliases":["NFULLPRED="],"description":"Specifies the number of predictors in the full model, not counting the intercept.","help":"NFULLPREDICTORS=*number-list*","type":"value"},{"name":"NOINT","optional":true,"description":"Specifies a no-intercept model (for both full and reduced models). By default, the intercept is included in the model. If you want to test the intercept, you can specify the NOINT option and simply consider the intercept to be one of the predictors being tested.","type":"standalone"},{"name":"NREDUCEDPREDICTORS=","optional":true,"aliases":["NREDUCEDPRED=","NREDPRED="],"description":"Specifies the number of predictors in the reduced model, not counting the intercept. This is the same as the difference between values of the NFULLPREDICTORS= and NTESTPREDICTORS= options. Note that supplying a value of 0 is the same as specifying an F test of a Pearson correlation. This option cannot be used at the same time as the NTESTPREDICTORS= option.","help":"NREDUCEDPREDICTORS=*number-list*","type":"value"},{"name":"NTESTPREDICTORS=","optional":true,"aliases":["NTESTPRED="],"description":"Specifies the number of predictors being tested. This is the same as the difference between values of the NFULLPREDICTORS= and NREDUCEDPREDICTORS= options. Note that supplying identical values for the NTESTPREDICTORS= and NFULLPREDICTORS= options is the same as specifying an F test of a Pearson correlation. This option cannot be used at the same time as the NREDUCEDPREDICTORS= option.","help":"NTESTPREDICTORS=*number-list*","type":"value"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.). The minimum acceptable value for the sample size depends on the MODEL=, NOINT, NFULLPREDICTORS=, NTESTPREDICTORS=, and NREDUCEDPREDICTORS= options. It ranges from p+1 to p+3, where p is the value of the NFULLPREDICTORS option.","help":"NTOTAL=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: MODEL= NFULLPREDICTORS= NTESTPREDICTORS= NREDUCEDPREDICTORS= ALPHA= PARTIALCORR= RSQUAREFULL= RSQUAREREDUCED= RSQUAREDIFF= NTOTAL= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the MULTREG statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the MULTREG statement.","type":"standalone"}]},{"name":"PARTIALCORR=","optional":true,"aliases":["PCORR="],"description":"Specifies the partial correlation between the tested predictors and the response, adjusting for any other predictors in the model.","help":"PARTIALCORR=*number-list*","type":"value"},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage.","help":"POWER=*number-list*","type":"value"},{"name":"RSQUAREDIFF=","optional":true,"aliases":["RSQDIFF="],"description":"Specifies the difference in R² between the full and reduced models. This is equivalent to the proportion of variation explained by the predictors you are testing. It is also equivalent to the squared semipartial correlation of the tested predictors with the response.","help":"RSQUAREDIFF=*number-list*","type":"value"},{"name":"RSQUAREFULL=","optional":true,"aliases":["RSQFULL="],"description":"Specifies the R² of the full model, where R² is the proportion of variation explained by the model.","help":"RSQUAREFULL=*number-list*","type":"value"},{"name":"RSQUAREREDUCED=","optional":true,"aliases":["RSQREDUCED=","RSQRED="],"description":"Specifies the R² of the reduced model, where R² is the proportion of variation explained by the model. If the reduced model is an empty or intercept-only model (in other words, if NREDUCEDPREDICTORS=0 or NTESTPREDICTORS=NFULLPREDICTORS), then RSQUAREREDUCED=0 is assumed.","help":"RSQUAREREDUCED=*number-list*","type":"value"},{"name":"TEST=","optional":true,"description":"Specifies a test of a set of predictors adjusting for any other predictors in the model.","help":"TEST=TYPE3","type":"choice","arguments":[{"name":"TYPE3","description":"Specifies a Type III F test of a set of predictors adjusting for any other predictors in the model. This is the default test option.","type":"standalone"}]}]},{"name":"ONECORR","description":"The ONECORR statement performs power and sample size analyses for tests of simple and partial Pearson correlation between two variables. Both Fisher's z test and the t test are supported.","help":"ONECORR &lt;ALPHA=number-list&gt; &lt;CORR=number-list&gt; &lt;DIST=&lt;FISHERZ | T&gt;&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CORR=","optional":true,"description":"Specifies the correlation between two variables, possibly adjusting for other variables as determined by the NPARTIALVARS= option.","help":"CORR=*number-list*","type":"value"},{"name":"DIST=","optional":true,"description":"Specifies the underlying distribution assumed for the test statistic.","help":"DIST=FISHERZ | T","type":"choice","arguments":[{"name":"FISHERZ","description":"Corresponds to Fisher's z normalizing transformation of the correlation coefficient.","type":"standalone"},{"name":"T","description":"Corresponds to the t transformation of the correlation coefficient.","type":"standalone"}]},{"name":"MODEL=","optional":true,"description":"Specifies the assumed distribution of the first variable when DIST=T. The second variable is assumed to have a normal distribution.","help":"MODEL=FIXED | RANDOM","type":"choice","arguments":[{"name":"FIXED","aliases":["CONDITIONAL"],"description":"Indicates a fixed distribution.","type":"standalone"},{"name":"RANDOM","aliases":["UNCONDITIONAL"],"description":"Indicates a joint bivariate normal distribution with the second variable.","type":"standalone"}]},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NPARTIALVARS=","optional":true,"aliases":["NPVARS="],"description":"Specifies the number of variables adjusted for in the correlation between the two primary variables. The default value is 0, corresponding to a simple correlation.","help":"NPARTIALVARS=*number-list*","type":"value"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.). Values for the sample size must be at least p + 3 when DIST=T and MODEL=CONDITIONAL, and at least p + 4 when either DIST=FISHER or when DIST=T and MODEL=UNCONDITIONAL, where p is the value of the NPARTIALVARS option.","help":"NTOTAL=*number-list*","type":"value"},{"name":"NULLCORR=","optional":true,"aliases":["NULLC="],"description":"Specifies the null value of the correlation. The default value is 0. This option can be used only with the DIST=FISHERZ analysis.","help":"NULLCORR=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: MODEL= SIDES= NULL= ALPHA= NPARTIALVARS= CORR= NTOTAL= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the ONECORR statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the ONECORR statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage.","help":"POWER=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"TEST=","optional":true,"description":"Specifies a test of the Pearson correlation coefficient between two variables, possibly adjusting for other variables. This is the default test option.","help":"TEST=PEARSON","type":"choice","arguments":[{"name":"PEARSON","description":"Specifies a test of the Pearson correlation coefficient between two variables, possibly adjusting for other variables.","type":"standalone"}]}]},{"name":"ONESAMPLEFREQ","description":"The ONESAMPLEFREQ statement performs power and sample size analyses for exact and approximate tests (including equivalence, noninferiority, and superiority) and confidence interval precision for a single binomial proportion.","help":"ONESAMPLEFREQ &lt;ALPHA=number-list&gt; &lt;CI=&lt;AGRESTICOULL|AC | JEFFREYS | EXACT|CLOPPERPEARSON|CP&gt;... &gt; &lt;EQUIVBOUNDS=grouped-number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CI=","optional":true,"description":"Specifies an analysis of precision of a confidence interval for the sample binomial proportion.","help":"CI=AGRESTICOULL | JEFFREYS | EXACT | WALD | WALD_CORRECT | WILSON","type":"choice","arguments":[{"name":"AGRESTICOULL","aliases":["AC"],"description":"Is a generalization of the \"Adjusted Wald / add 2 successes and 2 failures\" interval of Agresti and Coull (1998) and is presented in Brown, Cai, and DasGupta (2001). It corresponds to the TABLES / BINOMIAL (AGRESTICOULL) option in PROC FREQ.","type":"standalone"},{"name":"JEFFREYS","description":"Specifies the equal-tailed Jeffreys prior Bayesian interval, corresponding to the TABLES / BINOMIAL (JEFFREYS) option in PROC FREQ.","type":"standalone"},{"name":"EXACT","aliases":["CLOPPERPEARSON","CP"],"description":"Specifies the exact Clopper-Pearson confidence interval based on enumeration, corresponding to the TABLES / BINOMIAL (EXACT) option in PROC FREQ.","type":"standalone"},{"name":"WALD","description":"Specifies the confidence interval based on the Wald test (also commonly called the z test or normal-approximation test), corresponding to the TABLES / BINOMIAL (WALD) option in PROC FREQ.","type":"standalone"},{"name":"WALD_CORRECT","description":"Specifies the confidence interval based on the Wald test with continuity correction, corresponding to the TABLES / BINOMIAL (CORRECT WALD) option in PROC FREQ.","type":"standalone"},{"name":"WILSON","aliases":["SCORE"],"description":"Specifies the confidence interval based on the score statistic, corresponding to the TABLES / BINOMIAL (WILSON) option in PROC FREQ.","type":"standalone"}]},{"name":"EQUIVBOUNDS=","optional":true,"description":"Specifies the lower and upper equivalence bounds, representing the same information as the combination of the LOWER= and UPPER= options but grouping them together. The EQUIVBOUNDS= option can be used only with equivalence analyses (TEST=EQUIV_ADJZ | EQUIV_EXACT | EQUIV_Z). Values must be strictly between 0 and 1.","help":"EQUIVBOUNDS=*grouped-number-list*","type":"value"},{"name":"HALFWIDTH=","optional":true,"description":"Specifies the desired confidence interval half-width. The half-width for a two-sided interval is the length of the confidence interval divided by two. This option can be used only with the CI= analysis.","help":"HALFWIDTH=*number-list*","type":"value"},{"name":"LOWER=","optional":true,"description":"Specifies the lower equivalence bound for the binomial proportion. The LOWER= option can be used only with equivalence analyses (TEST=EQUIV_ADJZ | EQUIV_EXACT | EQUIV_Z). Values must be strictly between 0 and 1.","help":"LOWER=*number-list*","type":"value"},{"name":"MARGIN=","optional":true,"description":"Specifies the equivalence or noninferiority or superiority margin, depending on the analysis.","help":"MARGIN=*number-list*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the computational method.","help":"METHOD=EXACT | NORMAL","type":"choice","arguments":[{"name":"EXACT","description":"Computes exact results by using the binomial distribution. This is the default.","type":"standalone"},{"name":"NORMAL","description":"Computes approximate results by using the normal approximation to the binomial distribution.","type":"standalone"}]},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes. This option is invalid when the METHOD=EXACT option is specified.","type":"standalone"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"NULLPROPORTION=","optional":true,"aliases":["NULLP="],"description":"Specifies the null proportion. A value of 0.5 corresponds to the sign test.","help":"NULLPROPORTION=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES= NULLPROPORTION= ALPHA= PROPORTION= NTOTAL= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the ONESAMPLEFREQ statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the ONESAMPLEFREQ statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage.","help":"POWER=*number-list*","type":"value"},{"name":"PROBWIDTH=","optional":true,"description":"Specifies the desired probability of obtaining a confidence interval half-width less than or equal to the value specified by the HALFWIDTH= option. A missing value (PROBWIDTH=.) requests a solution for this probability. Values are expressed as probabilities (for example, 0.9) rather than percentages. This option can be used only with the CI= analysis.","help":"PROBWIDTH=*number-list*","type":"value"},{"name":"PROPORTION=","optional":true,"aliases":["P="],"description":"Specifies the binomial proportion—that is, the expected proportion of successes in the hypothetical binomial trial.","help":"PROPORTION=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"TEST=","optional":true,"description":"Specifies the statistical analysis.","help":"TEST=ADJZ | EQUIV_ADJZ | EQUIV_EXACT | EQUIV_Z | EXACT | Z","type":"choice","arguments":[{"name":"ADJZ","description":"Specifies a normal-approximate z test with continuity adjustment.","type":"standalone"},{"name":"EQUIV_ADJZ","description":"Specifies a normal-approximate two-sided equivalence test based on the z statistic with continuity adjustment and a TOST (two one-sided tests) procedure.","type":"standalone"},{"name":"EQUIV_EXACT","description":"Specifies the exact binomial two-sided equivalence test based on a TOST (two one-sided tests)' procedure.","type":"standalone"},{"name":"EQUIV_Z","description":"Specifies a normal-approximate two-sided equivalence test based on the z statistic without any continuity adjustment, which is the same as the chi-square statistic, and a TOST (two one-sided tests) procedure","type":"standalone"},{"name":"EXACT","description":"Specifies the exact binomial test. This is the default.","type":"standalone"},{"name":"Z","description":"Specifies a normal-approximate z test without any continuity adjustment, which is the same as the chi-square test when SIDES=2.","type":"standalone"}]},{"name":"UPPER=","optional":true,"description":"Specifies the upper equivalence bound for the binomial proportion. The UPPER= option can be used only with equivalence analyses (TEST=EQUIV_ADJZ | EQUIV_EXACT | EQUIV_Z). Values must be strictly between 0 and 1.","help":"UPPER=*number-list*","type":"value"},{"name":"VAREST=","optional":true,"description":"Specifies how the variance is computed in the test statistic for the TEST=Z, TEST=ADJZ, TEST=EQUIV_Z, and TEST=EQUIV_ADJZ analyses.","help":"VAREST=NULL | SAMPLE","type":"choice","arguments":[{"name":"NULL","description":"Estimates the variance by using the null proportion(s) (specified by some combination of the NULLPROPORTION=, MARGIN=, LOWER=, and UPPER= options). For TEST=Z and TEST=ADJZ, the null proportion is the value of the NULLPROPORTION= option plus the value of the MARGIN= option (if it is used). For TEST=EQUIV_Z and TEST=EQUIV_ADJZ, there are two null proportions, corresponding to the lower and upper equivalence bounds, one for each test in the TOST (two one-sided tests) procedure. This is the default.","type":"standalone"},{"name":"SAMPLE","description":"Estimates the variance by using the observed sample proportion.","type":"standalone"}]}]},{"name":"ONESAMPLEMEANS","description":"The ONESAMPLEMEANS statement performs power and sample size analyses for t tests, equivalence tests, and confidence interval precision involving one sample.","help":"ONESAMPLEMEANS &lt;ALPHA=number-list&gt; &lt;CI&gt; &lt;CI=&lt;T&gt;&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CI","optional":true,"description":"Specifies an analysis of precision of the confidence interval for the mean. Instead of power, the relevant probability for this analysis is the probability of achieving a desired precision. Specifically, it is the probability that the half-width of the confidence interval will be at most the value specified by the HALFWIDTH= option. If neither the CI= option nor the TEST= option is used, the default is TEST=T.","type":"standalone"},{"name":"CI=","optional":true,"description":"Specifies an analysis of precision of the confidence interval for the mean. Instead of power, the relevant probability for this analysis is the probability of achieving a desired precision. Specifically, it is the probability that the half-width of the confidence interval will be at most the value specified by the HALFWIDTH= option. If neither the CI= option nor the TEST= option is used, the default is TEST=T.","help":"CI=T","type":"choice","arguments":[{"name":"T","description":"Specifies an analysis of precision of the confidence interval for the mean based on a t test.","type":"standalone"}]},{"name":"CV=","optional":true,"description":"Specifies the coefficient of variation, defined as the ratio of the standard deviation to the mean. You can use this option only with DIST=LOGNORMAL.","help":"CV=*number-list*","type":"value"},{"name":"DIST=","optional":true,"description":"Specifies the underlying distribution assumed for the test statistic.","help":"DIST=LOGNORMAL | NORMAL","type":"choice","arguments":[{"name":"LOGNORMAL","description":"Corresponds to the lognormal distribution.","type":"standalone"},{"name":"NORMAL","description":"Corresponds to the normal distribution","type":"standalone"}]},{"name":"HALFWIDTH=","optional":true,"description":"Specifies the desired confidence interval half-width. The half-width is defined as the distance between the point estimate and a finite endpoint. This option can be used only with the CI=T analysis.","help":"HALFWIDTH=*number-list*","type":"value"},{"name":"LOWER=","optional":true,"description":"Specifies the lower equivalence bound for the mean. This option can be used only with the TEST=EQUIV analysis.","help":"LOWER=*number-list*","type":"value"},{"name":"MEAN=","optional":true,"description":"Specifies the mean, in the original scale, or requests a solution for the mean with a missing value (MEAN=.). The mean is arithmetic if DIST=NORMAL and geometric if DIST=LOGNORMAL. This option can be used only with the TEST=T and TEST=EQUIV analyses.","help":"MEAN=*number-list*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes. This option is invalid when the METHOD=EXACT option is specified.","type":"standalone"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"NULLMEAN=","optional":true,"aliases":["NULLM="],"description":"Specifies the null mean, in the original scale (whether DIST=NORMAL or DIST=LOGNORMAL). The default value is 0 when DIST=NORMAL and 1 when DIST=LOGNORMAL. This option can be used only with the TEST=T analysis.","help":"NULLMEAN=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES= NULLMEAN= LOWER= UPPER= ALPHA= MEAN= HALFWIDTH= STDDEV= CV= NTOTAL= POWER= PROBTYPE= PROBWIDTH=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the ONESAMPLEMEANS statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the ONESAMPLEMEANS statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage. This option can be used only with the TEST=T and TEST=EQUIV analyses.","help":"POWER=*number-list*","type":"value"},{"name":"PROBTYPE=","optional":true,"description":"Specifies the type of probability for the PROBWIDTH= option.","help":"PROBTYPE=CONDITIONAL | UNCONDITIONAL","type":"choice","arguments":[{"name":"CONDITIONAL","description":"Width probability conditional on interval containing the mean","type":"standalone"},{"name":"UNCONDITIONAL","description":"Unconditional width probability","type":"standalone"}]},{"name":"PROBWIDTH=","optional":true,"description":"Specifies the desired probability of obtaining a confidence interval half-width less than or equal to the value specified by the HALFWIDTH= option. A missing value (PROBWIDTH=.) requests a solution for this probability. The type of probability is controlled with the PROBTYPE= option. Values are expressed as probabilities (for example, 0.9) rather than percentages. This option can be used only with the CI=T analysis.","help":"PROBWIDTH=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"STDDEV=","optional":true,"aliases":["STD="],"description":"Specifies the standard deviation, or requests a solution for the standard deviation with a missing value (STDDEV=.). You can use this option only with DIST=NORMAL.","help":"STDDEV=*number-list*","type":"value"},{"name":"TEST=","optional":true,"description":"Specifies the statistical analysis.","help":"TEST=EQUIV | T","type":"choice","arguments":[{"name":"EQUIV","description":"Specifies an equivalence test of the mean by using a two one-sided tests (TOST) analysis (Schuirmann 1987).","type":"standalone"},{"name":"T","description":"Specifies a t test on the mean. If neither the TEST= option nor the CI= option is used, the default is TEST=T. This is the default.","type":"standalone"}]},{"name":"UPPER=","optional":true,"description":"Specifies the upper equivalence bound for the mean, in the original scale (whether DIST=NORMAL or DIST=LOGNORMAL). This option can be used only with the TEST=EQUIV analysis.","help":"UPPER=*number-list*","type":"value"}]},{"name":"ONEWAYANOVA","description":"The ONEWAYANOVA statement performs power and sample size analyses for one-degree-of-freedom contrasts and the overall F test in one-way analysis of variance.","help":"ONEWAYANOVA &lt;ALPHA=number-list&gt; &lt;CONTRAST= ( values ) &lt; ( ...values ) &gt;&gt; &lt;GROUPMEANS=grouped-number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CONTRAST=","optional":true,"description":"Specifies coefficients for single-degree-of-freedom hypothesis tests. You must provide a coefficient for every mean appearing in the GROUPMEANS= option. Specify multiple contrasts either with additional sets of coefficients or with additional CONTRAST= options. For example, you can specify two different contrasts of five means by using the following:","type":"value"},{"name":"GROUPMEANS=","optional":true,"aliases":["GMEANS="],"description":"Specifies the group means. This option is used to implicitly set the number of groups.","help":"GROUPMEANS=*grouped-number-list*","type":"value"},{"name":"GROUPNS=","optional":true,"aliases":["GNS="],"description":"Specifies the group sample sizes. The number of groups represented must be the same as with the GROUPMEANS= option.","help":"GROUPNS=*grouped-number-list*","type":"value"},{"name":"GROUPWEIGHTS=","optional":true,"aliases":["GWEIGHTS="],"description":"Specifies the sample size allocation weights for the groups. This option controls how the total sample size is divided between the groups. Each set of values across all groups represents relative allocation weights.","help":"GROUPWEIGHTS=*grouped-number-list*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes. This option is invalid when the METHOD=EXACT option is specified.","type":"standalone"},{"name":"NPERGROUP=","optional":true,"aliases":["NPERG="],"description":"Specifies the common sample size per group or requests a solution for the common sample size per group with a missing value (NPERGROUP==.). Use of this option implicitly specifies a balanced design.","help":"NPERGROUP=*number-list*","type":"value"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"NULLCONTRAST=","optional":true,"aliases":["NULLC="],"description":"Specifies the null value of the contrast. The default value is 0. This option can be used only with the TEST=CONTRAST analysis.","help":"NULLCONTRAST=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: CONTRAST= SIDES= NULLCONTRAST= ALPHA= GROUPMEANS= STDDEV= GROUPWEIGHTS= NTOTAL= NPERGROUP= GROUPNS= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the ONEWAYANOVA statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the ONEWAYANOVA statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage. This option can be used only with the TEST=T and TEST=EQUIV analyses.","help":"POWER=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"STDDEV=","optional":true,"aliases":["STD="],"description":"Specifies the error standard deviation.","help":"STDDEV=*number-list*","type":"value"},{"name":"TEST=","optional":true,"description":"Specifies the statistical analysis. The default is TEST=CONTRAST if the CONTRAST= option is used, and TEST=OVERALL otherwise.","help":"TEST=CONTRAST | OVERALL","type":"choice","arguments":[{"name":"CONTRAST","description":"Specifies a one-degree-of-freedom test of a contrast of means. The test is the usual F test for the two-sided case and the usual t test for the one-sided case.","type":"standalone"},{"name":"OVERALL","description":"Specifies the overall F test of equality of all means.","type":"standalone"}]}]},{"name":"PAIREDFREQ","description":"The PAIREDFREQ statement performs power and sample size analyses for McNemar's test for paired proportions.","help":"PAIREDFREQ &lt;ALPHA=number-list&gt; &lt;CORR=number-list&gt; &lt;DISCPROPORTIONS=grouped-number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CORR=","optional":true,"description":"Specifies the correlation φ between members of a pair.","help":"CORR=*number-list*","type":"value"},{"name":"DISCPROPDIFF=","optional":true,"aliases":["DISCPDIFF="],"description":"Specifies the difference p01 - p10 between discordant proportions.","help":"DISCPROPDIFF=*number-list*","type":"value"},{"name":"DISCPROPORTIONS=","optional":true,"aliases":["DISCPS="],"description":"Specifies the two discordant proportions, p10 and p01.","help":"DISCPROPORTIONS=*grouped-number-list*","type":"value"},{"name":"DISCPROPRATIO=","optional":true,"aliases":["DISCPRATIO="],"description":"Specifies the ratio p01 / p10 of discordant proportions.","help":"DISCPROPRATIO=*number-list*","type":"value"},{"name":"DIST=","optional":true,"description":"Specifies the underlying distribution assumed for the test statistic. The default value is EXACT_COND.","help":"DIST=EXACT_COND  | NORMAL","type":"choice","arguments":[{"name":"EXACT_COND","description":"Corresponds to the exact conditional test, based on the exact binomial distribution of the two types of discordant pairs given the total number of discordant pairs.","help":"EXACT_COND ","type":"standalone"},{"name":"NORMAL","description":"Corresponds to the conditional test based on the normal approximation to the binomial distribution of the two types of discordant pairs given the total number of discordant pairs.","type":"standalone"}]},{"name":"METHOD=","optional":true,"description":"Specifies the computational method.","help":"METHOD=CONNOR | EXACT | MIETTINEN","type":"choice","arguments":[{"name":"CONNOR","description":"Uses an approximation from Connor (1987). Valid only for DIST=NORMAL","type":"standalone"},{"name":"EXACT","description":"Uses the exact binomial distributions of the total number of discordant pairs and the two types of discordant pairs. This is the default.","type":"standalone"},{"name":"MIETTINEN","description":"Uses an approximation from Miettinen (1968). Valid only for DIST=NORMAL.","type":"standalone"}]},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes. This option cannot be used with METHOD=EXACT.","type":"standalone"},{"name":"NPAIRS=","optional":true,"description":"Specifies the total number of proportion pairs (concordant and discordant) or requests a solution for the number of pairs with a missing value (NPAIRS=.).","help":"NPAIRS=*number-list*","type":"value"},{"name":"NULLDISCPROPRATIO=","optional":true,"aliases":["NULLDISCPRATIO=","NULLRATIO=","NULLR="],"description":"Specifies the null value of the ratio of discordant proportions. The default value is 1.","help":"NULLDISCPROPRATIO=*number-list*","type":"value"},{"name":"ODDSRATIO=","optional":true,"aliases":["OR="],"description":"Specifies the odds ratio [p.1/(1-p.1)]/[p1./(1-p1.)].","help":"ODDSRATIO=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES= NULLDISCPROPRATIO= ALPHA= PAIREDPROPORTIONS= PROPORTIONDIFF= ODDSRATIO= RELATIVERISK= CORR= DISCPROPORTIONS= DISCPROPDIFF= TOTALPROPDISC= REFPROPORTION= DISCPROPRATIO= NPAIRS= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the PAIREDFREQ statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the PAIREDFREQ statement.","type":"standalone"}]},{"name":"PAIREDPROPORTIONS=","optional":true,"aliases":["PPROPORTIONS=","PAIREDPS=","PPS="],"description":"Specifies the two paired proportions, p1. and p.1.","help":"PAIREDPROPORTIONS=*grouped-number-list*","type":"value"},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage.","help":"POWER=*number-list*","type":"value"},{"name":"PROPORTIONDIFF=","optional":true,"aliases":["PDIFF="],"description":"Specifies the proportion difference p.1 - p1..","help":"PROPORTIONDIFF=*number-list*","type":"value"},{"name":"REFPROPORTION=","optional":true,"aliases":["REFP="],"description":"Specifies either the reference first proportion p.1 - p1.. (when used in conjunction with the PROPORTIONDIFF=, ODDSRATIO=, or RELATIVERISK= option) or the reference discordant proportion p10 (when used in conjunction with the DISCPROPDIFF= or DISCPROPRATIO= option).","help":"REFPROPORTION=*number-list*","type":"value"},{"name":"RELATIVERISK=","optional":true,"aliases":["RR="],"description":"Specifies the relative risk p.1/p1..","help":"RELATIVERISK=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"TEST=","optional":true,"description":"Specifies a test of paired proportions. The McNemar test of paired proportions is the default test option.","help":"TEST=MCNEMAR","type":"choice","arguments":[{"name":"MCNEMAR","description":"Specifies the McNemar test of paired proportions.","type":"standalone"}]},{"name":"TOTALPROPDISC=","optional":true,"aliases":["TOTALPDISC=","PDISC="],"description":"Specifies the sum of the two discordant proportions, p10 + p01.","help":"TOTALPROPDISC=*number-list*","type":"value"}]},{"name":"PAIREDMEANS","description":"The PAIREDMEANS statement performs power and sample size analyses for t tests, equivalence tests, and confidence interval precision involving paired samples.","help":"PAIREDMEANS &lt;ALPHA=number-list&gt; &lt;CI | CI=DIFF&gt; &lt;CORR=number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CI","optional":true,"description":"Specifies an analysis of precision of the confidence interval for the mean difference. Instead of power, the relevant probability for this analysis is the probability of achieving a desired precision. Specifically, it is the probability that the half-width of the observed confidence interval will be at most the value specified by the HALFWIDTH= option. If neither the CI= option nor the TEST= option is used, the default is TEST= DIFF.","type":"standalone"},{"name":"CORR=","optional":true,"description":"Specifies the correlation between members of a pair.","help":"CORR=*number-list*","type":"value"},{"name":"CV=","optional":true,"description":"Specifies the coefficient of variation, defined as the ratio of the standard deviation to the mean. You can use this option only with DIST=LOGNORMAL.","help":"CV=*number-list*","type":"value"},{"name":"DIST=","optional":true,"description":"Specifies the underlying distribution assumed for the test statistic.","help":"DIST=LOGNORMAL | NORMAL","type":"choice","arguments":[{"name":"LOGNORMAL","description":"Corresponds to the lognormal distribution.","type":"standalone"},{"name":"NORMAL","description":"Corresponds to the normal distribution","type":"standalone"}]},{"name":"HALFWIDTH=","optional":true,"description":"Specifies the desired confidence interval half-width. The half-width is defined as the distance between the point estimate and a finite endpoint. This option can be used only with the CI=T analysis.","help":"HALFWIDTH=*number-list*","type":"value"},{"name":"LOWER=","optional":true,"description":"Specifies the lower equivalence bound for the mean. This option can be used only with the TEST=EQUIV analysis.","help":"LOWER=*number-list*","type":"value"},{"name":"MEANDIFF=","optional":true,"description":"Specifies the mean difference, defined as the mean of the difference between the second and first members of a pair, µ2 - µ1 . This option can be used only with the TEST= DIFF and TEST= EQUIV_DIFF analyses. When TEST= EQUIV_DIFF, the mean difference is interpreted as the treatment mean minus the reference mean.","help":"MEANDIFF=*number-list*","type":"value"},{"name":"MEANRATIO=","optional":true,"description":"Specifies the geometric mean ratio, defined as γ2/γ1. This option can be used only with the TEST= RATIO and TEST= EQUIV_RATIO analyses. When TEST= EQUIV_RATIO, the mean ratio is interpreted as the treatment mean divided by the reference mean.","help":"MEANRATIO=*number-list*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes. This option is invalid when the METHOD=EXACT option is specified.","type":"standalone"},{"name":"NPAIRS=","optional":true,"description":"Specifies the total number of proportion pairs (concordant and discordant) or requests a solution for the number of pairs with a missing value (NPAIRS=.).","help":"NPAIRS=*number-list*","type":"value"},{"name":"NULLRATIO=","optional":true,"aliases":["NULLR="],"description":"Specifies the null value of the ratio of discordant proportions. The default value is 1.","help":"NULLRATIO=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES= NULLDIFF= NULLRATIO= LOWER= UPPER= ALPHA= PAIREDMEANS= MEANDIFF= MEANRATIO= HALFWIDTH= STDDEV= PAIREDSTDDEVS= CV= PAIREDCVS= CORR= NPAIRS= POWER= PROBTYPE= PROBWIDTH=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the PAIREDMEANS statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the PAIREDMEANS statement.","type":"standalone"}]},{"name":"PAIREDCVS=","optional":true,"description":"Specifies the coefficient of variation for each member of a pair. Unlike the CV= option, the PAIREDCVS= option supports different values for each member of a pair. Values must be nonnegative (unless both are equal to zero, which is permitted). This option can be used only with DIST=LOGNORMAL","help":"PAIREDCVS=*grouped-number-list*","type":"value"},{"name":"PAIREDMEANS=","optional":true,"aliases":["PMEANS="],"description":"Specifies the two paired means, in the original scale. The means are arithmetic if DIST=NORMAL and geometric if DIST=LOGNORMAL. This option cannot be used with the CI=DIFF analysis. When TEST=EQUIV_DIFF, the means are interpreted as the reference mean (first) and the treatment mean (second).","help":"PAIREDMEANS=*grouped-number-list*","type":"value"},{"name":"PAIREDSTDDEVS=","optional":true,"aliases":["PAIREDSTDS=","PSTDDEVS","PSTDS="],"description":"Specifies the standard deviation of each member of a pair. Unlike the STDDEV= option, the PAIREDSTDDEVS= option supports different values for each member of a pair. This option can be used only with DIST=NORMAL.","help":"PAIREDSTDDEVS=*grouped-number-list*","type":"value"},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage. This option cannot be used with the CI=DIFF analysis.","help":"POWER=*number-list*","type":"value"},{"name":"PROBTYPE=","optional":true,"description":"Specifies the type of probability for the PROBWIDTH= option.","help":"PROBTYPE=CONDITIONAL | UNCONDITIONAL","type":"choice","arguments":[{"name":"CONDITIONAL","aliases":["GIVENVALIDITY"],"description":"Indicates the conditional probability that the confidence interval half-width is at most the value specified by the HALFWIDTH= option, given that the true mean difference is captured by the confidence interval.","type":"standalone"},{"name":"UNCONDITIONAL","description":"Indicates the unconditional probability that the confidence interval half-width is at most the value specified by the HALFWIDTH= option.","type":"standalone"}]},{"name":"PROBWIDTH=","optional":true,"description":"Specifies the desired probability of obtaining a confidence interval half-width less than or equal to the value specified by the HALFWIDTH= option. A missing value (PROBWIDTH=.) requests a solution for this probability. The type of probability is controlled with the PROBTYPE= option. Values are expressed as probabilities (for example, 0.9) rather than percentages. This option can be used only with the CI=DIFF analysis.","help":"PROBWIDTH=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"STDDEV=","optional":true,"aliases":["STD="],"description":"Specifies the standard deviation assumed to be common to both members of a pair. This option can be used only with DIST=NORMAL.","help":"STDDEV=*number-list*","type":"value"},{"name":"TEST=","optional":true,"description":"Specifies the statistical analysis. If neither the TEST= option nor the CI= option is used, the default is TEST=DIFF.","help":"TEST=DIFF | EQUIV_DIFF | EQUIV_RATIO | RATIO","type":"choice","arguments":[{"name":"DIFF","description":"Specifies a paired t test on the mean difference. This is the default.","type":"standalone"},{"name":"EQUIV_DIFF","description":"Specifies an additive equivalence test of the mean difference by using a two one-sided tests (TOST) analysis (Schuirmann 1987).","type":"standalone"},{"name":"EQUIV_RATIO","description":"Specifies a multiplicative equivalence test of the mean ratio by using a TOST analysis.","type":"standalone"},{"name":"RATIO","description":"Specifies a paired t test on the geometric mean ratio.","type":"standalone"}]},{"name":"UPPER=","optional":true,"description":"Specifies the upper equivalence bound for the mean difference or mean ratio, in the original scale (whether DIST=NORMAL or DIST=LOGNORMAL). This option can be used only with the TEST=EQUIV_DIFF and TEST=EQUIV_RATIO analyses.","help":"UPPER=*number-list*","type":"value"}]},{"name":"PLOT","description":"The PLOT statement produces a graph or set of graphs for the sample size analysis defined by the previous analysis statement. The plot-options define the plot characteristics, and the graph-options are SAS/GRAPH-style options.","help":"PLOT INTERPOL=JOIN|NONE  KEY=BYCURVE|BYFEATURE|ONCURVES  MARKERS=ANALYSIS|COMPUTED|NICE...  ...","arguments":[{"name":"INTERPOL=","description":"Specifies the type of curve to draw through the computed points.","help":"INTERPOL=JOIN | NONE","type":"choice","arguments":[{"name":"JOIN","description":"Connects computed points with straight lines.","type":"standalone"},{"name":"NONE","description":"Leaves computed points unconnected.","type":"standalone"}]},{"name":"KEY=","description":"Specifies the style of key (or \"legend\") for the plot. The default is KEY=BYFEATURE.","help":"KEY=BYCURVE | BYFEATURE | ONCURVES","type":"choice","arguments":[{"name":"BYCURVE","description":"Specifies a key with each row identifying a distinct curve in the plot. Syntax: BYCURVE <(bycurve-options)> You can specify the following bycurve-options in parentheses after the KEY=BYCURVE option. NUMBERS=OFF | ON specifies how the key should identify curves. If NUMBERS=OFF, then the key includes symbol, color, and line style samples to identify the curves. If NUMBERS=ON, then the key includes numbers matching numeric labels placed adjacent to the curves. The default is NUMBERS=ON. POS=BOTTOM | INSET specifies the position of the key. The POS=BOTTOM option places the key below the X axis. The POS=INSET option places the key inside the plotting region and attempts to choose the least crowded corner. The default is POS=BOTTOM.","type":"standalone"},{"name":"BYFEATURE","description":"Specifies a key with a column of entries for each plot feature (line style, color, and/or symbol). Syntax: BYFEATURE <(byfeature-options)> You can specify the following byfeature-options in parentheses after KEY=BYFEATURE option. POS=BOTTOM | INSET specifies the position of the key. The POS=BOTTOM option places the key below the X axis. The POS=INSET option places the key inside the plotting region and attempts to choose the least crowded corner. The default is POS=BOTTOM.","type":"standalone"},{"name":"ONCURVES","description":"Places a curve-specific label adjacent to each curve.","type":"standalone"}]},{"name":"MARKERS=","description":"Specifies the locations for plotting symbols.","help":"MARKERS=ANALYSIS | COMPUTED | NICE | NONE","type":"choice","arguments":[{"name":"ANALYSIS","description":"Places plotting symbols at locations corresponding to the values of the relevant input parameter from the POWER statement preceding the PLOT statement.","type":"standalone"},{"name":"COMPUTED","description":"Places plotting symbols at the locations of actual computed points from the sample size analysis. This is the default.","type":"standalone"},{"name":"NICE","description":"Places plotting symbols at tick mark locations (corresponding to the argument axis).","type":"standalone"},{"name":"NONE","description":"Disables plotting symbols.","type":"standalone"}]},{"name":"MAX=","description":"Specifies the maximum of the range of values for the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for).","help":"MAX=&lt;*number*&gt; | DATAMAX","type":"choice","arguments":[{"name":"number","placeholder":true,"description":"Replace <number> with an actual value.","type":"value"},{"name":"DATAMAX","description":"Specifies the maximum value that occurs for this parameter in the POWER statement that precedes the PLOT statement. This is the default.","type":"standalone"}]},{"name":"MIN=","description":"Specifies the minimum of the range of values for the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for).","help":"MIN=&lt;*number*&gt; | DATAMIN","type":"choice","arguments":[{"name":"number","placeholder":true,"description":"Replace <number> with an actual value.","type":"value"},{"name":"DATAMIN","description":"Specifies the minimum value that occurs for this parameter in the POWER statement that precedes the PLOT statement. This is the default.","type":"standalone"}]},{"name":"NPOINTS=","aliases":["NPTS="],"description":"Specifies the number of values for the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for). You cannot use the NPOINTS= and STEP= options simultaneously. The default value for typical situations is 20.","help":"NPOINTS=*number*","type":"value"},{"name":"STEP=","description":"Specifies the increment between values of the parameter associated with the \"argument\" axis (the axis that is not representing the parameter being solved for).","help":"STEP=*number*","type":"value"},{"name":"VARY=","description":"Specifies how plot features should be linked to varying analysis parameters. Available plot features are COLOR, LINESTYLE, PANEL, and SYMBOL. A \"panel\" refers to a separate plot with a heading identifying the subset of values represented in the plot. The parameter-list is a list of one or more names separated by spaces. Each name must match the name of an analysis option used in the analysis statement preceding the PLOT statement. Also, the name must be the primary name for the analysis option—that is, the one listed first in the syntax description.","help":"VARY=BY","type":"choice","arguments":[{"name":"BY","type":"standalone"}]},{"name":"X=","description":"Specifies a plot with the requested type of parameter on the X axis and the parameter being solved for on the Y axis. The default is X=POWER, unless the result parameter is power or Prob(Width), in which case the default is X=N.","help":"X=EFFECT | N | POWER","type":"choice","arguments":[{"name":"EFFECT","description":"The parameter assigned to the X axis is the one most representative of \"effect size\".","type":"standalone"},{"name":"N","description":"The parameter assigned to the X axis is the sample size.","type":"standalone"},{"name":"POWER","description":"The parameter assigned to the X axis is the one most representative of \"power\" (either power itself or a similar probability, such as Prob(Width) for confidence interval analyses).","type":"standalone"}]},{"name":"XOPTS=","description":"Specifies plot characteristics pertaining to the X axis. You can specify the following x-options in parentheses. CROSSREF=NO | YES specifies whether the reference lines defined by the REF= y-option should be crossed with a reference line on the Y axis that indicates the solution point on the curve.","help":"XOPTS=CROSSREF= | REF=","type":"choice","arguments":[{"name":"CROSSREF=","type":"value"},{"name":"REF=","type":"value"}]},{"name":"Y=","description":"Specifies a plot with the requested type of parameter on the Y axis and the parameter being solved for on the X axis. You cannot use the Y= and X= options simultaneously. By default, the X= option is used instead of the Y= option.","help":"Y=EFFECT | N | POWER","type":"choice","arguments":[{"name":"EFFECT","description":"The parameter assigned to the Y axis is the one most representative of \"effect size\".","type":"standalone"},{"name":"N","description":"The parameter assigned to the Y axis is the sample size.","type":"standalone"},{"name":"POWER","description":"The parameter assigned to the Y axis is the one most representative of \"power\" (either power itself or a similar probability, such as Prob(Width) for confidence interval analyses).","type":"standalone"}]},{"name":"YOPTS=","description":"Specifies plot characteristics pertaining to the Y axis. You can specify the following y-options in parentheses. CROSSREF=NO | YES specifies whether the reference lines defined by the REF= y-option should be crossed with a reference line on the X axis that indicates the solution point on the curve.","help":"YOPTS=CROSSREF= | REF=","type":"choice","arguments":[{"name":"CROSSREF=","type":"value"},{"name":"REF=","type":"value"}]},{"name":"DESCRIPTION=","optional":true,"followsDelimiter":"/","description":"Specifies a descriptive string of up to 40 characters that appears in the \"Description\" field of the graphics catalog.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"NAME=","optional":true,"followsDelimiter":"/","description":"Specifies a name of up to eight characters for the catalog entry for the plot. The default name is PLOTn, where n is the number of the plot statement within the current invocation of PROC POWER. If the name duplicates the name of an existing entry, SAS/GRAPH software adds a number to the duplicate name to create a unique entry—for example, PLOT11 and PLOT12 for the second and third panels of a multipanel plot generated in the first PLOT statement in an invocation of PROC POWER.","help":"NAME='*string*'","type":"value"}]},{"name":"TWOSAMPLEFREQ","description":"The TWOSAMPLEFREQ statement performs power and sample size analyses for tests of two independent proportions. Pearson's chi-square, Fisher's exact, and likelihood ratio chi-square tests are supported.","help":"TWOSAMPLEFREQ &lt;ALPHA=number-list&gt; &lt;GROUPNS=grouped-number-list&gt; &lt;GROUPNS=grouped-number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"GROUPNS=","optional":true,"aliases":["GNS="],"description":"Specifies the two group sample sizes.","help":"GROUPNS=*grouped-number-list*","type":"value"},{"name":"GROUPPROPORTIONS=","optional":true,"aliases":["GPROPORTIONS=","GROUPPS=","GPS="],"description":"Specifies the two independent proportions, p1 and p2.","type":"value"},{"name":"GROUPWEIGHTS=","optional":true,"aliases":["GWEIGHTS="],"description":"Specifies the sample size allocation weights for the groups. This option controls how the total sample size is divided between the groups. Each set of values across all groups represents relative allocation weights.","help":"GROUPWEIGHTS=*grouped-number-list*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NPERGROUP=","optional":true,"aliases":["NPERG="],"description":"Specifies the common sample size per group or requests a solution for the common sample size per group with a missing value (NPERGROUP==.). Use of this option implicitly specifies a balanced design.","help":"NPERGROUP=*number-list*","type":"value"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"NULLODDSRATIO=","optional":true,"aliases":["NULLOR="],"description":"Specifies the null odds ratio. The default value is 1. This option can be used only with the ODDSRATIO= option in the TEST=PCHI analysis.","help":"NULLODDSRATIO=*number-list*","type":"value"},{"name":"NULLPROPORTIONDIFF=","optional":true,"aliases":["NULLPDIFF="],"description":"Specifies the null proportion difference. The default value is 0. This option can be used only with the GROUPPROPORTIONS= or PROPORTIONDIFF= option in the TEST=PCHI analysis.","help":"NULLPROPORTIONDIFF=*number-list*","type":"value"},{"name":"NULLRELATIVERISK=","optional":true,"aliases":["NULLRR="],"description":"Specifies the null relative risk. The default value is 1. This option can be used only with the RELATIVERISK= option in the TEST=PCHI analysis.","help":"NULLRELATIVERISK=*number-list*","type":"value"},{"name":"ODDSRATIO=","optional":true,"aliases":["OR="],"description":"Specifies the odds ratio [p2/(1-p2)]/[p1/(1-p1)].","help":"ODDSRATIO=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES= NULLPROPORTIONDIFF= NULLODDSRATIO= NULLRELATIVERISK= ALPHA= GROUPPROPORTIONS= REFPROPORTION= PROPORTIONDIFF= ODDSRATIO= RELATIVERISK= GROUPWEIGHTS= NTOTAL= NPERGROUP= GROUPNS= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the TWOSAMPLEFREQ statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the TWOSAMPLEFREQ statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage.","help":"POWER=*number-list*","type":"value"},{"name":"PROPORTIONDIFF=","optional":true,"aliases":["PDIFF="],"description":"Specifies the proportion difference p2 - p1.","help":"PROPORTIONDIFF=*number-list*","type":"value"},{"name":"REFPROPORTION=","optional":true,"aliases":["REFP="],"description":"Specifies either the reference first proportion p1.","help":"REFPROPORTION=*number-list*","type":"value"},{"name":"RELATIVERISK=","optional":true,"aliases":["RR="],"description":"Specifies the relative risk p2/p1.","help":"RELATIVERISK=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"TEST=","optional":true,"description":"Specifies the statistical analysis.","help":"TEST=FISHER | FM | FM_RR | LRCHI | PCHI","type":"choice","arguments":[{"name":"FISHER","description":"Specifies the Fisher's exact test.","type":"standalone"},{"name":"FM","description":"Specifies the score test of Farrington and Manning (1990) for proportion difference.","type":"standalone"},{"name":"FM_RR","description":"Specifies the score test of Farrington and Manning (1990) for relative risk.","type":"standalone"},{"name":"LRCHI","description":"Specifies the likelihood ratio chi-square test.","type":"standalone"},{"name":"PCHI","description":"Specifies Pearson’s chi-square test for proportion difference. This is the default.","type":"standalone"}]}]},{"name":"TWOSAMPLEMEANS","description":"The TWOSAMPLEMEANS statement performs power and sample size analyses for pooled and unpooled t tests, equivalence tests, and confidence interval precision involving two independent samples.","help":"TWOSAMPLEMEANS &lt;ALPHA=number-list&gt; &lt;CI | CI=DIFF&gt; &lt;CV=number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CI","optional":true,"description":"Specifies an analysis of precision of the confidence interval for the mean difference, assuming equal variances. Instead of power, the relevant probability for this analysis is the probability that the interval half-width is at most the value specified by the HALFWIDTH= option. If neither the TEST= option nor the CI= option is used, the default is TEST= DIFF.","type":"standalone"},{"name":"CV=","optional":true,"description":"Specifies the coefficient of variation assumed to be common to both groups. The coefficient of variation is defined as the ratio of the standard deviation to the mean. You can use this option only with DIST=LOGNORMAL.","help":"CV=*number-list*","type":"value"},{"name":"DIST=","optional":true,"description":"Specifies the underlying distribution assumed for the test statistic. The default value (also the only acceptable value in each case) is NORMAL for TEST=DIFF, TEST=DIFF_SATT, TEST=EQUIV_DIFF, and CI=DIFF; and LOGNORMAL for TEST=RATIO and TEST=EQUIV_RATIO.","help":"DIST=LOGNORMAL | NORMAL","type":"choice","arguments":[{"name":"LOGNORMAL","description":"Corresponds to the lognormal distribution.","type":"standalone"},{"name":"NORMAL","description":"Corresponds to the normal distribution","type":"standalone"}]},{"name":"GROUPMEANS=","optional":true,"aliases":["GMEANS="],"description":"Specifies the group means. This option is used to implicitly set the number of groups.","help":"GROUPMEANS=*grouped-number-list*","type":"value"},{"name":"GROUPNS=","optional":true,"aliases":["GNS="],"description":"Specifies the group sample sizes. The number of groups represented must be the same as with the GROUPMEANS= option.","help":"GROUPNS=*grouped-number-list*","type":"value"},{"name":"GROUPSTDDEVS=","optional":true,"aliases":["GSTDDEVS=","GROUPSTDS=","GSTDS="],"description":"Specifies tthe two group sample sizes or requests a solution for one group sample size given the other.","help":"GROUPSTDDEVS=*grouped-number-list*","type":"value"},{"name":"GROUPWEIGHTS=","optional":true,"aliases":["GWEIGHTS="],"description":"Specifies the sample size allocation weights for the two groups, or requests a solution for one group weight given the other. This option controls how the total sample size is divided between the two groups. Each pair of values for the two groups represents relative allocation weights.","help":"GROUPWEIGHTS=*grouped-number-list*","type":"value"},{"name":"HALFWIDTH=","optional":true,"description":"Specifies the desired confidence interval half-width. The half-width is defined as the distance between the point estimate and a finite endpoint. This option can be used only with the CI=DIFF analysis.","help":"HALFWIDTH=*number-list*","type":"value"},{"name":"LOWER=","optional":true,"description":"Specifies the lower equivalence bound for the mean difference or mean ratio, in the original scale (whether DIST=NORMAL or DIST=LOGNORMAL). Values must be greater than 0 when DIST=LOGNORMAL. This option can be used only with the TEST=EQUIV_DIFF and TEST=EQUIV_RATIO analyses.","help":"LOWER=*number-list*","type":"value"},{"name":"MEANDIFF=","optional":true,"description":"specifies the mean difference, defined as μ2 - μ1, or requests a solution for the mean difference with a missing value (MEANDIFF=.). This option can be used only with the TEST=DIFF, TEST=DIFF_SATT, and TEST=EQUIV_DIFF analyses. When TEST=EQUIV_DIFF, the mean difference is interpreted as the treatment mean minus the reference mean.","help":"MEANDIFF=*number-list*","type":"value"},{"name":"MEANRATIO=","optional":true,"description":"Specifies the geometric mean ratio, defined as γ2/γ1. This option can be used only with the TEST=RATIO and TEST=EQUIV_RATIO analyses. When TEST=EQUIV_RATIO, the mean ratio is interpreted as the treatment mean divided by the reference mean.","help":"MEANRATIO=*number-list*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NPERGROUP=","optional":true,"aliases":["NPERG="],"description":"Specifies the common sample size per group or requests a solution for the common sample size per group with a missing value (NPERGROUP==.). Use of this option implicitly specifies a balanced design.","help":"NPERGROUP=*number-list*","type":"value"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"NULLDIFF=","optional":true,"aliases":["NULLD="],"description":"Specifies the null mean difference. The default value is 0. This option can be used only with the TEST=DIFF and TEST=DIFF_SATT analyses.","help":"NULLDIFF=*number-list*","type":"value"},{"name":"NULLRATIO=","optional":true,"aliases":["NULLR="],"description":"Specifies the null mean ratio. The default value is 1. This option can be used only with the TEST=RATIO analysis.","help":"NULLRATIO=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES= NULLDIFF= NULLRATIO= LOWER= UPPER= ALPHA= GROUPMEANS= MEANDIFF= MEANRATIO= HALFWIDTH= STDDEV= GROUPSTDDEVS= CV= GROUPWEIGHTS= NTOTAL= NPERGROUP= GROUPNS= POWER= PROBTYPE= PROBWIDTH=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the TWOSAMPLEMEANS statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the TWOSAMPLEMEANS statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage. This option cannot be used with the CI=DIFF analysis.","help":"POWER=*number-list*","type":"value"},{"name":"PROBTYPE=","optional":true,"description":"Specifies the type of probability for the PROBWIDTH= option.","help":"PROBTYPE=CONDITIONAL | UNCONDITIONAL","type":"choice","arguments":[{"name":"CONDITIONAL","aliases":["GIVENVALIDITY"],"description":"Indicates the conditional probability that the confidence interval half-width is at most the value specified by the HALFWIDTH= option, given that the true mean difference is captured by the confidence interval.","type":"standalone"},{"name":"UNCONDITIONAL","description":"Indicates the unconditional probability that the confidence interval half-width is at most the value specified by the HALFWIDTH= option.","type":"standalone"}]},{"name":"PROBWIDTH=","optional":true,"description":"Specifies the desired probability of obtaining a confidence interval half-width less than or equal to the value specified by the HALFWIDTH= option. A missing value (PROBWIDTH=.) requests a solution for this probability. The type of probability is controlled with the PROBTYPE= option. Values are expressed as probabilities (for example, 0.9) rather than percentages. This option can be used only with the CI=DIFF analysis.","help":"PROBWIDTH=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"STDDEV=","optional":true,"aliases":["STD="],"description":"Specifies the standard deviation assumed to be common to both groups, or requests a solution for the common standard deviation with a missing value (STDDEV=.). This option can be used only with DIST=NORMAL.","help":"STDDEV=*number-list*","type":"value"},{"name":"TEST=","optional":true,"description":"Specifies the statistical analysis. If neither the TEST= option nor the CI= option is used, the default is TEST=DIFF.","help":"TEST=DIFF | EQUIV_DIFF | EQUIV_RATIO | RATIO","type":"choice","arguments":[{"name":"DIFF","description":"Specifies a paired t test on the mean difference. This is the default.","type":"standalone"},{"name":"EQUIV_DIFF","description":"Specifies an additive equivalence test of the mean difference by using a two one-sided tests (TOST) analysis (Schuirmann 1987).","type":"standalone"},{"name":"EQUIV_RATIO","description":"Specifies a multiplicative equivalence test of the mean ratio by using a TOST analysis.","type":"standalone"},{"name":"RATIO","description":"Specifies a paired t test on the geometric mean ratio.","type":"standalone"}]},{"name":"UPPER=","optional":true,"description":"Specifies the upper equivalence bound for the mean difference or mean ratio, in the original scale (whether DIST=NORMAL or DIST=LOGNORMAL). This option can be used only with the TEST=EQUIV_DIFF and TEST=EQUIV_RATIO analyses.","help":"UPPER=*number-list*","type":"value"}]},{"name":"TWOSAMPLESURVIVAL","description":"The TWOSAMPLESURVIVAL statement performs power and sample size analyses for comparing two survival curves. The log-rank, Gehan, and Tarone-Ware rank tests are supported.","help":"TWOSAMPLESURVIVAL &lt;ACCRUALRATEPERGROUP=number-list&gt; &lt;ACCRUALRATETOTAL=number-list&gt; &lt;ACCRUALTIME=&lt;&lt;number-list&gt; | MAX&gt;&gt; ...","arguments":[{"name":"ACCRUALRATEPERGROUP=","optional":true,"aliases":["ACCRUALRATEPERG=","ARPERGROUP=","ARPERG="],"description":"Specifies the common accrual rate per group or requests a solution for the common accrual rate per group with a missing value (ACCRUALRATEPERGROUP=.). The accrual rate per group is the number of subjects in each group that enters the study per time unit during the accrual period. Use of this option implicitly specifies a balanced design. The NFRACTIONAL option is automatically enabled when the ACCRUALRATEPERGROUP= option is used.","help":"ACCRUALRATEPERGROUP=*number-list*","type":"value"},{"name":"ACCRUALRATETOTAL=","optional":true,"aliases":["ARTOTAL="],"description":"Specifies the total accrual rate or requests a solution for the accrual rate with a missing value (ACCRUALRATETOTAL=.). The total accrual rate is the total number of subjects that enter the study per time unit during the accrual period. The NFRACTIONAL option is automatically enabled when the ACCRUALRATETOTAL= option is used.","help":"ACCRUALRATETOTAL=*number-list*","type":"value"},{"name":"ACCRUALTIME=","optional":true,"aliases":["ACCTIME=","ACCRUALT=","ACCT="],"description":"Specifies the accrual time. Accrual is assumed to occur uniformly from time 0 to the time specified by the ACCRUALTIME= option. If the GROUPSURVIVAL= or REFSURVIVAL= option is used, then the value of the total time (the sum of accrual and follow-up times) must be less than or equal to the largest time in each multipoint (piecewise linear) survival curve. If the ACCRUALRATEPERGROUP=, ACCRUALRATETOTAL=, or GROUPACCRUALRATES= option is used, then the accrual time must be greater than 0.","help":"ACCRUALTIME=&lt;*number-list*&gt; | MAX","type":"choice","arguments":[{"name":"number-list","placeholder":true,"description":"Replace <number-list> with an actual accrual time list.","type":"value"},{"name":"MAX","description":"Can be used when each scenario in the analysis contains at least one piecewise linear survival curve (in the GROUPSURVIVAL= or REFSURVIVAL= option). It causes the accrual time to be automatically set, separately for each scenario, to the maximum possible time supported by the piecewise linear survival curve(s) in that scenario. It is not compatible with the FOLLOWUPTIME=MAX option or the TOTALTIME= option.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"CURVE=","optional":true,"description":"Defines a survival curve. For the CURVE= option, label identifies the curve in the output and with the GROUPLOSS=, GROUPSURVIVAL=, and REFSURVIVAL= options.","type":"value"},{"name":"EVENTSTOTAL=","optional":true,"aliases":["EVENTTOTAL=","EETOTAL="],"description":"Specifies the expected total number of events—that is, deaths, whether observed or censored—during the entire study period, or requests a solution for this parameter with a missing value (EVENTSTOTAL=.). The NFRACTIONAL option is automatically enabled when the EVENTSTOTAL= option is used.","help":"EVENTSTOTAL=*number-list*","type":"value"},{"name":"FOLLOWUPTIME=","optional":true,"aliases":["FUTIME=","FOLLOWUPT=","FUT="],"description":"Specifies the follow-up time, the amount of time in the study past the accrual time. If the GROUPSURVIVAL= or REFSURVIVAL= option is used, then the value of the total time (the sum of accrual and follow-up times) must be less than or equal to the largest time in each multipoint (piecewise linear) survival curve.","help":"FOLLOWUPTIME=&lt;*number-list*&gt; | MAX","type":"choice","arguments":[{"name":"number-list","placeholder":true,"description":"Replace <number-list> with an actual follow-up time list.","type":"value"},{"name":"MAX","description":"Can be used when each scenario in the analysis contains at least one piecewise linear survival curve (in the GROUPSURVIVAL= or REFSURVIVAL= option). It causes the follow-up time to be automatically set, separately for each scenario, to the maximum possible time supported by the piecewise linear survival curve(s) in that scenario. It is not compatible with the ACCRUALTIME=MAX option or the TOTALTIME= option.","type":"standalone"}]},{"name":"GROUPACCRUALRATES=","optional":true,"aliases":["GACCRUALRATES=","GROUPARS=","GARS="],"description":"Specifies the accrual rate for each group. The groupwise accrual rates are the numbers of subjects in each group that enters the study per time unit during the accrual period. The NFRACTIONAL option is automatically enabled when the GROUPACCRUALRATES= option is used.","help":"GROUPACCRUALRATES=*grouped-number-list*","type":"value"},{"name":"GROUPEVENTS=","optional":true,"aliases":["GEVENTS=","GROUPEES=","GEES="],"description":"Specifies the expected number of events in each group—that is, deaths, whether observed or censored—during the entire study period. The NFRACTIONAL option is automatically enabled when the GROUPEVENTS= option is used.","help":"GROUPEVENTS=*grouped-number-list*","type":"value"},{"name":"GROUPLOSS=","optional":true,"aliases":["GLOSS="],"description":"Specifies the exponential loss survival curve for each group, by using labels specified with the CURVE= option. Loss is assumed to follow an exponential curve, indicating the expected rate of censoring (in other words, loss to follow-up) over time.","help":"GROUPLOSS=*grouped-name-list*","type":"value"},{"name":"GROUPMEDLOSSTIMES=","optional":true,"aliases":["GMEDLOSSTIMES=","GROUPMEDLOSSTS=","GMEDLOSSTS="],"description":"Specifies the median times of the loss in each group. Loss is assumed to follow an exponential curve, indicating the expected rate of censoring (in other words, loss to follow-up) over time.","help":"GROUPMEDLOSSTIMES=*grouped-number-list*","type":"value"},{"name":"GROUPMEDSURVTIMES=","optional":true,"aliases":["GMEDSURVTIMES=","GROUPMEDSURVTS=","GMEDSURVTS="],"description":"Specifies the median survival times in each group. When the GROUPMEDSURVTIMES= option is used, the survival curve in each group is assumed to be exponential.","help":"GROUPMEDSURVTIMES=*grouped-number-list*","type":"value"},{"name":"GROUPNS=","optional":true,"aliases":["GNS="],"description":"Specifies the two group sample sizes.","help":"GROUPNS=*grouped-number-list*","type":"value"},{"name":"GROUPSURVEXPHAZARDS=","optional":true,"aliases":["GSURVEXPHAZARDS=","GROUPSURVEXPHS=","GEXPHS="],"description":"Specifies exponential hazard rates of the survival curve for each group.","help":"GROUPSURVEXPHAZARDS=*grouped-number-list*","type":"value"},{"name":"GROUPSURVIVAL=","optional":true,"aliases":["GSURVIVAL=","GROUPSURV=","GSURV="],"description":"Specifies the survival curve for each group, by using labels specified with the CURVE= option.","help":"GROUPSURVIVAL=*grouped-name-list*","type":"value"},{"name":"GROUPWEIGHTS=","optional":true,"aliases":["GWEIGHTS="],"description":"Specifies the sample size allocation weights for the two groups. This option controls how the total sample size is divided between the two groups. Each pair of values for the two groups represents relative allocation weights. Additionally, if the NFRACTIONAL option is not used, the total sample size is restricted to be equal to a multiple of the sum of the 'two group weights (so that the resulting design has an integer sample size for each group while adhering exactly to the group allocation weights). Values must be integers unless the NFRACTIONAL option is used. The default value is (1 1), a balanced design with a weight of 1 for each group.","help":"GROUPWEIGHTS=*grouped-number-list*","type":"value"},{"name":"HAZARDRATIO=","optional":true,"aliases":["HR="],"description":"Specifies the hazard ratio of the second group's survival curve to the first group's survival curve.","help":"HAZARDRATIO=*number-lis*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes. This option is automatically enabled when any of the following options are used: ACCRUALRATEPERGROUP=, ACCRUALRATETOTAL=, EVENTSPERGROUP=, EVENTSTOTAL=, GROUPACCRUALRATES=, and GROUPEVENTS=.","type":"standalone"},{"name":"NPERGROUP=","optional":true,"aliases":["NPERG="],"description":"Specifies the common sample size per group or requests a solution for the common sample size per group with a missing value (NPERGROUP==.). Use of this option implicitly specifies a balanced design.","help":"NPERGROUP=*number-list*","type":"value"},{"name":"NSUBINTERVAL=","optional":true,"aliases":["NSUBINTERVALS=","NSUB=","NSUBS="],"description":"Specifies the number of subintervals per unit time to use in internal calculations. Higher values increase computational time and memory requirements but generally lead to more accurate results. The default value is 12.","help":"NSUBINTERVAL=*number-list*","type":"value"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES= ACCRUALTIME= FOLLOWUPTIME= TOTALTIME= NSUBINTERVAL= ALPHA= REFSURVIVAL= GROUPSURVIVAL= REFSURVEXPHAZARD= HAZARDRATIO= GROUPSURVEXPHAZARDS= GROUPMEDSURVTIMES= GROUPLOSSEXPHAZARDS= GROUPLOSS= GROUPMEDLOSSTIMES= GROUPWEIGHTS= NTOTAL= ACCRUALRATETOTAL= EVENTSTOTAL= NPERGROUP= ACCRUALRATEPERGROUP= EVENTSPERGROUP= GROUPNS= GROUPACCRUALRATES= GROUPEVENTS= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the TWOSAMPLESURVIVAL statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the TWOSAMPLESURVIVAL statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage. This option cannot be used with the CI=DIFF analysis.","help":"POWER=*number-list*","type":"value"},{"name":"REFSURVEXPHAZARD=","optional":true,"aliases":["REFSURVEXPH="],"description":"Specifies the exponential hazard rate of the survival curve for the first (reference) group.","help":"REFSURVEXPHAZARD=*number-list*","type":"value"},{"name":"REFSURVIVAL=","optional":true,"description":"Specifies the survival curve for the first (reference) group, by using labels specified with the CURVE= option.","help":"REFSURVIVAL=*name-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"TEST=","optional":true,"description":"Specifies the statistical analysis.","help":"TEST=GEHAN | LOGRANK | TARONEWARE","type":"choice","arguments":[{"name":"GEHAN","description":"Specifies the Gehan rank test.","type":"standalone"},{"name":"LOGRANK","description":"Specifies the log-rank test. This is the default.","type":"standalone"},{"name":"TARONEWARE","description":"Specifies the Tarone-Ware rank test.","type":"standalone"}]},{"name":"TOTALTIME=","optional":true,"aliases":["TOTALT="],"description":"Specifies the total time, which is equal to the sum of accrual and follow-up times. If the GROUPSURVIVAL= or REFSURVIVAL= option is used, then the value of the total time must be less than or equal to the largest time in each multipoint (piecewise linear) survival curve.","help":"TOTALTIME=&lt;*number-list*&gt; | MAX","type":"choice","arguments":[{"name":"number-list","placeholder":true,"description":"Replace <number-list> with an actual total time list.","type":"value"},{"name":"MAX","description":"Can be used when each scenario in the analysis contains at least one piecewise linear survival curve (in the GROUPSURVIVAL= or REFSURVIVAL= option). It causes the total time to be automatically set, separately for each scenario, to the maximum possible time supported by the piecewise linear survival curve(s) in that scenario. It is not compatible with the ACCRUALTIME=MAX option or the FOLLOWUPTIME=MAX option.","type":"standalone"}]}]},{"name":"TWOSAMPLEWILCOXON","description":"The TWOSAMPLEWILCOXON statement performs power and sample size analyses for the Wilcoxon-Mann-Whitney test (also called the Wilcoxon rank-sum test, Mann-Whitney-Wilcoxon test, or Mann-Whitney U test) for two independent groups. Note that the O'Brien-Castelloe approach to computing power for the Wilcoxon test is approximate, based on asymptotic behavior as the total sample size gets large. The quality of the power approximation degrades for small sample sizes; conversely, the quality of the sample size approximation degrades if the two distributions are far apart, so that only a small sample is needed to detect a significant difference. But this degradation is rarely a problem in practical situations, in which experiments are usually performed for relatively close distributions.","help":"TWOSAMPLEWILCOXON &lt;ALPHA=number-list&gt; &lt;GROUPNS=grouped-number-list&gt; &lt;GROUPWEIGHTS=grouped-number-list&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the level of significance of the statistical test. The default is 0.05, corresponding to the usual 0.05 x 100% = 5% level of significance.","help":"ALPHA=*number-list*","type":"value"},{"name":"GROUPNS=","optional":true,"aliases":["GNS="],"description":"Specifies the two group sample sizes.","help":"GROUPNS=*grouped-number-list*","type":"value"},{"name":"GROUPWEIGHTS=","optional":true,"aliases":["GWEIGHTS="],"description":"Specifies the sample size allocation weights for the two groups. This option controls how the total sample size is divided between the two groups. Each set of values across all groups represents relative allocation weights.","help":"GROUPWEIGHTS=*grouped-number-list*","type":"value"},{"name":"NBINS=","optional":true,"description":"Specifies the number of categories (or \"bins\") each variable's distribution is divided into (unless it is ordinal, in which case the categories remain intact) in internal calculations. Higher values increase computational time and memory requirements but generally lead to more accurate results. However, if the value is too high, then numerical instability can occur. The default value is 1000.","help":"NBINS=*number-list*","type":"value"},{"name":"NFRACTIONAL","optional":true,"aliases":["NFRAC"],"description":"Enables fractional input and output for sample sizes.","type":"standalone"},{"name":"NPERGROUP=","optional":true,"aliases":["NPERG="],"description":"Specifies the common sample size per group or requests a solution for the common sample size per group with a missing value (NPERGROUP==.). Use of this option implicitly specifies a balanced design.","help":"NPERGROUP=*number-list*","type":"value"},{"name":"NTOTAL=","optional":true,"description":"Specifies the sample size or requests a solution for the sample size with a missing value (NTOTAL=.).","help":"NTOTAL=*number-list*","type":"value"},{"name":"OUTPUTORDER=","optional":true,"description":"Controls how the input and default analysis parameters are ordered in the output. OUTPUTORDER=INTERNAL is the default.","help":"OUTPUTORDER=INTERNAL | REVERSE | SYNTAX","type":"choice","arguments":[{"name":"INTERNAL","description":"Arranges the parameters in the output according to the following order of their corresponding options: SIDES NBINS= ALPHA= VARIABLES= GROUPWEIGHTS= NTOTAL= NPERGROUP= GROUPNS= POWER=","type":"standalone"},{"name":"REVERSE","description":"Arranges the parameters in the output in the reverse of the order in which their corresponding options are specified in the TWOSAMPLEWILCOXON statement.","type":"standalone"},{"name":"SYNTAX","description":"Arranges the parameters in the output in the same order in which their corresponding options are specified in the TWOSAMPLEWILCOXON statement.","type":"standalone"}]},{"name":"POWER=","optional":true,"description":"Specifies the desired power of the test or requests a solution for the power with a missing value (POWER=.). The power is expressed as a probability, a number between 0 and 1, rather than as a percentage. This option can be used only with the TEST=T and TEST=EQUIV analyses.","help":"POWER=*number-list*","type":"value"},{"name":"SIDES=","optional":true,"description":"Specifies the number of sides (or tails) and the direction of the statistical test or confidence interval. The default value is 2.","help":"SIDES=1 | 2 | U | L","type":"choice","arguments":[{"name":"1","description":"One-sided with alternative hypothesis in same direction as effect","type":"standalone"},{"name":"2","description":"Two-sided","type":"standalone"},{"name":"U","description":"Upper one-sided with alternative greater than null value","type":"standalone"},{"name":"L","description":"Lower one-sided with alternative less than null value","type":"standalone"}]},{"name":"TEST=","optional":true,"description":"Specifies the Wilcoxon-Mann-Whitney test for two independent groups. This is the default test option.","help":"TEST=WMW","type":"choice","arguments":[{"name":"WMW","description":"Specifies the Wilcoxon-Mann-Whitney test for two independent groups.","type":"standalone"}]},{"name":"VARDIST=","optional":true,"description":"Defines a distribution for a variable, where label identifies the variable distribution in the output and with the VARIABLES= option. distribution specifies the distributional form of the variable.","help":"VARDIST=ORDINAL | BETA | BINOMIAL | EXPONENTIAL | GAMMA | LAPLACE | LOGISTIC | LOGNORMAL | NORMAL | POISSON | UNIFORM","type":"choice","arguments":[{"name":"ORDINAL","description":"Syntax: ORDINAL((values) : (probabilities)) Is an ordered categorical distribution. The values are any numbers separated by spaces. The probabilities are numbers between 0 and 1 (inclusive) separated by spaces. Their sum must be exactly 1. The number of probabilities must match the number of values.","type":"standalone"},{"name":"BETA","description":"Syntax: BETA (a, b <, l, r >) Is a beta distribution with shape parameters a and b and optional location parameters l and r. The values of a and b must be greater than 0, and l must be less than r. The default values for l and r are 0 and 1, respectively.","type":"standalone"},{"name":"BINOMIAL","description":"Syntax: BINOMIAL(p, n) Is a binomial distribution with probability of success p and number of independent Bernoulli trials n. The value of p must be greater than 0 and less than 1, and n must be an integer greater than 0.","type":"standalone"},{"name":"EXPONENTIAL","description":"Syntax: EXPONENTIAL(λ) Is an exponential distribution with scale λ, which must be greater than 0.","type":"standalone"},{"name":"GAMMA","description":"Syntax: GAMMA (α, λ) is a gamma distribution with shape α and scale λ. The values of a and λ must be greater than 0.","type":"standalone"},{"name":"LAPLACE","description":"Syntax: LAPLACE(θ, λ) Is a Laplace distribution with location θ and scale λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"LOGISTIC","description":"Syntax: LOGISTIC(θ, λ) Is a logistic distribution with location θ and scale λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"LOGNORMAL","description":"Syntax: LOGNORMAL(θ, λ) Is a lognormal distribution with location θ and scale λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"NORMAL","description":"Syntax: NORMAL(θ, λ) Is a normal distribution with mean θ and standard deviation λ. The value of λ must be greater than 0.","type":"standalone"},{"name":"POISSON","description":"Syntax: POISSON(m) Is a Poisson distribution with mean m. The value of m must be greater than 0.","type":"standalone"},{"name":"UNIFORM","description":"Syntax: UNIFORM(l, r) Is a uniform distribution on the interval [l,r], where l < r.","type":"standalone"}]},{"name":"VARIABLES=","optional":true,"aliases":["VARS="],"description":"Specifies the distributions of two or more variables, using labels specified with the VARDIST= option.","help":"VARIABLES=*grouped-name-list*","type":"value"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_018","docsetTargetFile":"statug_power_toc.htm"}}