{"name":"PRINCOMP","statements":[{"name":"PROC PRINCOMP","description":"The PRINCOMP procedure performs principal component analysis. As input you can use raw data, a correlation matrix, a covariance matrix, or a sum-of-squares-and-crossproducts (SSCP) matrix. You can create output data sets containing eigenvalues, eigenvectors, and standardized or unstandardized principal component scores. † Principal component analysis is a multivariate technique for examining relationships among several quantitative variables. The choice between using factor analysis and using principal component analysis depends in part on your research objectives. You should use the PRINCOMP procedure if you are interested in summarizing data and detecting linear relationships. You can use principal components to reduce the number of variables in regression, clustering, and so on.","help":"PROC PRINCOMP <COVARIANCE> <DATA=SAS-data-set> <N=number> <NOINT> <NOPRINT> <OUT=SAS-data-set> <OUTSTAT=SAS-data-set> <PARPREFIX=name> <PLOTS=ALL | EIGEN|EIGENVALUE|SCREE | MATRIX... > <PREFIX=name> <SINGULAR=p> <STANDARD> <VARDEF=DF | N | WEIGHT|WGT... >;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tFREQ variable ;     \n\tID variables ;     \n\tPARTIAL variables ; \n   \n\tVAR variables ;     \n\tWEIGHT variable; ","arguments":[{"name":"COVARIANCE","optional":true,"aliases":["COV"],"description":"Computes the principal components from the covariance matrix. If you omit the COV option, the correlation matrix is analyzed.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be analyzed.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"N=","optional":true,"description":"Specifies the number of principal components to be computed. The default is the number of variables. The value of the N= option must be an integer greater than or equal to zero.","help":"N=*number*","type":"value"},{"name":"NOINT","optional":true,"description":"Omits the intercept from the model. In other words, the NOINT option requests that the covariance or correlation matrix not be corrected for the mean.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set that contains all the original data as well as the principal component scores.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Creates an output SAS data set that contains means, standard deviations, number of observations, correlations or covariances, eigenvalues, and eigenvectors.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PARPREFIX=","optional":true,"aliases":["PPREFIX="],"description":"Specifies a prefix for naming the residual variables in the OUT= data set and the OUTSTAT= data set. By default, the prefix is R_.","help":"PARPREFIX=*name*","type":"value"},{"name":"PLOTS=","optional":true,"description":"Controls the plots produced through ODS Graphics. Syntax: (1) PLOTS <(global-plot-options)> <= plot-request <(options)>> (2) PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> The global plot options include the following: FLIP flips or interchanges the X-axis and Y-axis dimension for the component score plots and the component pattern plots. NCOMP=n specifies the number of components n to be plotted for the component pattern plots and the component score plots. ONLY suppresses the default plots. Only plots specifically requested are displayed.","help":"PLOTS=ALL | EIGEN | MATRIX | NONE | PATTERN | PATTERNPROFILE | SCORE","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"EIGEN","aliases":["EIGENVALUE","SCREE"],"description":"Produces the scree plot of eigenvalues and proportion variance explained.","type":"standalone"},{"name":"MATRIX","description":"Produces the matrix plot of principal component scores.","type":"standalone"},{"name":"NONE","description":"Suppresses the display of all graphics output.","type":"standalone"},{"name":"PATTERN","description":"Produces the pairwise component pattern plots. The available pattern-options are as follows: CIRCLES<= number list> plots the variance percentage circles. FLIP flips or interchanges the X-axis and Y-axis dimensions for the component pattern plots. NCOMP=n specifies the number of components n( ≥ 2) to be plotted. VECTOR plots pattern in a vector form.","type":"standalone"},{"name":"PATTERNPROFILE","aliases":["PROFILE"],"description":"Produces the pattern profile plot. There is a profile for each component.","type":"standalone"},{"name":"SCORE","description":"Produces the pairwise component score plots. The available score-options are as follows: ALPHA=number list specifies a list of numbers for the prediction ellipses to be displayed in the score plots. ELLIPSE requests prediction ellipses for the principal component scores of a new observation to be created in the principal component score plots. FLIP flips or interchanges the X-axis and Y-axis dimensions for the component score plots. NCOMP=n specifies the number of components n( ≥ 2) to be plotted.","type":"standalone"}]},{"name":"PREFIX=","optional":true,"description":"Specifies a prefix for naming the principal components. By default, the names are Prin1, Prin2, ..., Prinn. If you specify PREFIX=ABC, the components are named ABC1, ABC2, ABC3, and so on. The number of characters in the prefix plus the number of digits required to designate the variables should not exceed the current name length defined by the VALIDVARNAME= system option.","help":"PREFIX=*name*","type":"value"},{"name":"SINGULAR=","optional":true,"aliases":["SING="],"description":"Specifies the singularity criterion, where 0 < p < 1.","help":"SINGULAR=*p*","type":"value"},{"name":"STANDARD","optional":true,"aliases":["STD"],"description":"Standardizes the principal component scores in the OUT= data set to unit variance.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the divisor used in calculating variances and standard deviations.","help":"VARDEF=DF | N | WEIGHT | WDF","type":"choice","arguments":[{"name":"DF","description":"Error degrees of freedom","type":"standalone"},{"name":"N","description":"Number of observations","type":"standalone"},{"name":"WEIGHT","aliases":["WGT"],"description":"Sum of weights","type":"standalone"},{"name":"WDF","description":"Sum of weights minus one","type":"standalone"}]}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","description":"The FREQ statement specifies a variable that provides frequencies for each observation in the DATA= data set. Specifically, if n is the value of the FREQ variable for a given observation, then that observation is used n times.","help":"FREQ variable "},{"name":"ID","description":"The ID statement labels observations with values from the first ID variable in the principal component score plot. If one or more ID variables are specified, their values are displayed in tooltips of the component score plot and the matrix plot of component scores.","help":"ID variables "},{"name":"PARTIAL","description":"If you want to analyze a partial correlation or covariance matrix, specify the names of the numeric variablesto be partialed out in the PARTIAL statement.","help":"PARTIAL variables "},{"name":"VAR","description":"The VAR statement lists the numeric variables to be analyzed. If you omit the VAR statement, all numeric variables not specified in other statements are analyzed.","help":"VAR variables "},{"name":"WEIGHT","description":"If you want to use relative weights for each observation in the input data set, place the weights in a variable in the data set and specify the name in a WEIGHT statement. This is often done when the variance associated with each observation is different and the values of the weight variable are proportional to the reciprocals of the variances.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_022","docsetTargetFile":"statug_princomp_toc.htm"}}