{"name":"PROBIT","statements":[{"name":"PROC PROBIT","description":"The PROBIT procedure calculates maximum likelihood estimates of regression parameters and the natural (or threshold) response rate for quantal response data from biological assays or other discrete event data. This includes probit, logit, ordinal logistic, and extreme value (or gompit) regression models. † Probit analysis developed from the need to analyze qualitative (dichotomous or polytomous) dependent variables within the regression framework. Many response variables are binary by nature (yes/no), while others are measured ordinally rather than continuously (degree of severity). Collett (2003) and Agresti (2002), for example, have shown ordinary least squares (OLS) regression to be inadequate when the dependent variable is discrete. Probit or logit analyses are more appropriate in this case.","help":"PROC PROBIT <C=rate> <CVOUT> <DATA=SAS-data-set> <GOUT=graphics-catalog> <HPROB=p> <INEST=SAS-data-set> <INVERSECL> <LACKFIT> <LOG> <LOG10> <NAMELEN=n> <NOPRINT> <OPTC> <ORDER=DATA | FORMATTED | FREQ... > <OUTEST=SAS-data-set> <PLOTS=ALL | CDFPLOT | IPPPLOT... > <XDATA=SAS-data-set>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCDFPLOT <ANNOTATE=SAS-data-set> <CAXIS=color> <VAR=variable> ...; \n   \n\tCLASS variables ;     \n\tEFFECTPLOT BOX CONTOUR FIT ...;     \n\tESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tINSET <CFILL=color> <CFILLH=color> <CFRAME=color> ...; \n   \n\tIPPPLOT <ANNOTATE=SAS-data-set> <CAXIS=color> <VAR=variable> ...; \n   \n\tLPREDPLOT <ANNOTATE=SAS-data-set> <CAXIS=color> <VAR=variable> ...; \n   \n\tLSMEANS <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tLSMESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tMODEL <AGGREGATE=variable-list> <ALPHA=value> <CONVERGE=value> ...; \n   \n\tOUTPUT OUT=SAS-data-set PROB=name STD= ...; \n   \n\tPREDPPLOT <ANNOTATE=SAS-data-set> <CAXIS=color> <VAR=variable> ...; \n   \n\tSLICE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | DUNNETT | NELSON>... > <ALPHA=number> ...; \n   \n\tSTORE <LABEL='label'> ; \n   \n\tTEST <CHISQ> <DDF=value-list> <E> ...; \n   \n\tWEIGHT variable; ","arguments":[{"name":"C=","optional":true,"description":"Sets the natural response rate or to provide the initial estimate of the natural response rate. The natural response rate value must be a number between 0 and 1.","help":"C=*rate*","type":"value"},{"name":"CVOUT","optional":true,"description":"Writes the parameter estimate covariance matrix to the OUTEST= data set.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be used by PROC PROBIT.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"GOUT=","optional":true,"description":"Specifies a graphics catalog in which to save graphics output.","help":"GOUT=*graphics-catalog*","type":"dataSet"},{"name":"HPROB=","optional":true,"description":"Specifies a minimum probability level for the Pearson chi-square to indicate a good fit. The default value is 0.10.","help":"HPROB=*p*","type":"value"},{"name":"INEST=","optional":true,"description":"Specifies an input SAS data set that contains initial estimates for all the parameters in the model.","help":"INEST=*SAS-data-set*","type":"dataSet"},{"name":"INVERSECL","optional":true,"description":"Computes confidence limits for the values of the first continuous independent variable (such as dose) that yield selected response rates.","type":"standalone"},{"name":"LACKFIT","optional":true,"description":"Performs two goodness-of-fit tests (a Pearson chi-square test and a log-likelihood ratio chi-square test) for the fitted model.","type":"standalone"},{"name":"LOG","optional":true,"description":"Analyzes the data by replacing the first continuous independent variable with its natural logarithm.","type":"standalone"},{"name":"LOG10","optional":true,"description":"Specifies an analysis like that of the LN or LOG option, except that the common logarithm (log to the base 10) of the dose value is used rather than the natural logarithm.","type":"standalone"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length of effect names in tables and output data sets to be n-characters, where n is a value between 20 and 200. The default length is 20 characters.","help":"NAMELEN=*n*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output including graphics.","type":"standalone"},{"name":"OPTC","optional":true,"description":"Requests that the natural response rate C be estimated.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the sorting order for the levels of the classification variables specified in the CLASS statement, including the levels of the response variable.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Orders values according to their order in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Orders values by their ascending formatted values. This order depends on your operating environment.","type":"standalone"},{"name":"FREQ","description":"Orders values by descending frequency count so that levels with the most observations are listed first.","type":"standalone"},{"name":"INTERNAL","description":"Orders values by their unformatted values, which yields the same order as PROC SORT. This order depends on your operating environment.","type":"standalone"}]},{"name":"OUTEST=","optional":true,"description":"Specifies a SAS data set to contain the parameter estimates and, if the COVOUT option is specified, their estimated covariances.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"aliases":["PLOT="],"description":"Specifies options that control details of the plots created by ODS Graphics. Syntax: (1) PLOT | PLOTS <=plot-request> (2) PLOT | PLOTS <=(plot-request < ...plot-request > )>","help":"PLOTS=ALL | CDFPLOT | IPPPLOT | LPREDPLOT | NONE | PREDPPLOT","type":"choice","arguments":[{"name":"ALL","description":"Creates all appropriate plots.","type":"standalone"},{"name":"CDFPLOT","description":"Syntax: CDFPLOT<(LEVEL=(character-list))> Requests the plot of predicted cumulative distribution function (CDF) of the multinomial response variable as a function of a single continuous independent variable (dose variable).","type":"standalone"},{"name":"IPPPLOT","description":"Requests the inverse plot of the predicted probability against the first single continuous variable (dose variable) in the MODEL statement for the binomial model.","type":"standalone"},{"name":"LPREDPLOT","description":"Syntax: LPREDPLOT<(LEVEL=(character-list))> Requests the plot of the linear predictor x'b against the first single continuous variable (dose variable) in the MODEL statement for either the binomial model or the multinomial model.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"PREDPPLOT","description":"Syntax: PREDPPLOT<(LEVEL=(character-list))> Requests the plot of the predicted probability against the first single continuous variable (dose variable) in the MODEL statement for both the binomial model and the multinomial model.","type":"standalone"}]},{"name":"XDATA=","optional":true,"description":"Specifies an input SAS data set that contains values for all the independent variables in the MODEL statement and variables in the CLASS statement.","help":"XDATA=*SAS-data-set*","type":"dataSet"}]},{"name":"BY","description":"You can specify a BY statement with PROC PROBIT to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CDFPLOT","description":"The CDFPLOT statement plots the predicted cumulative distribution function (CDF) of the multinomial response variable as a function of a single continuous independent variable (dose variable). You can use this statement only after a multinomial model statement","help":"CDFPLOT &lt;ANNOTATE=SAS-data-set&gt; &lt;CAXIS=color&gt; &lt;VAR=variable&gt; ...","arguments":[{"name":"ANNOTATE=","optional":true,"aliases":["ANNO="],"description":"Specifies an Annotate data set that enables you to add features to the CDF plot. The ANNOTATE= data set you specify in the CDFPLOT statement is used for all plots created by the statement.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"CAXIS=","optional":true,"aliases":["CAXES=","CA="],"description":"Specifies the color used for the axes and tick marks. This option overrides any COLOR= specifications in an AXIS statement. The default is the first color in the device color list.","help":"CAXIS=*color*","type":"color"},{"name":"CFIT=","optional":true,"description":"Specifies the color for the fitted CDF curves. The default is the first color in the device color list.","help":"CFIT=*color*","type":"color"},{"name":"CFRAME=","optional":true,"aliases":["CFR="],"description":"Specifies the color for the area enclosed by the axes and frame. The area is not shaded by default.","help":"CFRAME=*color*","type":"color"},{"name":"CGRID=","optional":true,"description":"Specifies the color for grid lines. The default is the first color in the device color list.","help":"CGRID=*color*","type":"color"},{"name":"CHREF=","optional":true,"aliases":["CH="],"description":"Specifies the color for lines requested by the HREF= option. The default is the first color in the device color list.","help":"CHREF=*color*","type":"color"},{"name":"CLABBOX=","optional":true,"description":"Specifies the color for the area enclosed by the label box for CDF curves. This area is not shaded by default.","help":"CLABBOX=*color*","type":"color"},{"name":"CTEXT=","optional":true,"description":"Specifies the color for tick mark values and axis labels. The default is the color specified for the CTEXT= option in the most recent GOPTIONS statement.","help":"CTEXT=*color*","type":"color"},{"name":"CVREF=","optional":true,"aliases":["CV="],"description":"Specifies the color for lines requested by the VREF= option. The default is the first color in the device color list.","help":"CVREF=*color*","type":"color"},{"name":"DESCRIPTION=","optional":true,"aliases":["DES="],"description":"Specifies a description, up to 40 characters, that appears in the PROC GREPLAY master menu. The default is the variable name.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"FONT=","optional":true,"description":"Specifies a software font for reference line and axis labels. You can also specify fonts for axis labels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the GOPTIONS statement.","help":"FONT=*font*","type":"value"},{"name":"HAXIS=","optional":true,"description":"Specifies tick mark values for the horizontal axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"HEIGHT=","optional":true,"description":"Specifies the height of text used outside framed areas. The default value is 3.846 (in percentage).","help":"HEIGHT=*value*","type":"value"},{"name":"HLOWER=","optional":true,"description":"Specifies the lower limit on the horizontal axis scale. The HLOWER= option specifies value as the lower horizontal axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HLOWER=*value*","type":"value"},{"name":"HOFFSET=","optional":true,"description":"Specifies offset for horizontal axis. The default value is 1.","help":"HOFFSET=*value*","type":"value"},{"name":"HREF","optional":true,"description":"Requests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, a second reference line perpendicular to the vertical axis is drawn that intersects the fit line at the same point as the horizontal axis reference line. If a horizontal axis reference line label is specified, the intersecting vertical axis reference line is labeled with the vertical axis value.","type":"standalone"},{"name":"HREFLABELS=","optional":true,"aliases":["HREFLABEL=","HREFLAB="],"description":"Specifies labels for the lines requested by the HREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"HREFLABPOS=","optional":true,"description":"Specifies the vertical position of the HREFLABELS= labels.","help":"HREFLABPOS=1 | 2 | 3 | 4 | 5 | 6","type":"choice","arguments":[{"name":"1","description":"Top of plot","type":"standalone"},{"name":"2","description":"Staggered from top","type":"standalone"},{"name":"3","description":"Bottom of plot","type":"standalone"},{"name":"4","description":"Staggered from bottom","type":"standalone"},{"name":"5","description":"Alternating from top","type":"standalone"},{"name":"6","description":"Alternating from bottom","type":"standalone"}]},{"name":"HUPPER=","optional":true,"description":"Specifies value as the upper horizontal axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HUPPER=*value*","type":"value"},{"name":"INBORDER","optional":true,"description":"Requests a border around CDF plots.","type":"standalone"},{"name":"LEVEL=","optional":true,"aliases":["ORDINAL="],"description":"Specifies the names of the levels for which CDF curves are requested. Names should be quoted and separated by space. If there is no correct name provided, no CDF curve is plotted.","type":"value"},{"name":"LFIT=","optional":true,"description":"Specifies a line style for fitted curves. By default, fitted curves are drawn by connecting solid lines (linetype = 1).","help":"LFIT=*linetype*","type":"value"},{"name":"LGRID=","optional":true,"description":"Specifies a line style for all grid lines. linetype is between 1 and 46. The default is 35.","help":"LGRID=*linetype*","type":"value"},{"name":"LHREF=","optional":true,"aliases":["LH="],"description":"Specifies the line type for lines requested by the HREF= option. The default is 2, which produces a dashed line.","help":"LHREF=*linetype*","type":"value"},{"name":"LVREF=","optional":true,"aliases":["LV="],"description":"Specifies the line type for lines requested by the VREF= option. The default is 2, which produces a dashed line.","help":"LVREF=*linetype*","type":"value"},{"name":"NAME=","optional":true,"description":"Specifies a name for the plot, up to eight characters, that appears in the PROC GREPLAY master menu. The default value is 'PROBIT'.","help":"NAME='*string*'","type":"value"},{"name":"NOFIT","optional":true,"description":"Suppresses the fitted CDF curves.","type":"standalone"},{"name":"NOFRAME","optional":true,"description":"Suppresses the frame around plotting areas.","type":"standalone"},{"name":"NOGRID","optional":true,"description":"Suppresses grid lines.","type":"standalone"},{"name":"NOHLABEL","optional":true,"description":"Suppresses horizontal labels.","type":"standalone"},{"name":"NOHTICK","optional":true,"description":"Suppresses horizontal tick marks.","type":"standalone"},{"name":"NOTHRESH","optional":true,"description":"Suppresses the threshold line.","type":"standalone"},{"name":"NOVLABEL","optional":true,"description":"Suppresses vertical labels.","type":"standalone"},{"name":"NOVTICK","optional":true,"description":"Suppresses vertical tick marks.","type":"standalone"},{"name":"THRESHLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for the threshold line.","help":"THRESHLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are placed to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are placed to the right of the plot.","type":"standalone"}]},{"name":"VAR=","optional":true,"description":"Specifies a single continuous variable (dose variable) in the independent variable list of the MODEL statement. If a VAR= variable is not specified, the first single continuous variable in the independent variable list of the MODEL statement is used. If such a variable does not exist in the independent variable list of the MODEL statement, an error is reported.","help":"VAR=*variable*","type":"value"},{"name":"VAXIS=","optional":true,"description":"Specifies tick mark values for the vertical axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. This method of specification of tick marks is not valid for logarithmic axes. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"VAXISLABEL=","optional":true,"description":"Specifies a label for the vertical axis.","help":"VAXISLABEL='*string*'","type":"value"},{"name":"VLOWER=","optional":true,"description":"Specifies the lower limit on the vertical axis scale. The VLOWER= option specifies value as the lower vertical axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VLOWER=*value*","type":"value"},{"name":"VREF=","optional":true,"description":"Requests reference lines perpendicular to the vertical axis. If (INTERSECT) is specified, a second reference line perpendicular to the horizontal axis is drawn that intersects the fit line at the same point as the vertical axis reference line. If a vertical axis reference line label is specified, the intersecting horizontal axis reference line is labeled with the horizontal axis value.","help":"VREF=*value-list*","type":"value"},{"name":"VREFLABELS=","optional":true,"aliases":["VREFLABEL=","VREFLAB="],"description":"Specifies labels for the lines requested by the VREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"VREFLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for VREF= lines.","help":"VREFLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are positioned to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are positioned to the right of the plot.","type":"standalone"}]},{"name":"VUPPER=","optional":true,"description":"Specifies the upper limit on the vertical axis scale. The VUPPER= option specifies value as the upper vertical axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VUPPER=*value*","type":"value"},{"name":"WAXIS=","optional":true,"description":"Specifies the line thickness for axes and frame. The default value is 1.","help":"WAXIS=*n*","type":"value"},{"name":"WFIT=","optional":true,"description":"Specifies line thickness for fitted curves. The default value is 1.","help":"WFIT=*n*","type":"value"},{"name":"WGRID=","optional":true,"description":"Specifies line thickness for grids. The default value is 1.","help":"WGRID=*n*","type":"value"},{"name":"WREFL=","optional":true,"description":"Specifies line thickness for reference lines. The default value is 1.","help":"WREFL=*n*","type":"value"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. Classification variables can be either character or numeric. Observations with zero, negative, or missing weights are not used in model estimation.","help":"CLASS variables "},{"name":"EFFECTPLOT","description":"The EFFECTPLOT statement produces a display of the fitted model and provides options for changing and enhancing the displays.","help":"EFFECTPLOT BOX CONTOUR FIT ...","arguments":[{"name":"BOX=","description":"Displays a box plot of continuous response data at each level of a CLASS effect, with predicted values superimposed and connected by a line. This is an alternative to the INTERACTION plot-type.","help":"BOX=PLOTBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"CONTOUR=","description":"Displays a contour plot of predicted values against two continuous covariates.","help":"CONTOUR=PLOTBY= | X= | Y=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"},{"name":"Y=","type":"value"}]},{"name":"FIT=","description":"Displays a curve of predicted values versus a continuous variable.","help":"FIT=PLOTBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"INTERACTION=","description":"Displays a curve of predicted values versus a continuous variable grouped by the levels of a CLASS effect.","help":"INTERACTION=PLOTBY= | SLICEBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"SLICEBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"SLICEFIT=","description":"","help":"SLICEFIT=PLOTBY= | SLICEBY= | X=","type":"choice","arguments":[{"name":"PLOTBY=","type":"value"},{"name":"SLICEBY=","type":"value"},{"name":"X=","type":"value"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the significance level, 0 ≥ value ≥ 1, for producing 100(1-value/2)% prediction and confidence limits. By default, value=0.05.","help":"ALPHA=*value*","type":"value"},{"name":"AT","optional":true,"followsDelimiter":"/","description":"where contopt= MEAN | MIN | MAX | MIDRANGE classopt= ALL | REF varopt= contopts | number-list | classopts | ’class-level’...’class-level’]","type":"standalone"},{"name":"ATLEN=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum length (1 < n < 256) of the levels of the AT variables that are displayed in footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed, and the continuous AT levels are displayed with a BEST format that has a width greater than or equal to 5, which distinguishes each level. Caution:If the levels of your AT variables are not unique when the first n characters are displayed, then the levels are combined in the plots but not in the underlying computations. Also, at most n characters for continuous AT variables are displayed.","help":"ATLEN=*n*","type":"value"},{"name":"ATORDER=","optional":true,"followsDelimiter":"/","description":"Uses the AT values for continuous variables in ascending or descending order as specified. By default, values are used in the order of their first appearance in the AT option.","help":"ATORDER=ASCENDING | DESCENDING","type":"choice","arguments":[{"name":"ASCENDING","followsDelimiter":"/","description":"Uses the AT values for continuous variables in ascending order","type":"standalone"},{"name":"DESCENDING","followsDelimiter":"/","description":"Uses the AT values for continuous variables in descending order","type":"standalone"}]},{"name":"CLI","optional":true,"followsDelimiter":"/","description":"Displays normal (Wald) prediction limits. This option is available only for normal distributions with identity links. If your model is from a Bayesian analysis, then sampling-based intervals are computed.","type":"standalone"},{"name":"CLM","optional":true,"followsDelimiter":"/","description":"Displays confidence limits. These are computed as the normal (Wald) confidence limits for the linear predictor, and if the ILINK option is specified, the limits are also back-transformed by the inverse link function. If your model is from a Bayesian analysis, then sampling-based intervals are computed.","type":"standalone"},{"name":"CLUSTER","optional":true,"followsDelimiter":"/","description":"Modifies the BOX and INTERACTION plot-types by displaying the levels of the SLICEBY= effect in a side-by-side fashion. You can specify percent as a percentage of half the distance between X levels. The percent value must be between 0.1 and 1; the default percent depends on the number of X levels, the number of SLICEBY levels, and the number of PLOTBY levels for INTERACTION plot-types. Default clustering can be removed by specifying the NOCLUSTER option.","type":"standalone"},{"name":"CONNECT","optional":true,"followsDelimiter":"/","description":"Modifies the BOX and INTERACTION plot-types by connecting the predicted values with a line. Default connecting lines can be removed by specifying the NOCONNECT option.","type":"standalone"},{"name":"EXTEND=","optional":true,"followsDelimiter":"/","description":"Extends continuous covariate axes by value x ½range in both directions, where range is the range of the X axis.","help":"EXTEND=DATA | &lt;*value*&gt;","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Displays curves to the range of the data within the appropriate SLICEBY=, PLOTBY=, and AT level.","type":"standalone"},{"name":"value","placeholder":true,"followsDelimiter":"/","description":"Replace <value> with an actual value.","type":"value"}]},{"name":"GRIDSIZE=","optional":true,"followsDelimiter":"/","description":"Specifies the resolution of curves by computing the predicted values at n equally spaced x-values and specifies the resolution of surfaces by computing the predicted values on an nxn grid of points. Default values are n=200 for curves and bands, n=50 for surfaces, and n=2 for lines. If results of a Bayesian or bootstrap analysis are being displayed, then the defaults are n=500000/B, where B is the number of samples, the upper limit is equal to the usual defaults, and the lower limit equal to 20.","help":"GRIDSIZE=*n*","type":"value"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Displays the fit on the scale of the inverse link function. In particular, the results are displayed on the probability scale for logistic regression. By default, a procedure displays the fit on either the link or inverse link scale.","type":"standalone"},{"name":"INDIVIDUAL","optional":true,"followsDelimiter":"/","description":"Displays individual probabilities for polytomous response models with cumulative links on the scale of the inverse link function. This option is not available when the LINK option is specified, and confidence limits are not available with this option.","type":"standalone"},{"name":"LIMITS","optional":true,"followsDelimiter":"/","description":"Invokes the CLI and CLM options.","type":"standalone"},{"name":"LINK","optional":true,"followsDelimiter":"/","description":"Displays the fit on the scale of the link function; that is, the linear predictor. Note that probabilities or observed proportions near 0 and 1 are transformed to . By default, a procedure displays the fit on either the link or inverse link scale.","type":"standalone"},{"name":"MOFF","optional":true,"followsDelimiter":"/","description":"Moves the offset for a Poisson regression model to the response side of the equation. If the ILINK option is also in effect, then the rate is displayed on the Y axis, while the LINK option displays the log of the rate on the Y axis. Without this option, the predicted values are computed and displayed only for the observations.","type":"standalone"},{"name":"NCOLS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of columns in a paneled plot. This option is not available with the BOX plot-type. The default choice of NROWS= and NCOLS= is based on the number of PLOTBY= and AT levels. If there is only one plot being displayed in a panel, then NROWS=1 and NCOLS=1 and the plots are produced as if you specified only the UNPACK option. If only two plots are displayed in a panel, then NROWS=1 and NCOLS=2. For all other cases, a 2x2, 2x3, or 3x3 panel is chosen based on how much of the last panel is used, with ties going to the larger panels. For example, if 14 plots are being created, then this requires either four 2x2 panels with 50% of the last panel filled, three 2x3 panels with 33% of the last panel filled, or two 3x3 panels with 55% of the last panel filled; in this case, the 3x3 panels are chosen.","help":"NCOLS=*n*","type":"value"},{"name":"NOCLI","optional":true,"followsDelimiter":"/","description":"Suppresses the prediction limits.","type":"standalone"},{"name":"NOCLM","optional":true,"followsDelimiter":"/","description":"Suppresses the confidence limits.","type":"standalone"},{"name":"NOLIMITS","optional":true,"followsDelimiter":"/","description":"Invokes the NOCLI and NOCLM options.","type":"standalone"},{"name":"NOOBS","optional":true,"followsDelimiter":"/","description":"Suppresses the display of observations and overrides the specification of the OBS= option.","type":"standalone"},{"name":"NROWS=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of rows in a paneled plot. This option is not available with the BOX plot-type. See the NCOLS= option for more details.","help":"NROWS=*n*","type":"value"},{"name":"OBS=","optional":true,"followsDelimiter":"/","description":"Displays observations on the effect plots. An input data set is required; hence the OBS option is not available with PROC PLM. The OBS option is overridden by the NOOBS option. When the ILINK option is specified with binary response variables, then either the observed proportions or a coded value of the response is displayed. For polytomous response variables, the observed values are overlaid onto the fitted curves unless the LOCATION= option is specified. Whether observations are displayed by default or not depends upon the procedure. If the PLOTBY= option is specified, then the observations displayed on each plot are from the corresponding PLOTBY= level for classification effects; for continuous effects, all observations are displayed on every plot. The following options are available: BYAT -- subsets the observations by AT level and by the PLOTBY= level. CDISPLAY=NONE | OUTLINE | GRADIENT | OUTLINEGRADIENT controls the display of observations on contour plots. CGRADIENT=RESIDUAL | DEPENDENT specifies what the gradient-shading of the observed values on the CONTOUR plot-type represents. DEPTH=depth (you can specify 1 ≤ depth ≤ 100. By default, DEPTH=1) specifies the number of overlapping observations that can be distinguished by adjusting their transparency. DISTANCE displays observations on FIT plot-types with a color-gradient that indicates how far the observation is from the AT and PLOTBY= level. FITATCLASS -- computes fitted values only for class levels that are observed in the data set. FRINGE -- displays observations in a fringe (rug) plot at the bottom of the plot. JITTER<(FACTOR=factor SEED=seed X=x-jitter Y=y-jitter)> -- shifts (jitters) the observations. LABEL<=OBS> -- labels markers with their observation number.","help":"OBS=BYAT | CDISPLAY= | CGRADIENT= | DEPTH= | DISTANCE | FITATCLASS | FRINGE | JITTER | FACTOR= | SEED= | X= | Y= | LABEL | LABEL= | LOCATION=","type":"choice","arguments":[{"name":"BYAT","type":"standalone"},{"name":"CDISPLAY=","type":"value"},{"name":"CGRADIENT=","type":"value"},{"name":"DEPTH=","type":"value"},{"name":"DISTANCE","type":"standalone"},{"name":"FITATCLASS","type":"standalone"},{"name":"FRINGE","type":"standalone"},{"name":"JITTER","type":"standalone"},{"name":"FACTOR=","type":"value"},{"name":"SEED=","type":"value"},{"name":"X=","type":"value"},{"name":"Y=","type":"value"},{"name":"LABEL","type":"standalone"},{"name":"LABEL=","type":"value"},{"name":"LOCATION=","type":"value"}]},{"name":"PLOTBY=","optional":true,"followsDelimiter":"/","description":"Specifies a variable or CLASS effect at whose levels the predicted values are computed and the plots are displayed. You can specify the response variable as the effect for polytomous response models. The panel-type argument specifies the method in which the plots are grouped for the display. The following panel-types are available. COLUMNS specifies that the columns within each panel correspond to different levels of the PLOTBY= effect and hence the rows correspond to different AT levels. PACK specifies that plots be displayed in the panels as they are produced with no control over the placement of the PLOTBY= and AT levels. PANELS | LEVELS specifies that each level of the PLOTBY= effect begin a new panel of plots and the AT levels define the plots within the panels. ROWS specifies that the rows within each panel correspond to different levels of the PLOTBY= effect and hence the columns correspond to different AT levels.","help":"PLOTBY=COLUMNS | PACK | PANELS | LEVELS | ROWS","type":"choice","arguments":[{"name":"COLUMNS","type":"standalone"},{"name":"PACK","type":"standalone"},{"name":"PANELS","type":"standalone"},{"name":"LEVELS","type":"standalone"},{"name":"ROWS","type":"standalone"}]},{"name":"PLOTBYLEN=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum length (1 ≤ n ≤ 256) of the levels of the PLOTBY= variables, which are displayed in footnotes and headers. By default, up to 256 characters of the CLASS levels are displayed.","help":"PLOTBYLEN=*n*","type":"value"},{"name":"POLYBAR","optional":true,"followsDelimiter":"/","description":"Displays polytomous response data as a stacked histogram with bar heights defined by the individual predicted value. Your response variable must be the SLICEBY= variable, and the INDIVIDUAL and ILINK options must be in effect; otherwise, the option is ignored. Confidence limits are ignored.","type":"standalone"},{"name":"PREDLABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a label to be displayed on the Y axis. The default Y axis label is determined by your model. For the CONTOUR plot-type, this option changes the title to \"label for Y.\"","help":"PREDLABEL=*label*","type":"value"},{"name":"SHOWCLEGEND","optional":true,"followsDelimiter":"/","description":"Displays the gradient-legend for the CONTOUR plot-type. This option has no effect when the OBS(CGRADIENT=RESIDUAL) option is also specified.","type":"standalone"},{"name":"SLICEBY=","optional":true,"followsDelimiter":"/","description":"Displays the fitted values at the different levels of the specified variable or CLASS effect.","help":"SLICEBY=NONE | effect&lt;=numeric-list&gt;","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Preventing the INTERACTION plot-type from slicing by a second class covariate. Note that the SLICEBY=NONE option is not available for the SLICEFIT plot-type, since that is the same as the FIT plot-type.","type":"standalone"},{"name":"effect","followsDelimiter":"/","description":"You can specify the response variable as the effect for polytomous response models. Use this option to modify SLICEFIT and INTERACTION plot-types. If you specify a continuous variable as the effect, then you can either specify a numeric-list of values at which to display that variable or, by default, five equally spaced values from the minimum variable value to its maximum are displayed.","help":"effect&lt;=numeric-list&gt;","type":"value"}]},{"name":"SMOOTH","optional":true,"followsDelimiter":"/","description":"Overlays a loess smooth on the FIT plot-type for models that have only one continuous predictor. This option is not available for binary or polytomous response models.","type":"standalone"},{"name":"UNPACK","optional":true,"followsDelimiter":"/","description":"Suppresses paneling. By default, multiple plots can appear in some output panels. Specify UNPACK to display each plot separately.]","type":"standalone"},{"name":"X=","optional":true,"followsDelimiter":"/","description":"Specifies values to display on the X axis. For BOX and INTERACTION plot-types, effect can be a CLASS effect in the MODEL statement. For FIT, SLICEFIT, and CONTOUR plot-types, effect can be any continuous variable in the model.","help":"X=*effect*","type":"value"},{"name":"Y=","optional":true,"followsDelimiter":"/","description":"Specifies values to display on the Y axis for the CONTOUR plot-type. The Y= argument can be any continuous variable in the model.","help":"Y=*args*","type":"value"},{"name":"YRANGE=","optional":true,"followsDelimiter":"/","description":"Displays the predicted values on the Y axis in the range [min,max]. By default, when the Y axis displays predicted probabilities, the entire Y axis, [0,1], is displayed. This option is useful if your predicted probabilities are all contained in some subset of this range. This option is not available with the CONTOUR plot-type.","help":"YRANGE=CLIP | &lt;(&lt;min&gt;&lt;,max&gt;)&gt;","type":"choice","arguments":[{"name":"CLIP","followsDelimiter":"/","description":"Has the same effect as specifying the minimum predicted value as min and the maximum predicted value as max.","type":"standalone"},{"name":"<(<min><,max>)>","followsDelimiter":"/","description":"Replace min and max with actual values.","type":"standalone"}]}]},{"name":"ESTIMATE","description":"The ESTIMATE statement provides a mechanism for obtaining custom hypothesis tests.","help":"ESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the final effect listed in the ESTIMATE statement from the 'Type III Tests of Fixed Effects' table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE&lt;(simoptions)&gt; | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector.","help":"SIMULATE&lt;(simoptions)&gt;","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"BYCATEGORY","optional":true,"aliases":["BYCAT"],"description":"Requests that in models for nominal data (generalized logit models) estimates be reported separately for each category.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L matrix coefficients be displayed.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the estimate.","type":"standalone"},{"name":"GROUP","optional":true,"description":"Sets up random-effect contrasts between different groups when a GROUP= variable appears in the RANDOM statement.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking as documented for the CONTRAST statement.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion.","type":"standalone"},{"name":"SUBJECT","optional":true,"description":"Sets up random-effect contrasts between different subjects when a SUBJECT= variable appears in the RANDOM statement.","type":"standalone"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic.","type":"standalone"}]},{"name":"INSET","description":"The box or table of summary information produced on plots made with the CDFPLOT, IPPPLOT, LPREDPLOT, or PREDPPLOT statement is called an inset. You can use the INSET statement to customize both the information that is printed in the inset in box and the appearance of the inset box. To supply the information that is displayed the inset box, you specify keywords corresponding to the information you want shown.","help":"INSET &lt;CFILL=color&gt; &lt;CFILLH=color&gt; &lt;CFRAME=color&gt; ...","arguments":[{"name":"C","description":"User-input threshold","type":"standalone"},{"name":"CONFIDENCE","description":"Confidence coefficient for all confidence intervals","type":"standalone"},{"name":"DIST","description":"Name of the distribution","type":"standalone"},{"name":"NEVENTS","description":"Number of events","type":"standalone"},{"name":"NOBS","description":"Number of observations","type":"standalone"},{"name":"NRESPLEV","description":"Number of levels of the response variable","type":"standalone"},{"name":"NTRIALS","description":"Number of trials","type":"standalone"},{"name":"OPTC","description":"Estimated natural threshold","type":"standalone"},{"name":"CFILL=","optional":true,"followsDelimiter":"/","description":"Specifies color for filling box.","help":"CFILL=*color*","type":"color"},{"name":"CFILLH=","optional":true,"followsDelimiter":"/","description":"Specifies color for filling box header.","help":"CFILLH=*color*","type":"color"},{"name":"CFRAME=","optional":true,"followsDelimiter":"/","description":"Specifies the color for the frame.","help":"CFRAME=*color*","type":"color"},{"name":"CHEADER=","optional":true,"followsDelimiter":"/","description":"Specifies the color for text in header.","help":"CHEADER=CHEADER=","type":"value"},{"name":"CTEXT=","optional":true,"followsDelimiter":"/","description":"Specifies the color for text.","help":"CTEXT=*color*","type":"color"},{"name":"FONT=","optional":true,"followsDelimiter":"/","description":"Specifies software font for text.","help":"FONT=*font*","type":"value"},{"name":"HEADER=","optional":true,"followsDelimiter":"/","description":"Specifies text for header or box title.","help":"HEADER='*quoted-string*'","type":"value"},{"name":"HEIGHT=","optional":true,"followsDelimiter":"/","description":"Specifies the height of text.","help":"HEIGHT=*value*","type":"value"},{"name":"NOFRAME","optional":true,"followsDelimiter":"/","description":"Suppresses the frame around the box.","type":"standalone"},{"name":"POS=","optional":true,"followsDelimiter":"/","description":"Determines the position of the inset. The value can be a compass point (N, NE, E, SE, S, SW, W, NW) or a pair of coordinates (x, y) enclosed in parentheses. The coordinates can be specified in axis percentage units or axis data units.","type":"value"},{"name":"REFPOINT=","optional":true,"followsDelimiter":"/","description":"Specifies the reference point for an inset that is positioned by a pair of coordinates with the POS= option.","help":"REFPOINT=BR | BL | TR | TL","type":"choice","arguments":[{"name":"BR","followsDelimiter":"/","description":"Bottom right","type":"standalone"},{"name":"BL","followsDelimiter":"/","description":"Bottom left (the default)","type":"standalone"},{"name":"TR","followsDelimiter":"/","description":"Top right","type":"standalone"},{"name":"TL","followsDelimiter":"/","description":"Top left","type":"standalone"}]}]},{"name":"IPPPLOT","description":"The IPPPLOT statement plots the inverse of the predicted probability against a single continuous variable (dose variable) in the MODEL statement for the binomial model. You can only use this statement after a binomial model statement. The confidence limits for the predicted values of the dose variable are the computed fiducial limits, not the inverse of the confidence limits of the predicted probabilities.","help":"IPPPLOT &lt;ANNOTATE=SAS-data-set&gt; &lt;CAXIS=color&gt; &lt;VAR=variable&gt; ...","arguments":[{"name":"ANNOTATE=","optional":true,"aliases":["ANNO="],"description":"Specifies an Annotate data set that enables you to add features to the IPP plot. The ANNOTATE= data set you specify in the IPPPLOT statement is used for all plots created by the statement.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"CAXIS=","optional":true,"aliases":["CAXES=","CA="],"description":"Specifies the color used for the axes and tick marks. This option overrides any COLOR= specifications in an AXIS statement. The default is the first color in the device color list.","help":"CAXIS=*color*","type":"color"},{"name":"CFIT=","optional":true,"description":"Specifies the color for the fitted IPP curves. The default is the first color in the device color list.","help":"CFIT=*color*","type":"color"},{"name":"CFRAME=","optional":true,"aliases":["CFR="],"description":"Specifies the color for the area enclosed by the axes and frame. The area is not shaded by default.","help":"CFRAME=*color*","type":"color"},{"name":"CGRID=","optional":true,"description":"Specifies the color for grid lines. The default is the first color in the device color list.","help":"CGRID=*color*","type":"color"},{"name":"CHREF=","optional":true,"aliases":["CH="],"description":"Specifies the color for lines requested by the HREF= option. The default is the first color in the device color list.","help":"CHREF=*color*","type":"color"},{"name":"CTEXT=","optional":true,"description":"Specifies the color for tick mark values and axis labels. The default is the color specified for the CTEXT= option in the most recent GOPTIONS statement.","help":"CTEXT=*color*","type":"color"},{"name":"CVREF=","optional":true,"aliases":["CV="],"description":"Specifies the color for lines requested by the VREF= option. The default is the first color in the device color list.","help":"CVREF=*color*","type":"color"},{"name":"DESCRIPTION=","optional":true,"aliases":["DES="],"description":"Specifies a description, up to 40 characters, that appears in the PROC GREPLAY master menu. The default is the variable name.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"FONT=","optional":true,"description":"Specifies a software font for reference line and axis labels. You can also specify fonts for axis labels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the GOPTIONS statement.","help":"FONT=*font*","type":"value"},{"name":"HAXIS=","optional":true,"description":"Specifies tick mark values for the horizontal axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"HEIGHT=","optional":true,"description":"Specifies the height of text used outside framed areas. The default value is 3.846 (in percentage).","help":"HEIGHT=*value*","type":"value"},{"name":"HLOWER=","optional":true,"description":"Specifies the lower limit on the horizontal axis scale. The HLOWER= option specifies value as the lower horizontal axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HLOWER=*value*","type":"value"},{"name":"HOFFSET=","optional":true,"description":"Specifies offset for horizontal axis. The default value is 1.","help":"HOFFSET=*value*","type":"value"},{"name":"HREF=","optional":true,"description":"Requests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, a second reference line perpendicular to the vertical axis is drawn that intersects the fit line at the same point as the horizontal axis reference line. If a horizontal axis reference line label is specified, the intersecting vertical axis reference line is labeled with the vertical axis value.","help":"HREF=INTERSECT","type":"choice","arguments":[{"name":"INTERSECT","type":"standalone"}]},{"name":"HREFLABELS=","optional":true,"aliases":["HREFLABEL=","HREFLAB="],"description":"Specifies labels for the lines requested by the HREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"HREFLABPOS=","optional":true,"description":"Specifies the vertical position of the HREFLABELS= labels.","help":"HREFLABPOS=1 | 2 | 3 | 4 | 5 | 6","type":"choice","arguments":[{"name":"1","description":"Top of plot","type":"standalone"},{"name":"2","description":"Staggered from top","type":"standalone"},{"name":"3","description":"Bottom of plot","type":"standalone"},{"name":"4","description":"Staggered from bottom","type":"standalone"},{"name":"5","description":"Alternating from top","type":"standalone"},{"name":"6","description":"Alternating from bottom","type":"standalone"}]},{"name":"HUPPER=","optional":true,"description":"Specifies value as the upper horizontal axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HUPPER=*value*","type":"value"},{"name":"INBORDER","optional":true,"description":"Requests a border around IPP plots.","type":"standalone"},{"name":"LFIT=","optional":true,"description":"Specifies a line style for fitted curves. By default, fitted curves are drawn by connecting solid lines (linetype = 1).","help":"LFIT=*linetype*","type":"value"},{"name":"LGRID=","optional":true,"description":"Specifies a line style for all grid lines. linetype is between 1 and 46. The default is 35.","help":"LGRID=*linetype*","type":"value"},{"name":"LHREF=","optional":true,"aliases":["LH="],"description":"Specifies the line type for lines requested by the HREF= option. The default is 2, which produces a dashed line.","help":"LHREF=*linetype*","type":"value"},{"name":"LVREF=","optional":true,"aliases":["LV="],"description":"Specifies the line type for lines requested by the VREF= option. The default is 2, which produces a dashed line.","help":"LVREF=*linetype*","type":"value"},{"name":"NAME=","optional":true,"description":"Specifies a name for the plot, up to eight characters, that appears in the PROC GREPLAY master menu. The default value is 'PROBIT'.","help":"NAME='*string*'","type":"value"},{"name":"NOFIT","optional":true,"description":"Suppresses the fitted IPP curves.","type":"standalone"},{"name":"NOFRAME","optional":true,"description":"Suppresses the frame around plotting areas.","type":"standalone"},{"name":"NOGRID","optional":true,"description":"Suppresses grid lines.","type":"standalone"},{"name":"NOHLABEL","optional":true,"description":"Suppresses horizontal labels.","type":"standalone"},{"name":"NOHTICK","optional":true,"description":"Suppresses horizontal tick marks.","type":"standalone"},{"name":"NOTHRESH","optional":true,"description":"Suppresses the threshold line.","type":"standalone"},{"name":"NOVLABEL","optional":true,"description":"Suppresses vertical labels.","type":"standalone"},{"name":"NOVTICK","optional":true,"description":"Suppresses vertical tick marks.","type":"standalone"},{"name":"THRESHLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for the threshold line.","help":"THRESHLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are placed to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are placed to the right of the plot.","type":"standalone"}]},{"name":"VAR=","optional":true,"description":"Specifies a single continuous variable (dose variable) in the independent variable list of the MODEL statement. If a VAR= variable is not specified, the first single continuous variable in the independent variable list of the MODEL statement is used. If such a variable does not exist in the independent variable list of the MODEL statement, an error is reported.","help":"VAR=*variable*","type":"value"},{"name":"VAXIS=","optional":true,"description":"Specifies tick mark values for the vertical axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. This method of specification of tick marks is not valid for logarithmic axes. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"VAXISLABEL=","optional":true,"description":"Specifies a label for the vertical axis.","help":"VAXISLABEL='*string*'","type":"value"},{"name":"VLOWER=","optional":true,"description":"Specifies the lower limit on the vertical axis scale. The VLOWER= option specifies value as the lower vertical axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VLOWER=*value*","type":"value"},{"name":"VREF=","optional":true,"description":"Requests reference lines perpendicular to the vertical axis. If (INTERSECT) is specified, a second reference line perpendicular to the horizontal axis is drawn that intersects the fit line at the same point as the vertical axis reference line. If a vertical axis reference line label is specified, the intersecting horizontal axis reference line is labeled with the horizontal axis value.","help":"VREF=*value-list*","type":"value"},{"name":"VREFLABELS=","optional":true,"aliases":["VREFLABEL=","VREFLAB="],"description":"Specifies labels for the lines requested by the VREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"VREFLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for VREF= lines.","help":"VREFLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are positioned to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are positioned to the right of the plot.","type":"standalone"}]},{"name":"VUPPER=","optional":true,"description":"Specifies the upper limit on the vertical axis scale. The VUPPER= option specifies value as the upper vertical axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VUPPER=*value*","type":"value"},{"name":"WAXIS=","optional":true,"description":"Specifies the line thickness for axes and frame. The default value is 1.","help":"WAXIS=*n*","type":"value"},{"name":"WFIT=","optional":true,"description":"Specifies line thickness for fitted curves. The default value is 1.","help":"WFIT=*n*","type":"value"},{"name":"WGRID=","optional":true,"description":"Specifies line thickness for grids. The default value is 1.","help":"WGRID=*n*","type":"value"},{"name":"WREFL=","optional":true,"description":"Specifies line thickness for reference lines. The default value is 1.","help":"WREFL=*n*","type":"value"}]},{"name":"LPREDPLOT","description":"The LPREDPLOT statement plots the linear predictor x'b against a single continuous variable (dose variable) in the MODEL statement for either the binomial model or the multinomial model. The confidence limits for the predicted values are available only for the binomial model.","help":"LPREDPLOT &lt;ANNOTATE=SAS-data-set&gt; &lt;CAXIS=color&gt; &lt;VAR=variable&gt; ...","arguments":[{"name":"ANNOTATE=","optional":true,"aliases":["ANNO="],"description":"Specifies an Annotate data set that enables you to add features to the LPRED plot. The ANNOTATE= data set you specify in the LPREDPLOT statement is used for all plots created by the statement.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"CAXIS=","optional":true,"aliases":["CAXES=","CA="],"description":"Specifies the color used for the axes and tick marks. This option overrides any COLOR= specifications in an AXIS statement. The default is the first color in the device color list.","help":"CAXIS=*color*","type":"color"},{"name":"CFIT=","optional":true,"description":"Specifies the color for the fitted LPRED curves. The default is the first color in the device color list.","help":"CFIT=*color*","type":"color"},{"name":"CFRAME=","optional":true,"aliases":["CFR="],"description":"Specifies the color for the area enclosed by the axes and frame. The area is not shaded by default.","help":"CFRAME=*color*","type":"color"},{"name":"CGRID=","optional":true,"description":"Specifies the color for grid lines. The default is the first color in the device color list.","help":"CGRID=*color*","type":"color"},{"name":"CHREF=","optional":true,"aliases":["CH="],"description":"Specifies the color for lines requested by the HREF= option. The default is the first color in the device color list.","help":"CHREF=*color*","type":"color"},{"name":"CTEXT=","optional":true,"description":"Specifies the color for tick mark values and axis labels. The default is the color specified for the CTEXT= option in the most recent GOPTIONS statement.","help":"CTEXT=*color*","type":"color"},{"name":"CVREF=","optional":true,"aliases":["CV="],"description":"Specifies the color for lines requested by the VREF= option. The default is the first color in the device color list.","help":"CVREF=*color*","type":"color"},{"name":"DESCRIPTION=","optional":true,"aliases":["DES="],"description":"Specifies a description, up to 40 characters, that appears in the PROC GREPLAY master menu. The default is the variable name.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"FONT=","optional":true,"description":"Specifies a software font for reference line and axis labels. You can also specify fonts for axis labels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the GOPTIONS statement.","help":"FONT=*font*","type":"value"},{"name":"HAXIS=","optional":true,"description":"Specifies tick mark values for the horizontal axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"HEIGHT=","optional":true,"description":"Specifies the height of text used outside framed areas. The default value is 3.846 (in percentage).","help":"HEIGHT=*value*","type":"value"},{"name":"HLOWER=","optional":true,"description":"Specifies the lower limit on the horizontal axis scale. The HLOWER= option specifies value as the lower horizontal axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HLOWER=*value*","type":"value"},{"name":"HOFFSET=","optional":true,"description":"Specifies offset for horizontal axis. The default value is 1.","help":"HOFFSET=*value*","type":"value"},{"name":"HREF=","optional":true,"description":"Requests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, a second reference line perpendicular to the vertical axis is drawn that intersects the fit line at the same point as the horizontal axis reference line. If a horizontal axis reference line label is specified, the intersecting vertical axis reference line is labeled with the vertical axis value.","help":"HREF=INTERSECT","type":"choice","arguments":[{"name":"INTERSECT","type":"standalone"}]},{"name":"HREFLABELS=","optional":true,"aliases":["HREFLABEL=","HREFLAB="],"description":"Specifies labels for the lines requested by the HREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"HREFLABPOS=","optional":true,"description":"Specifies the vertical position of the HREFLABELS= labels.","help":"HREFLABPOS=1 | 2 | 3 | 4 | 5 | 6","type":"choice","arguments":[{"name":"1","description":"Top of plot","type":"standalone"},{"name":"2","description":"Staggered from top","type":"standalone"},{"name":"3","description":"Bottom of plot","type":"standalone"},{"name":"4","description":"Staggered from bottom","type":"standalone"},{"name":"5","description":"Alternating from top","type":"standalone"},{"name":"6","description":"Alternating from bottom","type":"standalone"}]},{"name":"HUPPER=","optional":true,"description":"Specifies value as the upper horizontal axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HUPPER=*value*","type":"value"},{"name":"INBORDER","optional":true,"description":"Requests a border around LPRED plots.","type":"standalone"},{"name":"LEVEL=","optional":true,"aliases":["ORDINAL="],"description":"Specifies the names of the levels for which LPRED curves are requested. Names should be quoted and separated by space. If there is no correct name provided, no LPRED curve is plotted.","type":"value"},{"name":"LFIT=","optional":true,"description":"Specifies a line style for fitted curves. By default, fitted curves are drawn by connecting solid lines (linetype = 1).","help":"LFIT=*linetype*","type":"value"},{"name":"LGRID=","optional":true,"description":"Specifies a line style for all grid lines. linetype is between 1 and 46. The default is 35.","help":"LGRID=*linetype*","type":"value"},{"name":"LHREF=","optional":true,"aliases":["LH="],"description":"Specifies the line type for lines requested by the HREF= option. The default is 2, which produces a dashed line.","help":"LHREF=*linetype*","type":"value"},{"name":"LVREF=","optional":true,"aliases":["LV="],"description":"Specifies the line type for lines requested by the VREF= option. The default is 2, which produces a dashed line.","help":"LVREF=*linetype*","type":"value"},{"name":"NAME=","optional":true,"description":"Specifies a name for the plot, up to eight characters, that appears in the PROC GREPLAY master menu. The default value is 'PROBIT'.","help":"NAME='*string*'","type":"value"},{"name":"NOCONF","optional":true,"description":"Suppresses confidence limits from the plot. This works only for the binomial model. Confidence limits are not plotted for the multinomial model.","type":"standalone"},{"name":"NODATA","optional":true,"description":"Suppresses observed data points from the plot. This works only for the binomial model. Data points are not plotted for the multinomial model.","type":"standalone"},{"name":"NOFIT","optional":true,"description":"Suppresses the fitted LPRED curves.","type":"standalone"},{"name":"NOFRAME","optional":true,"description":"Suppresses the frame around plotting areas.","type":"standalone"},{"name":"NOGRID","optional":true,"description":"Suppresses grid lines.","type":"standalone"},{"name":"NOHLABEL","optional":true,"description":"Suppresses horizontal labels.","type":"standalone"},{"name":"NOHTICK","optional":true,"description":"Suppresses horizontal tick marks.","type":"standalone"},{"name":"NOTHRESH","optional":true,"description":"Suppresses the threshold line.","type":"standalone"},{"name":"NOVLABEL","optional":true,"description":"Suppresses vertical labels.","type":"standalone"},{"name":"NOVTICK","optional":true,"description":"Suppresses vertical tick marks.","type":"standalone"},{"name":"THRESHLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for the threshold line.","help":"THRESHLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are placed to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are placed to the right of the plot.","type":"standalone"}]},{"name":"VAR=","optional":true,"description":"Specifies a single continuous variable (dose variable) in the independent variable list of the MODEL statement. If a VAR= variable is not specified, the first single continuous variable in the independent variable list of the MODEL statement is used. If such a variable does not exist in the independent variable list of the MODEL statement, an error is reported.","help":"VAR=*variable*","type":"value"},{"name":"VAXIS=","optional":true,"description":"Specifies tick mark values for the vertical axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. This method of specification of tick marks is not valid for logarithmic axes. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"VAXISLABEL=","optional":true,"description":"Specifies a label for the vertical axis.","help":"VAXISLABEL='*string*'","type":"value"},{"name":"VLOWER=","optional":true,"description":"Specifies the lower limit on the vertical axis scale. The VLOWER= option specifies value as the lower vertical axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VLOWER=*value*","type":"value"},{"name":"VREF=","optional":true,"description":"Requests reference lines perpendicular to the vertical axis. If (INTERSECT) is specified, a second reference line perpendicular to the horizontal axis is drawn that intersects the fit line at the same point as the vertical axis reference line. If a vertical axis reference line label is specified, the intersecting horizontal axis reference line is labeled with the horizontal axis value.","help":"VREF=*value-list*","type":"value"},{"name":"VREFLABELS=","optional":true,"aliases":["VREFLABEL=","VREFLAB="],"description":"Specifies labels for the lines requested by the VREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"VREFLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for VREF= lines.","help":"VREFLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are positioned to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are positioned to the right of the plot.","type":"standalone"}]},{"name":"VUPPER=","optional":true,"description":"Specifies the upper limit on the vertical axis scale. The VUPPER= option specifies value as the upper vertical axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VUPPER=*value*","type":"value"},{"name":"WAXIS=","optional":true,"description":"Specifies the line thickness for axes and frame. The default value is 1.","help":"WAXIS=*n*","type":"value"},{"name":"WFIT=","optional":true,"description":"Specifies line thickness for fitted curves. The default value is 1.","help":"WFIT=*n*","type":"value"},{"name":"WGRID=","optional":true,"description":"Specifies line thickness for grids. The default value is 1.","help":"WGRID=*n*","type":"value"},{"name":"WREFL=","optional":true,"description":"Specifies line thickness for reference lines. The default value is 1.","help":"WREFL=*n*","type":"value"}]},{"name":"LSMEANS","description":"The LSMEANS statement computes least squares means (LS-means) of fixed effects. As in the GLM and the MIXED procedures, LS-means are predicted population margins—that is, they estimate the marginal means over a balanced population. In a sense, LS-means are to unbalanced designs as class and subclass arithmetic means are to balanced designs.","help":"LSMEANS &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. CVADJUST specifies that the quantile should be estimated by the control variate adjustment method of Hsu and Nelson (1998) instead of simply as the quantile of the simulated sample. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. NSAMP=n specifies the sample size for the simulation. REPORT specifies that a report on the simulation should be displayed, including a listing of the parameters, such as γ, ε, and α, as well as an analysis of various methods for estimating or approximating the quantile. SEED=number specifies an integer used to start the pseudo-random number generator for the simulation.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default value is 0.05, corresponding to a 95% confidence interval.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Enables you to modify the values of the covariates used in computing LS-means.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the LSMEANS effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences, and it is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified LSMEANS effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for all LSMEANS effects be displayed.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"OBSMARGINS","optional":true,"followsDelimiter":"/","aliases":["OM"],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients.","type":"standalone"},{"name":"ODDS","optional":true,"followsDelimiter":"/","description":"Requests that in models with logit, cumulative logit, and generalized logit link function the odds of the levels of the fixed effects are reported.","type":"standalone"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) and simple effect comparisons (SLICEDIFF option) are also reported in terms of odds ratios.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the LSMEANS statement.","help":"PLOT=ALL | ANOMPLOT | CONTROLPLOT | DIFFPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this LSMEANS statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Requests displays of the least squares means. Syntax: MEANPLOT<(meanplot-options)> The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking as documented for the CONTRAST statement.","help":"SINGULAR=*number*","type":"value"},{"name":"SLICE=","optional":true,"followsDelimiter":"/","description":"Specifies effects by which to partition interaction LSMEANS effects.","help":"SLICE=*fixed-effect*","type":"value"},{"name":"SLICEDIFF=","optional":true,"followsDelimiter":"/","aliases":["SIMPLEDIFF="],"description":"Requests that differences of simple effects be constructed and tested against zero.","type":"value"},{"name":"SLICEDIFFTYPE=","optional":true,"followsDelimiter":"/","aliases":["SIMPLEDIFFTYPE="],"description":"Determines the type of simple effect differences produced with the SLICEDIFF= option.","help":"SLICEDIFFTYPE=ALL | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all simple effects differences, and it is the default.","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified LSMEANS effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"STEPDOWN","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","type":"standalone"}]},{"name":"LSMESTIMATE","description":"The LSMESTIMATE statement provides a mechanism for obtaining custom hypothesis tests among the least squares means.","help":"LSMESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. CVADJUST specifies that the quantile should be estimated by the control variate adjustment method of Hsu and Nelson (1998) instead of simply as the quantile of the simulated sample. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. NSAMP=n specifies the sample size for the simulation. REPORT specifies that a report on the simulation should be displayed, including a listing of the parameters, such as γ, ε, and α, as well as an analysis of various methods for estimating or approximating the quantile. SEED=number specifies an integer used to start the pseudo-random number generator for the simulation.","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"description":"Enables you to modify the values of the covariates used in computing LS-means.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"description":"Requests that PROC GLIMMIX compute separate margins for each level of the LSMEANS effect.","type":"standalone"},{"name":"CHISQ","optional":true,"description":"Requests that chi-square tests be performed in addition to F tests, when you request an F test with the FTEST option.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed.","type":"standalone"},{"name":"CORR","optional":true,"description":"Displays the estimated correlation matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"COV","optional":true,"description":"Displays the estimated covariance matrix of the linear combination of the least squares means.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L matrix coefficients be displayed.","type":"standalone"},{"name":"ELSM","optional":true,"description":"Requests that the K matrix coefficients be displayed.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the estimate.","type":"standalone"},{"name":"FTEST","optional":true,"description":"Produces an F test that jointly tests the rows of the LSMESTIMATE against zero.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic.","type":"standalone"},{"name":"OBSMARGINS","optional":true,"aliases":["OM"],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking as documented for the CONTRAST statement.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion. You can specify the following step-down-options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. The default is MAXTIME=60. ORDER=PVALUE ORDER=ROWS specifies the order in which the step-down tests are performed. ORDER=PVALUE is the default, with LS-mean estimates being declared significant only if all LS-mean estimates with smaller (unadjusted) p-values are significant. If you specify ORDER=ROWS, then significances are evaluated in the order in which they are specified. REPORT specifies that a report on the step-down adjustment be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","type":"standalone"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic.","type":"standalone"}]},{"name":"MODEL","description":"The MODEL statement names the variables used as the response and the independent variables. Additionally, you can specify the distribution used to model the response, as well as other options. Only a single MODEL statement can be used with one invocation of the PROBIT procedure. If multiple MODEL statements are present, only the last is used. Main effects and interaction terms can be specified in the MODEL statement, as in the GLM procedure. The optional label, which must be a valid SAS name, is used to label output from the matching MODEL statement. The response can be a single variable with a value that is used to indicate the level of the observed response. Alternatively, the response can be specified as a pair of variable names separated by a slash (/). The value of the first variable, events, is the number of positive responses (or events). The value of the second variable, trials, is the number of trials. Both variables must be numeric and nonnegative, and the ratio of the first variable value to the second variable value must be between 0 and 1, inclusive. The effects following the equal sign are the covariates in the model. Higher-order effects, such as interactions and nested terms, are allowed in the list, as in the GLM procedure.","help":"MODEL &lt;AGGREGATE=variable-list&gt; &lt;ALPHA=value&gt; &lt;CONVERGE=value&gt; ...","arguments":[{"name":"AGGREGATE=","optional":true,"followsDelimiter":"/","description":"Specifies the subpopulations on which the Pearson chi-square test statistic and the log-likelihood ratio chi-square test statistic (deviance) are calculated if the LACKFIT option is specified.","help":"AGGREGATE=*variable-list*","type":"value"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Sets the significance level for the confidence intervals for regression parameters, fiducial limits for the predicted values, and confidence intervals for the predicted probabilities. The value must be between 0 and 1. The default value is ALPHA=0.05.","help":"ALPHA=*value*","type":"value"},{"name":"CONVERGE=","optional":true,"followsDelimiter":"/","description":"Sets the convergence criterion. Convergence is declared when the maximum change in the parameter estimates between Newton-Raphson steps is less than the value specified.","help":"CONVERGE=*value*","type":"value"},{"name":"COORB","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the parameter estimates.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the parameter estimates.","type":"standalone"},{"name":"DISTRIBUTION=","optional":true,"followsDelimiter":"/","aliases":["DIST=","D="],"description":"Specifies the cumulative distribution function used to model the response probabilities.","help":"DISTRIBUTION=NORMAL | LOGISTIC | EXTREMEVALUE","type":"choice","arguments":[{"name":"NORMAL","followsDelimiter":"/","description":"Normal distribution for the probit model","type":"standalone"},{"name":"LOGISTIC","followsDelimiter":"/","description":"Logistic distribution for the probit model","type":"standalone"},{"name":"EXTREMEVALUE","followsDelimiter":"/","description":"Extreme value, or Gompertz distribution for the gompit model","type":"standalone"}]},{"name":"HPROB","optional":true,"followsDelimiter":"/","description":"Specifies a minimum probability level for the Pearson chi-square to indicate a good fit.","type":"standalone"},{"name":"INITIAL=","optional":true,"followsDelimiter":"/","description":"Sets initial values for the parameters in the model other than the intercept. The values must be given in the order in which the variables are listed in the MODEL statement.","help":"INITIAL=*values*","type":"value"},{"name":"INTERCEPT=","optional":true,"followsDelimiter":"/","description":"Initializes the intercept parameter to value. By default, INTERCEPT=0.","help":"INTERCEPT=*value*","type":"value"},{"name":"INVERSECL","optional":true,"followsDelimiter":"/","description":"Computes confidence limits for the values of the first continuous independent variable (such as dose) that yield selected response rates.","type":"standalone"},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"Displays the iteration history, the final evaluation of the gradient, and the second derivative matrix (Hessian).","type":"standalone"},{"name":"LACKFIT","optional":true,"followsDelimiter":"/","description":"Performs two goodness-of-fit tests (a Pearson chi-square test and a log-likelihood ratio chi-square test) for the fitted model.","type":"standalone"},{"name":"MAXITER=","optional":true,"followsDelimiter":"/","aliases":["MAXIT="],"description":"Specifies the maximum number of iterations to be performed in estimating the parameters. By default, MAXITER=50.","help":"MAXITER=*value*","type":"value"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Fits a model with no intercept parameter.","type":"standalone"},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Enables you to specify the method for estimating the dispersion parameter. To correct for overdispersion or underdispersion, the covariance matrix is multiplied by the estimate of the dispersion parameter.","help":"SCALE=DEVIANCE | PEARSON","type":"choice","arguments":[{"name":"DEVIANCE","followsDelimiter":"/","description":"Specifies that the dispersion parameter be estimated by the deviance divided by its degrees of freedom.","type":"standalone"},{"name":"PEARSON","followsDelimiter":"/","description":"Specifies that the dispersion parameter be estimated by the Pearson chi-square statistic divided by its degrees of freedom. This is set as the default.","type":"standalone"}]},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Specifies the singularity criterion for determining linear dependencies in the set of independent variables.","help":"SINGULAR=*value*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set containing all variables in the input data set and, optionally, the fitted probabilities, the estimate of x'β, and the estimate of its standard error. keyword=name specifies the statistics to include in the output data set and assigns names to the new variables that contain the statistics. Specify a keyword for each desired statistic, an equal sign, and the variable to contain the statistic.","help":"OUTPUT OUT=SAS-data-set PROB=name STD= ...","arguments":[{"name":"OUT=","description":"Names the output data set. By default, the new data set is named by using the DATAn convention.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PROB=","aliases":["P="],"description":"Cumulative probability estimates","help":"PROB=*name*","type":"value"},{"name":"STD=","description":"[Statistics keyword] Standard error estimates of aj + x'b","type":"value"},{"name":"XBETA=","description":"[Statistics keyword] E Estimates of aj + x'β","type":"value"}]},{"name":"PREDPPLOT","description":"The PREDPPLOT statement plots the predicted probability against a single continuous variable (dose variable) in the MODEL statement for both the binomial model and the multinomial model. Confidence limits are available only for the binomial model. An attached box on the right side of the plot is used to label predicted probability curves with the names of their levels for the multinomial model. You can specify the color of this box by using the CLABBOX= option.","help":"PREDPPLOT &lt;ANNOTATE=SAS-data-set&gt; &lt;CAXIS=color&gt; &lt;VAR=variable&gt; ...","arguments":[{"name":"ANNOTATE=","optional":true,"aliases":["ANNO="],"description":"Specifies an Annotate data set that enables you to add features to the PREDP plot. The ANNOTATE= data set you specify in the PREDPPLOT statement is used for all plots created by the statement.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"CAXIS=","optional":true,"aliases":["CAXES=","CA="],"description":"Specifies the color used for the axes and tick marks. This option overrides any COLOR= specifications in an AXIS statement. The default is the first color in the device color list.","help":"CAXIS=*color*","type":"color"},{"name":"CFIT=","optional":true,"description":"Specifies the color for the fitted PREDP curves. The default is the first color in the device color list.","help":"CFIT=*color*","type":"color"},{"name":"CFRAME=","optional":true,"aliases":["CFR="],"description":"Specifies the color for the area enclosed by the axes and frame. The area is not shaded by default.","help":"CFRAME=*color*","type":"color"},{"name":"CGRID=","optional":true,"description":"Specifies the color for grid lines. The default is the first color in the device color list.","help":"CGRID=*color*","type":"color"},{"name":"CHREF=","optional":true,"aliases":["CH="],"description":"Specifies the color for lines requested by the HREF= option. The default is the first color in the device color list.","help":"CHREF=*color*","type":"color"},{"name":"CTEXT=","optional":true,"description":"Specifies the color for tick mark values and axis labels. The default is the color specified for the CTEXT= option in the most recent GOPTIONS statement.","help":"CTEXT=*color*","type":"color"},{"name":"CVREF=","optional":true,"aliases":["CV="],"description":"Specifies the color for lines requested by the VREF= option. The default is the first color in the device color list.","help":"CVREF=*color*","type":"color"},{"name":"DESCRIPTION=","optional":true,"aliases":["DES="],"description":"Specifies a description, up to 40 characters, that appears in the PROC GREPLAY master menu. The default is the variable name.","help":"DESCRIPTION='*string*'","type":"value"},{"name":"FONT=","optional":true,"description":"Specifies a software font for reference line and axis labels. You can also specify fonts for axis labels in an AXIS statement. The FONT= font takes precedence over the FTEXT= font specified in the GOPTIONS statement.","help":"FONT=*font*","type":"value"},{"name":"HAXIS=","optional":true,"description":"Specifies tick mark values for the horizontal axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"HEIGHT=","optional":true,"description":"Specifies the height of text used outside framed areas. The default value is 3.846 (in percentage).","help":"HEIGHT=*value*","type":"value"},{"name":"HLOWER=","optional":true,"description":"Specifies the lower limit on the horizontal axis scale. The HLOWER= option specifies value as the lower horizontal axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HLOWER=*value*","type":"value"},{"name":"HOFFSET=","optional":true,"description":"Specifies offset for horizontal axis. The default value is 1.","help":"HOFFSET=*value*","type":"value"},{"name":"HREF=","optional":true,"description":"Requests reference lines perpendicular to the horizontal axis. If (INTERSECT) is specified, a second reference line perpendicular to the vertical axis is drawn that intersects the fit line at the same point as the horizontal axis reference line. If a horizontal axis reference line label is specified, the intersecting vertical axis reference line is labeled with the vertical axis value.","help":"HREF=INTERSECT","type":"choice","arguments":[{"name":"INTERSECT","type":"standalone"}]},{"name":"HREFLABELS=","optional":true,"aliases":["HREFLABEL=","HREFLAB="],"description":"Specifies labels for the lines requested by the HREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"HREFLABPOS=","optional":true,"description":"Specifies the vertical position of the HREFLABELS= labels.","help":"HREFLABPOS=1 | 2 | 3 | 4 | 5 | 6","type":"choice","arguments":[{"name":"1","description":"Top of plot","type":"standalone"},{"name":"2","description":"Staggered from top","type":"standalone"},{"name":"3","description":"Bottom of plot","type":"standalone"},{"name":"4","description":"Staggered from bottom","type":"standalone"},{"name":"5","description":"Alternating from top","type":"standalone"},{"name":"6","description":"Alternating from bottom","type":"standalone"}]},{"name":"HUPPER=","optional":true,"description":"Specifies value as the upper horizontal axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the HAXIS= option is used.","help":"HUPPER=*value*","type":"value"},{"name":"INBORDER","optional":true,"description":"Requests a border around PREDP plots.","type":"standalone"},{"name":"LEVEL=","optional":true,"aliases":["ORDINAL="],"description":"Specifies the names of the levels for which PREDP curves are requested. Names should be quoted and separated by space. If there is no correct name provided, no PREDP curve is plotted.","type":"value"},{"name":"LFIT=","optional":true,"description":"Specifies a line style for fitted curves. By default, fitted curves are drawn by connecting solid lines (linetype = 1).","help":"LFIT=*linetype*","type":"value"},{"name":"LGRID=","optional":true,"description":"Specifies a line style for all grid lines. linetype is between 1 and 46. The default is 35.","help":"LGRID=*linetype*","type":"value"},{"name":"LHREF=","optional":true,"aliases":["LH="],"description":"Specifies the line type for lines requested by the HREF= option. The default is 2, which produces a dashed line.","help":"LHREF=*linetype*","type":"value"},{"name":"LVREF=","optional":true,"aliases":["LV="],"description":"Specifies the line type for lines requested by the VREF= option. The default is 2, which produces a dashed line.","help":"LVREF=*linetype*","type":"value"},{"name":"NAME=","optional":true,"description":"Specifies a name for the plot, up to eight characters, that appears in the PROC GREPLAY master menu. The default value is 'PROBIT'.","help":"NAME='*string*'","type":"value"},{"name":"NOFIT","optional":true,"description":"Suppresses the fitted PREDP curves.","type":"standalone"},{"name":"NOFRAME","optional":true,"description":"Suppresses the frame around plotting areas.","type":"standalone"},{"name":"NOGRID","optional":true,"description":"Suppresses grid lines.","type":"standalone"},{"name":"NOHLABEL","optional":true,"description":"Suppresses horizontal labels.","type":"standalone"},{"name":"NOHTICK","optional":true,"description":"Suppresses horizontal tick marks.","type":"standalone"},{"name":"NOTHRESH","optional":true,"description":"Suppresses the threshold line.","type":"standalone"},{"name":"NOVLABEL","optional":true,"description":"Suppresses vertical labels.","type":"standalone"},{"name":"NOVTICK","optional":true,"description":"Suppresses vertical tick marks.","type":"standalone"},{"name":"THRESHLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for the threshold line.","help":"THRESHLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are placed to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are placed to the right of the plot.","type":"standalone"}]},{"name":"VAR=","optional":true,"description":"Specifies a single continuous variable (dose variable) in the independent variable list of the MODEL statement. If a VAR= variable is not specified, the first single continuous variable in the independent variable list of the MODEL statement is used. If such a variable does not exist in the independent variable list of the MODEL statement, an error is reported.","help":"VAR=*variable*","type":"value"},{"name":"VAXIS=","optional":true,"description":"Specifies tick mark values for the vertical axis; value1, value2, and value3 must be numeric, and value1 must be less than value2. The lower tick mark is value1. Tick marks are drawn at increments of value3. The last tick mark is the greatest value that does not exceed value2. This method of specification of tick marks is not valid for logarithmic axes. If value3 is omitted, a value of 1 is used.","type":"value"},{"name":"VAXISLABEL=","optional":true,"description":"Specifies a label for the vertical axis.","help":"VAXISLABEL='*string*'","type":"value"},{"name":"VLOWER=","optional":true,"description":"Specifies the lower limit on the vertical axis scale. The VLOWER= option specifies value as the lower vertical axis tick mark. The tick mark interval and the upper axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VLOWER=*value*","type":"value"},{"name":"VREF=","optional":true,"description":"Requests reference lines perpendicular to the vertical axis. If (INTERSECT) is specified, a second reference line perpendicular to the horizontal axis is drawn that intersects the fit line at the same point as the vertical axis reference line. If a vertical axis reference line label is specified, the intersecting horizontal axis reference line is labeled with the horizontal axis value.","help":"VREF=*value-list*","type":"value"},{"name":"VREFLABELS=","optional":true,"aliases":["VREFLABEL=","VREFLAB="],"description":"Specifies labels for the lines requested by the VREF= option. The number of labels must equal the number of lines. Enclose each label in quotes. Labels can have up to 16 characters.","type":"value"},{"name":"VREFLABPOS=","optional":true,"description":"Specifies the horizontal position of labels for VREF= lines.","help":"VREFLABPOS=1 | 2","type":"choice","arguments":[{"name":"1","description":"Labels are positioned to the left of the plot.","type":"standalone"},{"name":"2","description":"Labels are positioned to the right of the plot.","type":"standalone"}]},{"name":"VUPPER=","optional":true,"description":"Specifies the upper limit on the vertical axis scale. The VUPPER= option specifies value as the upper vertical axis tick mark. The tick mark interval and the lower axis limit are determined automatically. This option has no effect if the VAXIS= option is used.","help":"VUPPER=*value*","type":"value"},{"name":"WAXIS=","optional":true,"description":"Specifies the line thickness for axes and frame. The default value is 1.","help":"WAXIS=*n*","type":"value"},{"name":"WFIT=","optional":true,"description":"Specifies line thickness for fitted curves. The default value is 1.","help":"WFIT=*n*","type":"value"},{"name":"WGRID=","optional":true,"description":"Specifies line thickness for grids. The default value is 1.","help":"WGRID=*n*","type":"value"},{"name":"WREFL=","optional":true,"description":"Specifies line thickness for reference lines. The default value is 1.","help":"WREFL=*n*","type":"value"}]},{"name":"SLICE","description":"The SLICE statement provides a general mechanism for performing a partitioned analysis of the LS-means for an interaction. This analysis is also known as an analysis of simple effects. The SLICE statement uses the same options as the LSMEANS statement.","help":"SLICE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | DUNNETT | NELSON&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"followsDelimiter":"/","description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","followsDelimiter":"/","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the LS-mean effect in the \"Type III Tests of Fixed Effects\" table.","type":"standalone"},{"name":"ROW","followsDelimiter":"/","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across LS-mean differences.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"followsDelimiter":"/","description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the differences of LS-means.","help":"ADJUST=BON | DUNNETT | NELSON | SCHEFFE | SIDAK | SIMULATE | SMM | TUKEY","type":"choice","arguments":[{"name":"BON","followsDelimiter":"/","description":"Bonferroni adjustment","type":"standalone"},{"name":"DUNNETT","followsDelimiter":"/","description":"Dunnett adjustment (in which the procedure analyzes all differences with a control level)","type":"standalone"},{"name":"NELSON","followsDelimiter":"/","description":"Nelson adjustment (in which ANOM differences are taken)","type":"standalone"},{"name":"SCHEFFE","followsDelimiter":"/","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","followsDelimiter":"/","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","followsDelimiter":"/","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector. Syntax: SIMULATE<(simoptions)> You can specify the following simoptions in parentheses after the ADJUST=SIMULATE option. ACC=value specifies the target accuracy radius γ of a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. EPS=value specifies the value ε for a 100(1-ε)% confidence interval for the true probability content of the estimated (1-α)th quantile. The default value is ACC=0.005. NSAMP=n specifies the sample size for the simulation. SEED=number specifies an integer that is used to start the pseudo-random number generator for the simulation. THREADS specifies that the computational work for the simulation be divided into parallel threads, where the number of threads is the value of the SAS system option CPUCOUNT=. NOTHREADS specifies that the computational work for the simulation be performed in sequence rather than in parallel. NOTHREADS is the default. This option overrides the SAS system option THREADS|NOTHREADS.","type":"standalone"},{"name":"SMM","followsDelimiter":"/","aliases":["GT2"],"description":"SMM adjustment","type":"standalone"},{"name":"TUKEY","followsDelimiter":"/","description":"If your data are unbalanced, PROC GLIMMIX uses the approximation described in Kramer (1956) and identifies the adjustment as \"Tukey-Kramer\" in the results.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Requests that a t-type confidence interval be constructed for each of the LS-means with confidence level (1-number)x100%. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"AT=","optional":true,"followsDelimiter":"/","description":"Modifies the values of the covariates that are used in computing LS-means. By default, all covariate effects are set equal to their mean values for computation of standard LS-means. The AT option enables you to assign arbitrary values to the covariates. Additional columns in the output table indicate the values of the covariates.","help":"AT=MEANS","type":"choice","arguments":[{"name":"MEANS","type":"standalone"}]},{"name":"BYLEVEL","optional":true,"followsDelimiter":"/","description":"Requests that separate margins be computed for each level of the SLICE model-effect.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests that t-type confidence limits be constructed for each of the LS-means. The confidence level is 0.95 by default; this can be changed with the ALPHA= option.","type":"standalone"},{"name":"CORR","optional":true,"followsDelimiter":"/","description":"Displays the estimated correlation matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"COV","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the least squares means as part of the \"Least Squares Means\" table.","type":"standalone"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the t test and confidence limits. The default is the denominator degrees of freedom taken from the \"Type III Tests\" table that corresponds to the LS-means effect.","help":"DF=*number*","type":"value"},{"name":"DIFF=","optional":true,"followsDelimiter":"/","aliases":["PDIFF="],"description":"Requests that differences of the LS-means be displayed.","help":"DIFF=ALL | ANOM | CONTROL | CONTROLL | CONTROLU","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests all pairwise differences; this is the default.","type":"standalone"},{"name":"ANOM","followsDelimiter":"/","description":"Requests differences between each LS-mean and the average LS-mean, as in the analysis of means (Ott 1967).","type":"standalone"},{"name":"CONTROL","followsDelimiter":"/","description":"Requests the differences with a control, which, by default, is the first level of each of the specified SLICE effects.","type":"standalone"},{"name":"CONTROLL","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly smaller than the control; the upper confidence limits for the control minus the noncontrol levels are considered to be infinity and are displayed as missing.","type":"standalone"},{"name":"CONTROLU","followsDelimiter":"/","description":"Tests whether the noncontrol levels are significantly larger than the control; the upper confidence limits for the noncontrol levels minus the control are considered to be infinity and are displayed as missing.","type":"standalone"}]},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that the L matrix coefficients for the SLICE effects be displayed.","type":"standalone"},{"name":"EXP","optional":true,"followsDelimiter":"/","description":"Requests exponentiation of the LS-means or LS-mean differences. When you model data with the logit, cumulative logit, or generalized logit link functions, and the estimate represents a log odds ratio or log cumulative odds ratio, the EXP option produces an odds ratio. In proportional hazards model, the exponentiation of the LS-mean differences produces estimates of hazard ratios. If you specify the CL or ALPHA= option, the (adjusted) confidence bounds are also exponentiated.","type":"standalone"},{"name":"ILINK","optional":true,"followsDelimiter":"/","description":"Requests that estimates and their standard errors in the \"Least Squares Means\" table also be reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LINES","optional":true,"followsDelimiter":"/","description":"Presents results of comparisons between all pairs of least squares means by listing the means in descending order and indicating nonsignificant subsets by line segments beside the corresponding LS-means.","type":"standalone"},{"name":"MEANS","optional":true,"followsDelimiter":"/","description":"Specifies to produce the table of least squares means.","type":"standalone"},{"name":"NOF","optional":true,"followsDelimiter":"/","description":"Suppresses the F test for testing the mutual equality of the estimable functions in the partition.","type":"standalone"},{"name":"NOMEANS","optional":true,"followsDelimiter":"/","description":"Specifies not to produce the table of least squares means. This is the default.","type":"standalone"},{"name":"OBSMARGINS=","optional":true,"followsDelimiter":"/","aliases":["OM="],"description":"Specifies a potentially different weighting scheme for the computation of LS-means coefficients. The standard LS-means have equal coefficients across classification effects; however, the OM option changes these coefficients to be proportional to those found in the OM-data-set. This adjustment is reasonable when you want your inferences to apply to a population that is not necessarily balanced but has the margins that are observed in OM-data-set.","type":"value"},{"name":"ODDSRATIO","optional":true,"followsDelimiter":"/","aliases":["OR"],"description":"Requests that LS-mean differences (DIFF, ADJUST= options) are also reported in terms of odds ratios. The ODDSRATIO option is ignored unless you use either the logit, cumulative logit, or generalized logit link function. If you specify the CL or ALPHA= option, confidence intervals for the odds ratios are also computed. These intervals are adjusted for multiplicity when you specify the ADJUST= option.","type":"standalone"},{"name":"PDIFF","optional":true,"followsDelimiter":"/","description":"Is the same as the DIFF option.","type":"standalone"},{"name":"PLOT=","optional":true,"followsDelimiter":"/","aliases":["PLOTS="],"description":"Requests that least squares means related graphics are produced via ODS Graphics, provided that the ODS GRAPHICS statement has been specified and the plot request does not conflict with other options in the SLICE statement.","help":"PLOT=ALL | ANOMPLOT | BOXPLOT | CONTROLPLOT | DIFFPLOT | DISTPLOT | MEANPLOT | NONE","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Requests that the default plots corresponding to this SLICE statement be produced.","type":"standalone"},{"name":"ANOMPLOT","followsDelimiter":"/","aliases":["ANOM"],"description":"Requests an analysis of means display in which least squares means are compared to an average least squares mean.","type":"standalone"},{"name":"BOXPLOT","followsDelimiter":"/","description":"Syntax: BOXPLOT<boxplot-options>> Produces box plots of the distribution of the least squares mean or least squares mean differences across a posterior sample. For example, this plot is available in procedures that support a Bayesian analysis through the BAYES statement. A separate box is generated for each estimable function, and all boxes appear on a single graph by default. You can affect the appearance of the box plot graph with the following options: ORIENTATION=VERTICAL|HORIZONTAL ORIENT=VERT|HORIZ specifies the orientation of the boxes. The default is vertical orientation of the box plots. NPANELPOS=number specifies how to break the series of box plots across multiple panels. If the NPANELPOS option is not specified, or if number equals zero, then all box plots are displayed in a single graph; this is the default.","type":"standalone"},{"name":"CONTROLPLOT","followsDelimiter":"/","aliases":["CONTROL"],"description":"Requests a display in which least squares means are visually compared against a reference level.","type":"standalone"},{"name":"DIFFPLOT","followsDelimiter":"/","aliases":["DIFFOGRAM","DIFF"],"description":"Requests a display of all pairwise least squares mean differences and their significance. Syntax: DIFFPLOT<(diffplot-options)> You can specify the following diffplot-options: ABS all line segments are shown on the same side of the reference line. NOABS separates comparisons according to the sign of the difference. CENTER marks the center point for each comparison. NOLINES suppresses the display of the line segments that represent the confidence bounds for the differences of the least squares means. The NOLINES option implies the CENTER option.","type":"standalone"},{"name":"DISTPLOT","followsDelimiter":"/","aliases":["DIST"],"description":"Syntax: DISTPLOT<distplot-options> Generates panels of histograms with a kernel density overlaid if the analysis has access to a set of posterior parameter estimates. You can sepcify the following distplot-options in parentheses: BOX|NOBOX controls the display of a horizontal box plot of the estimable function’s distribution across the posterior sample below the graph. The BOX option is enabled by default. HIST|NOHIST controls the display of the histogram of the estimable function’s distribution across the posterior sample. The HIST option is enabled by default. NORMAL|NONORMAL controls the display of a normal density estimate on the graph. The NONORMAL option is enabled by default. KERNEL|NOKERNEL controls the display of a kernel density estimate on the graph. The KERNEL option is enabled by default. NROWS=number specifies the highest number of rows in a panel. The default is 3. NCOLS=number specifies the highest number of columns in a panel. The default is 3. UNPACK unpacks the panel into separate graphics.","type":"standalone"},{"name":"MEANPLOT","followsDelimiter":"/","description":"Syntax: MEANPLOT<(meanplot-options)> Requests displays of the least squares means. The following meanplot-options control the display of the least squares means: ASCENDING displays the least squares means in ascending order. This option has no effect if means are sliced or displayed in separate plots. CL displays upper and lower confidence limits for the least squares means. By default, 95% limits are drawn. CLBAND displays confidence limits as bands. This option implies the JOIN option. DESCENDING displays the least squares means in descending order. This option has no effect if means are sliced or displayed in separate plots. ILINK requests that means (and confidence limits) are displayed on the inverse linked scale. JOIN | CONNECT connects the least squares means with lines. This option is implied by the CLBAND option. SLICEBY=fixed-effect specifies an effect by which to group the means in a single plot. PLOTBY=fixed-effect specifies an effect by which to break interaction plots into separate displays.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Requests that no plots be produced.","type":"standalone"}]},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the sampling-based components of the computations for the SLICE statement (for example, chi-bar-square statistics and simulated p-values). number specifies an integer that is used to start the pseudo-random-number generator for the simulation. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated from reading the time of day from the computer clock.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the estimability checking. The value for number must be between 0 and 1; the default is 1E-4.","help":"SINGULAR=*number*","type":"value"},{"name":"SLICEBY=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"STEPDOWN=","optional":true,"followsDelimiter":"/","description":"Requests that multiple comparison adjustments for the p-values of LS-mean differences be further adjusted in a step-down fashion. Step-down methods increase the power of multiple comparisons by taking advantage of the fact that a p-value is never declared significant unless all smaller p-values are also declared significant. You can specify the following step-down options in parentheses: MAXTIME=n specifies the time (in seconds) to spend computing the maximal logically consistent sequential subsets of equality hypotheses for TYPE=LOGICAL. REPORT specifies that a report on the step-down adjustment should be displayed, including a listing of the sequential subsets (Westfall 1997) and, for ADJUST=SIMULATE, the step-down simulation results.","help":"STEPDOWN=MAXTIME= | REPORT | TYPE=","type":"choice","arguments":[{"name":"MAXTIME=","type":"value"},{"name":"REPORT","type":"standalone"},{"name":"TYPE=","type":"value"}]}]},{"name":"STORE","aliases":["ITEMSTORE"],"description":"The STORE statement requests that the procedure save the context and results of the statistical analysis. The resulting item store is a binary file format that cannot be modified. The contents of the item store can be processed with the PLM procedure. The item-store-name is a usual one- or two-level SAS name, like the names that are used for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session. Since item stores usually are used to perform postprocessing tasks, typical usage specifies a two-level name of the form libname.membername. If an item store by the same name as specified in the STORE statement already exists, the existing store is replaced.","help":"STORE &lt;LABEL='label'&gt; ","arguments":[{"name":"LABEL=","optional":true,"followsDelimiter":"/","description":"Adds a custom label. When the PLM procedure processes an item store, the label appears in the PROC PLM output along with other identifying information.","help":"LABEL='*label*'","type":"value"}]},{"name":"TEST","description":"The TEST statement enables you to perform F tests for model effects that test Type I, II, or Type III hypotheses.","help":"TEST &lt;CHISQ&gt; &lt;DDF=value-list&gt; &lt;E&gt; ...","arguments":[{"name":"CHISQ","optional":true,"followsDelimiter":"/","description":"Requests that chi-square tests be performed for the relevant effects in addition to the F tests. Type III tests are the default; you can produce the Type I and Type II tests by using the HTYPE= option. This option has no effect when the procedure produces chi-square statistics by default.","type":"standalone"},{"name":"DDF=","optional":true,"followsDelimiter":"/","aliases":["DF="],"description":"Specifies the denominator degrees of freedom for the fixed effects. The value-list specification is a list of numbers or missing values (.) separated by commas. The order of degrees of freedom should match the order of the fixed effects that are specified in the TEST statement; otherwise it should match the order in which the effects appear in the \"Type III Tests of Fixed Effects\" table.","help":"DDF=*value-list*","type":"value"},{"name":"E","optional":true,"followsDelimiter":"/","description":"Requests that Type I, Type II, and Type III L matrix coefficients be displayed for all relevant effects.","type":"standalone"},{"name":"E1","optional":true,"followsDelimiter":"/","aliases":["EI"],"description":"Requests that Type I L matrix coefficients be displayed for all relevant effects.","type":"standalone"},{"name":"E2","optional":true,"followsDelimiter":"/","aliases":["EII"],"description":"Requests that Type II L matrix coefficients be displayed for all relevant effects.]","type":"standalone"},{"name":"E3","optional":true,"followsDelimiter":"/","aliases":["EIII"],"description":"Requests that Type III L matrix coefficients be displayed for all relevant effects.","type":"standalone"},{"name":"HTYPE=","optional":true,"followsDelimiter":"/","description":"Indicates the type of hypothesis test to perform on the fixed effects. Valid entries for values in the value-list are 1, 2, and 3, which correspond to Type I, Type II, and Type III tests, respectively. The default value is 3.","help":"HTYPE=*value-list*","type":"value"},{"name":"INTERCEPT","optional":true,"followsDelimiter":"/","aliases":["INT"],"description":"Adds a row to the tables for Type I, II, and III tests that correspond to the overall intercept.","type":"standalone"}]},{"name":"WEIGHT","description":"A WEIGHT statement can be used with PROC PROBIT to weight each observation by the value of the variable specified. The contribution of each observation to the likelihood function is multiplied by the value of the weight variable.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_026","docsetTargetFile":"statug_probit_toc.htm"}}