{"name":"QLIM","statements":[{"name":"PROC QLIM","description":"The QLIM (qualitative and limited dependent variable model) procedure analyzes univariate and multivariate limited dependent variable models where dependent variables take discrete values or dependent variables are observed only in a limited range of values. This procedure includes logit, probit, tobit, selection, and multivariate models. The multivariate model can contain discrete choice and limited endogenous variables as well as continuous endogenous variables. † The QLIM procedure supports the following models: † o linear regression model with heteroscedasticity o Box-Cox regression with heteroscedasticity o probit with heteroscedasticity o logit with heteroscedasticity o tobit (censored and truncated) with heteroscedasticity o bivariate probit o bivariate tobit o sample selection and switching regression models o multivariate limited dependent variables o stochastic frontier production and cost models","help":"PROC QLIM <CORRB><CORROUT><COVB><COVEST=OP | HESSIAN | QML><COVOUT><DATA=SAS-data-set><ITPRINT><METHOD=CONGRA | DBLDOG | NMSIMP... ><NDRAW=value><NOPRINT><OUTEST=SAS-data-set><PRINTALL><SEED=value>; \n\tBOUNDS bound1 < , bound2 ...>           ;\n\tBY variables ;\n\tCLASS variables ;\n\tENDOGENOUS <CENSORED <(censored-options )>><DISCRETE <(discrete-options)>><CENSORED <(truncated-options )>> ...;\n\tFREQ variable ;\n\tHETERO               <LINK=<EXP | LINEAR>><NOCONST><SQUARE> ...;\n\tINIT initvalue1 < , initvalue2 ...> ;\n\tMODEL <BOXCOX (option-list )><LIMIT1=value><NOINT> ...;\n\tNLOPTIONS <ABSCONV= | ABSTOL=r><ABSFCONV=r[n] | ABSFTOL=r[n><ABSGCONV=r[n] | ABSGTOL=r[n> ...;\n\tOUTPUT <CONDITIONAL><ERRSTD><OUT=SAS-data-set> ...;\n\tRESTRICT restriction1 <, restriction2 ...> ;\n\tTEST <ALL><LM><WALD> ...;\n\tWEIGHT variable ;","arguments":[{"name":"CORRB","optional":true,"description":"Prints the correlation matrix of the parameter estimates.","type":"standalone"},{"name":"CORROUT","optional":true,"description":"Writes the correlation matrix for the parameter estimates to the OUTEST= data set. This option is valid only if the OUTEST= option is specified.","type":"standalone"},{"name":"COVB","optional":true,"description":"Prints the covariance matrix of the parameter estimates.","type":"standalone"},{"name":"COVEST=","optional":true,"description":"Specifies the method to calculate the covariance matrix of parameter estimates.","help":"COVEST=OP | HESSIAN | QML","type":"choice","arguments":[{"name":"OP","description":"Specifies the covariance from the outer product matrix.","type":"standalone"},{"name":"HESSIAN","description":"Specifies the covariance from the inverse Hessian matrix.","type":"standalone"},{"name":"QML","description":"Specifies the covariance from the outer product and Hessian matrices (the quasi-maximum likelihood estimates).","type":"standalone"}]},{"name":"COVOUT","optional":true,"description":"Writes the covariance matrix for the parameter estimates to the OUTEST= data set. This option is valid only if the OUTEST= option is specified.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set. If the DATA= option is not specified, PROC QLIM uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"ITPRINT","optional":true,"description":"Prints the initial parameter estimates, convergence criteria, and all constraints of the optimization. At each iteration, objective function value, step size, maximum gradient, and slope of search direction are printed as well.","type":"standalone"},{"name":"METHOD=","optional":true,"description":"Specifies the optimization method. If this option is specified, it overwrites the TECH= option in NLOPTIONS statement.","help":"METHOD=CONGRA | DBLDOG | NMSIMP | NEWRAP | NRRIDG | QUANEW | TRUREG","type":"choice","arguments":[{"name":"CONGRA","description":"Performs a conjugate-gradient optimization","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double dogleg optimization","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization","type":"standalone"},{"name":"NEWRAP","description":"Performs a Newton-Raphson optimization combining a line-search algorithm with ridging","type":"standalone"},{"name":"NRRIDG","description":"Performs a Newton-Raphson optimization with ridging","type":"standalone"},{"name":"QUANEW","description":"Performs a quasi-Newton optimization","type":"standalone"},{"name":"TRUREG","description":"Performs a trust region optimization","type":"standalone"}]},{"name":"NDRAW=","optional":true,"description":"Specifies the number of draws for Monte Carlo integration.","help":"NDRAW=*value*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal printed output but does not suppress error listings. If NOPRINT option is set, then any other print option is turned off.","type":"standalone"},{"name":"OUTEST=","optional":true,"description":"Writes the parameter estimates to an output data set.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"PRINTALL","optional":true,"description":"Turns on all the printing-control options. The options set by PRINTALL are COVB and CORRB.","type":"standalone"},{"name":"SEED=","optional":true,"description":"Specifies a seed for pseudo-random number generation in Monte Carlo integration.","help":"SEED=*value*","type":"value"}]},{"name":"BAYES","description":"controls the Metropolis sampling scheme that is used to obtain samples from the posterior distribution of the underlying model and data.","help":"BAYES             &lt;*options*&gt;","arguments":[{"name":"AUTOMCMC","optional":true,"description":"specifies an algorithm for the auto-initialization of the MCMC sampling algorithm.","help":"AUTOMCMC&lt;=(*automcmc-options*)&gt;","type":"standaloneOrValue","arguments":[{"name":"ACCURACY=","description":"ustomizes the behavior of the AUTOMCMC algorithm when you are searching for an accurate representation of the posterior distribution.","help":"ACCURACY=(*accuracy-options*)","type":"value","arguments":[{"name":"ATTEMPTS=","description":"specifies the maximum number of attempts that is required in order to obtain accurate samples from the posterior distribution. By default, ATTEMPTS=10.","help":"                           ATTEMPTS=*number*","type":"value"},{"name":"TARGETESS=","description":"requests that the accuracy search be based on the effective sample size (ESS) analysis. If you specify this option, you must also specify the minimum number of effective samples.","help":"TARGETESS=*number*","type":"value"},{"name":"TARGETSTATS","description":"requests that the accuracy search be based on the analysis of the posterior mean and a posterior quantile of interest. You can customize the behavior of the analysis of the posterior mean by adjusting HEIDELBERGER sub-options.","help":"TARGETSTATS&lt;=(*targetstats-options*)&gt;","type":"standaloneOrValue"},{"name":"TOL=","description":"specifies the proportion of parameters that are required to be accurate. By default, TOL=0.95.","help":"TOL=*value*","type":"value"}]},{"name":"MAXNMC=","description":"specifies the maximum number of posterior samples that the AUTOMCMC option allows.","help":"MAXNMC=*number*","type":"value"},{"name":"RANDINIT","description":"specifies random starting points for the MCMC algorithm. MULTIPLIER= specifies the radius of the area where the starting points are sampled. PROPORTION= specifies the proportion of the starting points that are sampled around the maximum likelihood estimate and around the prior mean.","help":"RANDINIT&lt;=(MULTIPLIER=(*value*) | PROPORTION=(*value*))&gt;","type":"standaloneOrValue","arguments":[{"name":"MULTIPLIER=","description":"specifies the radius of the area where the starting points are sampled. For the starting points that are sampled around the maximum likelihood estimate, the radius equals the standard deviation of the maximum likelihood estimate multiplied by the multiplier value. For the starting points that are sampled around the prior mean, the radius equals the standard deviation of the prior distribution multiplied by the multiplier value. By default, MULTIPLIER=2.","help":"MULTIPLIER=(*value*)","type":"value"},{"name":"PROPORTION=","description":"specifies the proportion of starting points that are sampled around the maximum likelihood estimate and around the prior mean. By default, PROPORTION=0, which implies that all the initial points are sampled around the maximum likelihood estimate. If you use choose to sample starting points around the prior mean, the convergence of the MCMC algorithm could be very slow.","help":"PROPORTION=(*value*)","type":"value"}]},{"name":"STATIONARITY=","description":"customizes the behavior of the AUTOMCMC algorithm when you are trying to sample from the posterior distribution.","help":"STATIONARITY=(ATTEMPTS=*number* | TOL=*value*)","type":"choice","arguments":[{"name":"ATTEMPTS=","description":"specifies the maximum number of attempts that are required in order to obtain stationary samples from the posterior distribution. By default, ATTEMPTS=10.","help":"ATTEMPTS=*number*","type":"value"},{"name":"TOL=","description":"specifies the proportion of parameter whose samples must to be stationary. By default, TOL=0.95.","help":"TOL=*value*","type":"value"}]}]},{"name":"DIAGNOSTICS=","optional":true,"aliases":["DIAG"],"description":"controls which diagnostics are produced. All the following diagnostics are produced with DIAGNOSTICS=ALL. If you do not want any of these diagnostics, specify DIAGNOSTICS=NONE. If you want some but not all of the diagnostics, or if you want to change certain settings of these diagnostics, specify a subset of the following keywords. By default, DIAGNOSTICS=NONE.","help":"DIAGNOSTICS=ALL | \n                NONE | \n                (keyword-list)","type":"choice","arguments":[{"name":"AUTOCORR","description":"computes the autocorrelations at lags that are specified in the numeric-list. Elements in the numeric-list are truncated to integers, and repeated values are removed. If the LAGS= option is not specified, autocorrelations of lags 1, 5, 10, and are computed.","help":"AUTOCORR                       &lt;(LAGS=*numeric-list*)&gt;","type":"standaloneOrValue"},{"name":"AUTOMCMCSUM","description":"produces a summary table for the AUTOMCMC (automatic MCMC) sampling tool is used.","type":"standalone"},{"name":"ESS","description":"computes Carlin’s estimate of the effective sample size, the correlation time, and the efficiency of the chain for each parameter.","type":"standalone"},{"name":"GEWEKE","description":"computes the Geweke spectral density diagnostics, which are essentially a two-sample t test between the first f 1 portion and the last f 2 portion of the chain. The default is f 1 equals 0.1 and f 2 equals 0.5.","help":"GEWEKE                       &lt;(*geweke-options*)&gt;","type":"standaloneOrValue","arguments":[{"name":"FRAC1=","description":"specifies the fraction f 1 for the first window.","help":"FRAC1=*value*","type":"value"},{"name":"FRAC2=","description":"specifies the fraction f 2 for the second window.","help":"FRAC2=*value*","type":"value"}]},{"name":"HEIDELBERGER","description":"computes the Heidelberger and Welch diagnostic for each variable, which consists of a stationarity test of the null hypothesis that the sample values form a stationary process.","help":"HEIDELBERGER                       &lt;(*heidel-options*)&gt;","type":"standaloneOrValue","arguments":[{"name":"SALPHA=","description":"specifies the alpha level for the stationarity test.","help":"SALPHA=*value*","type":"value"},{"name":"HALPHA=","description":"specifies the alpha level for the halfwidth test.","help":"HALPHA=*value*","type":"value"},{"name":"EPS=","description":"specifies a positive number epsilon such that if the halfwidth is less than epsilon times the sample mean of the retained iterates, the halfwidth test is passed.","help":"EPS=*value*","type":"value"}]},{"name":"MCERROR","aliases":["MCSE"],"description":"computes the Monte Carlo standard error for each parameter. The Monte Carlo standard error, which measures the simulation accuracy, is the standard error of the posterior mean estimate and is calculated as the posterior standard deviation divided by the square root of the effective sample size.","type":"standalone"},{"name":"RAFTERY","description":"computes the Raftery and Lewis diagnostics.","help":"RAFTERY&lt;(*raftery-options*)&gt;","type":"standaloneOrValue","arguments":[{"name":"QUANTILE=","aliases":["Q"],"description":"specifies the order (a value between 0 and 1) of the quantile of interest. The default is 0.025.","help":"QUANTILE=value","type":"value"},{"name":"ACCURACY=","aliases":["R"],"description":"specifies a small positive number as the margin of error for measuring the accuracy of estimation of the quantile. The default is 0.005.","help":"ACCURACY=*value*","type":"value"},{"name":"PROBABILITY=","aliases":["S"],"description":"specifies the probability of attaining the accuracy of the estimation of the quantile. The default is 0.95.","help":"PROBABILITY=*value*","type":"value"},{"name":"EPSILON=","aliases":["EPS"],"description":"specifies the tolerance level (a small positive number) for the stationary test. The default is 0.001.","help":"EPSILON=*value*","type":"value"}]}]},{"name":"DELTA=","optional":true,"description":"specifies the target acceptance rate during the tuning process of the No-U-Turn Sampler (NUTS) algorithm. By default, DELTA=0.6. Increasing the value can often improve mixing, but it can also significantly slow down the sampling.","help":"DELTA=*value*","type":"value"},{"name":"MARGINLIKE","optional":true,"description":"evaluates of the logarithm of the marginal likelihood.","help":"MARGINLIKE&lt;(NSIM=*number*)&gt;","type":"standaloneOrValue"},{"name":"MAXHEIGHT=","optional":true,"description":"specifies the maximum height of the NUTS algorithm tree.","help":"MAXHEIGHT=*value*","type":"value"},{"name":"MAXTUNE=","optional":true,"description":"specifies the maximum number of tuning phases. The default is 24.","help":"MAXTUNE=*number*","type":"value"},{"name":"MINTUNE=","optional":true,"description":"specifies the minimum number of tuning phases. The default is 2.","help":"MINTUNE=*number*","type":"value"},{"name":"NBI=","optional":true,"description":"specifies the number of burn-in iterations before the chains are saved. The default is 1,000.","help":"NBI=*number*","type":"value"},{"name":"NMC=","optional":true,"description":"specifies the number of iterations after the burn-in for both Metropolis and Hamiltonian sampling schemes.","help":"NMC=*number*","type":"value"},{"name":"NMCPRIOR=","optional":true,"description":"specifies the number of samples for the prior predictive analysis when PLOTS(PRIOR)=BAYESPRED is requested. The default is 10,000.","help":"NMCPRIOR=*number*","type":"value"},{"name":"THREADS=","optional":true,"aliases":["NTRDS"],"description":"specifies the number of threads to be used. The number of threads cannot exceed the number of computer cores available. Each core samples the number of iterations that is specified by the NMC option. The default is 1.","help":"THREADS=*number*","type":"value"},{"name":"NTU=","optional":true,"description":"specifies the number of samples for each tuning phase for both Metropolis and Hamiltonian sampling schemes. For more information, see the SAMPLING= option. The default is 500.","help":"NTU=*number*","type":"value"},{"name":"OUTPOST=","optional":true,"description":"names the SAS data set to contain the posterior samples.","help":"OUTPOST=*SAS-data-set*","type":"dataSet"},{"name":"OUTPRIOR=","optional":true,"description":"names the SAS data set to contain the prior samples used to generate the prior predictive analysis when you request the prior predictive plots","help":"OUTPRIOR=*SAS-data-set*","type":"dataSet"},{"name":"PROPCOV=","optional":true,"description":"specifies the method used in constructing the initial covariance matrix for the Metropolis-Hastings algorithm. The QUANEW and NMSIMP methods find numerically approximated covariance matrices at the optimum of the posterior density function with respect to all continuous parameters. The tuning phase starts at the optimized values; in some problems, this can greatly increase convergence performance. If the approximated covariance matrix is not positive definite, then an identity matrix is used instead.","help":"PROPCOV=CONGRA | DBLDOG | NEWRAP | NMSIMP | NRRIDG | QUANEW | TRUREG","type":"choice","arguments":[{"name":"CONGRA","description":"performs a conjugate-gradient optimization.","type":"standalone"},{"name":"DBLDOG","description":"performs a version of double-dogleg optimization.","type":"standalone"},{"name":"NEWRAP","description":"performs a Newton-Raphson optimization that combines a line-search algorithm with ridging.","type":"standalone"},{"name":"NMSIMP","description":"performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NRRIDG","description":"performs a Newton-Raphson optimization with ridging.","type":"standalone"},{"name":"QUANEW","description":"performs a quasi-Newton optimization.","type":"standalone"},{"name":"TRUREG","description":"performs a trust-region optimization.","type":"standalone"}]},{"name":"SAMPLING=","optional":true,"description":"specifies how to sample from the posterior distribution.","help":"SAMPLING=*value*","type":"value","arguments":[{"name":"MODELMETROPOLIS","description":"implements a Metropolis sampling scheme on multiple blocks: one block for each model (all the parameters of the model) plus a block for all the correlation parameters across the models.","type":"standalone"},{"name":"MULTIMETROPOLIS","description":"implements a Metropolis sampling scheme on a single block that contains all the parameters of the model. SAMPLING=MULTIMETROPOLIS is the default option.","type":"standalone"},{"name":"UNIMETROPOLIS","description":"implements a Metropolis sampling scheme on multiple blocks, one for each parameter of the model.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"specifies an integer seed for the random number generator in the simulation. Specifying a seed enables you to reproduce identical Markov chains for the same specification. If you do not specify the SEED= option, or if you specify a nonpositive seed, a random seed is derived from the time of day.","help":"SEED=*number*","type":"value"},{"name":"SIMTIME","optional":true,"description":"prints the time required for the MCMC sampling.","type":"standalone"},{"name":"STATISTICS","optional":true,"aliases":["STATS"],"description":"controls the number of posterior statistics produced. Specifying STATISTICS=ALL is equivalent to specifying STATISTICS= (CORR COV INTERVAL PRIOR SUMMARY). If you do not want any posterior statistics, specify STATISTICS=NONE. The default is STATISTICS=(SUMMARY INTERVAL).","help":"STATISTICS                   <(global-options)> =                   ALL | \n                NONE | \n                keyword | \n                (keyword-list)","type":"standaloneOrValue","arguments":[{"name":"ALPHA=","description":"controls the probabilities of the credible intervals. The ALPHA= values must be between 0 and 1. Each ALPHA= value produces a pair of 100(1–ALPHA)% equal-tail and HPD intervals for each parameter. The default is ALPHA=0.05, which yields the 95% credible intervals for each parameter.","help":"ALPHA=*numeric-list*","type":"value"},{"name":"PERCENT=","description":"requests the percentile points of the posterior samples. The PERCENT= values must be between 0 and 100. The default is PERCENT=25, 50, 75, which yields the 25th, 50th, and 75th percentile points, respectively, for each parameter.","help":"PERCENT=*numeric-list*","type":"value"},{"name":"ALL","description":"equivalent to specifying STATISTICS= (CORR COV INTERVAL PRIOR SUMMARY).","type":"standalone"},{"name":"NONE","description":"suppresses all posterior statistics.","type":"standalone"},{"name":"CORR","description":"produces the posterior correlation matrix.","type":"standalone"},{"name":"COV","description":"produces the posterior covariance matrix.","type":"standalone"},{"name":"INTERVAL","description":"produces equal-tail credible intervals and HPD intervals. The default is to produce the 95% equal-tail credible intervals and 95% HPD intervals, but you can use the ALPHA= global-option to request intervals of any probabilities.","type":"standalone"},{"name":"NONE","description":"suppresses printing of all summary statistics.","type":"standalone"},{"name":"PRIOR","description":"produces a summary table of the prior distributions used in the Bayesian analysis.","type":"standalone"},{"name":"SUMMARY","description":"produces the means, standard deviations, and percentile points (25th, 50th, and 75th) for the posterior samples. You can use the global PERCENT= global-option to request specific percentile points.","type":"standalone"}]},{"name":"THINNING=","optional":true,"aliases":["THIN"],"description":"controls the thinning of the Markov chain.","help":"THINNING=*number*","type":"value"}]},{"name":"BOUNDS","description":"The BOUNDS statement imposes simple boundary constraints on the parameter estimates. BOUNDS statement constraints refer to the parameters estimated by the QLIM procedure. Any number of BOUNDS statements can be specified. Each bound is composed of parameters and constants and inequality operators. Parameters associated with regressor variables are referred to by the names of the corresponding regressor variables: item operator item < operator item < operator item ...> > Each item is a constant, the name of a parameter, or a list of parameter names. Each operator is ’<’, ’>’, ’≤’, or ’≥’.","help":"BOUNDS bound1 &lt; , bound2 ...&gt; "},{"name":"BY","description":"A BY statement can be used with PROC QLIM to obtain separate analyses on observations in groups defined by the BY variables.","help":"BY variables "},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the analysis. Classification variables can be either character or numeric.","help":"CLASS variables "},{"name":"ENDOGENOUS","description":"The ENDOGENOUS statement specifies the type of dependent variables that appear on the left-hand side of the equation. Endogenous variables listed refer to the dependent variables that appear on the left-hand side of the equation. Currently, no right-hand side endogeneity is handled in PROC QLIM. All variables appearing on the right-hand side of the equation are treated as exogenous","help":"ENDOGENOUS &lt;CENSORED &lt;(censored-options )&gt;&gt;&lt;DISCRETE &lt;(discrete-options)&gt;&gt;&lt;CENSORED &lt;(truncated-options )&gt;&gt; ...","arguments":[{"name":"CENSORED=","optional":true,"description":"Specifies that the endogenous variables in this statement be censored. Valid censored-options are as follows: LB=value or variable LOWERBOUND=value or variable specifies the lower bound of the censored variables. If value is missing or the value in variable is missing, no lower bound is set. By default, no lower bound is set.","help":"CENSORED=LB= | LOWERBOUND= | UB= | UPPERBOUND=","type":"choice","arguments":[{"name":"LB=","type":"value"},{"name":"LOWERBOUND=","type":"value"},{"name":"UB=","type":"value"},{"name":"UPPERBOUND=","type":"value"}]},{"name":"DISCRETE=","optional":true,"description":"Specifies that the endogenous variables in this statement are discrete. Valid discrete-options are as follows: ORDER=DATA | FORMATTED | FREQ | INTERNAL specifies the sorting order for the levels of the discrete variables specified in the ENDOGENOUS statement. DISTRIBUTION=NORMAL|LOGISTIC DIST=NORMAL|LOGISTIC D=NORMAL|LOGISTIC specifies the cumulative distribution function used to model the response probabilities. Valid values are as follows: NORMAL the normal distribution for the probit model","help":"DISCRETE=ORDER= | DISTRIBUTION= | DIST= | D=","type":"choice","arguments":[{"name":"ORDER=","type":"value"},{"name":"DISTRIBUTION=","type":"value"},{"name":"DIST=","type":"value"},{"name":"D=","type":"value"}]},{"name":"FRONTIER=","optional":true,"description":"Specifies that the endogenous variable in this statement follow a production or cost frontier. Valid frontier-options are as follows: TYPE=HALF | EXPONENTIAL | TRUNCATED HALF specifies half-normal model. EXPONENTIAL specifies exponential model. TRUNCATED specifies truncated normal model. PRODUCTION specifies that the model estimated be a production function.","help":"FRONTIER=TYPE= | PRODUCTION | COST","type":"choice","arguments":[{"name":"TYPE=","type":"value"},{"name":"PRODUCTION","type":"standalone"},{"name":"COST","type":"standalone"}]},{"name":"SELECT","optional":true,"description":"Specifies selection criteria for sample selection model. Select-option specifies the condition for the endogenous variable to be selected. It is written as a variable name, followed by an equality operator (=) or an inequality operator (<, >, ≤, ≥), followed by a number: variable operator number The variable is the endogenous variable that the selection is based on. The operator can be =, <, >, ≤ , or ≥. Multiple select-options can be combined with the logic operators: AND, OR. The following example illustrates the use of the SELECT option:","type":"standalone"},{"name":"TRUNCATED=","optional":true,"description":"Specifies that the endogenous variables in this statement be truncated. Valid truncated-options are as follows: LB=value or variable LOWERBOUND=value or variable specifies the lower bound of the truncated variables. If value is missing or the value in variable is missing, no lower bound is set. By default, no lower bound is set.","help":"TRUNCATED=LB= | LOWERBOUND= | UB= | UPPERBOUND=","type":"choice","arguments":[{"name":"LB=","type":"value"},{"name":"LOWERBOUND=","type":"value"},{"name":"UB=","type":"value"},{"name":"UPPERBOUND=","type":"value"}]}]},{"name":"FREQ","description":"The FREQ statement identifies a variable that contains the frequency of occurrence of each observation. PROC QLIM treats each observation as if it appears n times, where n is the value of the FREQ variable for the observation. If it is not an integer, the frequency value is truncated to an integer. If the frequency value is less than 1 or missing, the observation is not used in the model fitting. When the FREQ statement is not specified, each observation is assigned a frequency of 1. If you specify more than one FREQ statement, then the first FREQ statement is used.","help":"FREQ variable "},{"name":"HETERO","description":"The HETERO statement specifies variables that are related to the heteroscedasticity of the residuals and the way these variables are used to model the error variance.","help":"HETERO                 &lt;LINK=&lt;EXP | LINEAR&gt;&gt;&lt;NOCONST&gt;&lt;SQUARE&gt; ...","arguments":[{"name":"LINK=","optional":true,"followsDelimiter":"/","description":"The functional form can be specified using the LINK= option.","help":"LINK=EXP | LINEAR","type":"choice","arguments":[{"name":"EXP","followsDelimiter":"/","description":"Specifies a exponential link function.","type":"standalone"},{"name":"LINEAR","followsDelimiter":"/","description":"Specifies a linear link function.","type":"standalone"}]},{"name":"NOCONST","optional":true,"followsDelimiter":"/","description":"Specifies that there be no constant in the linear or exponential heteroscedasticity model.","type":"standalone"},{"name":"SQUARE","optional":true,"followsDelimiter":"/","description":"Estimates the model by using the square of linear heteroscedasticity function.","type":"standalone"}]},{"name":"INIT","description":"The INIT statement is used to set initial values for parameters in the optimization. Any number of INIT statements can be specified. Each initvalue is written as a parameter or parameter list, followed by an optional equality operator (=), followed by a number: parameter <=> number","help":"INIT initvalue1 &lt; , initvalue2 ...&gt; "},{"name":"MODEL","description":"The MODEL statement specifies the dependent variable and independent regressor variables for the regression model.","help":"MODEL &lt;BOXCOX (option-list )&gt;&lt;LIMIT1=value&gt;&lt;NOINT&gt; ...","arguments":[{"name":"BOXCOX","optional":true,"followsDelimiter":"/","description":"Specifies options that are used for Box-Cox regression or regressor transformation. For example, the Box-Cox regression is specified as: model y = x1 x2 / boxcox(y=lambda,x1 x2)","type":"standalone"},{"name":"LIMIT1=","optional":true,"followsDelimiter":"/","description":"Specifies the restriction of the threshold value of the first category when the ordinal probit or logit model is estimated. LIMIT1=ZERO is the default option. When LIMIT1=VARYING is specified, the threshold value is estimated.","help":"LIMIT1=*value*","type":"value"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Suppresses the intercept parameter.","type":"standalone"}]},{"name":"NLOPTIONS","description":"PROC QLIM uses the be nonlinear optimization (NLO) subsystem to perform nonlinear optimization tasks.","help":"NLOPTIONS &lt;ABSCONV= | ABSTOL=r&gt;&lt;ABSFCONV=r[n] | ABSFTOL=r[n&gt;&lt;ABSGCONV=r[n] | ABSGTOL=r[n&gt; ...","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion. The default value of r is the negative square root of the largest double-precision value, which serves only as a protection against overflows.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function convergence criterion. The default value is r=0. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. The default value is r=1E-5. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"ABSXCONV=","optional":true,"aliases":["ABSXTOL="],"description":"Specifies the absolute parameter convergence criterion. The default is r=1E-8 for the NMSIMP technique and r=0 otherwise. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can terminate.","type":"value"},{"name":"DAMPSTEP=","optional":true,"description":"Specifies that the initial step length value a⁰ for each line search (used by the QUANEW, HYQUAN, CONGRA, or NEWRAP technique) cannot be larger than r times the step length value used in the former iteration. If the DAMPSTEP option is specified but r is not specified, the default is r=2. The DAMPSTEP=r option can prevent the line-search algorithm from repeatedly stepping into regions where some objective functions are difficult to compute or where they could lead to floating point overflows during the computation of objective functions and their derivatives. The DAMPSTEP=r option can save time-costly function calls during the line searches of objective functions that result in very small steps.","type":"value"},{"name":"FCONV2=","optional":true,"aliases":["FTOL2="],"description":"Specifies another function convergence criterion.","type":"value"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies a relative function convergence criterion.","type":"value"},{"name":"FSIZE=","optional":true,"description":"Specifies the FSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"FSIZE=*r*","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies a relative gradient convergence criterion. The default value is r=1E-8. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can terminate.","type":"value"},{"name":"HESCAL=","optional":true,"aliases":["HS="],"description":"Specifies the scaling version of the Hessian matrix used in NRRIDG, TRUREG, NEWRAP, or DBLDOG optimization.","help":"HESCAL=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","description":"Specifies that no scaling is done.","type":"standalone"},{"name":"1","description":"Specifies the Moré (1978) scaling update","type":"standalone"},{"name":"2","description":"Specifies the Dennis, Gay, and Welsch (1981) scaling update","type":"standalone"},{"name":"3","description":"Specifies that di is reset in each iteration","type":"standalone"}]},{"name":"INHESSIAN=","optional":true,"aliases":["INHESS="],"description":"Specifies how the initial estimate of the approximate Hessian is defined for the quasi-Newton techniques QUANEW and DBLDOG.","type":"value"},{"name":"INSTEP=","optional":true,"description":"Reduces the length of the first trial step during the line search of the first iterations.","help":"INSTEP=*r*","type":"value"},{"name":"LINESEARCH=","optional":true,"aliases":["LIS="],"description":"Specifies the line-search method for the CONGRA, QUANEW, and NEWRAP optimization techniques.","help":"LINESEARCH=1 | 2 | 3 | 4 | 5 | 6 | 7 | 8","type":"choice","arguments":[{"name":"1","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is similar to one used by the Harwell subroutine library.","type":"standalone"},{"name":"2","description":"Specifies a line-search method that needs more function calls than gradient calls for quadratic and cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"3","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"4","description":"Specifies a line-search method that needs the same number of function and gradient calls for stepwise extrapolation and cubic interpolation","type":"standalone"},{"name":"5","description":"Specifies a line-search method that is a modified version of LIS=4.","type":"standalone"},{"name":"6","description":"Specifies golden section line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"7","description":"Specifies bisection line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"8","description":"Specifies Armijo line-search technique (Polak 1971), which uses only function values for linear approximation.","type":"standalone"}]},{"name":"LSPRECISION=","optional":true,"aliases":["LSP="],"description":"Specifies the degree of accuracy that should be obtained by the line-search algorithms LIS=2 and LIS=3. The default LSPRECISION= values are:","type":"value"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Requires the number of function calls to be no larger than i. The default values are:","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Requires the number of iterations to be no larger than i. The default values are: o For TECH= TRUREG, NRRIDG, NEWRAP: i=50 o For TECH= QUANEW, DBLDOG: i=200 o For TECH= CONGRA: i=400 o For TECH= NMSIMP: i=1000 These default values are also valid when i is specified as a missing value.","type":"value"},{"name":"MAXSTEP=","optional":true,"description":"Specifies an upper bound for the step length of the line-search algorithms during the first n iterations.","help":"MAXSTEP=*r[n*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Requires the CPU time to be no larger than r. The default value of the MAXTIME= option is the largest double floating-point number on your computer. Note that the time specified by the MAXTIME= option is checked only once at the end of each iteration. Therefore, the actual running time can be much longer than that specified by the MAXTIME= option. The actual running time includes the rest of the time needed to finish the iteration and the time needed to generate the output of the results.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0. If you request more iterations than are actually needed for convergence to a stationary point, the optimization algorithms can behave strangely. For example, the effect of rounding errors can prevent the algorithm from continuing for the required number of iterations.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the output.","type":"standalone"},{"name":"PALL","optional":true,"description":"[Displays all optional output for optimization.","type":"standalone"},{"name":"PHISTORY","optional":true,"description":"Displays the optimization history.","type":"standalone"},{"name":"PHISTPARMS","optional":true,"description":"Display parameter estimates in each iteration.","type":"standalone"},{"name":"PINIT","optional":true,"description":"Displays the initial values and derivatives (if available).","type":"standalone"},{"name":"PSHORT","optional":true,"description":"Restricts the amount of default output.","type":"standalone"},{"name":"PSUMMARY","optional":true,"description":"Restricts the amount of default displayed output to a short form of iteration history and notes, warnings, and errors.","type":"standalone"},{"name":"RESTART=","optional":true,"aliases":["REST="],"description":"Specifies that the QUANEW or CONGRA algorithm is restarted with a steepest descent/ascent search direction after, at most, i iterations, i > 0.","type":"value"},{"name":"SOCKET=","optional":true,"description":"Specifies the fileref that contains the information needed for remote monitoring.","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH="],"description":"Specifies the optimization technique.","help":"TECHNIQUE=CONGRA | DBLDOG | NMSIMP | NEWRAP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Chooses one of four different conjugate-gradient optimization algorithms, which can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization, which uses the gradient to update an approximation of the Cholesky factor of the Hessian.","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NEWRAP","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. The algorithm combines a line-search algorithm with ridging, and it can be modified with the LINESEARCH= option.","type":"standalone"},{"name":"NRRIDG","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. This algorithm does not perform a line search.","type":"standalone"},{"name":"QUANEW","description":"Chooses one of four different quasi-Newton optimization algorithms that can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"TRUREG","description":"Performs a usually very stable but, for large problems, memory- and time-consuming trust-region optimization technique. The algorithm is implemented similar to Gay (1983) and Moré and Sorensen (1983).","type":"standalone"},{"name":"NONE","description":"Does not perform any optimization. This option is similar to METHOD=NONE, but TECH=NONE also computes and displays residuals and goodness of fit statistics.","type":"standalone"}]},{"name":"UPDATE=","optional":true,"aliases":["UPD="],"description":"Specifies the update method for the quasi-Newton, double-dogleg, or conjugate-gradient optimization technique.","help":"UPDATE=BFGS | DBFGS | DDFP | DFP | PB | FR | PR | CD","type":"choice","arguments":[{"name":"BFGS","description":"Performs the original Broyden, Fletcher, Goldfarb, and Shanno (BFGS) update of the inverse Hessian matrix.","type":"standalone"},{"name":"DBFGS","description":"Performs the dual BFGS update of the Cholesky factor of the Hessian matrix. This is the default update method.","type":"standalone"},{"name":"DDFP","description":"Performs the dual Davidon, Fletcher, and Powell (DFP) update of the Cholesky factor of the Hessian matrix.","type":"standalone"},{"name":"DFP","description":"Performs the original DFP update of the inverse Hessian matrix.","type":"standalone"},{"name":"PB","description":"Performs the automatic restart update method of Powell (1977) and Beale (1972).","type":"standalone"},{"name":"FR","description":"Performs the Fletcher-Reeves update (Fletcher 1987).","type":"standalone"},{"name":"PR","description":"Performs the Polak-Ribiere update (Fletcher 1987).","type":"standalone"},{"name":"CD","description":"Performs a conjugate-descent update of Fletcher (1987).","type":"standalone"}]},{"name":"XCONV=","optional":true,"aliases":["XTOL="],"description":"Specifies the relative parameter convergence criterion. For all techniques except NMSIMP, termination requires a small relative parameter change in subsequent iterations. The default value is r=1E-8 for the NMSIMP technique and r=0 otherwise. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"XSIZE=","optional":true,"description":"Specifies the XSIZE parameter of the relative parameter termination criterion. The default value is r=0.","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set containing all variables in the input data set and, optionally, the estimates of x'β, predicted value, residual, marginal effects, probability, standard deviation of the error, expected value, conditional expected value, and inverse Mills ratio. When the response values are missing for the observation, all output estimates except residual are still computed as long as none of the explanatory variables is missing. This enables you to compute these statistics for prediction. You can specify only one OUTPUT statement.","help":"OUTPUT &lt;CONDITIONAL&gt;&lt;ERRSTD&gt;&lt;OUT=SAS-data-set&gt; ...","arguments":[{"name":"CONDITIONAL","optional":true,"description":"Output estimates of conditional expected values of continuous endogenous","type":"standalone"},{"name":"ERRSTD","optional":true,"description":"Output estimates of σ-j, the standard deviation of the error term.","type":"standalone"},{"name":"EXPECTED","optional":true,"description":"Output estimates of expected values of continuous endogenous variables.","type":"standalone"},{"name":"MARGINAL","optional":true,"description":"Output marginal effects.","type":"standalone"},{"name":"MILLS","optional":true,"description":"Output estimates of inverse Mills ratios of censored or truncated continuous, binary discrete, and selection endogenous variables.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Names the output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PREDICTED","optional":true,"description":"Output estimates of predicted endogenous variables.","type":"standalone"},{"name":"PROB","optional":true,"description":"Output estimates of probability of discrete endogenous variables taking the current observed responses.","type":"standalone"},{"name":"PROBALL","optional":true,"description":"Output estimates of probability of discrete endogenous variables for all possible responses.","type":"standalone"},{"name":"RESIDUAL","optional":true,"description":"Output estimates of residuals of continuous endogenous variables.","type":"standalone"},{"name":"TE1","optional":true,"description":"Outputs estimates of technical efficiency for each producer in the stochastic frontier model suggested by Battese and Coelli (1988).","type":"standalone"},{"name":"TE2","optional":true,"description":"Outputs estimates of technical efficiency for each producer in the stochastic frontier model suggested by Jondrow et al. (1982).","type":"standalone"},{"name":"XBETA","optional":true,"description":"Output estimates of x'β.","type":"standalone"}]},{"name":"PRIOR","description":"The PRIOR statement specifies the prior distribution of the model parameters. You must specify a single parameter or a list of parameters, a tilde ~, and then a distribution with its parameters. Alternately, you can specify the special keyword REGRESSORS to select all the parameters used in the linear regression component of the model. Multiple PRIOR statements are allowed.","help":"PRIOR *parameter-list*  ~                   *distribution* | _REGRESSORS;","arguments":[{"name":"parameter-list","placeholder":true,"description":"one or more parameters.","type":"value"},{"name":"distribution","placeholder":true,"description":"Distributions can include NORMAL(MEAN=μ VAR=σ2), GAMMA(SHAPE=a, SCALE=b), SQGAMMA(SHAPE=a, SCALE=b), IGAMMA(SHAPE=a, SCALE=b), SQIGAMMA(SHAPE=a, SCALE=b) UNIFORM(MIN=m, MAX=M), BETA(SHAPE1=a, SHAPE2=b, MIN=m, MAX=M),T(LOCATION=μ, DF=ν)","type":"value"},{"name":"_REGRESSORS","description":"select all the parameters used in the linear regression component of the model.","type":"standalone"}]},{"name":"RANDOM","description":"The RANDOM statement defines the regressors of the model, including the intercept, that have random coefficients in a random-parameters model. If you have a panel data set, you can use the RANDOM statement to estimate random-parameters models that include binomial probit, binomial logit, ordinal probit, ordinal logit, linear regression, Tobit, truncated regression, and stochastic frontier models. You do not have to have the observations collected in a panel data setting to model the parameter heterogeneity. Random-parameters models can also be applied to cross-sectional data. You can specify only a single RANDOM statement, and if you specify a RANDOM statement, you can specify only one MODEL statement. The RANDOM statement is not supported if a BAYES statement is also specified.","help":"RANDOM *regressors*&lt; /                 *options*&gt; ;","arguments":[{"name":"SUBJECT=","optional":true,"followsDelimiter":"/","aliases":["S"],"description":"determines the variable that specifies the ID of the individuals or groups across which the parameter heterogeneity occurs. In panel data, the variable identifies the cross-sectional units. For example, in panel data, the variable might be household or country. If you do not specify this option, then variable is assumed to have a single realization; that is, there is no variation in the random effects. You should specify this option in order to have a true random-parameters model.","help":"SUBJECT=*variable*","type":"value"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","aliases":["M"],"description":"specifies the method of approximation to the integral that appears in the likelihood function.","help":"METHOD=HALTON                       <(halton-options)> | \n                HERMITE                     <(QPOINTS=value)> | \n                SIMULATION                       <(simulation-options)>","type":"choice","arguments":[{"name":"HALTON","followsDelimiter":"/","aliases":["HALT","QMC"],"description":"requests a quasi–Monte Carlo integration method that uses the Halton sequences that are defined by the prime numbers starting from 2.","help":"HALTON                       &lt;(*halton-options*)&gt;","type":"standaloneOrValue","arguments":[{"name":"NDRAW=","followsDelimiter":"/","description":"determines the number of elements that the Halton series has for each unique value of the subject variable. Therefore, the total number of elements in the Halton sequence is value times the number of unique values of the variable that you specify in the SUBJECT= option. For more information, see the section QMC Method Using the Halton Sequence. The default value of the NDRAW= option is the number of unique values of the variable that you specify in the SUBJECT= option. For example, if you have a panel data set, the total number of terms in the Halton sequence is the square of the number of cross sections.","help":"NDRAW=*value*","type":"value"},{"name":"START=","followsDelimiter":"/","description":"specifies the starting point of the Halton sequence, where value must be a positive integer. When you specify this option, value–1 extra draws are created and the initial value–1 elements are discarded. By default, START=11.","help":"START=*value*","type":"value"}]},{"name":"HERMITE","followsDelimiter":"/","aliases":["HERM","GAUSS"],"description":"requests the Gauss-Hermite quadrature integration method. You can use this method if your model has only one random parameter—that is, if you have a random-effects model or if your model has a single random coefficient. For more information about this method, see the section Approximation by Hermite Quadrature.QPOINTS=value specifies the number of quadrature points to be used during evaluation of the integral. By default, QPOINTS=20.","help":"HERMITE                       &lt;(QPOINTS=*value*)&gt;","type":"standaloneOrValue"},{"name":"SIMULATION","followsDelimiter":"/","aliases":["SIM"],"description":"requests Monte Carlo simulation as the method of integration.","help":"SIMULATION                       &lt;(*simulation-options*)&gt;","type":"standaloneOrValue","arguments":[{"name":"NDRAW=","followsDelimiter":"/","description":"specifies the number of draws for the simulation. You can also specify the number of draws in the NDRAW= option in the PROC QLIM statement. If you specify this option in both statements, PROC QLIM uses the value in the RANDOM statement.","help":"NDRAW=*value*","type":"value"},{"name":"SEED=","followsDelimiter":"/","description":"specifies the seed of the random draws, where value must be less than 231 - 1. You can also specify the seed in the SEED= option in the PROC QLIM statement. If you specify this option in both statements, PROC QLIM uses the value in the RANDOM statement. If you do not specify a seed, or if you specify a value less than or equal to zero, the seed is generated randomly.","help":"SEED=*value*","type":"value"}]}]},{"name":"NOCORRELATION","optional":true,"followsDelimiter":"/","aliases":["NOCORR"],"description":"requests that the random parameters be uncorrelated with one another. If you specify this option, only the diagonal elements of the covariance matrix of the random parameters are estimated.","type":"standalone"}]},{"name":"RESTRICT","description":"The RESTRICT statement is used to impose linear restrictions on the parameter estimates. Any number of RESTRICT statements can be specified, but the number of restrictions imposed is limited by the number of regressors. Each restriction is written as an expression, followed by an equality operator (=) or an inequality operator (<, >, ≤, ≥), followed by a second expression: expression operator expression The operator can be =, <, >, ≤ , or ≥. The operator and second expression are optional.","help":"RESTRICT restriction1 &lt;, restriction2 ...&gt; "},{"name":"TEST","description":"The TEST statement performs Wald, Lagrange multiplier, and likelihood ratio tests of linear hypotheses about the regression parameters in the preceding MODEL statement. Each equation specifies a linear hypothesis to be tested. All hypotheses in one TEST statement are tested jointly. Variable names in the equations must correspond to regressors in the preceding MODEL statement, and each name represents the coefficient of the corresponding regressor. The keyword INTERCEPT refers to the coefficient of the intercept.","help":"TEST &lt;ALL&gt;&lt;LM&gt;&lt;WALD&gt; ...","arguments":[{"name":"ALL","optional":true,"followsDelimiter":"/","description":"Requests Wald, Lagrange multiplier, and likelihood ratio tests.","type":"standalone"},{"name":"LM","optional":true,"followsDelimiter":"/","description":"Requests the Lagrange multiplier test.","type":"standalone"},{"name":"LR","optional":true,"followsDelimiter":"/","description":"Requests the likelihood ratio test.","type":"standalone"},{"name":"WALD","optional":true,"followsDelimiter":"/","description":"Requests the Wald test.","type":"standalone"}]},{"name":"WEIGHT","description":"The WEIGHT statement specifies a variable to supply weighting values to use for each observation in estimating parameters. The log likelihood for each observation is multiplied by the corresponding weight variable value. If the weight of an observation is nonpositive, that observation is not used in the estimation.","help":"WEIGHT variable "}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"latest","docsetTargetFile":"etsug_qlim_toc.htm"}}