{"name":"QTRSELECT","statements":[{"name":"PROC QTRSELECT","description":"The QTRSELECT procedure fits and performs model selection for quantile regression models in SAS Viya. Quantile regression uses a linear function model to fit the quantiles of a response variable conditional on the explanatory variables. The model does not assume a particular parametric distribution for the response. The models that PROC QTRSELECT supports can contain main effects that consist of both continuous and classification variables and interaction effects of these variables. The models can also include constructed effects such as splines. The procedure offers a number of effect-selection methods, including stepwise methods. It also offers extensive capabilities for customizing the model selection by using a wide variety of selection and stopping criteria, including significance-level-based criteria, information criteria, and modern validation-based criteria. PROC QTRSELECT also provides a variety of quantile regression diagnostics that are conditional on the selected model.","help":"PROC QTRSELECT <ALPHA=number> <COV=SPARSITY> <DATA=CAS-libref.data-table> <NOCLPRINT<=number>>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <DESCENDING> <MISSING> <ORDER=<FORMATTED | FREQ | INTERNAL>> ...; \n   \n\tCODE <COMMENT> <FILE=filename> <FORMATWIDTH=width> ...; \n   \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...; \n   \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...; \n   \n\tEFFECT <DETAILS> EFFECT-NAME=COLLECTION|MULTIMEMBER|MM|POLYNOMIAL|POLY...  <NOEFFECT> ...;     \n\tMODEL <CLB> <INCLUDE=n | INCLUDE=single-effect | INCLUDE=(effects)> <INFORMATIVE> ...; \n   \n\tOUTPUT <COPYVAR=variable | COPYVARS=(variables)> <OUT=CAS-libref.data-table> <PREDICTED<=name> | PRED<=name> | P<=name>> ...; \n   \n\tPARTITION <FRACTION(< TEST=fraction > < VALIDATE=fraction > < SEED=number >)> <ROLE=|ROLEVAR=variable (< TEST='value' > < TRAIN='value' > < VALIDATE='value' >)> ; \n   \n\tSELECTION <ADAPTIVE <(GAMMA=nonnegative number)>> <CHOOSE=<AIC | AICC | SBC>> <METHOD=<BACKWARD | FORWARD | FORWARDSWAP>... > ...; \n   \n\tWEIGHT variable; ","arguments":[{"name":"ALPHA=","optional":true,"description":"Sets the significance level to be used for the construction of confidence intervals. The value must be between 0 and 1; the default value of 0.05 results in 95% intervals. This option affects the keywords LCLM, UCLM, and STDP in the OUTPUT statement and the CLB option in the MODEL statement.","help":"ALPHA=*number*","type":"value"},{"name":"COV=","optional":true,"description":"Specifies the sparsity-function bandwidth method for estimating the covariance matrix of the parameter estimates. You can specify the following suboptions: BF uses the Bofinger bandwidth method. HS uses the Hall-Sheather bandwidth method.","help":"COV=SPARSITY","type":"choice","arguments":[{"name":"SPARSITY","description":"Syntax: COV=SPARSITY<(BF | HS)> You can specify the following suboptions: BF uses the Bofinger bandwidth method. HS uses the Hall-Sheather bandwidth method.","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC QTRSELECT to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the \"Class Level Information\" table if you do not specify number. If you specify number, the values of the classification variables are displayed only for variables whose number of levels is less than number.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement in PROC QTRSEKECT to obtain separate analyses of observations in groups that are defined by the values of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis. You can list the response variable for binary models in the CLASS statement, but this is not required.","help":"CLASS &lt;DESCENDING&gt; &lt;MISSING&gt; &lt;ORDER=&lt;FORMATTED | FREQ | INTERNAL&gt;&gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sort order of the classification variable. If both the DESCENDING and ORDER= options are specified, the procedure orders the categories according to the ORDER= option and then reverses that order.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (\".\", \".A\", …, \".Z\" for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sort order for the levels of classification variables. This ordering determines which parameters in the model correspond to each level in the data.","help":"ORDER=FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"FORMATTED","followsDelimiter":"/","description":"External formatted values, except for numeric variables that have no explicit format, which are sorted by their unformatted (internal) values. The sort order is machine-dependent. For numeric variables for which you have supplied no explicit format, the levels are ordered by their internal values.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Descending frequency count (levels that have more observations come earlier in the order).","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Unformatted value. The sort order is machine-dependent.","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | GLM | ORDINAL | POLYNOMIAL | REFERENCE | ORTHEFFECT | ORTHORDINAL | ORTHPOLY | ORTHREF","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Specifies effect coding.","type":"standalone"},{"name":"GLM","followsDelimiter":"/","description":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","type":"standalone"},{"name":"ORDINAL","followsDelimiter":"/","aliases":["THERMOMETER"],"description":"Specifies the cumulative parameterization for an ordinal CLASS variable.","type":"standalone"},{"name":"POLYNOMIAL","followsDelimiter":"/","aliases":["POLY"],"description":"Specifies polynomial coding.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","aliases":["REF"],"description":"Specifies reference-cell coding.","type":"standalone"},{"name":"ORTHEFFECT","followsDelimiter":"/","description":"Orthogonalizes PARAM=EFFECT.","type":"standalone"},{"name":"ORTHORDINAL","followsDelimiter":"/","aliases":["ORTHOTHERM"],"description":"Orthogonalizes PARAM=ORDINAL.","type":"standalone"},{"name":"ORTHPOLY","followsDelimiter":"/","description":"Orthogonalizes PARAM=POLYNOMIAL.","type":"standalone"},{"name":"ORTHREF","followsDelimiter":"/","description":"Orthogonalizes PARAM=REFERENCE.","type":"standalone"}]},{"name":"REF=","optional":true,"followsDelimiter":"/","aliases":["REFERENCE="],"description":"Specifies the reference level that is used when you specify a nonsingular parameterization.","help":"REF=&lt;'*level*'&gt; | FIRST | LAST","type":"choice","arguments":[{"name":"'level'","placeholder":true,"followsDelimiter":"/","description":"The level of the variable to use as the reference level. Specify the formatted value of the variable if a format is assigned. Replace <level> with an actual value.","type":"value"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first ordered level as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last ordered level as reference.","type":"standalone"}]},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"Specifies that design matrix columns that correspond to any effect that contains a split classification variable can be selected to enter or leave a model independently of the other design columns of that effect.","type":"standalone"}]},{"name":"CODE","description":"The CODE statement writes SAS DATA step code for computing predicted values of the fitted model either to a file or to a catalog entry. This code can then be included in a DATA step to score new data.","help":"CODE &lt;COMMENT&gt; &lt;FILE=filename&gt; &lt;FORMATWIDTH=width&gt; ...","arguments":[{"name":"COMMENT","optional":true,"description":"Adds comments to the generated code.","type":"standalone"},{"name":"FILE=","optional":true,"description":"Names the external file that saves the generated code. When enclosed in a quoted string (for example, FILE=\"c:nmydirnscorecode.sas\"), this option specifies the path and filename for writing the code to an external file. If you do not specify a path but your SAS client has a default path, then the code is written to an external file named filename at that location. You can also specify an unquoted filename of no more than eight characters. If the filename is assigned as a fileref in a Base SAS FILENAME statement, the file specified in the FILENAME statement is opened; otherwise, if your SAS client has a default path, an external file named filename is created..","help":"FILE=*filename*","type":"value"},{"name":"FORMATWIDTH=","optional":true,"description":"Specifies the width to use in formatting derived numbers such as parameter estimates. You can specify a value in the range 4 to 32; the default is 20.","help":"FORMATWIDTH=*width*","type":"value"},{"name":"INDENTSIZE=","optional":true,"description":"Specifies the number of spaces to indent the generated code. You can specify a value in the range 0 to 10; the default is 3.","help":"INDENTSIZE=*n*","type":"value"},{"name":"LABELID=","optional":true,"description":"Specifies a number used to construct array names and statement labels in the generated code. You can specify a value in the range 0 to 1024; the default is randomly chosen.","help":"LABELID=*value*","type":"value"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the line size for the generated code. You can specify a value in the range 64 to 254; the default is 120.","type":"value"},{"name":"NOTRIM","optional":true,"description":"Bases comparisons of formatted values on the full format width, including blank padding. By default, blanks at the beginning and end of strings are ignored.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates a CAS table that contains the score code. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates the CAS output tables on all nodes.","type":"standalone"}]},{"name":"EFFECT","description":"The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects that are formed from continuous or classification variables.","help":"EFFECT &lt;DETAILS&gt; EFFECT-NAME=COLLECTION|MULTIMEMBER|MM|POLYNOMIAL|POLY...  &lt;NOEFFECT&gt; ...","arguments":[{"name":"EFFECT-NAME=","description":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set.","help":"*EFFECT-NAME*=COLLECTION | MULTIMEMBER | POLYNOMIAL | SPLINE","type":"value","arguments":[{"name":"COLLECTION","description":"Is a collection effect that defines one or more variables as a single effect with multiple degrees of freedom. The variables in a collection are considered as a unit for estimation and inference. Option(s) available (specified after a slash (/) following the variable list): DETAILS Displays the constituents of the collection effect","type":"standalone"},{"name":"MULTIMEMBER","aliases":["MM"],"description":"Is a multimember classification effect whose levels are determined by one or more variables that appear in a CLASS statement. Options available (specified after a slash (/) following the variable list): NOEFFECT Specifies that observations with all missing levels for the multimember variables should have zero values in the corresponding design matrix columns STDIZE Standardizes the design matrix entries so that each observation has a sum of 1 WEIGHT= Specifies the weight variable for the contributions of each of the classification effects","type":"standalone"},{"name":"POLYNOMIAL","aliases":["POLY"],"description":"Is a multivariate polynomial effect in the specified numeric variables. Options available (specified after a slash (/) following the variable list): DEGREE= Specifies the degree of the polynomial DETAILS Displays details of the specified polynomial MDEGREE= Specifies the maximum degree of any variable in a term of the polynomial NOSEPARATE Treats the polynomial as a single effect with multiple degrees of freedom STANDARDIZE= Specifies centering and scaling suboptions for the variables that define the polynomial","type":"standalone"},{"name":"SPLINE","description":"Is a regression spline effect whose columns are univariate spline expansions of one or more variables. A spline expansion replaces the original variable with an expanded or larger set of new variables. Options available (specified after a slash (/) following the variable list): BASIS= Specifies the type of basis (B-spline basis or truncated power function basis) for the spline expansion DATABOUNDARY Uses the extremes of the data as boundary knots for a B-spline basis DEGREE= Specifies the degree of the spline transformation DETAILS Displays the knots and locations for each spline basis function KNOTMAX= Requests equally spaced right-side boundary knots starting at the variables’ maximum and ending at the KNOTMAX= value KNOTMETHOD= Specifies how to construct the knots for spline effects KNOTMIN= Requests equally spaced left-side boundary knots starting at the KNOTMIN= value and ending at the variables’ minimum value NATURALCUBIC Specifies a natural cubic spline basis for the spline effect SEPARATE Treats the spline basis for each variable as a separate effect when multiple variables are specified SPLIT Treats each design matrix column as a separate effect for selection methods","type":"standalone"}]},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NATURALCUBIC","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Uses a natural cubic spline basis for the spline expansion. Natural cubic splines, also known as restricted cubic splines, are cubic splines that are constrained to be linear beyond the extreme knots.","type":"standalone"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"}]},{"name":"MODEL","description":"The MODEL statement names the dependent variable and the explanatory effects, including covariates, main effects, interactions, and nested effects. If you omit the explanatory effects, the procedure fits an intercept-only model.","help":"MODEL &lt;CLB&gt; &lt;INCLUDE=n | INCLUDE=single-effect | INCLUDE=(effects)&gt; &lt;INFORMATIVE&gt; ...","arguments":[{"name":"CLB","optional":true,"description":"Requests the 100(1-α)% upper and lower confidence limits for the parameter estimates. By default, the 95% limits are computed; you can use the ALPHA= option in the PROC QTRSELECT statement to change the α level.","type":"standalone"},{"name":"INCLUDE=","optional":true,"description":"Forces effects to be included in all models. If you specify INCLUDE=n, then the first n effects listed in the MODEL statement are included in all models. If you specify INCLUDE=single-effect or INCLUDE=(single-effect), then the specified effects are forced into all models.","type":"value"},{"name":"INFORMATIVE","optional":true,"description":"Models missing values by using extra model effects. These effects consist of dummy variables that take the value 1 when the value of a continuous model variable involved in the effect is missing, and take the value 0 otherwise. The missing value in the original model effect is replaced by the average value of the effect for the nonmissing values.","type":"standalone"},{"name":"NOINT","optional":true,"description":"Suppresses the intercept term that is otherwise included in the model.","type":"standalone"},{"name":"QUANTILES=","optional":true,"aliases":["QUANTILE"],"description":"Syntax: QUANTILES<(quantile-level-options)><=number-list> | QUANTILE<(quantile-level-options)><=number-list> | Q<(quantile-level-options)><=number-list> Specifies the quantile levels for the quantile regression. You can request any values of quantile levels in (0,1) by specifying a number-list. By default, the QTRSELECT procedure uses QUANTILES=0.5, which corresponds to median regression.","help":"QUANTILES=NTAU= | NQ= | SORT","type":"choice","arguments":[{"name":"NTAU=","type":"value"},{"name":"NQ=","type":"value"},{"name":"SORT","type":"standalone"}]},{"name":"START=","optional":true,"description":"Begins the selection process in the FORWARD and STEPWISE selection methods from the initial model that you designate. If you specify START=n, then the starting model consists of the first n effects listed in the MODEL statement. If you specify START=single-effect or START=(single-effect), then the starting model consists of these specified effects.","type":"value"},{"name":"STB","optional":true,"description":"Produces standardized regression coefficients. A standardized regression coefficient is computed by dividing a parameter estimate by the ratio of the sample standard deviation of the dependent variable to the sample standard deviation of the regressor.","type":"standalone"}]},{"name":"OUTPUT","description":"","help":"OUTPUT &lt;COPYVAR=variable | COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; &lt;PREDICTED&lt;=name&gt; | PRED&lt;=name&gt; | P&lt;=name&gt;&gt; ...","arguments":[{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Copies one or more variables from the input data table to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC QTRSELECT to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where CAS-libref refers to a collection of information that is defined in the LIBNAME statement and includes the caslib, which includes a path to where the data table is to be stored, and a session identifier, which defaults to the active session but which can be explicitly defined in the LIBNAME statement.","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"PREDICTED","optional":true,"aliases":["PRED","P"],"description":"Requests predicted values for each response. The default prefix is Pred.","type":"standalone"},{"name":"RESIDUAL","optional":true,"aliases":["RESID"],"description":"Requests residuals for each predictor. The default prefix is XResid.","type":"standalone"},{"name":"ROLE","optional":true,"description":"Requests numeric values that indicate the role played by each observation in fitting the model. The default prefix is _ROLE_.","type":"standalone"}]},{"name":"PARTITION","description":"The PARTITION statement specifies how observations in the input data set are logically partitioned into disjoint subsets for model training, validation, and testing.","help":"PARTITION &lt;FRACTION(&lt; TEST=fraction &gt; &lt; VALIDATE=fraction &gt; &lt; SEED=number &gt;)&gt; &lt;ROLE=|ROLEVAR=variable (&lt; TEST='value' &gt; &lt; TRAIN='value' &gt; &lt; VALIDATE='value' &gt;)&gt; ","arguments":[{"name":"FRACTION=","optional":true,"description":"Randomly assigns specified proportions of the observations in the input data table to the roles. You specify the proportions for testing and validation by using the TEST= and VALIDATE= suboptions. If you specify both the TEST= and VALIDATE= suboptions, then the sum of the specified fractions must be less than 1 and the remaining fraction of the observations are assigned to the training role. The SEED= option specifies an integer that is used to start the pseudorandom number generator for random partitioning of data for training, testing, and validation. If you do not specify SEED=number or if number is less than or equal to 0, the seed is generated by reading the time of day from the computer’s clock.","help":"FRACTION=VALIDATE= | TEST= | SEED=","type":"choice","arguments":[{"name":"VALIDATE=","type":"value"},{"name":"TEST=","type":"value"},{"name":"SEED=","type":"value"}]},{"name":"ROLE=","optional":true,"aliases":["ROLEVAR="],"description":"Names the variable in the input data table whose values are used to assign roles to each observation. This variable cannot also appear as an analysis variable in other statements or options. The TEST=, TRAIN=, and VALIDATE= suboptions specify the formatted values of this variable that are used to assign observation roles. If you do not specify the TRAIN= suboption, then all observations whose role is not determined by the TEST= or VALIDATE= suboption are assigned to the training role.","help":"ROLE=TRAIN= | VALIDATE= | TEST=","type":"choice","arguments":[{"name":"TRAIN=","type":"value"},{"name":"VALIDATE=","type":"value"},{"name":"TEST=","type":"value"}]}]},{"name":"SELECTION","description":"The SELECTION statement performs model selection by examining whether effects should be added to or removed from the model according to rules that are defined by model selection methods.","help":"SELECTION &lt;ADAPTIVE &lt;(GAMMA=nonnegative number)&gt;&gt; &lt;CHOOSE=&lt;AIC | AICC | SBC&gt;&gt; &lt;METHOD=&lt;BACKWARD | FORWARD | FORWARDSWAP&gt;... &gt; ...","arguments":[{"name":"ADAPTIVE=","optional":true,"description":"Applies adaptive weights to each of the coefficients when METHOD=LASSO. Ordinary least squares estimates of the model parameters are used to form the adaptive weights. You use the GAMMA= option to specify the power transformation that is applied to the parameters in forming the adaptive weights. By default, GAMMA=1.","help":"ADAPTIVE=GAMMA=","type":"choice","arguments":[{"name":"GAMMA=","type":"value"}]},{"name":"CHOOSE=","optional":true,"description":"Chooses from the list of models (at each step of the selection process) the model that yields the best value of the specified criterion.","help":"CHOOSE=AIC | AICC | SBC*criterion*","type":"value","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"AICC","description":"Specifies the corrected Akaike’s information criterion.","type":"standalone"},{"name":"SBC","description":"Specifies the Schwarz Bayesian information criterion.","type":"standalone"}]},{"name":"COMPETITIVE","optional":true,"description":"[method-option to be enclosed in parenthesis] Is applicable as a method-option only when METHOD=STEPWISE. If you specify the COMPETITIVE option, then the SELECT= criterion is evaluated for all models in which an effect currently in the model is dropped or an effect not yet in the model is added.","type":"standalone"},{"name":"DETAILS=","optional":true,"description":"Specifies the level of detail to be produced about the selection process. The default is DETAILS= SUMMARY.","help":"DETAILS=SUMMARY | STEPS | ALL | NONE","type":"choice","arguments":[{"name":"SUMMARY","description":"Produces a summary table that shows the effect that is added or removed at each step along with the criteria specified in the SELECT=, CHOOSE=, and STOP= method-options. The summary table is produced by default if you do not specify the DETAILS= option.","type":"standalone"},{"name":"STEPS","description":"Syntax: DETAILS=STEPS<(CANDIDATES(ALL | n))> Produces the preceding summary table and displays the results from fitting each model at each step. If you specify STEPS(CANDIDATES(n)), then the best n candidates are shown. If you specify STEPS(CANDIDATES(ALL)), then all candidates are shown.","type":"standalone"},{"name":"ALL","description":"Produces the preceding tables and a detailed listing of all candidates at each step along with their ranking in terms of the selection criterion for addition to or removal from the model.","type":"standalone"},{"name":"NONE","description":"Specifies that no details be produced about the selection process.","type":"standalone"}]},{"name":"FAST","optional":true,"description":"[method-option to be enclosed in parenthesis] Implements the computational algorithm of Lawless and Singhal (1978) to compute a first-order approximation to the remaining slope estimates for each subsequent elimination of a variable from the model. When applied in backward selection, this option essentially leads to approximating the selection process as the selection process of a linear regression model in which the crossproducts matrix equals the Hessian matrix in the full model under consideration. This option is available only when METHOD=BACKWARD is specified. It is computationally efficient because the model is not fit after removal of each effect.","type":"standalone"},{"name":"HIERARCHY=","optional":true,"description":"Specifies whether and how the model hierarchy requirement is applied. You can specify that only classification effects, or both classification and continuous effects, be subject to the hierarchy requirement. This option is ignored unless you also specify one of the following options: METHOD=FORWARD, METHOD=BACKWARD, or METHOD=STEPWISE.","help":"HIERARCHY=NONE | SINGLE | SINGLECLASS","type":"choice","arguments":[{"name":"NONE","description":"Specifies that model hierarchy not be maintained. Any single effect can enter or leave the model at any step of the selection process.","type":"standalone"},{"name":"SINGLE","description":"Specifies that only one effect enter or leave the model at one time, subject to the model hierarchy requirement.","type":"standalone"},{"name":"SINGLECLASS","description":"Is the same as HIERARCHY=SINGLE except that only CLASS effects are subject to the hierarchy requirement.","type":"standalone"}]},{"name":"LSCOEFFS","optional":true,"description":"[method-option to be enclosed in parenthesis] Requests a hybrid version of the LAR and LASSO methods, in which the sequence of models is determined by the LAR or LASSO algorithm but the coefficients of the parameters for the model at any step are determined by using ordinary least squares.","type":"standalone"},{"name":"MAXEFFECTS=","optional":true,"description":"Specifies the maximum number of effects in any model that is considered during the selection process. This option is ignored when METHOD=BACKWARD is specified.","help":"MAXEFFECTS=*n*","type":"value"},{"name":"MAXSTEPS=","optional":true,"description":"Specifies the maximum number of selection steps that are performed. The default value of n is the number of effects in the SCALEMODEL or MODEL statement when METHOD=FORWARD or METHOD=BACKWARD.","help":"MAXSTEPS=*n*","type":"value"},{"name":"METHOD=","optional":true,"aliases":["SELECTION="],"description":"Specifies the selection method to use.","help":"METHOD=BACKWARD | FORWARD | FORWARDSWAP | STEPWISE","type":"choice","arguments":[{"name":"BACKWARD","description":"Specifies the backward elimination method.","type":"standalone"},{"name":"FORWARD","description":"Specifies the forward selection method.","type":"standalone"},{"name":"FORWARDSWAP","description":"Specifies forward-swap selection, which is an extension of the forward selection method.","type":"standalone"},{"name":"STEPWISE","description":"specifies the stepwise regression method.","type":"standalone"}]},{"name":"MINEFFECTS=","optional":true,"description":"Specifies the minimum number of effects in any model that is considered during backward selection. This option is ignored unless METHOD=BACKWARD is specified.","help":"MINEFFECTS=*n*","type":"value"},{"name":"ORDERSELECT","optional":true,"description":"Specifies that effects in the selected model are displayed in the order in which they first entered the model. If you do not specify the ORDERSELECT option, then effects in the selected model are displayed in the order in which they appear in the MODEL statement.","type":"standalone"},{"name":"PLOT=","optional":true,"aliases":["PLOTS="],"description":"Controls the selection process plots that are produced through ODS Graphics. Each global-plot-option applies to all plots that the SELECTION statement generates, unless you alter the option by using a specific plot option that follows a plot-request. You can specify the following global-plot-options:","help":"PLOT=ALL | COEFFICIENTS | CRITERIA | FITBYROLE  | NONE","type":"choice","arguments":[{"name":"ALL","description":"produces all relevant plots.","type":"standalone"},{"name":"COEFFICIENTS","description":"Syntax: COEFFICIENTS | COEFFICIENTPANEL <(UNPACK | UNPACKPANEL)> Creates a panel of two plots. The upper plot shows the progression of the parameter values as the selection process proceeds. The lower plot shows the progression of the CHOOSE= criterion.","type":"standalone"},{"name":"CRITERIA","description":"Syntax: CRITERIA | CRITERIONPANEL <(UNPACK | UNPACKPANEL)> Creates a panel of model fit criteria. If you specify the UNPACK option, then each criterion progression is shown in a separate plot.","type":"standalone"},{"name":"FITBYROLE","description":"Plots the progression of a fit statistic on the training, test, and validation data. The fit statistic that is displayed depends on the type of model that is being fit. The fit by role plot is not produced if you do not specify a PARTITION statement.","help":"FITBYROLE ","type":"standalone"},{"name":"NONE","description":"Suppress all selection process plots, even if you specify other plot options.","type":"standalone"}]},{"name":"SELECT=","optional":true,"aliases":["CRITERION="],"description":"Specifies the criterion that the procedure uses to determine the order in which effects enter or leave at each step of the selection method. For each step, the effect whose addition to or removal from the current model yields the maximum improvement in the specified criterion is selected. You can use the traditional significance-level approach by specifying the SL criterion; for other supported criteria, see the chapter for the relevant procedure. This option is not valid when METHOD=LAR or METHOD=LASSO.","help":"SELECT=AIC | AICC | SBC","type":"choice","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"AICC","description":"Specifies the corrected Akaike’s information criterion.","type":"standalone"},{"name":"SBC","description":"Specifies the Schwarz Bayesian information criterion.","type":"standalone"}]},{"name":"SLENTRY=","optional":true,"aliases":["SLE="],"description":"Specifies the significance level for entry when STOP=SL or SELECT=SL. By default, SLENTRY=0.05.","type":"value"},{"name":"SLSTAY=","optional":true,"aliases":["SLS="],"description":"Specifies the significance level for staying in the model when STOP=SL or SELECT=SL.","type":"value"},{"name":"STOP=","optional":true,"description":"Specifies a criterion that is used to stop the selection process.","help":"STOP=SL | NONE | &lt;*criterion*&gt;","type":"choice","arguments":[{"name":"SL","description":"Stops the selection process at the step where the significance level of the candidate for entry is greater than the SLENTRY= value for addition steps when METHOD=FORWARD or METHOD=STEPWISE and where the significance level of the candidate for removal is greater than the SLSTAY= value when METHOD=BACKWARD or METHOD=STEPWISE.","type":"standalone"},{"name":"NONE","description":"Stops the selection process if no suitable add or drop candidates can be found or if a size-based limit is reached.","type":"standalone"},{"name":"criterion","placeholder":true,"description":"Stops the selection process if the selection process produces a local extremum of this criterion or if a size-based limit is reached.","type":"value"}]},{"name":"STOPHORIZON=","optional":true,"description":"Specifies the number of consecutive steps at which the STOP= criterion must worsen in order for a local extremum to be detected. The stop horizon value is ignored if you also specify STOP=NONE or STOP=SL. For example, suppose that STOP=AIC and the sequence of AIC values at steps 1 to 6 of a selection are 10, 7, 4, 6, 5, 2. If STOPHORIZON=2, then the AIC criterion is deemed to have a local minimum at step 3 because the AIC value at the next two steps are greater than the value 4 that occurs at step 3. However, if STOPHORIZON=3, then the value at step 3 is not deemed to be a local minimum because the AIC value at step 6 is lower than the AIC value at step 3. When METHOD=LAR or METHOD=LASSO, n is ignored and STOPHORIZON=1 is used. By default, STOPHORIZON=3.","help":"STOPHORIZON=*n*","type":"value"}]},{"name":"WEIGHT","description":"The variable in the WEIGHT statement is used as a weight to perform a weighted analysis of the data. Observations that have nonpositive or missing weights are not included in the analysis. If a WEIGHT statement is not included, all observations that are used in the analysis are assigned a weight of 1.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"v_019","docsetTargetFile":"casstat_qtrselect_toc.htm"}}