{"name":"QUANTREG","statements":[{"name":"PROC QUANTREG","description":"The QUANTREG procedure models the effects of covariates on the conditional quantiles of a response variable by means of quantile regression. † Ordinary least squares (OLS) regression models the relationship between one or more covariates X and the conditional mean of the response variable Y given X=x. Quantile regression, which was introduced by Koenker and Bassett (1978), extends the regression model to conditional quantiles of the response variable, such as the median or the 90th percentile. Quantile regression is particularly useful when the rate of change in the conditional quantile, expressed by the regression coefficients, depends on the quantile.","help":"PROC QUANTREG <ALGORITHM=SIMPLEX | INTERIOR | SMOOTH> <ALPHA=value> <CI=NONE | RANK | SPARSITY... > <DATA=SAS-data-set> <INEST=SAS-data-set> <NAMELEN=n> <ORDER=DATA | FORMATTED | FREQ... > <OUTEST=SAS-data-set> <PLOTS=ALL | DDPLOT | FITPLOT... > <PP>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS variables ;     \n\tEFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tESTIMATE <ADJDFE=<SOURCE | ROW>> <ADJUST=<BON | SCHEFFE | SIDAK>... > <ALPHA=number> ...; \n   \n\tID variables ;     \n\tMODEL <CORRB> <COVB> <CUTOFF=value> ...; \n   \n\tOUTPUT <COLUMNWISE> LEVERAGE= OUT=SAS-data-set ...;     \n\tPERFORMANCE <CPUCOUNT=<<1-1024> | ACTUAL>> <DETAILS> <THREADS> ...; \n   \n\tTEST <LR> <QINTERACT> <WALD> ...; \n   \n\tWEIGHT variable; ","arguments":[{"name":"ALGORITHM=","optional":true,"description":"Specifies an algorthm to estimate the regression parameters.","help":"ALGORITHM=SIMPLEX | INTERIOR | SMOOTH","type":"choice","arguments":[{"name":"SIMPLEX","description":"Simplex algorithm","type":"standalone"},{"name":"INTERIOR","description":"[Syntax: INTERIOR<(suboptions)>] Interior point algorithm. You can specify the following suboptions: KAPPA=value specifies the step length parameter for the interior point algorithm. MAXIT=n sets the maximum number of iterations for the interior point algorithm. By default, n=1000. TOLERANCE=value specifies the tolerance for the convergence criterion of the interior point algorithm. The default value is 1E-8.","type":"standalone"},{"name":"SMOOTH","description":"[Syntax: SMOOTH<(suboptions)>] Smoothing algorithm. You can specify the following suboption: RRATIO=value specifies the reduction ratio for the smoothing algorithm.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Sets the confidence level for the confidence intervals for regression parameters. The value must be between 0 and 1. The default is ALPHA=0.05, corresponding to a 0.95 confidence interval.","help":"ALPHA=*value*","type":"value"},{"name":"CI=","optional":true,"description":"Specifies a method to compute confidence intervals for regression parameters.","help":"CI=NONE | RANK | SPARSITY | RESAMPLING","type":"choice","arguments":[{"name":"NONE","description":"No confidence intervals are computed.","type":"standalone"},{"name":"RANK","description":"By inverting rank-score tests.","type":"standalone"},{"name":"SPARSITY","description":"[Syntax: SPARSITY<(BF | HS)></IID>] By estimating sparsity function. There are two suboptions for estimating the sparsity function. If you specify the IID suboption, the sparsity function is estimated by assuming that the errors in the linear model are i.i.d. You can specify the Bofinger method with the BF suboption or the Hall-Sheather method with the HS suboption. By default, the Hall-Sheather method is used.","type":"standalone"},{"name":"RESAMPLING","description":"[Syntax: RESAMPLING<(NREP=n)>] By resampling. You can specify the number of repeats with the NREP=n suboption.","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set used by PROC ROBUSTREG. By default, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"INEST=","optional":true,"description":"Specifies an input SAS data set that contains initial estimates for all the parameters in the model.","help":"INEST=*SAS-data-set*","type":"dataSet"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length of effect names in tables and output data sets to be n characters, where n is a value between 20 and 200. The default length is 20 characters.","help":"NAMELEN=*n*","type":"value"},{"name":"ORDER=","optional":true,"description":"Specifies the order in which to sort the levels of the classification variables (which are specified in the CLASS statement).","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels sorted by the unformatted value.","type":"standalone"}]},{"name":"OUTEST=","optional":true,"description":"Specifies an output SAS data set containing the parameter estimates for all quantiles.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Specifies options that control details of the plots. The ONLY option suppresses the default quantile fit plot. Only plots specifically requested are displayed. Syntax: (1) PLOT | PLOTS <(global-plot-options)> <=plot-request> (2) PLOT | PLOTS<(global-plot-options)> <=(plot-request < ...plot-request > )> The following global plot option is available: MAXPOINTS=NONE | number specifies that plots with elements that require processing more than number points be suppressed. The default is MAXPOINTS=5000. This cutoff is ignored if you specify MAXPOINTS=NONE.","help":"PLOTS=ALL | DDPLOT | FITPLOT | HISTORGRAM | NONE | QQPLOT | RDPLOT","type":"choice","arguments":[{"name":"ALL","description":"Creates all appropriate plots.","type":"standalone"},{"name":"DDPLOT","description":"[Syntax: DDPLOT<(LABEL=ALL|LEVERAGE|NONE|OUTLIER)>] Creates a plot of robust distance against Mahalanobis distance. The LABEL= option specifies how the points on this plot are to be labeled: LABEL=ALL label all points LABEL=LEVERAGE label leverage points LABEL=NONE no labels LABEL=OUTLIERS label outliers","type":"standalone"},{"name":"FITPLOT","description":"[Syntax: FITPLOT<(NOLIMITS)>] Creates a plot of robust fit against the single independent continuous variable specified in the model.","type":"standalone"},{"name":"HISTORGRAM","description":"Creates a histogram for the standardized robust residuals.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"QQPLOT","description":"creates the normal quantile-quantile plot for the standardized robust residuals","type":"standalone"},{"name":"RDPLOT","description":"[Syntax: RDPLOT<(LABEL=ALL|LEVERAGE|NONE|OUTLIER)>] Creates the plot of standardized robust residual against robust distance. The LABEL= option specifies how the points on this plot are to be labeled: LABEL=ALL label all points LABEL=LEVERAGE label leverage points LABEL=NONE no labels LABEL=OUTLIERS label outliers","type":"standalone"}]},{"name":"PP","optional":true,"description":"Requests preprocessing to speed up the interior point algorithm or the smoothing algorithm.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC QUANTREG to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"Variables that are classification variables rather than quantitative numeric variables must be listed in the CLASS statement. For each explanatory variable listed in the CLASS statement, indicator variables are generated for the levels assumed by the CLASS variable.","help":"CLASS variables "},{"name":"EFFECT","description":"The name of the effect is specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. The effect-type is specified after an equal sign, followed by a list of variables within parentheses which are used in constructing the effect. Effect-options that are specific to an effect-type can be specified after a slash (/) following the variable list. The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects formed from continuous or classification variables.","help":"EFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"EFFECT-NAME=","placeholder":true,"description":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. These values can be used: COLLECTION, LAG, MULTIMEMBER, POLYNOMIAL, or SPLINE.","type":"value"},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"ESTIMATE","description":"The ESTIMATE statement provides a mechanism for obtaining custom hypothesis tests. Estimates are formed as linear estimable functions of the form Lβ. You can perform hypothesis tests for the estimable functions, construct confidence limits, and obtain specific nonlinear transformations.","help":"ESTIMATE &lt;ADJDFE=&lt;SOURCE | ROW&gt;&gt; &lt;ADJUST=&lt;BON | SCHEFFE | SIDAK&gt;... &gt; &lt;ALPHA=number&gt; ...","arguments":[{"name":"ADJDFE=","optional":true,"description":"Specifies how denominator degrees of freedom are determined when p-values and confidence limits are adjusted for multiple comparisons with the ADJUST= option.","help":"ADJDFE=SOURCE | ROW","type":"choice","arguments":[{"name":"SOURCE","description":"The denominator degrees of freedom for multiplicity-adjusted results are the denominator degrees of freedom for the final effect listed in the ESTIMATE statement from the 'Type III Tests of Fixed Effects' table.","type":"standalone"},{"name":"ROW","description":"Useful if you want multiplicity adjustments to take into account that denominator degrees of freedom are not constant across estimates.","type":"standalone"}]},{"name":"ADJUST=","optional":true,"description":"Requests a multiple comparison adjustment for the p-values and confidence limits for the estimates.","help":"ADJUST=BON | SCHEFFE | SIDAK | SIMULATE&lt;(simoptions)&gt; | T","type":"choice","arguments":[{"name":"BON","description":"Bonferroni adjustment","type":"standalone"},{"name":"SCHEFFE","description":"Scheffe's adjustment","type":"standalone"},{"name":"SIDAK","description":"Sidak adjustment","type":"standalone"},{"name":"SIMULATE","description":"Computes adjusted p-values and confidence limits from the simulated distribution of the maximum or maximum absolute value of a multivariate t random vector.","help":"SIMULATE&lt;(simoptions)&gt;","type":"standalone"},{"name":"T","description":"The default, which really signifies no adjustment for multiple comparisons.","type":"standalone"}]},{"name":"ALPHA=","optional":true,"description":"Requests that a t-type confidence interval be constructed with confidence level 1-number. The value of number must be between 0 and 1; the default is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"BYCATEGORY","optional":true,"aliases":["BYCAT"],"description":"Requests that in models for nominal data (generalized logit models) estimates be reported separately for each category.","type":"standalone"},{"name":"CL","optional":true,"description":"Requests that t-type confidence limits be constructed.","type":"standalone"},{"name":"DF=","optional":true,"description":"Specifies the degrees of freedom for the t test and confidence limits.","help":"DF=*number*","type":"value"},{"name":"DIVISOR=","optional":true,"description":"Specifies a list of values by which to divide the coefficients so that fractional coefficients can be entered as integer numerators.","help":"DIVISOR=*value-list*","type":"value"},{"name":"E","optional":true,"description":"Requests that the L matrix coefficients be displayed.","type":"standalone"},{"name":"EXP","optional":true,"description":"Requests exponentiation of the estimate.","type":"standalone"},{"name":"GROUP","optional":true,"description":"Sets up random-effect contrasts between different groups when a GROUP= variable appears in the RANDOM statement.","type":"standalone"},{"name":"ILINK","optional":true,"description":"Requests that the estimate and its standard error are also reported on the scale of the mean (the inverse linked scale).","type":"standalone"},{"name":"LOWER","optional":true,"aliases":["LOWERTAILED"],"description":"Requests that the p-value for the t test be based only on values less than the test statistic.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Tunes the estimability checking as documented for the CONTRAST statement.","help":"SINGULAR=*number*","type":"value"},{"name":"STEPDOWN","optional":true,"description":"Requests that multiplicity adjustments for the p-values of estimates be further adjusted in a step-down fashion.","type":"standalone"},{"name":"SUBJECT","optional":true,"description":"Sets up random-effect contrasts between different subjects when a SUBJECT= variable appears in the RANDOM statement.","type":"standalone"},{"name":"UPPER","optional":true,"aliases":["UPPERTAILED"],"description":"Requests that the p-value for the t test be based only on values greater than the test statistic.","type":"standalone"}]},{"name":"ID","description":"When the diagnostics table is requested with the DIAGNOSTICS option in the MODEL statement, the variables listed in the ID statement are displayed in addition to the observation number. These values are useful for identifying observations.","help":"ID variables "},{"name":"MODEL","description":"Main effects and interaction terms can be specified in the MODEL statement, as in the GLM procedure. Classification variables in the MODEL statement must be specified in the CLASS statement.","help":"MODEL &lt;CORRB&gt; &lt;COVB&gt; &lt;CUTOFF=value&gt; ...","arguments":[{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Produces the estimated correlation matrix of the parameter estimates.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Produces the estimated covariance matrix of the parameter estimates.","type":"standalone"},{"name":"CUTOFF=","optional":true,"followsDelimiter":"/","description":"Specifies the multiplier of the cutoff value for outlier detection. By default, CUTOFF=3.","help":"CUTOFF=*value*","type":"value"},{"name":"DIAGNOSTICS=","optional":true,"followsDelimiter":"/","description":"Requests the outlier diagnostics. By default, only observations identified as outliers or leverage points are displayed. To request that all observations be displayed, specify the ALL option.","help":"DIAGNOSTICS=ALL","type":"choice","arguments":[{"name":"ALL","type":"standalone"}]},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"Displays the iteration history for the iteratively reweighted least squares algorithm used by M and MM estimation.","type":"standalone"},{"name":"LEVERAGE=","optional":true,"followsDelimiter":"/","description":"Requests an analysis of leverage points for the continuous covariates.","help":"LEVERAGE=CUTOFF= | CUTOFFALPHA= | QUANTILE=","type":"choice","arguments":[{"name":"CUTOFF=","type":"value"},{"name":"CUTOFFALPHA=","type":"value"},{"name":"QUANTILE=","type":"value"}]},{"name":"NODIAG","optional":true,"followsDelimiter":"/","description":"Suppresses the computation for outlier diagnostics. If you specify the NODIAG option, the diagnostics summary table will not be provided.","type":"standalone"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Specifies no-intercept regression.","type":"standalone"},{"name":"NOSUMMARY","optional":true,"followsDelimiter":"/","description":"Suppresses the computation for summary statistics. If you specify the NOSUMMARY option, the summary statistics table will not be provided.","type":"standalone"},{"name":"PLOTS=","optional":true,"followsDelimiter":"/","aliases":["PLOT="],"description":"You can use the PLOTS= option in the MODEL statement together with the ODS GRAPHICS statement to request the quantile process plot in addition to all plots available with the PLOT= option in the PROC statement. You can specify the following plot option only in the MODEL statement:","help":"PLOTS=QUANTPLOT | EFFECTS | NOLIMITS | UNPACK | OLS","type":"choice","arguments":[{"name":"QUANTPLOT","type":"standalone"},{"name":"EFFECTS","type":"standalone"},{"name":"NOLIMITS","type":"standalone"},{"name":"UNPACK","type":"standalone"},{"name":"OLS","type":"standalone"}]},{"name":"QUANTILE=","optional":true,"followsDelimiter":"/","description":"Specifies the quantiles for the quantile regression.","help":"QUANTILE=&lt;*number-list*&gt; | PROCESS","type":"choice","arguments":[{"name":"number-list","placeholder":true,"followsDelimiter":"/","description":"The number-list lets you specify any number of quantiles in (0,1).","type":"value"},{"name":"PROCESS","followsDelimiter":"/","description":"Specifies to compute the entire quantile process.","type":"standalone"}]},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Specifies the scale value used to compute the standardized residuals.","help":"SCALE=*number*","type":"value"},{"name":"SEED=","optional":true,"followsDelimiter":"/","description":"Specifies the seed for the random number generator used to compute the MCMB confidence intervals.","help":"SEED=*number*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Sets the tolerance for testing singularity of the information matrix and the crossproducts matrix for the initial least squares estimates.","help":"SINGULAR=*value*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates an output SAS data set containing statistics calculated after fitting tmodels for all specified quantiles with the QUANTILE= option in the MODEL statement. At least one specification of the form keyword=name is required.","help":"OUTPUT &lt;COLUMNWISE&gt; LEVERAGE= OUT=SAS-data-set ...","arguments":[{"name":"LEVERAGE=","description":"Specifies a variable to indicate leverage points.","type":"value"},{"name":"MAHADIST=","aliases":["MD="],"description":"Specifies a variable to contain the Mahalanobis distance.","type":"value"},{"name":"OUT=","description":"Specifies the new data set. By default, the procedure uses the DATAn convention to name the new data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTLIER=","description":"Specifies a variable to indicate outliers.","type":"value"},{"name":"PREDICTED=","aliases":["P="],"description":"Specifies a variable to contain the estimated response.","type":"value"},{"name":"QUANTILE=","aliases":["Q="],"description":"Specifies a variable to contain the quantile for which the quantile regression is fitted.","type":"value"},{"name":"RESIDUAL=","aliases":["RES="],"description":"Specifies a variable to contain the unstandardized residuals.","type":"value"},{"name":"ROBDIST=","aliases":["RD="],"description":"Specifies a variable to contain the robust MCD distance.","type":"value"},{"name":"SPLINE=","aliases":["SP="],"description":"Specifies a variable to contain the estimated spline effect, which includes all spline effects in the model and their interactions.","type":"value"},{"name":"SRESIDUAL=","aliases":["SRES="],"description":"Specifies a variable to contain the standardized residuals.","type":"value"},{"name":"STDP=","description":"Specifies a variable to contain the estimates of the standard errors of the estimated response.","type":"value"},{"name":"COLUMNWISE","optional":true,"followsDelimiter":"/","description":"If you specify multiple quantiles in the MODEL statement, the COLUMNWISE option arranges the created OUTPUT data set in column-wise form.","type":"standalone"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement is used to change default options that affect the performance of PROC QUANTREG and to request tables that show the performance options in effect and timing details.","help":"PERFORMANCE &lt;CPUCOUNT=&lt;&lt;1-1024&gt; | ACTUAL&gt;&gt; &lt;DETAILS&gt; &lt;THREADS&gt; ...","arguments":[{"name":"CPUCOUNT=","optional":true,"description":"Specifies the number of processors to use for forming crossproduct matrices.","help":"CPUCOUNT=&lt;1-1024&gt; | ACTUAL","type":"choice","arguments":[{"name":"1-1024","description":"Specify a value between 1 and 1024 (inclusive).","type":"standaloneOrValue"},{"name":"ACTUAL","description":"Sets CPUCOUNT to be the number of physical processors available.","type":"standalone"}]},{"name":"DETAILS","optional":true,"description":"Requests the \"PerfSettings\" table that shows the performance settings in effect and the \"Timing\" table that provides a broad timing breakdown of the PROC QUANTTREG step.","type":"standalone"},{"name":"NOTHREADS","optional":true,"description":"Disables multithreaded computation for the interior point algorithm. This option overrides the SAS system option THREADS | NOTHREADS.","type":"standalone"},{"name":"THREADS","optional":true,"description":"Enables multithreaded computation for the interior point algorithm. This option overrides the SAS system option THREADS | NOTHREADS.","type":"standalone"}]},{"name":"TEST","description":"The TEST statement provides a means of obtaining a test for the canonical linear hypothesis concerning the parameters of the tested effects. You can request Wald tests with the WALD option and likelihood ratio tests with the LR option.","help":"TEST &lt;LR&gt; &lt;QINTERACT&gt; &lt;WALD&gt; ...","arguments":[{"name":"LR","optional":true,"followsDelimiter":"/","description":"Requests the likelihood ratio tests.","type":"standalone"},{"name":"QINTERACT","optional":true,"followsDelimiter":"/","description":"[This option is new under SAS 9.3] Enables you to test whether any difference exists among the coefficients across quantiles if several quantiles are specified in the MODEL statement.","type":"standalone"},{"name":"RANKSCORE=","optional":true,"followsDelimiter":"/","description":"Requests rank tests. The NORMAL, WILCOXON, and SIGN functions are implemented and suitable for iid error models, and the TAU score function is implemented and appropriate for non-iid error models. By default, the TAU score function is used.","help":"RANKSCORE=NORMAL | WILCOXON | SIGN","type":"choice","arguments":[{"name":"NORMAL","type":"standalone"},{"name":"WILCOXON","type":"standalone"},{"name":"SIGN","type":"standalone"}]},{"name":"WALD","optional":true,"followsDelimiter":"/","description":"Requests the Wald tests.","type":"standalone"}]},{"name":"WEIGHT","aliases":["WGT"],"description":"The WEIGHT statement specifies a weight variable in the input data set. To request weighted quantile regression, place the weights in a variable and specify the name in the WEIGHT statement.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_019","docsetTargetFile":"statug_qreg_toc.htm"}}