{"name":"QUANTLIFE","statements":[{"name":"PROC QUANTLIFE","description":"[SAS/STAT 12.1 Experimental Procedure] † The QUANTLIFE procedure performs quantile regression analysis for survival data, where observations are not always directly observed. † Quantile regression (Koenker and Bassett, 1978) is a type of regression analysis that explores how the conditional quantile of a response variable depends on its covariates. By estimating a set of conditional quantiles, you can gain more insight about the conditional distribution of the response given its covariates. † Quantile regression provides a flexible way to capture heterogeneous effects in the sense that the tails and the central location of the conditional distributions can vary differently with the covariates. Thus, quantile regression offers a powerful tool in survival analysis, where the lifetimes are skewed, and extreme survival times can be of special interest (Koenker and Geling, 2001; Huang, 2010).","help":"PROC QUANTLIFE <ALPHA=value> <CI=EW | PW | NONE> <DATA=SAS-data-set> <GRIDSIZE=value> <INITTAU=value> <KAPPA=value> <LOG> <MAXIT=n> <METHOD=KM | NA> <NAMELEN=n> <NREP=n> <OUTBOOTEST=SAS-data-set> <PLOTS=ALL | NONE | QUANTILE... > <SEED=number> <TOLERANCE=value>;     \n\tBASELINE <COVARIATES=SAS-data-set> <OUT=SAS-data-set> <SURVIVAL = name> ...;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS <TRUNCATE> ; \n   \n\tEFFECT <EFFECT-NAME>=COLLECTION|LAG|MULTIMEMBER|MM...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tMODEL <NOINT> <QUANTILE=<number-list | PROCESS>> ; \n   \n\tOUTPUT <OUT=SAS-data-set> <PREDICTED=> <RESIDUAL=> ...; \n   \n\tTEST <WALD> ;   \n \n\tWEIGHT variable ; ","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the confidence level for the regression parameters. The value must be between 0 and 1. The default is ALPHA=0.05, which corresponds to a 95% confidence interval.","help":"ALPHA=*value*","type":"value"},{"name":"CI=","optional":true,"description":"Specifies the method used to compute confidence intervals for regression parameters. In addition to confidence intervals, the QUANTLIFE procedure also computes standard errors, t values, and p-values for regression parameters. You can suppress these computations by specifying CI=NONE. The QUANTLIFE procedure provides two resampling methods for computing confidence intervals, the exponentially weighted (EW) method and the pairwise (PW) resampling method.","help":"CI=EW | PW | NONE","type":"choice","arguments":[{"name":"EW","description":"Exponentially weighted (EW) resampling method for computing confidence intervals","type":"standalone"},{"name":"PW","description":"Pairwise resampling method for computing confidence intervals","type":"standalone"},{"name":"NONE","description":"Suppresses computations of confidence intervals for regression parameters","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set that the QUANTLIFE procedure uses. By default, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"GRIDSIZE=","optional":true,"description":"Specifies the step size for computing regression quantiles. The value must be between 0 and 1.","help":"GRIDSIZE=*value*","type":"value"},{"name":"INITTAU=","optional":true,"description":"Specifies the first quantile level for computing regression quantiles.","help":"INITTAU=*value*","type":"value"},{"name":"KAPPA=","optional":true,"description":"Specifies the step-length parameter for the interior point algorithm. The value must be between 0 and 1. The interior point method used by the QUANTLIFE is identical to the interior point method used by the QUANTREG procedure.","help":"KAPPA=*value*","type":"value"},{"name":"LOG","optional":true,"description":"Requests that a log transformation of the response variable be performed before the model is fitted.","type":"standalone"},{"name":"MAXIT=","optional":true,"description":"Specifies the maximum number of iterations for the interior point algorithm. The default is MAXIT= 1000.","help":"MAXIT=*n*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the method used to estimate the regression parameters. KM specifies the Kaplan-Meier-type method (see the section Kaplan-Meier-Type Estimator for Censored Quantile Regression) and NA specifies the Nelson-Aalen-type method (see the section Nelson-Aalen-Type Estimator for Censored Quantile Regression).","help":"METHOD=KM | NA","type":"choice","arguments":[{"name":"KM","description":"Specifies the Kaplan-Meier-type method (see the section Kaplan-Meier-Type Estimator for Censored Quantile Regression)","type":"standalone"},{"name":"NA","description":"Specifies the Nelson-Aalen-type method (see the section Nelson-Aalen-Type Estimator for Censored Quantile Regression).","type":"standalone"}]},{"name":"NAMELEN=","optional":true,"description":"Specifies the length of effect names in tables and output data sets to be n characters, where n is a value between 20 and 200. The default is NAMELEN=20.","help":"NAMELEN=*n*","type":"value"},{"name":"NREP=","optional":true,"description":"Specifies the number of replications to draw in the resampling method. The default is NREP=200.","help":"NREP=*n*","type":"value"},{"name":"OUTBOOTEST=","optional":true,"description":"Creates a data set to contain the parameter estimates from the resampled data sets.","help":"OUTBOOTEST=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Requests various plots. When you specify one plot-request, you can omit the parentheses around the plot request. ODS Graphics must be enabled before plots can be requested. For example:","help":"PLOTS=ALL | NONE | QUANTILE | QUANTPLOT | SURVIVAL","type":"choice","arguments":[{"name":"ALL","description":"Creates all appropriate plots.","type":"standalone"},{"name":"NONE","description":"Suppresses all the plots in the procedure. Specifying this option is equivalent to disabling ODS Graphics for the entire procedure.","type":"standalone"},{"name":"QUANTILE","description":"Plots the estimated quantile function for each combination of covariate values in the COVARIATES= data set specified in the BASELINE statement. If the COVARIATES= data set is not specified, the estimated quantile function is plotted for the reference set of covariate values that consists of reference levels for the CLASS variables and average values for the continuous variables. When the estimated quantile function is not monotonic, the quantile function (Chernozhukov, Fernandez-Val, and Galichon, 2009) is rearranged to make it monotonic and then plotted.","type":"standalone"},{"name":"QUANTPLOT","description":"QUANTPLOT </ UNPACK > Plots the regression quantile process. The estimated coefficient of each specified covariate effect is plotted as a function of the quantile level. You can use the UNPACK option to create individual process plots.","type":"standalone"},{"name":"SURVIVAL","description":"Plots the estimated survival function for each combination of covariate values in the COVARIATES= data set specified in the BASELINE statement. If the COVARIATES= data set is not specified, the estimated survival function is plotted for the reference set of covariate values that consists of reference levels for the CLASS variables and average values for the continuous variables.","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies a positive integer to start the pseudorandom number generator. The default is a value that is generated from reading the time of day from the computer’s clock. However, to duplicate the results under identical situations, you must specify the same seed in subsequent runs of the QUANTLIFE procedure. The seed information is displayed in the “Model Information” table.","help":"SEED=*number*","type":"value"},{"name":"TOLERANCE=","optional":true,"description":"Specifies the tolerance for the convergence criterion of the interior point algorithm. Both the QUANTLIFE procedure and the QUANTREG procedure use the duality gap as the convergence criterion.","help":"TOLERANCE=*value*","type":"value"}]},{"name":"BASELINE","description":"The BASELINE statement creates an output data set to contain the survival function estimates or the conditional quantile function estimates for every set of covariates (x) in the COVARIATES= data set. If the COVARIATES= data set is not specified, PROC QUANTLIFE uses a reference set of covariates that consists of the reference levels for the CLASS variables and the average values for the continuous variables.","help":"BASELINE &lt;COVARIATES=SAS-data-set&gt; &lt;OUT=SAS-data-set&gt; &lt;SURVIVAL = name&gt; ...","arguments":[{"name":"COVARIATES=","optional":true,"description":"Names the SAS data set that contains the sets of explanatory variable values for which the quantities of interest are estimated. All variables in the COVARIATES= data set are copied to the OUT= data set. Thus, the variables in the COVARIATES= data set can be used to identify the covariate sets in the OUT= data set.","help":"COVARIATES=*SAS-data-set*","type":"dataSet"},{"name":"OUT=","optional":true,"description":"Names the output data set. If you omit the OUT= option, the data set is created and given a default name by using the DATAn convention.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"QUANTILE=","optional":true,"description":"Specifies the estimated quantile function.","type":"value"},{"name":"SURVIVAL=","optional":true,"description":"Specifies the estimated survival function.","type":"value"},{"name":"TAU=","optional":true,"description":"Specifies the quantile level, which is the complement of the survival function.","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC QUANTLIFE to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the QUANTLIFE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order.","type":"standalone"}]},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used in the model. Typical classification variables are Treatment, Sex, Race, Group, and Replication. If you use the CLASS statement, it must appear before the MODEL statement. Classification variables can be either character or numeric. By default, class levels are determined from the entire set of formatted values of the CLASS variables. In any case, you can use formats to group values into levels.","help":"CLASS &lt;TRUNCATE&gt; ","arguments":[{"name":"TRUNCATE","optional":true,"followsDelimiter":"/","description":"Specifies that class levels should be determined by using only up to the first 16 characters of the formatted values of CLASS variables.","type":"standalone"}]},{"name":"EFFECT","description":"The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects that are formed from continuous or classification variables, as discussed in the section GLM Parameterization of Classification Variables and Effects. The name of the effect is specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. The effect-type is specified after an equal sign, followed by a list of variables within parentheses which are used in constructing the effect. Effect-options that are specific to an effect-type can be specified after a slash (/) following the variable list. The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects formed from continuous or classification variables.","help":"EFFECT &lt;EFFECT-NAME&gt;=COLLECTION|LAG|MULTIMEMBER|MM...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"EFFECT-NAME=","placeholder":true,"description":"Replace EFFECT-NAME with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. These values can be used: COLLECTION, LAG, MULTIMEMBER, POLYNOMIAL, or SPLINE.","type":"value"},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"MODEL","description":"The MODEL statement identifies the response variable, the optional censoring variable, and the explanatory effects, including covariates, main effects, interactions, and nested effects. In the MODEL statement, the response variable precedes the equal sign. This name can optionally be followed by an asterisk, the name of the censoring variable, and a list of censoring values (separated by blanks or commas if you list more than one value) enclosed in parentheses. If the censoring variable takes on one of these values, the corresponding failure time is considered to be censored. Following the equal sign are the explanatory effects (sometimes called independent variables or covariates) for the model. The censoring variable must be numeric.","help":"MODEL &lt;NOINT&gt; &lt;QUANTILE=&lt;number-list | PROCESS&gt;&gt; ","arguments":[{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Specifies no intercept regression.","type":"standalone"},{"name":"QUANTILE=","optional":true,"followsDelimiter":"/","description":"Specifies the quantile levels of interest for quantile regression analysis. You can specify any number of quantile levels in the interval (0,1). You can also compute the entire quantile process by specifying the PROCESS option.","help":"QUANTILE=number-list | PROCESS","type":"choice","arguments":[{"name":"number-list","followsDelimiter":"/","description":"Replace number-list with any number of quantile levels in the interval (0,1).","type":"standalone"},{"name":"PROCESS","followsDelimiter":"/","description":"Specifies to compute the entire quantile process.","type":"standalone"}]}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a SAS data set to contain statistics that are calculated after fitting models for all quantiles specified by the QUANTILE= option in the MODEL statement. At least one specification of the form keyword=name is required. All variables in the original data set are included in the new data set, along with the variables that are created. These new variables contain fitted values and estimated quantiles. If you want to create a permanent SAS data set, you must specify a two-level name.","help":"OUTPUT &lt;OUT=SAS-data-set&gt; &lt;PREDICTED=&gt; &lt;RESIDUAL=&gt; ...","arguments":[{"name":"OUT=","optional":true,"description":"Specifies the new data set. By default, the procedure uses the DATAn convention to name the new data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PREDICTED=","optional":true,"aliases":["P="],"description":"Specifies a variable to contain the predicted response.","type":"value"},{"name":"RESIDUAL=","optional":true,"aliases":["RES="],"description":"Specifies a variable to contain residuals.","type":"value"},{"name":"SAMPLEWEIGHT=","optional":true,"aliases":["SW="],"description":"Specifies variables for sample weights from the bootstrap samples. For the ith sample, a column that contains the weights that are used for that sample is added. The name of this column is formed by appending an index i to the name that you specify. If you do not specify a name, then the default prefix is sw.","type":"value"},{"name":"STDP=","optional":true,"description":"Specifies a variable to contain the estimates of the standard errors of the estimated response.","type":"value"}]},{"name":"TEST","description":"In quantile regression analysis, you might be interested in testing whether a covariate effect is statistically significant for a given quantile. You can include multiple TEST statements, provided that they appear after the MODEL statement. The optional label, which must be a valid SAS name, is used to identify output from the corresponding TEST statement.","help":"TEST &lt;WALD&gt; ","arguments":[{"name":"WALD","optional":true,"followsDelimiter":"/","description":"Requests the Wald tests.","type":"standalone"}]},{"name":"WEIGHT","description":"The WEIGHT statement specifies a weight variable in the input data set. To request weighted quantile regression, place the weights in a variable and specify the name in the WEIGHT statement. The values of the WEIGHT variable can be nonintegral and are not truncated. Observations with nonpositive or missing values for the weight variable do not contribute to the fit of the model.","help":"WEIGHT variable "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"latest","docsetTargetFile":"statug_quantlife_toc.htm"}}