{"name":"REG","statements":[{"name":"PROC REG","description":"The REG procedure is one of many regression procedures in the SAS System. It is a general-purpose procedure for regression, while other SAS regression procedures provide more specialized applications.","help":"PROC REG <ALL> <ALPHA=number> <ANNOTATE=SAS-data-set> <CORR> <COVOUT> <DATA=SAS-data-set> <EDF> <GOUT=graphics-catalog> <LINEPRINTER> <NOPRINT> <OUTEST=SAS-data-set> <OUTSEB> <OUTSSCP=SAS-data-set> <OUTSTB> <OUTVIF> <PCOMIT=list> <PLOTS=ADJRSQ | AIC | ALL... > <PRESS> <RIDGE=list> <RSQUARE> <SIMPLE> <SINGULAR=n> <TABLEOUT> <USSCP>;     \n\tADD variables ;\n    \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tDELETE variables ;\n    \n\tFREQ variable ;\n    \n\tID variables ;\n    \n\tMODEL <ACOV> <ACOVMETHOD=<0 | 1 | 2>... > <HCCMETHOD=<0 | 1 | 2>... > ...;\n    \n\tMTEST <CANPRINT> <DETAILS> <MSTAT=<FAPPROX | EXACT>> ...;\n    \n\tOUTPUT <COOKD=> <COVRATIO=> <OUT=SAS-data-set> ...;\n    \n\tPAINT ALLOBS <NOLIST> <RESET> ...;\n    \n\tPRINT <ACOV> <ANOVA> <MODELDATA> ...;\n    \n\tREFIT ;\n    \n\tRESTRICT equation <, ..., equation> ;\n    \n\tREWEIGHT <ALLOBS> <NOLIST> <RESET> ...;\n    \n\tTEST <PRINT> ;\n    \n\tVAR variables ;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"ALL","optional":true,"description":"Requests the display of many tables.","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Sets the significance level used for the construction of confidence intervals. The value must be between 0 and 1; the default value of 0.05 results in 95% intervals.","help":"ALPHA=*number*","type":"value"},{"name":"ANNOTATE=","optional":true,"description":"Specifies an input data set that contains appropriate variables for annotation of the traditional graphics.","help":"ANNOTATE=*SAS-data-set*","type":"dataSet"},{"name":"CORR","optional":true,"description":"Displays the correlation matrix for all variables listed in the MODEL or VAR statement.","type":"standalone"},{"name":"COVOUT","optional":true,"description":"Outputs the covariance matrices for the parameter estimates to the OUTEST= data set.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Names the SAS data set to be used by PROC REG.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"EDF","optional":true,"description":"Outputs the number of regressors in the model excluding and including the intercept, the error degrees of freedom, and the model R-square to the OUTEST= data set.","type":"standalone"},{"name":"GOUT=","optional":true,"description":"Specifies a graphics catalog in which to save graphics output.","help":"GOUT=*graphics-catalog*","type":"dataSet"},{"name":"LINEPRINTER","optional":true,"description":"Creates plots requested as line printer plots.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of the results.","type":"standalone"},{"name":"OUTEST=","optional":true,"description":"Requests that parameter estimates and optional model fit summary statistics be output to this data set.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"OUTSEB","optional":true,"description":"Outputs the standard errors of the parameter estimates to the OUTEST= data set.","type":"standalone"},{"name":"OUTSSCP=","optional":true,"description":"Requests that the sums of squares and crossproducts matrix be output to this TYPE=SSCP data set.","help":"OUTSSCP=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTB","optional":true,"description":"Outputs the standardized parameter estimates as well as the usual estimates to the OUTEST= data set when the RIDGE= or PCOMIT= option is specified.","type":"standalone"},{"name":"OUTVIF","optional":true,"description":"Outputs the variance inflation factors (VIF) to the OUTEST= data set when the RIDGE= or PCOMIT= option is specified.","type":"standalone"},{"name":"PCOMIT=","optional":true,"description":"Requests an incomplete principal component (IPC) analysis for each value m in the list.","help":"PCOMIT=*list*","type":"value"},{"name":"PLOTS=","optional":true,"description":"[Syntax: PLOTS <(global-plot-options)> <= plot-request <(options)>> PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> Controls the plots produced through ODS Graphics. The following global plot options are available: LABEL specifies that the LABEL option be applied to each plot that supports a LABEL option. MAXPOINTS=NONE | max < heat-max > suppresses most plots that require processing more than max points. When the number of points exceeds max but does not exceed heat-max divided by the number of independent variables, heat maps are displayed instead of scatter plots for the fit and residual plots. All other plots are suppressed when the number of points exceeds max. The default is MAXPOINTS=5000 150000. These cutoffs are ignored if you specify MAXPOINTS=NONE. NOTE: Heat maps are experimental in this release. MODELLABEL requests that the model label be displayed in the upper-left corner of all plots. ONLY suppress the default plots. STATS=ALL | DEFAULT | NONE | (plot-statistics) requests statistics that are included on the fit plot and diagnostics panel. UNPACK suppresses paneling.","help":"PLOTS=ADJRSQ | AIC | ALL | BIC | COOKSD | CP | CRITERIA | DFBETAS | DEFITS | DIAGNOSTICS | FITPLOT | OBSERVEDBYPREDICTED | NONE | PARTIAL | PREDICTIONS | QQPLOT | RESIDUALBOXPLOT | RESIDUALBYPREDICTED | RESIDUAL | RESIDUALHISTOGRAM | REFPLOT | RIDGE | RSQUARE | RSTUDENTBYLEVERAGE | RSTUDENTBYPREDICTED | SBC","type":"choice","arguments":[{"name":"ADJRSQ","description":"[Syntax: ADJRSQ<(adjrsq-options)>] Displays the adjusted R-square values for the models examined when you request variable selection with the SELECTION= option in the MODEL statement. The following adjrsq-options are available: LABEL requests that the model number corresponding to the one displayed in the \"Subset Selection Summary\" table be used to label the model with the largest adjusted R-square statistic at each value of the number of parameters. LABELVARS requests that the list (excluding the intercept) of the regressors in the relevant model be used to label the model with the largest adjusted R-square statistic at each value of the number of parameters.","type":"standalone"},{"name":"AIC","description":"[Syntax: AIC<(aic-options)>] Displays Akaike’s information criterion (AIC) for the models examined when you request variable selection with the SELECTION= option in the MODEL statement. The following aic-options are available: LABEL requests that the model number corresponding to the one displayed in the \"Subset Selection Summary\" table be used to label the model with the smallest AIC statistic at each value of the number of parameters. LABELVARS requests that the list (excluding the intercept) of the regressors in the relevant model be used to label the model with the smallest AIC statistic at each value of the number of parameters.","type":"standalone"},{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"BIC","description":"[Syntax: BIC<(bic-options)>] Displays Sawa’s Bayesian information criterion (BIC) for the models examined when you request variable selection with the SELECTION= option in the MODEL statement. The following bic-options are available: LABEL requests that the model number corresponding to the one displayed in the \"Subset Selection Summary\" table be used to label the model with the smallest BIC statistic at each value of the number of parameters. LABELVARS requests that the list (excluding the intercept) of the regressors in the relevant model be used to label the model with the smallest BIC statistic at each value of the number of parameters.","type":"standalone"},{"name":"COOKSD","description":"[Syntax: COOKSD<(LABEL)>] Plots Cook’s D statistic by observation number. If you specify the LABEL option, then points deemed as influential are labeled.","type":"standalone"},{"name":"CP","description":"[Syntax: CP<(cp-options)>] Displays Mallow’s Cp statistic for the models examined when you request variable selection with the SELECTION= option in the MODEL statement. The following cp-options are available: LABEL requests that the model number corresponding to the one displayed in the \"Subset Selection Summary\" table be used to label the model with the smallest Cp statistic at each value of the number of parameters. LABELVARS requests that the list (excluding the intercept) of the regressors in the relevant model be used to label the model with the smallest Cp statistic at each value of the number of parameters.","type":"standalone"},{"name":"CRITERIA","description":"[Syntax: CRITERIA<(criteria-options)>] Produces a panel of fit criteria for the models examined when you request variable selection with the SELECTION= option in the MODEL statement. The following criteria-options are available: LABEL requests that the model number corresponding to the one displayed in the \"Subset Selection Summary\" table be used to label the best model at each value of the number of parameters. LABELVARS requests that the list (excluding the intercept) of the regressors in the relevant model be used to label the best model at each value of the number of parameters. UNPACK suppresses paneling.","type":"standalone"},{"name":"DFBETAS","description":"[Syntax: DFBETAS<(DFBETAS-options)>] Produces panels of DFBETAS by observation number for the regressors in the model. The following DFBETAS-options are available: COMMONAXES specifies that the same DFBETAS axis be used in all panels when multiple panels are needed. LABEL specifies that observations whose magnitude are greater than 2/SQRT(n) be labeled. UNPACK suppresses paneling.","type":"standalone"},{"name":"DEFITS","description":"[Syntax: DEFITS<(LABEL)>] Plots the DFFITS statistic by observation number. If you specify the LABEL option, then these influential observations are labeled.","type":"standalone"},{"name":"DIAGNOSTICS","description":"[Syntax: DIAGNOSTICS<(diagnostics-options)>] Produces a summary panel of fit diagnostics. You can specify the following diagnostics-options: STATS=stats-options determines which model fit statistics are included in the panel. UNPACK produces the eight plots in the panel as individual plots.","type":"standalone"},{"name":"FITPLOT","description":"[Syntax: FITPLOT<(fit-options)>] Produces a scatter plot of the data overlaid with the regression line, confidence band, and prediction band for models that depend on at most one regressor excluding the intercept. You can specify the following fit-options: NOCLI suppresses the prediction limits. NOCLM suppresses the confidence limits. NOLIMITS suppresses the confidence and prediction limits. STATS=stats-options determines which model fit statistics are included in the panel.","type":"standalone"},{"name":"OBSERVEDBYPREDICTED","description":"[Syntax: OBSERVEDBYPREDICTED<(LABEL)>] Plots dependent variable values by the predicted values.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"PARTIAL","description":"[Syntax: PARTIAL<(UNPACK)>] Produces panels of partial regression plots for each regressor with at most six regressors per panel. If you specify the UNPACK option, then all partial plot panels are unpacked.","type":"standalone"},{"name":"PREDICTIONS","description":"[Syntax: PREDICTIONS(X=numeric-variable <prediction-options>)] Produces a panel of two plots whose horizontal axis is the variable you specify in the required X= suboption. The upper plot in the panel is a scatter plot of the residuals. The lower plot shows the data overlaid with the regression line, confidence band, and prediction band. You can specify the following prediction-options: NOCLI suppresses the prediction limits. NOCLM suppresses the confidence limits NOLIMITS suppresses the confidence and prediction limits SMOOTH requests a nonparametric smooth of the residuals as a function of the variable you specify in the X= suboption. UNPACK suppresses paneling.","type":"standalone"},{"name":"QQPLOT","description":"Produces a normal quantile plot of the residuals.","type":"standalone"},{"name":"RESIDUALBOXPLOT","description":"[Syntax: RESIDUALBOXPLOT<(LABEL)>] Produces a box plot consisting of the residuals. If you specify label option, points deemed far-outliers are labeled.","type":"standalone"},{"name":"RESIDUALBYPREDICTED","description":"[Syntax: RESIDUALBYPREDICTED<(LABEL)>] Plots residuals by predicted values. If you specify the LABEL option, then points deemed as outliers or influential are labeled.","type":"standalone"},{"name":"RESIDUAL","description":"[Syntax: RESIDUAL<(residual-options)>] Produces panels of the residuals versus the regressors in the model. Note that each panel contains at most six plots, and multiple panels are used in the case where there are more than six regressors (including the intercept) in the model. The following residual-options are available: SMOOTH requests a nonparametric smooth of the residuals for each regressor. UNPACK suppresses paneling.","type":"standalone"},{"name":"RESIDUALHISTOGRAM","description":"Produces a histogram of the residuals.","type":"standalone"},{"name":"REFPLOT","description":"Produces a \"Residual-Fit\" (or RF) plot consisting of side-by-side quantile plots of the centered fit and the residuals.","type":"standalone"},{"name":"RIDGE","description":"[Syntax: RIDGE<(ridge-options)>] Creates panels of VIF values and standardized ridge estimates by ridge values for each coefficient. The following ridge-options are available: COMMONAXES specifies that the same VIF axis and the same standardized estimate axis are used in all panels when multiple panels are needed. RIDGEAXIS=LINEAR | LOG specifies the axis type used to display the ridge parameters. UNPACK suppresses paneling. VARSPERPLOT=ALL | number specifies the maximum number of regressors displayed in each panel or in each plot if you additionally specify the UNPACK option. If you specify VARSPERPLOT=ALL, then the VIF values and ridge traces for all regressors are displayed in a single panel. VIFAXIS=LINEAR | LOG specifies the axis type used to display the VIF statistics. The default is VIFAXIS=LINEAR.","type":"standalone"},{"name":"RSQUARE","description":"[Syntax: RSQUARE<(rsquare-options)>] Displays the R-square values for the models examined when you request variable selection with the SELECTION= option in the MODEL statement. The following rsquare-options are available: LABEL requests that the model number corresponding to the one displayed in the \"Subset Selection Summary\" table be used to label the model with the largest R-square statistic at each value of the number of parameters. LABELVARS requests that the list (excluding the intercept) of the regressors in the relevant model be used to label the model with the largest R-square statistic at each value of the number of parameters.","type":"standalone"},{"name":"RSTUDENTBYLEVERAGE","description":"[Syntax: RSTUDENTBYLEVERAGE<(LABEL)>] Plots studentized residuals by leverage. If you specify the LABEL option, then points deemed as outliers or influential are labeled.","type":"standalone"},{"name":"RSTUDENTBYPREDICTED","description":"[Syntax: RSTUDENTBYPREDICTED <(LABEL)>] Plots studentized residuals by predicted values. If you specify the LABEL option, then points deemed as outliers or influential are labeled.","type":"standalone"},{"name":"SBC","description":"[Syntax: SBC<(sbc-options)>] Displays Schwarz’s Bayesian information criterion (SBC) for the models examined when you request variable selection with the SELECTION= option in the MODEL statement. The following sbc-options are available: LABEL requests that the model number corresponding to the one displayed in the \"Subset Selection Summary\" table be used to label the model with the smallest SBC statistic at each value of the number of parameters. LABELVARS requests that the list (excluding the intercept) of the regressors in the relevant model be used to label the model with the smallest SBC statistic at each value of the number of parameters.","type":"standalone"}]},{"name":"PRESS","optional":true,"description":"Outputs the PRESS statistic to the OUTEST= data set. The values of this statistic are saved in the variable _PRESS_.","type":"standalone"},{"name":"RIDGE=","optional":true,"description":"Requests a ridge regression analysis and specifies the values of the ridge constant k.","help":"RIDGE=*list*","type":"value"},{"name":"RSQUARE","optional":true,"description":"Has the same effect as the EDF option.","type":"standalone"},{"name":"SIMPLE","optional":true,"description":"Displays the sum, mean, variance, standard deviation, and uncorrected sum of squares for each variable used in PROC REG.","type":"standalone"},{"name":"SINGULAR=","optional":true,"description":"Tunes the mechanism used to check for singularities. The default value is machine dependent but is approximately 1E-7 on most machines. This option is rarely needed.","help":"SINGULAR=*n*","type":"value"},{"name":"TABLEOUT","optional":true,"description":"Outputs the standard errors and 100(1 - α)% confidence limits for the parameter estimates, the t statistics for testing if the estimates are zero, and the associated p-values to the OUTEST= data set.","type":"standalone"},{"name":"USSCP","optional":true,"description":"Displays the uncorrected sums-of-squares and crossproducts matrix for all variables used in the procedure.","type":"standalone"}]},{"name":"ADD","description":"The ADD statement adds independent variables to the regression model. Only variables used in the VAR statement or used in MODEL statements before the first RUN statement can be added to the model.","help":"ADD variables "},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"DELETE","description":"The DELETE statement deletes independent variables from the regression model. The DELETE statement performs the opposite function of the ADD statement and is used in a similar manner.","help":"DELETE variables "},{"name":"FREQ","description":"When a FREQ statement appears, each observation in the input data set is assumed to represent n observations, where n is the value of the FREQ variable.","help":"FREQ variable "},{"name":"ID","description":"When one of the MODEL statement options CLI, CLM, P, R, and INFLUENCE is requested, the variables listed in the ID statement are displayed beside each observation. These variables can be used to identify each observation.","help":"ID variables "},{"name":"MODEL","description":"After the keyword MODEL, the dependent (response) variables are specified, followed by an equal sign and the regressor variables. Variables specified in the MODEL statement must be numeric variables in the data set being analyzed.","help":"MODEL &lt;ACOV&gt; &lt;ACOVMETHOD=&lt;0 | 1 | 2&gt;... &gt; &lt;HCCMETHOD=&lt;0 | 1 | 2&gt;... &gt; ...","arguments":[{"name":"ACOV","optional":true,"followsDelimiter":"/","description":"Displays the estimated asymptotic covariance matrix of the estimates under the hypothesis of heteroscedasticity and heteroscedasticity-consistent standard errors of parameter estimates.","type":"standalone"},{"name":"ACOVMETHOD=","optional":true,"followsDelimiter":"/","description":"[See the HCCMETHOD= option.] Specifies the method used to obtain a heteroscedasticity-consistent covariance matrix for use with the ACOV, HCC, or WHITE option in the MODEL statement and for heteroscedasticity-consistent tests with the TEST statement.","help":"ACOVMETHOD=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","followsDelimiter":"/","description":"Uses the HC0 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"},{"name":"1","followsDelimiter":"/","description":"Uses the HC1 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"},{"name":"2","followsDelimiter":"/","description":"Uses the HC2 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"},{"name":"3","followsDelimiter":"/","description":"Uses the HC3 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"}]},{"name":"ADJRSQ","optional":true,"followsDelimiter":"/","description":"Computes R-square adjusted for degrees of freedom for each model selected.","type":"standalone"},{"name":"AIC","optional":true,"followsDelimiter":"/","description":"Outputs Akaike’s information criterion for each model selected to the OUTEST= data set.","type":"standalone"},{"name":"ALL","optional":true,"followsDelimiter":"/","description":"Outputs Akaike’s information criterion for each model selected to the OUTEST= data set.","type":"standalone"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Sets the significance level used for the construction of confidence intervals for the current MODEL statement. The value must be between 0 and 1; the default value of 0.05 results in 95% intervals.","help":"ALPHA=*number*","type":"value"},{"name":"B","optional":true,"followsDelimiter":"/","description":"Is used with the RSQUARE, ADJRSQ, and CP model-selection methods to compute estimated regression coefficients for each model selected.","type":"standalone"},{"name":"BEST=","optional":true,"followsDelimiter":"/","description":"Is used with the RSQUARE, ADJRSQ, and CP model-selection methods.","help":"BEST=*n*","type":"value"},{"name":"BIC","optional":true,"followsDelimiter":"/","description":"Outputs Sawa’s Bayesian information criterion for each model selected to the OUTEST= data set.","type":"standalone"},{"name":"CLB","optional":true,"followsDelimiter":"/","description":"Requests the 100(1 - α)% upper and lower confidence limits for the parameter estimates. By default, the 95% limits are computed","type":"standalone"},{"name":"CLI","optional":true,"followsDelimiter":"/","description":"Requests the 100(1 - α)% upper and lower confidence limits for an individual predicted value. By default, the 95% limits are computed","type":"standalone"},{"name":"CLM","optional":true,"followsDelimiter":"/","description":"Displays the 100(1 - α)% upper and lower confidence limits for the expected value of the dependent variable (mean) for each observation.","type":"standalone"},{"name":"COLLIN","optional":true,"followsDelimiter":"/","description":"Requests a detailed analysis of collinearity among the regressors.","type":"standalone"},{"name":"COLLINOINT","optional":true,"followsDelimiter":"/","description":"Requests the same analysis as the COLLIN option with the intercept variable adjusted out rather than included in the diagnostics.","type":"standalone"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Displays the correlation matrix of the estimates.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Displays the estimated covariance matrix of the estimates.","type":"standalone"},{"name":"CP","optional":true,"followsDelimiter":"/","description":"Outputs Mallows’ Cp statistic for each model selected (Mallows 1973; Hocking 1976) to the OUTEST= data set.","type":"standalone"},{"name":"DETAILS=","optional":true,"followsDelimiter":"/","description":"Specifies the level of detail produced when the BACKWARD, FORWARD, or STEPWISE method is used.","help":"DETAILS=ALL | STEPS | SUMMARY","type":"choice","arguments":[{"name":"ALL","followsDelimiter":"/","description":"Produces entry and removal statistics for each variable in the model building process, ANOVA and parameter estimates at each step, and a selection summary table.","type":"standalone"},{"name":"STEPS","followsDelimiter":"/","description":"Provides the step information and summary table.","type":"standalone"},{"name":"SUMMARY","followsDelimiter":"/","description":"Produces only the summary table.","type":"standalone"}]},{"name":"DW","optional":true,"followsDelimiter":"/","description":"Calculates a Durbin-Watson statistic to test whether or not the errors have first-order autocorrelation. (This test is appropriate only for time series data.)","type":"standalone"},{"name":"DWPROB","optional":true,"followsDelimiter":"/","description":"Calculates a Durbin-Watson statistic and a p-value to test whether or not the errors have first-order autocorrelation.","type":"standalone"},{"name":"EDF","optional":true,"followsDelimiter":"/","description":"Outputs the number of regressors in the model excluding and including the intercept, the error degrees of freedom, and the model R-square to the OUTEST= data set.","type":"standalone"},{"name":"GMSEP","optional":true,"followsDelimiter":"/","description":"Outputs the estimated mean square error of prediction assuming that both independent and dependent variables are multivariate normal to the OUTEST= data set.","type":"standalone"},{"name":"GROUPNAMES=","optional":true,"followsDelimiter":"/","description":"Provides names for variable groups. This option is available only in the BACKWARD, FORWARD, and STEPWISE methods.","type":"value"},{"name":"HCC","optional":true,"followsDelimiter":"/","description":"Requests heteroscedasticity-consistent standard errors of the parameter estimates. You can use the HCCMETHOD= option to specify the method used to compute the heteroscedasticity-consistent covariance matrix.","type":"standalone"},{"name":"HCCMETHOD=","optional":true,"followsDelimiter":"/","description":"Specifies the method used to obtain a heteroscedasticity-consistent covariance matrix for use with the ACOV, HCC, or WHITE option in the MODEL statement and for heteroscedasticity-consistent tests with the TEST statement.","help":"HCCMETHOD=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","followsDelimiter":"/","description":"Uses the HC0 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"},{"name":"1","followsDelimiter":"/","description":"Uses the HC1 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"},{"name":"2","followsDelimiter":"/","description":"Uses the HC2 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"},{"name":"3","followsDelimiter":"/","description":"Uses the HC3 heteroscedasticity-consistent covariance matrix estimator.","type":"standalone"}]},{"name":"I","optional":true,"followsDelimiter":"/","description":"Displays the (X'X)⁻¹ matrix. The inverse of the crossproducts matrix is bordered by the parameter estimates and SSE matrices.","type":"standalone"},{"name":"INCLUDE=","optional":true,"followsDelimiter":"/","description":"Forces the first n independent variables listed in the MODEL statement to be included in all models.","help":"INCLUDE=*n*","type":"value"},{"name":"INFLUENCE","optional":true,"followsDelimiter":"/","description":"Requests a detailed analysis of the influence of each observation on the estimates and the predicted values.","type":"standalone"},{"name":"JP","optional":true,"followsDelimiter":"/","description":"Outputs Jp, the estimated mean square error of prediction for each model selected assuming that the values of the regressors are fixed and that the model is correct to the OUTEST= data set.","type":"standalone"},{"name":"LACKFIT","optional":true,"followsDelimiter":"/","description":"Performs a lack-of-fit test.","type":"standalone"},{"name":"MAXSTEP=","optional":true,"followsDelimiter":"/","description":"Specifies the maximum number of steps that are done when SELECTION=FORWARD, SELECTION=BACKWARD, or SELECTION=STEPWISE is used.","help":"MAXSTEP=*n*","type":"value"},{"name":"MSE","optional":true,"followsDelimiter":"/","description":"Computes the mean square error for each model selected.","type":"standalone"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Suppresses the intercept term that is otherwise included in the model.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses the normal display of regression results.","type":"standalone"},{"name":"OUTSEB","optional":true,"followsDelimiter":"/","description":"Outputs the standard errors of the parameter estimates to the OUTEST= data set.","type":"standalone"},{"name":"OUTSTB","optional":true,"followsDelimiter":"/","description":"Outputs the standardized parameter estimates as well as the usual estimates to the OUTEST= data set when the RIDGE= or PCOMIT= option is specified.","type":"standalone"},{"name":"OUTVIF","optional":true,"followsDelimiter":"/","description":"Outputs the variance inflation factors (VIF) to the OUTEST= data set when the RIDGE= or PCOMIT= option is specified.","type":"standalone"},{"name":"P","optional":true,"followsDelimiter":"/","description":"Calculates predicted values from the input data and the estimated model.","type":"standalone"},{"name":"PARTIAL","optional":true,"followsDelimiter":"/","description":"Requests partial regression leverage plots for each regressor.","type":"standalone"},{"name":"PARTIALDATA","optional":true,"followsDelimiter":"/","description":"Requests partial regression leverage data for each regressor.","type":"standalone"},{"name":"PARTIALR2","optional":true,"followsDelimiter":"/","description":"Displays the squared semipartial correlation coefficients computed using Type I sums of squares.","type":"standalone"},{"name":"PC","optional":true,"followsDelimiter":"/","description":"Outputs Amemiya’s prediction criterion for each model selected to the OUTEST= data set.","type":"standalone"},{"name":"PCOMIT=","optional":true,"followsDelimiter":"/","description":"Requests an IPC analysis for each value m in the list.","help":"PCOMIT=*list*","type":"value"},{"name":"PCORR1","optional":true,"followsDelimiter":"/","description":"Displays the squared partial correlation coefficients computed using Type I sum of squares (SS).","type":"standalone"},{"name":"PCORR2","optional":true,"followsDelimiter":"/","description":"Displays the squared partial correlation coefficients computed using Type II sums of squares.","type":"standalone"},{"name":"PRESS","optional":true,"followsDelimiter":"/","description":"Outputs the PRESS statistic to the OUTEST= data set. The values of this statistic are saved in the variable _PRESS_.","type":"standalone"},{"name":"R","optional":true,"followsDelimiter":"/","description":"Requests an analysis of the residuals.","type":"standalone"},{"name":"RIDGE=","optional":true,"followsDelimiter":"/","description":"Requests a ridge regression analysis and specifies the values of the ridge constant k.","help":"RIDGE=*list*","type":"value"},{"name":"RMSE","optional":true,"followsDelimiter":"/","description":"Displays the root mean square error for each model selected.","type":"standalone"},{"name":"RSQUARE","optional":true,"followsDelimiter":"/","description":"Has the same effect as the EDF option.","type":"standalone"},{"name":"SBC","optional":true,"followsDelimiter":"/","description":"Outputs the SBC statistic for each model selected to the OUTEST= data set.","type":"standalone"},{"name":"SCORR1","optional":true,"followsDelimiter":"/","description":"Displays the squared semipartial correlation coefficients computed using Type I sums of squares.","type":"standalone"},{"name":"SCORR2","optional":true,"followsDelimiter":"/","description":"Displays the squared semipartial correlation coefficients computed using Type II sums of squares.","type":"standalone"},{"name":"SEQB","optional":true,"followsDelimiter":"/","description":"Produces a sequence of parameter estimates as each variable is entered into the model.","type":"standalone"},{"name":"SIGMA=","optional":true,"followsDelimiter":"/","description":"Specifies the true standard deviation of the error term to be used in computing the CP and BIC statistics.","help":"SIGMA=*n*","type":"value"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Tunes the mechanism used to check for singularities.","help":"SINGULAR=*n*","type":"value"},{"name":"SLENTRY=","optional":true,"followsDelimiter":"/","aliases":["SLE="],"description":"Specifies the significance level for entry into the model used in the FORWARD and STEPWISE methods. The defaults are 0.50 for FORWARD and 0.15 for STEPWISE.","help":"SLENTRY=*value*","type":"value"},{"name":"SLSTAY=","optional":true,"followsDelimiter":"/","aliases":["SLS="],"description":"Specifies the significance level for staying in the model for the BACKWARD and STEPWISE methods. The defaults are 0.10 for BACKWARD and 0.15 for STEPWISE.","help":"SLSTAY=*value*","type":"value"},{"name":"SP","optional":true,"followsDelimiter":"/","description":"outputs the Sp statistic for each model selected to the OUTEST= data set.","type":"standalone"},{"name":"SPEC","optional":true,"followsDelimiter":"/","description":"Performs a test that the first and second moments of the model are correctly specified.","type":"standalone"},{"name":"SS1","optional":true,"followsDelimiter":"/","description":"Displays the sequential sums of squares (Type I SS) along with the parameter estimates for each term in the model.","type":"standalone"},{"name":"SS2","optional":true,"followsDelimiter":"/","description":"Displays the partial sums of squares (Type II SS) along with the parameter estimates for each term in the model.","type":"standalone"},{"name":"SSE","optional":true,"followsDelimiter":"/","description":"Computes the error sum of squares for each model selected.","type":"standalone"},{"name":"START=","optional":true,"followsDelimiter":"/","description":"Is used to begin the comparing-and-switching process in the MAXR, MINR, and STEPWISE methods for a model containing the first s independent variables in the MODEL statement, where s is the START value.","help":"START=*s*","type":"value"},{"name":"STB","optional":true,"followsDelimiter":"/","description":"Produces standardized regression coefficients.","type":"standalone"},{"name":"STOP=","optional":true,"followsDelimiter":"/","description":"Causes PROC REG to stop when it has found the \"best\" s-variable model, where s is the STOP value.","help":"STOP=*s*","type":"value"},{"name":"TOL","optional":true,"followsDelimiter":"/","description":"Produces tolerance values for the estimates.","type":"standalone"},{"name":"VIF","optional":true,"followsDelimiter":"/","description":"Produces variance inflation factors with the parameter estimates. Variance inflation is the reciprocal of tolerance.","type":"standalone"},{"name":"WHITE","optional":true,"followsDelimiter":"/","description":"See the HCC option.","type":"standalone"},{"name":"XPX","optional":true,"followsDelimiter":"/","description":"Displays the X'X crossproducts matrix for the model.","type":"standalone"}]},{"name":"MTEST","description":"where each equation is a linear function composed of coefficients and variable names. The label is optional. The MTEST statement is used to test hypotheses in multivariate regression models where there are several dependent variables fit to the same regressors.","help":"MTEST &lt;CANPRINT&gt; &lt;DETAILS&gt; &lt;MSTAT=&lt;FAPPROX | EXACT&gt;&gt; ...","arguments":[{"name":"CANPRINT","optional":true,"followsDelimiter":"/","description":"Displays the canonical correlations for the hypothesis combinations and the dependent variable combinations.","type":"standalone"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"Displays the M matrix and various intermediate calculations.","type":"standalone"},{"name":"MSTAT=","optional":true,"followsDelimiter":"/","description":"Specifies the method of evaluating the multivariate test statistics.","help":"MSTAT=FAPPROX | EXACT","type":"choice","arguments":[{"name":"FAPPROX","followsDelimiter":"/","description":"Specifies that the multivariate tests are evaluated by using the usual approximations based on the F distribution","type":"standalone"},{"name":"EXACT","followsDelimiter":"/","description":"Compute exact p-values for three of the four tests (Wilks’ lambda, the Hotelling-Lawley trace, and Roy’s greatest root) and an improved F approximation for the fourth (Pillai’s trace).","type":"standalone"}]},{"name":"PRINT","optional":true,"followsDelimiter":"/","description":"Displays the H and E matrices.","type":"standalone"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set that saves diagnostic measures calculated after fitting the model.","help":"OUTPUT &lt;COOKD=&gt; &lt;COVRATIO=&gt; &lt;OUT=SAS-data-set&gt; ...","arguments":[{"name":"COOKD=","optional":true,"description":"Cook’s D influence statistic","type":"value"},{"name":"COVRATIO=","optional":true,"description":"Standard influence of observation on covariance of betas","type":"value"},{"name":"DFFITS=","optional":true,"description":"Standard influence of observation on predicted value","type":"value"},{"name":"H=","optional":true,"description":"Leverage","type":"value"},{"name":"LCL=","optional":true,"description":"Lower bound of a 100(1 - α)% confidence interval for an individual prediction.","type":"value"},{"name":"LCLM=","optional":true,"description":"Lower bound of a 100(1 - α)% confidence interval for the expected value (mean) of the dependent variable.","type":"value"},{"name":"OUT=","optional":true,"description":"Gives the name of the new data set. By default, the procedure uses the DATAn convention to name the new data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PREDICTED=","optional":true,"description":"Predicted values","type":"value"},{"name":"PRESS=","optional":true,"description":"i-th residual divided by (1-h), where h is the leverage, and where the model has been refit without the i-th observation.","type":"value"},{"name":"RESIDUAL=","optional":true,"description":"Residuals, calculated as ACTUAL minus PREDICTED.","type":"value"},{"name":"RSTUDENT=","optional":true,"description":"A studentized residual with the current observation deleted.","type":"value"},{"name":"STDI=","optional":true,"description":"Standard error of the individual predicted value.","type":"value"},{"name":"STDP=","optional":true,"description":"Standard error of the mean predicted value.","type":"value"},{"name":"STDR","optional":true,"description":"Standard error of the residual.","type":"standalone"},{"name":"STUDENT=","optional":true,"description":"Studentized residuals, which are the residuals divided by their standard errors.","type":"value"},{"name":"UCL=","optional":true,"description":"Upper bound of a 100(1 - α)% confidence interval for an individual prediction.","type":"value"},{"name":"UCLM=","optional":true,"description":"Upper bound of a 100(1 - α)% confidence interval for the expected value (mean) of the dependent variable.","type":"value"}]},{"name":"PAINT","description":"The PAINT statement selects observations to be painted or highlighted in a scatter plot on line printer output.","help":"PAINT ALLOBS &lt;NOLIST&gt; &lt;RESET&gt; ...","arguments":[{"name":"ALLOBS","description":"Selects all observations.","type":"standalone"},{"name":"STATUS","description":"Lists (in the log) the observation number and plotting symbol of all currently painted observations.","type":"standalone"},{"name":"UNDO","description":"Undoes changes made by the most recent PAINT statement.","type":"standalone"},{"name":"NOLIST","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the selected observation numbers.","type":"standalone"},{"name":"RESET","optional":true,"followsDelimiter":"/","description":"Changes the painting symbol to the current default symbol, effectively unpainting the observations selected.","type":"standalone"},{"name":"SYMBOL=","optional":true,"followsDelimiter":"/","description":"Specifies a painting symbol.","type":"value"}]},{"name":"PRINT","description":"The PRINT statement enables you to interactively display the results of MODEL statement options, produce an ANOVA table, display the data for variables used in the current model, or redisplay the options specified in a MODEL or a previous PRINT statement.","help":"PRINT &lt;ACOV&gt; &lt;ANOVA&gt; &lt;MODELDATA&gt; ...","arguments":[{"name":"ACOV","optional":true,"description":"Displays the estimated asymptotic covariance matrix of the estimates under the hypothesis of heteroscedasticity and heteroscedasticity-consistent standard errors of parameter estimates.","type":"standalone"},{"name":"ALL","optional":true,"description":"Outputs Akaike’s information criterion for each model selected to the OUTEST= data set.","type":"standalone"},{"name":"ANOVA","optional":true,"description":"Produces the ANOVA table associated with the current model.","type":"standalone"},{"name":"CLI","optional":true,"description":"Requests the 100(1 - α)% upper and lower confidence limits for an individual predicted value. By default, the 95% limits are computed","type":"standalone"},{"name":"CLM","optional":true,"description":"Displays the 100(1 - α)% upper and lower confidence limits for the expected value of the dependent variable (mean) for each observation.","type":"standalone"},{"name":"COLLIN","optional":true,"description":"Requests a detailed analysis of collinearity among the regressors.","type":"standalone"},{"name":"COLLINOINT","optional":true,"description":"Requests the same analysis as the COLLIN option with the intercept variable adjusted out rather than included in the diagnostics.","type":"standalone"},{"name":"CORRB","optional":true,"description":"Displays the correlation matrix of the estimates.","type":"standalone"},{"name":"COVB","optional":true,"description":"Displays the estimated covariance matrix of the estimates.","type":"standalone"},{"name":"DW","optional":true,"description":"DCalculates a Durbin-Watson statistic to test whether or not the errors have first-order autocorrelation. (This test is appropriate only for time series data.)","type":"standalone"},{"name":"I","optional":true,"description":"Displays the (X'X)⁻¹ matrix. The inverse of the crossproducts matrix is bordered by the parameter estimates and SSE matrices.","type":"standalone"},{"name":"INFLUENCE","optional":true,"description":"Requests a detailed analysis of the influence of each observation on the estimates and the predicted values.","type":"standalone"},{"name":"MODELDATA","optional":true,"description":"Displays the data for variables used in the current model.","type":"standalone"},{"name":"P","optional":true,"description":"Calculates predicted values from the input data and the estimated model.","type":"standalone"},{"name":"PARTIAL","optional":true,"description":"Requests partial regression leverage plots for each regressor.","type":"standalone"},{"name":"PCORR1","optional":true,"description":"Displays the squared partial correlation coefficients computed using Type I sum of squares (SS).","type":"standalone"},{"name":"PCORR2","optional":true,"description":"Displays the squared partial correlation coefficients computed using Type II sums of squares.","type":"standalone"},{"name":"R","optional":true,"description":"Requests an analysis of the residuals.","type":"standalone"},{"name":"SCORR1","optional":true,"description":"Displays the squared semipartial correlation coefficients computed using Type I sums of squares.","type":"standalone"},{"name":"SCORR2","optional":true,"description":"Displays the squared semipartial correlation coefficients computed using Type II sums of squares.","type":"standalone"},{"name":"SEQB","optional":true,"description":"Produces a sequence of parameter estimates as each variable is entered into the model.","type":"standalone"},{"name":"SPEC","optional":true,"description":"Performs a test that the first and second moments of the model are correctly specified.","type":"standalone"}]},{"name":"REFIT","description":"The REFIT statement causes the current model and corresponding statistics to be recomputed immediately. No output is generated by this statement.","help":"REFIT "},{"name":"RESTRICT","description":"A RESTRICT statement is used to place restrictions on the parameter estimates in the MODEL preceding it. More than one RESTRICT statement can follow each MODEL statement.","help":"RESTRICT equation &lt;, ..., equation&gt; "},{"name":"REWEIGHT","description":"The REWEIGHT statement interactively changes the weights of observations that are used in computing the regression equation. The REWEIGHT statement can change observation weights, or set them to zero, which causes selected observations to be excluded from the analysis.","help":"REWEIGHT &lt;ALLOBS&gt; &lt;NOLIST&gt; &lt;RESET&gt; ...","arguments":[{"name":"ALLOBS","optional":true,"followsDelimiter":"/","description":"Selects all observations.","type":"standalone"},{"name":"NOLIST","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the selected observation numbers. If you omit the NOLIST option, a list of observations selected is written to the log.","type":"standalone"},{"name":"RESET","optional":true,"followsDelimiter":"/","description":"Resets the observation weights to their original values as defined by the WEIGHT statement or to WEIGHT=1 if no WEIGHT statement is specified.","type":"standalone"},{"name":"STATUS","optional":true,"followsDelimiter":"/","description":"[Valid only if you omit condition and the ALLOBS options] Writes to the log the observation’s number and the weight of all reweighted observations.","type":"standalone"},{"name":"UNDO","optional":true,"followsDelimiter":"/","description":"[Valid only if you omit condition and the ALLOBS options] Undoes the changes made by the most recent REWEIGHT statement.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"Changes observation weights to the specified nonnegative real number. If you omit the WEIGHT= option, the observation weights are set to zero, and observations are excluded from the analysis.","help":"WEIGHT=*value*","type":"value"}]},{"name":"TEST","description":"The TEST statement tests hypotheses about the parameters estimated in the preceding MODEL statement.","help":"TEST &lt;PRINT&gt; ","arguments":[{"name":"PRINT","optional":true,"followsDelimiter":"/","description":"Displays intermediate calculations.","type":"standalone"}]},{"name":"VAR","description":"The VAR statement is used to include numeric variables in the crossproducts matrix that are not specified in the first MODEL statement.","help":"VAR variables "},{"name":"WEIGHT","description":"A WEIGHT statement names a variable in the input data set with values that are relative weights for a weighted least squares fit. If the weight value is proportional to the reciprocal of the variance for each observation, then the weighted estimates are the best linear unbiased estimates (BLUE).","help":"WEIGHT variable"}],"interactive":true,"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_029","docsetTargetFile":"statug_reg_toc.htm"}}