{"name":"ROBUSTREG","statements":[{"name":"PROC ROBUSTREG","description":"The main purpose of robust regression is to detect outliers and provide resistant (stable) results in the presence of outliers. In order to achieve this stability, robust regression limits the influence of outliers. Historically, three classes of problems have been addressed with robust regression techniques: † o problems with outliers in the -direction (response direction) † o problems with multivariate outliers in the -space (that is, outliers in the covariate space, which are also referred to as leverage points) † o problems with outliers in both the -direction and the x-space","help":"PROC ROBUSTREG <COVOUT> <DATA=SAS-data-set> <FWLS> <INEST=SAS-data-set> <ITPRINT> <METHOD=M | LTS | S... > <NAMELEN=n> <ORDER=DATA | FORMATTED | FREQ... > <OUTEST=SAS-data-set> <PLOTS=ALL | DDPLOT | FITPLOT... > <SEED=number>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCLASS variables ;     \n\tEFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  <PERIOD=variable> <WITHIN=(variables) | WITHIN=variable> ...;     \n\tID variables ;     \n\tMODEL <ALPHA=value> <CORRB> <COVB> ...; \n   \n\tOUTPUT <LEVERAGE=> <OUT=SAS-data-set> <OUTLIER=> ...; \n   \n\tPERFORMANCE <CPUCOUNT=<<1-1024> | ACTUAL>> <DETAILS> <THREADS> ...; \n   \n\t<label:> TEST effects ;     \n\tWEIGHT variable; ","arguments":[{"name":"COVOUT","optional":true,"description":"Saves the estimated covariance matrix in the OUTEST= data set. This option is not supported for LTS estimation.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set used by PROC ROBUSTREG. By default, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"FWLS","optional":true,"description":"Requests that final weighted least squares estimates be computed.","type":"standalone"},{"name":"INEST=","optional":true,"description":"Specifies an input SAS data set that contains initial estimates for all the parameters in the model.","help":"INEST=*SAS-data-set*","type":"dataSet"},{"name":"ITPRINT","optional":true,"description":"Displays the iteration history for the iteratively reweighted least squares algorithm used by M and MM estimation.","type":"standalone"},{"name":"METHOD=","optional":true,"description":"Specifies the estimation method and specify some additional options for the estimation method.","help":"METHOD=M | LTS | S | MM","type":"choice","arguments":[{"name":"M","description":"[Syntax: M<(options)>] With METHOD=M, you can specify the following additional options: ASYMPCOV=H1 | H2 | H3 specifies the type of asymptotic covariance computed for the M estimate. CONVERGENCE=criterion<(EPS=value)> specifies a convergence criterion for the M estimate. MAXITER=n sets the maximum number of iterations during the parameter estimation. By default, MAXITER=1000. SCALE=scale type | value specifies the scale parameter or a method for estimating the scale parameter. WF | WEIGHTFUNCTION=function type specifies the weight function used for the M estimate.","type":"standalone"},{"name":"LTS","description":"[Syntax: LTS<(options)>] With METHOD=LTS, you can specify the following additional options: CSTEP=n specifies the number of C-steps for the LTS estimate. IADJUST=ALL | NONE requests (IADJUST=ALL) or suppresses (IADJUST=NONE) the intercept adjustment for all estimates in the LTS algorithm. H=n specifies the quantile for the LTS estimate. NBEST=n specifies the number of best solutions kept for each subgroup during the computation of the LTS estimate. The default number is 10, which is the maximum number allowed. NREP=n specifies the number of repeats of least squares fit in subgroups during the computation of the LTS estimate. SUBANALYSIS requests a display of the subgrouping information and parameter estimates within subgroups. SUBGROUPSIZE=n specifies the data set size of the subgroups in the computation of the LTS estimate. The default number is 300.","type":"standalone"},{"name":"S","description":"[Syntax: S<(options)>] With METHOD=S, you can specify the following additional options: ASYMPCOV=H1 | H2 | H3 | H4 specifies the type of asymptotic covariance computed for the S estimate. CHIF= TUKEY | YOHAI specifies the Chi function for the S estimate. EFF=value specifies the efficiency (as a fraction) for the S estimate. K0=value specifies the k0 parameter in the Chi function of the S estimate. MAXITER=n sets the maximum number of iterations for computing the scale parameter of the S estimate. By default, MAXITER=1000. NREP=n specifies the number of repeats of subsampling in the computation of the S estimate. NOREFINE suppresses the refinement for the S estimate. SUBSETSIZE=n specifies the size of the subset for the S estimate. TOLERANCE=value specifies the tolerance for the S estimate of the scale. The default value is 0.001.","type":"standalone"},{"name":"MM","description":"[Syntax: MM<(options)>] With METHOD=MM, you can specify the following additional options: ASYMPCOV=H1 | H2 | H3 | H4 specifies the type of asymptotic covariance computed for the MM estimate. BIASTEST<(ALPHA=number)>> requests the bias test for the final MM estimate. CHIF= TUKEY | YOHAI selects the Chi function for the MM estimate. CONVERGENCE=criterion<(EPS=number)> specifies a convergence criterion for the MM estimate. EFF=value specifies the efficiency (as a fraction) for the MM estimate. INITH=n specifies the integer h for the initial LTS estimate used by the MM estimator. INITEST=LTS | S specifies the initial estimator for the MM estimator. K0=number specifies the parameter ko in the Chi function for the MM estimate. MAXITER=n sets the maximum number of iterations during the parameter estimation. By default, MAXITER=1000.","type":"standalone"}]},{"name":"NAMELEN=","optional":true,"description":"Specifies the length of effect names in tables and output data sets to be n characters, where n is a value between 20 and 200. The default length is 20 characters.","help":"NAMELEN=*n*","type":"value"},{"name":"ORDER=","optional":true,"description":"Specifies the order in which to sort the levels of the classification variables (which are specified in the CLASS statement).","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels sorted by the unformatted value.","type":"standalone"}]},{"name":"OUTEST=","optional":true,"description":"Specifies an output SAS data set containing the parameter estimates, and, if the COVOUT option is specified, the estimated covariance matrix.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Specifies options that control details of the plots. The ONLY option suppresses the default robust fit plot. Only plots specifically requested are displayed. Syntax: (1) PLOT | PLOTS <(global-plot-options)> <=plot-request> (2) PLOT | PLOTS<(global-plot-options)> <=(plot-request < ...plot-request > )> The following global-plot-option is available:","help":"PLOTS=ALL | DDPLOT | FITPLOT | HISTORGRAM | NONE | QQPLOT | RDPLOT","type":"choice","arguments":[{"name":"ALL","description":"Creates all appropriate plots.","type":"standalone"},{"name":"DDPLOT","description":"[Syntax: DDPLOT<(LABEL=ALL|LEVERAGE|NONE|OUTLIER)>] Creates a plot of robust distance against Mahalanobis distance. The LABEL= option specifies how the points on this plot are to be labeled: LABEL=ALL label all points LABEL=LEVERAGE label leverage points LABEL=NONE no labels LABEL=OUTLIERS label outliers","type":"standalone"},{"name":"FITPLOT","description":"[Syntax: FITPLOT<(NOLIMITS)>] Creates a plot of robust fit against the single independent continuous variable specified in the model. You can request this plot when only a single independent continuous variable is specified in the model. Confidence limits are added on the plot by default. The NOLIMITS option suppresses these limits.","type":"standalone"},{"name":"HISTORGRAM","description":"Creates a histogram for the standardized robust residuals.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"QQPLOT","description":"Creates the normal quantile-quantile plot for the standardized robust residuals","type":"standalone"},{"name":"RDPLOT","description":"[Syntax: RDPLOT<(LABEL=ALL|LEVERAGE|NONE|OUTLIER)>] Creates the plot of standardized robust residual against robust distance. The LABEL= option specifies how the points on this plot are to be labeled: LABEL=ALL label all points LABEL=LEVERAGE label leverage points LABEL=NONE no labels LABEL=OUTLIERS label outliers","type":"standalone"}]},{"name":"SEED=","optional":true,"description":"Specifies the seed for the random number generator used to randomly select the subgroups and subsets for LTS and S estimation.","help":"SEED=*number*","type":"value"}]},{"name":"BY","description":"You can specify a BY statement with PROC ROBUSTREG to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","description":"Explanatory variables that are classification variables rather than quantitative numeric variables must be listed in the CLASS statement. For each explanatory variable listed in the CLASS statement, indicator variables are generated for the levels assumed by the CLASS variable. If the CLASS statement is used, it must appear before the MODEL statement.","help":"CLASS variables "},{"name":"EFFECT","description":"The name of the effect is specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. The effect-type is specified after an equal sign, followed by a list of variables within parentheses which are used in constructing the effect. Effect-options that are specific to an effect-type can be specified after a slash (/) following the variable list. The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects formed from continuous or classification variables.","help":"EFFECT EFFECT-NAME=COLLECTION|LAG|MULTIMEMBER|MM...  &lt;PERIOD=variable&gt; &lt;WITHIN=(variables) | WITHIN=variable&gt; ...","arguments":[{"name":"EFFECT-NAME=","description":"Replace 'EFFECT-NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set. These values can be used: COLLECTION, LAG, MULTIMEMBER, POLYNOMIAL, or SPLINE.","type":"value"},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DESIGNROLE=","optional":true,"followsDelimiter":"/","description":"","help":"DESIGNROLE=*variable*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the LAG | COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the (1) lag design matrix of the lag effect, or (2) constituents of the collection effect, or (3) levels of the multimember effect, or (4) details of the specified polynomial, or (5) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"LABELSTYLE=","optional":true,"followsDelimiter":"/","description":"","help":"LABELSTYLE=EXPAND | EXPONENT | INCLUDENAME | PRODUCTSYMBOL=","type":"choice","arguments":[{"name":"EXPAND","followsDelimiter":"/","description":"Specifies that each variable with an exponent greater than 1 be written as products of that variable.","type":"standalone"},{"name":"EXPONENT","followsDelimiter":"/","description":"Syntax: EXPONENT <=quoted string> Specifies that each variable with an exponent greater than 1 be written using exponential notation. By default, the symbol ^ is used as the exponentiation operator. If you supply the optional quoted string after an equal sign, then that string is used as the exponentiation operator.","type":"standalone"},{"name":"INCLUDENAME","followsDelimiter":"/","description":"Specifies that the name of the effect followed by an underscore be used as a prefix for term labels.","type":"standalone"},{"name":"PRODUCTSYMBOL=","followsDelimiter":"/","description":"Syntax: PRODUCTSYMBOL=NONE | quoted string Specifies that the supplied string be used as the product symbol.","type":"value"}]},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NLAG=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that, for observations with all missing levels of the multimember variables, the values in the corresponding design matrix columns be set to zero.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"PERIOD=","optional":true,"followsDelimiter":"/","description":"Specifies the period variable of the LAG design. The number of periods is the number of unique formatted values of the PERIOD= variable, and the ordering of the period is formed by sorting these formatted values in ascending order. You must specify a PERIOD= variable.","help":"PERIOD=*variable*","type":"value"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"},{"name":"WITHIN=","optional":true,"followsDelimiter":"/","description":"","type":"value"}]},{"name":"ID","description":"When the diagnostics table is requested with the DIAGNOSTICS option in the MODEL statement, the variables listed in the ID statement are displayed in addition to the observation number. These variables can be used to identify each observation.","help":"ID variables "},{"name":"MODEL","description":"Main effects and interaction terms can be specified in the MODEL statement, as in the GLM procedure.","help":"MODEL &lt;ALPHA=value&gt; &lt;CORRB&gt; &lt;COVB&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the significance level for the confidence intervals for regression parameters. The value must be between 0 and 1. By default, ALPHA=0.05.","help":"ALPHA=*value*","type":"value"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Produces the estimated correlation matrix of the parameter estimates.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Produces the estimated covariance matrix of the parameter estimates.","type":"standalone"},{"name":"CUTOFF=","optional":true,"followsDelimiter":"/","description":"Specifies the multiplier of the cutoff value for outlier detection. By default, CUTOFF=3.","help":"CUTOFF=*value*","type":"value"},{"name":"DIAGNOSTICS=","optional":true,"followsDelimiter":"/","description":"Requests the outlier diagnostics. By default, only observations identified as outliers or leverage points are displayed. To request that all observations be displayed, specify the ALL option.","help":"DIAGNOSTICS=ALL","type":"choice","arguments":[{"name":"ALL","type":"standalone"}]},{"name":"ITPRINT","optional":true,"followsDelimiter":"/","description":"Displays the iteration history for the iteratively reweighted least squares algorithm used by M and MM estimation.","type":"standalone"},{"name":"LEVERAGE","optional":true,"followsDelimiter":"/","description":"Requests an analysis of leverage points for the covariates. The results are added to the diagnostics table, which you can request with the DIAGNOSTICS option in the MODEL statement. The following leverage-options are available: CUTOFF=value -- specifies the leverage cutoff value for leverage-point detection. CUTOFFALPHA=value specifies the leverage cutoff value for leverage-point detection. By default, α = 0.025. H | QUANTILE=n specifies the quantile to be minimized for the MCD algorithm that is used for the leverage-point analysis. By default, H=[(3n + p + 1)/4], where n is the number of observations and p is the number of independent variables excluding the intercept. MCDALPHA=value specifies the MCD cutoff value for the final MCD reweighting step. By default, α = 0.025. MCDCUTOFF | MCDCUTOFF=value specifies the MCD cutoff value for the final MCD reweighting step. The cutoff value can also be specified with the MCD cutoff value by using the MCDALPHA= option. MCDINFO requests that detailed information about the MCD covariance estimate be displayed, including the low-dimensional structure, the breakdown value, the MCD center, and the MCD covariance itself. The option outputs the ODS tables of the MCD profile, MCD center, MCD covariance, and MCD correlation. OPC | OFFPLANECOEF requests the ODS table of the coefficients for MCD-dropped components, when projection is applied in the generalized MCD algorithm. The OFFPLANECOEF option is ignored for the regular MCD algorithm. PALPHA | PROJECTIONALPHA=value specifies the projection cutoff value to be used to judge whether an observation is on or off the low-dimensional hyperplane identified by the generalized MCD algorithm. By default, α = 0.001. PCUTOFF | PROJECTIONCUTOFF=value specifies the projection cutoff value to be used to judge whether an observation is on or off the low-dimensional hyperplane identified by the projected MCD algorithm.","type":"standalone"},{"name":"NOGOODFIT","optional":true,"followsDelimiter":"/","description":"Suppresses the computation of goodness-of-fit statistics.","type":"standalone"},{"name":"NOINT","optional":true,"followsDelimiter":"/","description":"Specifies no-intercept regression.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","description":"Specifies the tolerance for testing singularity of the information matrix and the crossproducts matrix for the initial least squares estimates.","help":"SINGULAR=*value*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates an output SAS data set containing statistics calculated after fitting the model. At least one specification of the form keyword=name is required.","help":"OUTPUT &lt;LEVERAGE=&gt; &lt;OUT=SAS-data-set&gt; &lt;OUTLIER=&gt; ...","arguments":[{"name":"LEVERAGE=","optional":true,"description":"Specifies a variable to indicate leverage points.","type":"value"},{"name":"OUT=","optional":true,"description":"Specifies the new data set. By default, the procedure uses the DATAn convention to name the new data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTLIER=","optional":true,"description":"Specifies a variable to indicate outliers.","type":"value"},{"name":"PREDICTED=","optional":true,"aliases":["P="],"description":"Specifies a variable to contain the estimated response.","type":"value"},{"name":"RESIDUAL=","optional":true,"aliases":["R="],"description":"Specifies a variable to contain the unstandardized residuals.","type":"value"},{"name":"STDI=","optional":true,"description":"Specifies a variable to contain the estimates of the standard errors of the individual predicted values.","type":"value"},{"name":"STDP=","optional":true,"description":"Specifies a variable to contain the estimates of the standard errors of the estimated response.","type":"value"},{"name":"WEIGHT=","optional":true,"description":"Specifies a variable to contain the computed final weights.","type":"value"}]},{"name":"PERFORMANCE","description":"The PERFORMANCE statement is used to change default options that affect the performance of PROC ROBUSTREG and to request tables that show the performance options in effect and timing details.","help":"PERFORMANCE &lt;CPUCOUNT=&lt;&lt;1-1024&gt; | ACTUAL&gt;&gt; &lt;DETAILS&gt; &lt;THREADS&gt; ...","arguments":[{"name":"CPUCOUNT=","optional":true,"description":"Specifies the number of processors to use for forming crossproduct matrices.","help":"CPUCOUNT=&lt;1-1024&gt; | ACTUAL","type":"choice","arguments":[{"name":"<1-1024>","description":"Replace with a value between 1 and 1024 (inclusive).","type":"standalone"},{"name":"ACTUAL","description":"Sets CPUCOUNT to be the number of physical processors available.","type":"standalone"}]},{"name":"DETAILS","optional":true,"description":"Requests the \"PerfSettings\" table that shows the performance settings in effect and the \"Timing\" table that provides a broad timing breakdown of the PROC ROBUSTREG step.","type":"standalone"},{"name":"NOTHREADS","optional":true,"description":"Disables multithreaded computation. This option overrides the SAS system option THREADS | NOTHREADS.","type":"standalone"},{"name":"THREADS","optional":true,"description":"Enables multithreaded computation. This option overrides the SAS system option THREADS | NOTHREADS.","type":"standalone"}]},{"name":"TEST","description":"With M estimation and MM estimation, the TEST statement provides a means of obtaining a test for the canonical linear hypothesis concerning the parameters of the tested effects. The optional label, which must be a valid SAS name, is used to label output from the corresponding TEST statement.","help":"&lt;label:&gt; TEST effects "},{"name":"WEIGHT","description":"The WEIGHT statement specifies a weight variable in the input data set. If you want to use fixed weights for each observation in the input data set, place the weights in a variable in the data set and specify the name in a WEIGHT statement. The values of the WEIGHT variable can be nonintegral and are not truncated.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_028","docsetTargetFile":"statug_rreg_toc.htm"}}