{"name":"RSREG","statements":[{"name":"PROC RSREG","description":"The RSREG procedure uses the method of least squares to fit quadratic response surface regression models. Response surface models are a kind of general linear model in which attention focuses on characteristics of the fit response function and in particular, where optimum estimated response values occur.","help":"PROC RSREG <DATA=SAS-data-set> <NOPRINT> <OUT=SAS-data-set> <PLOTS=ALL | DIAGNOSTICS | FIT... >;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tID variables ;\n    \n\tMODEL <ACTUAL> <BYOUT> <COVAR=n> ...;\n    \n\tRIDGE <CENTER=uncoded-factor-values> <MAXIMUM> <MINIMUM> ...;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set that contains the data to be analyzed. By default, PROC RSREG uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results when only the output data set is required.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Creates an output SAS data set that contains statistics for each observation in the input data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Syntax: PLOTS <(global-plot-option)>=plot-request<(options)> PLOTS <(global-plot-option)>=(plot-request<(options)>< plot-request<(options)>>)","help":"PLOTS=ALL | DIAGNOSTICS | FIT | NONE | RESIDUALS | RIDGE | SURFACE","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"DIAGNOSTICS","description":"[Syntax: DIAGNOSTICS<(LABEL | UNPACK)>] Displays a panel of summary fit diagnostic plots.","type":"standalone"},{"name":"FIT","description":"[Syntax: FIT<(GRIDSIZE=number)>] Plots the predicted values against a single predictor when you have only one factor or only one covariate in the model.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"RESIDUALS","description":"[Syntax: RESIDUALS<(UNPACK | SMOOTH)>] Displays plots of residuals against each factor and covariate. The UNPACK option displays each residual plot separately. The SMOOTH option overlays a loess smooth on each residual plot.","type":"standalone"},{"name":"RIDGE","description":"[Syntax: RIDGE<(UNPACK)>] Displays the maximum and/or minimum ridge plots. The UNPACK option displays the estimated response and factor level ridge plots separately.","type":"standalone"},{"name":"SURFACE","description":"[Syntax: SURFACE<(surface-options)>] Displays the response surface for each response variable and each pair of factors with all other factors and covariates fixed at their means. By default a panel of contour plots is produced. The following surface-options can be specified: 3D displays three-dimensional surface plots instead of contour plots. AT <keyword><(variable=value-list | keyword <...variable=value-list | keyword>)> specifies fixed values for factors and covariates. Keywords available: MIN, MEAN, MIDRANGE, MAX. EXTEND=value extends the surface value-times the range of each factor in each direction, which enables you to see more of the fitted surface. FILL=PRED | SE | NONE produces a filled contour plot for either the predicted values or the standard errors. FILL=SE is the default. GRIDSIZE=n creates an nxn grid of points at which the estimated values for the surface and standard errors are computed, for n ≥ 0. By default, n=50. LINE<=PRED | SE | NONE> produces a contour line plot for either the predicted values or the standard errors. LINE=PRED is the default. NODESIGN suppresses the display of the design points on the contour surface plots and the overlaid contour-line plots. OVERLAYPAIRS produces overlaid contour line plots for all pairs of response variables in addition to the contour surface plots. ROTATE=angle rotates the 3D surface plots angle degrees, –180 < angle < 180. By default, angle = 57. TILT=angle tilts the 3D surface plots angle degrees, –180 < angle < 180. By default, angle = 20. UNPACKPANELS | UNPACK suppresses paneling, and displays each surface plot separately.","type":"standalone"}]}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"ID","description":"The ID statement names variables that are to be transferred to the data set created by the OUT= option in the PROC RSREG statement.","help":"ID variables "},{"name":"MODEL","description":"In the MODEL statement, you specify the response (dependent) variables followed by an equal sign and then the independent variables, some of which can be covariates.","help":"MODEL &lt;ACTUAL&gt; &lt;BYOUT&gt; &lt;COVAR=n&gt; ...","arguments":[{"name":"ACTUAL","optional":true,"followsDelimiter":"/","description":"Specifies that the observed response values from the input data set be written to the output data set.","type":"standalone"},{"name":"BYOUT","optional":true,"followsDelimiter":"/","description":"Uses only the first BY group to estimate the model.","type":"standalone"},{"name":"COVAR=","optional":true,"followsDelimiter":"/","description":"Declares that the first n variables on the right side of the model are simple linear regressors (covariates) and not factors in the quadratic response surface.","help":"COVAR=*n*","type":"value"},{"name":"D","optional":true,"followsDelimiter":"/","description":"Specifies that Cook’s D influence statistic be written to the output data set.","type":"standalone"},{"name":"L95","optional":true,"followsDelimiter":"/","description":"Specifies that the lower bound of a 95% confidence interval for an individual predicted value be written to the output data set.","type":"standalone"},{"name":"L95M","optional":true,"followsDelimiter":"/","description":"Specifies that the lower bound of a 95% confidence interval for the expected value of the dependent variable be written to the output data set.","type":"standalone"},{"name":"LACKFIT","optional":true,"followsDelimiter":"/","description":"Performs a lack-of-fit test.","type":"standalone"},{"name":"NOANOVA","optional":true,"followsDelimiter":"/","aliases":["NOAOV"],"description":"Suppresses the display of the analysis of variance and parameter estimates from the model fit.","type":"standalone"},{"name":"NOCODE","optional":true,"followsDelimiter":"/","description":"Performs the canonical and ridge analyses with the parameter estimates derived from fitting the response to the original values of the factor variables, rather than their coded values.","type":"standalone"},{"name":"NOOPTIMAL","optional":true,"followsDelimiter":"/","aliases":["NOOPT"],"description":"Suppresses the display of the canonical analysis for the quadratic response surface.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses the display of both the analysis of variance and the canonical analysis.","type":"standalone"},{"name":"PREDICT","optional":true,"followsDelimiter":"/","description":"Specifies that the values predicted by the model be written to the output data set.","type":"standalone"},{"name":"PRESS","optional":true,"followsDelimiter":"/","description":"Computes and displays the predicted residual sum of squares (PRESS) statistic for each dependent variable in the model.","type":"standalone"},{"name":"RESIDUAL","optional":true,"followsDelimiter":"/","description":"Specifies that the residuals, calculated as ACTUAL - PREDICTED, be written to the output data set.","type":"standalone"},{"name":"U95","optional":true,"followsDelimiter":"/","description":"Specifies that the upper bound of a 95% confidence interval for an individual predicted value be written to the output data set.","type":"standalone"},{"name":"U95M","optional":true,"followsDelimiter":"/","description":"Specifies that the upper bound of a 95% confidence interval for the expected value of the dependent variable be written to the output data set.","type":"standalone"}]},{"name":"RIDGE","description":"A RIDGE statement computes the ridge of optimum response.","help":"RIDGE &lt;CENTER=uncoded-factor-values&gt; &lt;MAXIMUM&gt; &lt;MINIMUM&gt; ...","arguments":[{"name":"CENTER=","optional":true,"description":"Gives the coordinates of the point x0 from which to begin the ridge.","help":"CENTER=*uncoded-factor-values*","type":"value"},{"name":"MAXIMUM","optional":true,"aliases":["MAX"],"description":"Computes the ridge of maximum response.","type":"standalone"},{"name":"MINIMUM","optional":true,"aliases":["MIN"],"description":"Computes the ridge of minimum response.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of the ridge analysis when only an output data set is required.","type":"standalone"},{"name":"OUTR=","optional":true,"description":"Creates an output SAS data set containing the computed optimum ridge.","help":"OUTR=*SAS-data-set*","type":"dataSet"},{"name":"RADIUS=","optional":true,"description":"Gives the distances from the ridge starting point at which to compute the optima. The values in the list represent distances between coded points. The list can take any of the following forms or can be composed of mixtures of them: m1,m2,...,mn specifies several values. m TO n specifies a sequence where m equals the starting value, n equals the ending value, and the increment equals 1.","help":"RADIUS=*coded-radii*","type":"value"}]},{"name":"WEIGHT","description":"The WEIGHT statement specifies a weight variable in the input data set.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_017","docsetTargetFile":"statug_rsreg_toc.htm"}}