{"name":"SCORE","statements":[{"name":"PROC SCORE","description":"The SCORE procedure multiplies values from two SAS data sets, one containing coefficients (for example, factor-scoring coefficients or regression coefficients) and the other containing raw data to be scored using the coefficients from the first data set.","help":"PROC SCORE <DATA=SAS-data-set> <NOSTD> <OUT=SAS-data-set> <PREDICT> <RESIDUAL> <SCORE=SAS-data-set> <TYPE=name or ‘string’>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tID variables ;\n    \n\tVAR variables ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the input SAS data set containing the raw data to score. This option is required.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NOSTD","optional":true,"description":"Suppresses centering and scaling of the raw data.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies the name of the SAS data set created by PROC SCORE. If you want to create a permanent SAS data set, you must specify a two-level name.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PREDICT","optional":true,"description":"Specifies that PROC SCORE should treat coefficients of -1 in the SCORE= data set as 0.","type":"standalone"},{"name":"RESIDUAL","optional":true,"description":"Reverses the sign of each score. Applied directly to regression results, PROC SCORE produces negative residuals (PREDICTACTUAL); the RESIDUAL option produces positive residuals (ACTUALPREDICT) instead.","type":"standalone"},{"name":"SCORE=","optional":true,"description":"Names the data set containing the scoring coefficients.","help":"SCORE=*SAS-data-set*","type":"dataSet"},{"name":"TYPE=","optional":true,"description":"Specifies the observations in the SCORE= data set that contain scoring coefficients.","type":"value"}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"ID","description":"The ID statement identifies variables from the DATA= data set to be included in the OUT= data set. If there is no ID statement, all variables from the DATA= data set are included in the OUT= data set. The ID variables can be character or numeric.","help":"ID variables "},{"name":"VAR","description":"The VAR statement specifies the variables to be used in computing scores. These variables must be in both the DATA= and SCORE= input data sets and must be numeric. If you do not specify a VAR statement, the procedure uses all numeric variables in the SCORE= data set.","help":"VAR variables "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_018","docsetTargetFile":"statug_score_toc.htm"}}