{"name":"SEMISUPLEARN","statements":[{"name":"PROC SEMISUPLEARN","description":"The SEMISUPLEARN procedure implements the graph-based semisupervised learning algorithm that relies on label spreading in a distributed framework in SAS Viya. The semisupervised learning algorithm has numerous applications, including web page classification, image recognition, medical imaging, natural language processing, and action recognition. † You can use the SEMISUPLEARN procedure to read and write data in distributed form and to perform search in parallel by making full use of multicore computers or distributed computing environments.","help":"PROC SEMISUPLEARN <DATA=CAS-libref.data-table> <GAMMA=number> <LABEL=CAS-libref.data-table> <MAXITER=number> <NTHREADS=number>;     \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...;\n    \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...;\n    \n\tINPUT <LEVEL=<INTERVAL>> ;\n    \n\tOUTPUT <COPYVAR=variable | COPYVARS=(variables)> <OUT=CAS-libref.data-table> ;\n    \n\tTARGET <LEVEL=<NOMINAL>> ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC SEMISUPLEARN to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"GAMMA=","optional":true,"description":"Specifies the number of the inverse of the variance for Gaussian kernels in order to calculate similarity between observations, where number is a positive real number. By default, GAMMA=20.","help":"GAMMA=*number*","type":"value"},{"name":"LABEL","optional":true,"description":"Specifies the input data table that contains the labeled data observations, which are the data with target variables. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","type":"standalone"},{"name":"MAXITER=","optional":true,"description":"Specifies the number of iterations for label predictions, where number is a positive integer. By default, MAXITER=3.","help":"MAXITER=*number*","type":"value"},{"name":"NTHREADS=","optional":true,"description":"Specifies the number of threads to use for the computation, where number is an integer from 1 to 64, inclusive. The default value is the maximum number of available threads per computer.","help":"NTHREADS=*number*","type":"value"}]},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates all CAS output tables on all nodes.","type":"standalone"}]},{"name":"INPUT","description":"The INPUT statement specifies the variables to use for calculating the similarity measure in the semisupervised learning algorithm. The variables must be of interval type. You must specify at least one input variable.","help":"INPUT &lt;LEVEL=&lt;INTERVAL&gt;&gt; ","arguments":[{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"Specifies the level of measurement of the variables.","help":"LEVEL=INTERVAL*INTERVAL*","type":"value","arguments":[{"name":"INTERVAL","followsDelimiter":"/","description":"Specifies that the level of measurement is interval.","type":"standalone"}]}]},{"name":"OUTPUT","description":"The OUTPUT statement creates the predicted target variable data table for both the unlabeled data and the labeled data. For each row in the output data table, the WARN column indicates whether the row of data is coming from labeled data or unlabeled data. The WARN value is 1 for labeled data and 0 for unlabeled data. In the table, the formatted strings are provided in the predicted label.","help":"OUTPUT &lt;COPYVAR=variable | COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; ","arguments":[{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Lists one or more variables from the unlabeled data table to be transferred to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC SEMISUPLEARN to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"TARGET","description":"The TARGET statement lists the target variable to be considered from the labeled data table in the PROC SEMISUPLEARN statement. You must specify one variable, which must be nominal. The default target variable type is nominal.","help":"TARGET &lt;LEVEL=&lt;NOMINAL&gt;&gt; ","arguments":[{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"Syntax: LEVEL=NOMINAL","help":"LEVEL=NOMINAL*NOMINAL*","type":"value","arguments":[{"name":"NOMINAL","followsDelimiter":"/","description":"Specifies that the target variable type is interval.","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"v_016","docsetTargetFile":"casml_semisuplearn_toc.htm"}}