{"name":"SEQDESIGN","statements":[{"name":"PROC SEQDESIGN","description":"The purpose of the SEQDESIGN procedure is to design interim analyses for clinical trials. Clinical trials are experiments on human subjects to demonstrate the efficacy and safety of new drugs or treatments. A simple example is a trial to test the effectiveness of a new drug in humans by comparing the outcomes in a group of patients who receive the new drug with the outcomes in a comparable group of patients who receive a placebo. † A clinical trial is conducted according to a plan called a protocol. A protocol details the objectives of the trial, the data collection process, and the analysis. The protocol specifies the null hypothesis and an alternative hypothesis, a test statistic, the probability α of a Type I error, the probability β of a Type II error, the sample size needed to attain a specified power of 1-β at an alternative reference, and critical values that are associated with the test statistic.","help":"PROC SEQDESIGN <ALTREF=θ1<(<LOWER=θ1l> <UPPER=θ1u>)>> <BOUNDARYSCALE=MLE | SCORE | STDZ... > <ERRSPEND> <MAXINFO=number> <PLOTS=ALL | ASN | BOUNDARY... > <PSS <( CREF= numbers )>> <STOPPROB <( CREF= numbers )>>;     \n\tDESIGN <ALPHA= <( <LOWER=>   <UPPER=> )>> <ALT=<LOWER | UPPER | TWOSIDED>> <BETA= <( <LOWER=>   <UPPER=> )>> ...; \n   \n\tSAMPLESIZE <MODEL=<INPUTNOBS | INPUTNEVENTS | ONESAMPLEMEAN>... > ; ","arguments":[{"name":"ALTREF=","optional":true,"description":"Specifies the alternative reference—that is, the hypothetical reference under the alternative hypothesis at which the power is computed. The LOWER= and UPPER= options are applicable only for a two-sided design with different lower and upper alternative references.","type":"value"},{"name":"BOUNDARYSCALE=","optional":true,"aliases":["BSCALE="],"description":"Specifies the statistic scale to be displayed in the boundaries for the output boundary table and boundary plots.","help":"BOUNDARYSCALE=MLE | SCORE | STDZ | PVALUE","type":"choice","arguments":[{"name":"MLE","description":"Corresponds to the boundary with the maximum likelihood estimator scale.","type":"standalone"},{"name":"SCORE","description":"Corresponds to the boundary with the score statistic scale.","type":"standalone"},{"name":"STDZ","description":"Corresponds to the boundary with the standardized normal Z scale.","type":"standalone"},{"name":"PVALUE","description":"Corresponds to the boundary with the p-value scale.","type":"standalone"}]},{"name":"ERRSPEND","optional":true,"description":"Displays the error spending at each stage for each boundary in the design.","type":"standalone"},{"name":"MAXINFO=","optional":true,"description":"Specifies the maximum information level for the design.","help":"MAXINFO=*number*","type":"value"},{"name":"PLOTS=","optional":true,"description":"Syntax: PLOTS <( ONLY )> <= plot-request> PLOTS <( ONLY )> <= ( plot-request < ...plot-request> ) > Specifies options that control the details of the plots. The default is PLOTS=BOUNDARY.","help":"PLOTS=ALL | ASN | BOUNDARY | COMBINEDBOUNDARY | ERRSPEND | NONE | POWER","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"ASN","description":"[Syntax: ASN<(CREF= numbers)> ] Displays a plot of the average sample numbers (expected sample sizes), under various hypothetical references. For a one-sided design, the power and expected sample sizes under hypotheses θ=ci*thetha1 are displayed, where θ1 is the alternative reference and ci are the values specified in the CREF= option. For a two-sided design, the power and expected sample sizes under hypotheses θ=ci*thetha1l and θ=ci*thetha1u are displayed, where thetha1l and thetha1u are the lower and upper alternative references, respectively. The default is CREF=0 to 1.5 by 0.01.","type":"standalone"},{"name":"BOUNDARY","description":"[Syntax: BOUNDARY<(HSCALE=INFO | SAMPLESIZE)> ] Displays a plot of the resulting sequential boundaries with the acceptance and rejection regions for each design. Either the information level (HSCALE=INFO) or the sample size (HSCALE=SAMPLESIZE) is displayed on the horizontal axis. If the HSCALE=SAMPLESIZE option is specified. the SAMPLESIZE statement must also be specified. The default is HSCALE=INFO.","type":"standalone"},{"name":"COMBINEDBOUNDARY","description":"[Syntax: COMBINEDBOUNDARY<(HSCALE=INFO | SAMPLESIZE | STAGE)> ] Displays a plot of the resulting sequential boundaries for all designs simultaneously. You can display the information level (HSCALE=INFO), the sample size (HSCALE=SAMPLESIZE), or the stage number (HSCALE=STAGE) on the horizontal axis. The default is HSCALE=INFO.","type":"standalone"},{"name":"ERRSPEND","description":"[Syntax: ERRSPEND<(HSCALE=INFO | STAGE)> ] Displays a plot of the error spending for all sequential boundaries in the designs simultaneously. axis. You can display the information level (HSCALE=INFO) or the stage number (HSCALE=STAGE) on the horizontal. With HSCALE=INFO, the information in percentage of its corresponding fixed-sample design is used in the plot. The default is HSCALE=STAGE.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"POWER","description":"[Syntax: POWER<(CREF= numbers)> ] Displays a plot of the power curves under various hypothetical references. For a one-sided design, the power and expected sample sizes under hypotheses θ=ci*thetha1 are displayed, where θ1 is the alternative reference and ci are the values specified in the CREF= option. For a two-sided design, the power and expected sample sizes under hypotheses θ=ci*thetha1l and θ=ci*thetha1u are displayed, where thetha1l and thetha1u are the lower and upper alternative references, respectively. The default is CREF=0 to 1.5 by 0.01.","type":"standalone"}]},{"name":"PSS","optional":true,"description":"Displays powers and expected sample sizes under various hypothetical references. For a one- sided design, the power and expected sample sizes under hypotheses θ=ci*thetha1 are displayed, where θ1 is the alternative reference and ci are the values specified in the CREF= option.","type":"standalone"},{"name":"STOPPROB","optional":true,"description":"Displays expected cumulative stopping probabilities under various hypothetical references. For a one-sided design, the power and expected sample sizes under hypotheses θ=ci*thetha1 are displayed, where θ1 is the alternative reference and ci are the values specified in the CREF= option.","type":"standalone"}]},{"name":"DESIGN","description":"The DESIGN statement requests a new group sequential design. You can use multiple DESIGN statements, and each DESIGN statement corresponds to a separate group sequential design.","help":"DESIGN &lt;ALPHA= &lt;( &lt;LOWER=&gt;   &lt;UPPER=&gt; )&gt;&gt; &lt;ALT=&lt;LOWER | UPPER | TWOSIDED&gt;&gt; &lt;BETA= &lt;( &lt;LOWER=&gt;   &lt;UPPER=&gt; )&gt;&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the Type I error probability a. The default is a=0.05. The LOWER= and UPPER= options are applicable only for the two-sided design.","type":"value"},{"name":"ALT=","optional":true,"description":"Specifies the type of alternative hypothesis in the design.","help":"ALT=LOWER | UPPER | TWOSIDED","type":"choice","arguments":[{"name":"LOWER","description":"Corresponds to the alternative hypothesis θ is less than 0.","type":"standalone"},{"name":"UPPER","description":"Corresponds to the alternative hypothesis θ is greater than 0.","type":"standalone"},{"name":"TWOSIDED","description":"Corresponds to the alternative hypothesis θ not equal to 0.","type":"standalone"}]},{"name":"BETA=","optional":true,"description":"Specifies the Type II error probability level β. The default is β=0.10. The LOWER= and UPPER= options are applicable only for the two-sided design.","type":"value"},{"name":"BOUNDARYKEY=","optional":true,"description":"Specifies types of errors to be maintained in the resulting boundary. The default is BOUNDARYKEY=ALPHA if both ALTREF= and MAXINFO= options are specified. Otherwise, the default is BOUNDARYKEY=NONE for Whitehead methods with the STOP=BOTH option, and it is BOUNDARYKEY=BOTH for others.","help":"BOUNDARYKEY=ALPHA | BETA | BOTH | NONE","type":"choice","arguments":[{"name":"ALPHA","description":"Maintains the Type I error probability level a and derives Type II error probability b.","type":"standalone"},{"name":"BETA","description":"Maintains the Type II error probability level β and derives Type I error probability a.","type":"standalone"},{"name":"BOTH","description":"Derives boundary values that maintain both Type I and Type II error probability levels, If the ALTREF= and MAXINFO= options are not both specified.","type":"standalone"},{"name":"NONE","description":"Derives both Type I and Type II error probabilities with the completely specified boundary values.","type":"standalone"}]},{"name":"INFO=","optional":true,"description":"Specifies relative information levels for all stages in the design.","help":"INFO=EQUAL | CUM(numbers)","type":"choice","arguments":[{"name":"EQUAL","description":"Specifies equally spaced information levels. This is the default.","type":"standalone"},{"name":"CUM","description":"Specifies cumulative relative information levels.","help":"CUM(numbers)","type":"standalone"}]},{"name":"METHOD(ACCEPT)=","optional":true,"description":"Specifies the method for the β boundary of a one-sided design or the lower and upper β boundaries for a two-sided design.","help":"METHOD(ACCEPT)=*method*","type":"value"},{"name":"METHOD(ALPHA)=","optional":true,"description":"Specifies the method for the α boundary of a one-sided design or the lower and upper α boundaries for a two-sided design.","help":"METHOD(ALPHA)=*method*","type":"value"},{"name":"METHOD(BETA)=","optional":true,"description":"Specifies the method for the β boundary of a one-sided design or the lower and upper β boundaries for a two-sided design.","help":"METHOD(BETA)=*method*","type":"value"},{"name":"METHOD(LOWERACCEPT)=","optional":true,"description":"Specifies the method for the lower β boundary of a two-sided design.","help":"METHOD(LOWERACCEPT)=*method*","type":"value"},{"name":"METHOD(LOWERALPHA)=","optional":true,"description":"Specifies the method for the lower α boundary of a two-sided design.","help":"METHOD(LOWERALPHA)=*method*","type":"value"},{"name":"METHOD(LOWERBETA)=","optional":true,"description":"Specifies the method for the lower β boundary of a two-sided design.","help":"METHOD(LOWERBETA)=*method*","type":"value"},{"name":"METHOD(LOWERREJECT)=","optional":true,"description":"Specifies the method for the lower α boundary of a two-sided design.","help":"METHOD(LOWERREJECT)=*method*","type":"value"},{"name":"METHOD(REJECT)=","optional":true,"description":"Specifies the method for the α boundary of a one-sided design or the lower and upper α boundaries for a two-sided design.","help":"METHOD(REJECT)=*method*","type":"value"},{"name":"METHOD(UPPERACCEPT)=","optional":true,"description":"Specifies the method for the upper β boundary of a two-sided design.","help":"METHOD(UPPERACCEPT)=*method*","type":"value"},{"name":"METHOD(UPPERBETA)=","optional":true,"description":"Specifies the method for the upper β boundary of a two-sided design.","help":"METHOD(UPPERBETA)=*method*","type":"value"},{"name":"METHOD=","optional":true,"description":"Specifies the method for the boundaries in the design.","help":"METHOD=WHITEHEAD | ERRFUNCGAMMA | ERRFUNCOBF | ERRFUNCPOC | ERRFUNCPOW | ERRSPEND | HP | OBRIENFLEMING | POCOCK | POWER | TRIANGULAR | UNIFIED","type":"choice","arguments":[{"name":"WHITEHEAD","description":"[Syntax: WHITEHEAD<(AU= <(<LOWER=> <UPPER=>)>)> ] Uses Whitehead’s triangular design and double-triangular design for a one-sided design and two-sided design, respectively (Whitehead and Stratton 1983; Whitehead 1997, 2001).","type":"standalone"},{"name":"ERRFUNCGAMMA","description":"[Syntax: ERRFUNCGAMMA<(GAMMA=value)>] Specifies a gamma cumulative error spending function for the boundary (Hwang, Shih, and DeCani 1990).","type":"standalone"},{"name":"ERRFUNCOBF","description":"Specifies the O’Brien-Fleming-type cumulative error spending function for the boundary (Lan and DeMets 1983).","type":"standalone"},{"name":"ERRFUNCPOC","description":"Specifies the Pocock-type cumulative error spending function for the boundary (Lan and DeMets 1983).","type":"standalone"},{"name":"ERRFUNCPOW","description":"[Syntax: ERRFUNCPOW<( RHO=value)> ] Specifies a power cumulative error spending function for the boundary (Jennison and Turnbull 2000, p. 148).","type":"standalone"},{"name":"ERRSPEND","description":"[Syntax: ERRSPEND(numbers)] Specifies the relative cumulative error spending at each stage.","type":"standalone"},{"name":"HP","description":"[Syntax: HP<(Z=numbers | PVALUE=numbers)>] Specifies the Haybittle-Peto method (Haybittle 1971; Peto et al. 1976).","type":"standalone"},{"name":"OBRIENFLEMING","description":"Specifies the O’Brien-Fleming method (O’Brien and Fleming 1979).","type":"standalone"},{"name":"POCOCK","description":"Specifies the Pocock method (Pocock 1977). The Pocock method is equivalent to a power family method with RHO=0.","type":"standalone"},{"name":"POWER","description":"[Syntax: POWER<(RHO=value)>] Specifies a power family method (Wang and Tsiatis 1987; Emerson and Fleming 1989; Pampallona and Tsiatis 1994).","type":"standalone"},{"name":"TRIANGULAR","description":"[Syntax: TRIANGULAR<(TAU=value)>] Specifies a unified family triangular method (Kittelson and Emerson 1999). The default is TAU=1.0.","type":"standalone"},{"name":"UNIFIED","description":"[Syntax: UNIFIED<(<TAU=value> <RHO=value>)>] Specifies a unified family method (Kittelson and Emerson 1999).","type":"standalone"}]},{"name":"NSTAGES=","optional":true,"description":"Specifies the number of stages for the design. This option is required in the DESIGN statement, and the maximum allowed number of stages is 25.","help":"NSTAGES=*number*","type":"value"},{"name":"STOP=","optional":true,"description":"Specifies the condition of early stopping for the design.","help":"STOP=ACCEPT | REJECT | BOTH","type":"choice","arguments":[{"name":"ACCEPT","description":"Early stopping only to accept the null hypothesis Ho.","type":"standalone"},{"name":"REJECT","description":"Early stopping only to reject the null hypothesis Ho. This is the default.","type":"standalone"},{"name":"BOTH","description":"Syntax: BOTH < ( BETABOUNDARY=BINDING | NONBINDING ) > Specifies the early stopping criterion for the design. The keywords ACCEPT, REJECT, and BOTH correspond to early stopping only to accept, only to reject, and either to accept or reject the null hypothesis H0, respectively. The default is STOP=REJECT. With STOP=BOTH, the BETABOUNDARY= BINDING suboption computes the Type I error probability with the acceptance boundary, and the BETABOUNDARY=NONBINDING suboption computes the Type I error probability without the acceptance boundary. The default is BETABOUNDARY=BINDING. The BETABOUNDARY= NONBINDING option is not applicable with METHOD=WHITEHEAD.","type":"standalone"}]}]},{"name":"SAMPLESIZE","description":"If each observation in the data set provides one unit of information in a hypothesis testing such as a one-sample test for the mean, the SAMPLESIZE statement computes the required sample sizes for the sequential design specified in each DESIGN statement. However, for a survival analysis, an individual in the survival time data might provide only partial information because of censoring. For this hypothesis, the SAMPLESIZE statement computes the required numbers of events. With additional accrual information in a survival analysis, the sample sizes can also be computed.","help":"SAMPLESIZE &lt;MODEL=&lt;INPUTNOBS | INPUTNEVENTS | ONESAMPLEMEAN&gt;... &gt; ","arguments":[{"name":"MODEL=","optional":true,"description":"Specifies the input sample size or number of events from a fixed-sample study, or it specifies a statistical model to compute the required sample size.","help":"MODEL=INPUTNOBS | INPUTNEVENTS | ONESAMPLEMEAN | ONESAMPLEFREQ | TWOSAMPLEMEAN | TWOSAMPLEFREQ | TWOSAMPLESURVIVAL | REG | LOGISTIC | PHREG","type":"choice","arguments":[{"name":"INPUTNOBS","description":"[Syntax: INPUTNOBS<(options)>] Specifies the sample size information for a fixed-sample design. The available options are as follows: N=n specifies the sample size n for the fixed-sample design. SAMPLE= ONE|TWO specifies a one-sample test or a two-sample test. WEIGHT= wa < wb with a two-sample test, specifies the sample size allocation weights for the two groups. MATCHNOBS= YES|NO specifies whether or not to request fractional sample sizes that are rounded up to integer sample sizes to match the sample size allocation.","type":"standalone"},{"name":"INPUTNEVENTS","description":"[Syntax: INPUTNEVENTS(D=d < options >)] Specifies the number of events for a fixed-sample survival test. The available options are as follows: D=d specifies the fixed-sample number of events d. SAMPLE= ONE|TWO specifies a one-sample test or a two-sample test. HAZARD=ha <hb> specifies the hazard rate MEDSURVTIME=ta <tb> specifies hazard rates for groups A and B implicitly through the median survival times ta and tb. WEIGHT=wa <wb> specifies the sample size allocation weights for the two groups. ACCNOBS=na specifies the total number of individuals in the study. ACCRATE=ra specifies the constant accrual rate ra, ACCRUAL= UNIFORM | EXP(PARM=γ0) specifies the method for individual accrual. The default ACCRUAL=UNIFORM option specifies that the individual accrual is uniform in the accrual time Ta with a constant accrual rate ra, and the ACCRUAL=EXP(PARM=γ0) option specifies that the individual accrual is truncated exponential with a scaled power parameter γ0, where γ0 >= -10 and γ0 ≠ 0. LOSS= NONE | EXP( HAZARD=τ | MEDLOSSTIME=tτ) specifies the individual loss to follow up in the sample size computation. The default LOSS=NONE option specifies no loss to follow up, and the LOSS=EXP option specifies exponential loss function. The HAZARD=τ suboption specifies the exponential loss hazard rate τ, and the MEDLOSSTIME=tτ suboption specifies the exponential loss hazard rate through the median loss times tτ. ACCTIME=Ta specifies the accrual time Ta FOLTIME=Tf specifies the follow-up time Tf TOTALTIME=T specifies the total study time T=Ta+Tf.","type":"standalone"},{"name":"ONESAMPLEMEAN","description":"[Syntax: ONESAMPLEMEAN<(options)>] Specifies the one-sample Z test for mean. The available options are as follows: MEAN=u1 specifies the alternative reference u1 and is required if the alternative reference is not specified or derived in the procedure. STDDEV=σ specifies the standard deviation σ","type":"standalone"},{"name":"ONESAMPLEFREQ","description":"[Syntax: ONESAMPLEFREQ<(options)>] Specifies the one-sample test for binomial proportion with the null hypothesis Ho: θ=0 and the alternative hypothesis H1: θ=θ1, where θ=p-po and θ1=p1-po. The available options are as follows: NULLPROP=po specify the proportions under the null hypotheses PROP=p1 specify the proportions under the alternative hypotheses REF= NULLPROP|PROP specifies the hypothesis under which the proportion is used in the sample size computation.","type":"standalone"},{"name":"TWOSAMPLEMEAN","description":"[Syntax: TWOSAMPLEMEAN<(options)>] Specifies the two-sample Z test for mean difference. The available options are as follows: MEANDIFF=θ1 specifies the alternative reference θ1 and is required if the alternative reference is not specified or derived in the procedure. STDDEV=σA <σB> specifies the standard deviations σA and σB. WEIGHT=wa <wb> specifies the sample size allocation weights for the two groups. MATCHNOBS= YES|NO specifies whether or not to request fractional sample sizes that are rounded up to integer sample sizes to match the sample size allocation.","type":"standalone"},{"name":"TWOSAMPLEFREQ","description":"[Syntax: TWOSAMPLEFREQ<(options)>] Specifies the two-sample test for binomial proportions. The available options are as follows: NULLPROP=poa <pob> specifies proportions pa=poa and pb=pob in groups A and B, respectively, under the null hypothesis. PROP=p1a specifies proportion pa=p1a in group A under the alternative hypothesis. TEST= PROP|LOGOR|LOGRR specifies the null hypothesis Ho:θ=0 in the test. REF= NULLPROP|PROP|AVGNULLPROP|AVGPROP specifies the hypothesis under which the proportions are used in the sample size computation. WEIGHT=wa <wb> specifies the sample size allocation weights for the two groups. MATCHNOBS= YES|NO specifies whether or not to request fractional sample sizes that are rounded up to integer sample sizes to match the sample size allocation.","type":"standalone"},{"name":"TWOSAMPLESURVIVAL","description":"[Syntax: TWOSAMPLESURVIVAL<(options)>] Specifies the log-rank test for two survival distributions. The available options for the number of events are as follows: NULLHAZARD=hoa <hob> specifies hazard rates ha=hoa and hb=hob for groups A and B, respectively, under the null hypothesis. NULLMEDSURVTIME=toa <tob> specifies the median survival times ta=toa and tb=tob under the null hypothesis. HAZARD=h1a specifies the group A hazard rate h1a under the alternative hypothesis. MEDSURVTIME=t1a specifies the group A median survival time t1a under the alternative hypothesis. HAZARDRATIO=λ1 specifies the hazard ratio λ1=h1a/h1b under the alternative hypothesis.","type":"standalone"},{"name":"REG","description":"[Syntax: REG<(options)>] Specifies the Z test for a normal regression parameter. The available options are as follows: BETA=B1 specifies the alternative reference B1 and is required if the alternative reference is not specified or derived in the procedure. VARIANCE=σ²y specifies the variances for the response variable Y. XVARIANCE=σ²x specifies the variances for the covariate X. XRSQUARE=r²x used to derive the variance of X after adjusting for other covariates. The default is XRSQUARE=0.","type":"standalone"},{"name":"LOGISTIC","description":"[Syntax: LOGISTIC<(options)>] Specifies the Z test for a logistic regression parameter. The available options are as follows: BETA=B1 specifies the alternative reference B1 and is required if the alternative reference is not specified or derived in the procedure. PROP=p specifies the proportion of the binary response variable Y. The default is PROP=0.5. XVARIANCE=σ²x specifies the variances for the covariate X. The default is XVARIANCE=1. XRSQUARE=r-square-x used to derive the variance of X after adjusting for other covariates. The default is XRSQUARE=0.","type":"standalone"},{"name":"PHREG","description":"[Syntax: PHREG<(options)>] Specifies the Z test for a proportional hazards regression parameter. The available options for the number of events are as follows: BETA=B1 specifies the alternative reference B1 and is required if the alternative reference is not specified or derived in the procedure. XVARIANCE=σ²x specifies the variances for the covariate X. The default is XVARIANCE=1. XRSQUARE=r-square-x used to derive the variance of X after adjusting for other covariates. The default is XRSQUARE=0. HAZARD=ha specifies the hazard rate ha explicitly. MEDSURVTIME=ta specifies hazard rate implicitly through the median survival time ta. ACCRATE=ra specifies the constant accrual rate ra, ACCTIME=Ta specifies the accrual time Ta FOLTIME=Tf specifies the follow-up time Tf TOTALTIME=T specifies the total study time T=Ta+Tf.","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_029","docsetTargetFile":"statug_seqdesign_toc.htm"}}