{"name":"SEVSELECT","statements":[{"name":"PROC SEVSELECT","description":"The SEVSELECT procedure estimates parameters of any arbitrary continuous probability distribution that is used to model the magnitude (severity) of a continuous-valued event of interest. Examples of such events include loss amounts paid by an insurance company and demand of a product as depicted by its sales. PROC SEVSELECT is especially useful when the severity of an event does not follow typical distributions (such as the normal distribution) that are often assumed by standard statistical methods.","help":"PROC SEVSELECT <COVOUT> <CRITERION=AD | AIC | AICC... > <DATA=CAS-libref.data-table> <EMPIRICALCDF=AUTOMATIC | KAPLANMEIER | MODIFIEDKM... > <INEST=CAS-libref.data-table> <INITSAMPLE (initsample-option) | INITSAMPLE (initsample-option . . . initsample-option)> <NOCLPRINT< =number >> <NOPRINT> <OBJECTIVE=symbol-name> <OUTEST=CAS-libref.data-table> <OUTMODELINFO=SAS-data-set> <OUTSTAT=SAS-data-set> <OUTSTORE=store-name> <PRINT=ALL | ALLFITSTATS | CONVSTATUS... > <SELECTNLOTECH=CONGRA | DBLDOG | NEWRAP... > <SELECTOUT> <VARDEF=DF | N> <ZEROEST>;     \n\tABORT <ABEND> <CANCEL> <CANCEL FILE> ...;     \n\tARRAY <_ALL_> <_NUMERIC_> <_TEMPORARY_> ...; \n   \n\tATTRIB <FORMAT=format> <INFORMAT=informat> <LABEL='label'> ...; \n   \n\tBY variable-list ;     \n\tCALL routine(parameter-1<, ...parameter-n>);     \n\tCLASS <DESCENDING> <MISSING> <ORDER=<FORMATTED | FREQ | INTERNAL>> ...; \n   \n\tCONTINUE;     \n\tDELETE; \n   \n\tDESCRIBE;     \n\tDISPLAY <CASESENSITIVE> <EXCLUDE> <EXCLUDEALL> ...; \n   \n\tDISPLAYOUT <INCLUDEALL> <NOREPLACE> <REPEATED> ...; \n   \n\tDIST _ALL_ _PREDEFINED_ _USER_ ...; \n   \n\tDO <OVER> <> <> ...; \n   \n\t;     \n\t; \n   \n\tDROP variable-list;     \n\tEFFECT <DETAILS> NAME=COLLECTION|MULTIMEMBER|MM|POLYNOMIAL|POLY...  <NOEFFECT> ...;     \n\tELSE <DO> <IF> <THEN> ...; \n   \n\tEND;     \n\tENDRSUBMIT; \n   \n\tERROR <message>;     \n\tEXECUTE; \n   \n\tFILE <DISK> <DUMMY> <LOG> ...; \n   \n\tFORMAT <DEFAULT=default-format> ; \n   \n\tGO TO label | GOTO label;     \n\tIF <DO> <THEN> <WHEN> ...; \n   \n\tINFILE <DATALINES4> <DATALINES> <DISK> ...; \n   \n\tINFORMAT <DEFAULT= default-informat> ; \n   \n\tINPUT <specification(s)><@|@@>; \n   \n\tKEEP variable-list;     \n\t; \n   \n\tLEAVE;     \n\tLENGTH <DEFAULT=n> ; \n   \n\tLINK label;     \n\tLIST; \n   \n\tLOCK <CLEAR> <LIST> ; \n   \n\tLOSS <LEFTCENSORED=variable-name LEFTCENSORED=number> <LEFTTRUNCATED=variable-name <(left-truncation-option)> LEFTTRUNCATED=number <(left-truncation-option)>> <RIGHTCENSORED=variable-name RIGHTCENSORED=number> ...; \n   \n\tMERGE <ALTER=> <BUFNO=<n | nK | hexX>... > <END=variable> ...; \n   \n\tMISSING character(s);     \n\tMODIFY <END=variable> <KEY=index> <NOBS=variable> ...; \n   \n\tNLOPTIONS <ABSCONV=r> <ABSFCONV=r[n]> <ABSGCONV=r[n]> ...; \n   \n\tOTHERWISE <DO> ; \n   \n\tOUTPUT <COPYVARS=variable-list> <FUNCTIONS=(function<(arg)><=variable> <function<(arg)><=variable>> …)> <OUT=CAS-libref.data-table> ...; \n   \n\tOUTSCORELIB <COMMONPACKAGE> <OUTBYID=SAS-data-set> OUTLIB=fcmp-library-name ...;     \n\tPAGE;     \n\tPUT <_ALL_> <_INFILE_> <_ODS_> ...; \n   \n\tPUTLOG 'message';     \n\tRENAME old-name-1=new-name-1 ... <old-name-n=new-name-n>; \n   \n\tREPLACE <data-set-name-1><...data-set-name-n>; \n   \n\tRETAIN <element-list(s) <initial-value(s) |; \n   \n\tRETURN;     \n\tRSUBMIT <options>; ENDRSUBMIT <CANCEL>;     \n\tSCALEMODEL <DFMIXTURE=<FULL | MEAN | QUANTILE>... > <INCLUDE=n | INCLUDE=single-effect | INCLUDE=(effects)> <INFORMATIVE> ...; \n   \n\t;     \n\tSELECTION <ADAPTIVE <(GAMMA=nonnegative number)>> <CHOOSE=<AIC | AICC | SBC>> <METHOD=<BACKWARD | FORWARD | FORWARDSWAP>... > ...; \n   \n\tSET <END=variable> <INDSNAME=variable> <KEY=index</UNIQUE>> ...; \n   \n\tSKIP <n>;     \n\tSTOP; \n   \n\tWEIGHT variable-name ;     \n\tWHEN <DO> ; \n   \n\tWHERE where-expression-1; ","arguments":[{"name":"COVOUT","optional":true,"description":"Specifies that the OUTEST= data set contain the estimate of the covariance structure of the parameters. This option has no effect if you do not specify the OUTEST= option.","type":"standalone"},{"name":"CRITERION=","optional":true,"aliases":["CRITERIA=","CRIT="],"description":"Specifies the criterion to report in the model selection table.","help":"CRITERION=AD | AIC | AICC | BIC | CUSTOM | CVM | KS | LOGLIKELIHOOD | M","type":"choice","arguments":[{"name":"AD","description":"Specifies the Anderson-Darling (AD) statistic value, which is computed by using the empirical distribution function (EDF) estimate, as the selection criterion. A lower value is deemed better.","type":"standalone"},{"name":"AIC","description":"Specifies the Akaike’s information criterion (AIC) as the selection criterion. A lower value is deemed better.","type":"standalone"},{"name":"AICC","description":"Specifies the finite-sample corrected Akaike’s information criterion (AICC) as the selection criterion. A lower value is deemed better.","type":"standalone"},{"name":"BIC","description":"Specifies Schwarz Bayesian information criterion (BIC) as the selection criterion. A lower value is deemed better.","type":"standalone"},{"name":"CUSTOM","description":"Specifies the custom objective function as the selection criterion. You can specify this only if you also specify the OBJECTIVE= option. A lower value is deemed better.","type":"standalone"},{"name":"CVM","description":"Specifies the Cram´ er-von Mises (CvM) statistic value, which is computed by using the empirical distribution function (EDF) estimate, as the selection criterion. A lower value is deemed better.","type":"standalone"},{"name":"KS","description":"Specifies the Kolmogorov-Smirnov (KS) statistic value, which is computed by using the empirical distribution function (EDF) estimate, as the selection criterion. A lower value is deemed better.","type":"standalone"},{"name":"LOGLIKELIHOOD","aliases":["LL"],"description":"Specifies -2*log(L) as the selection criterion, where L is the likelihood of the data. A lower value is deemed better. This is the default.","type":"standalone"},{"name":"M","description":"er–von Mises (CvM) statistic value, which is computed by using the empirical distribution function (EDF) estimate, as the selection criterion. A lower value is deemed better.","type":"standalone"}]},{"name":"DATA=","optional":true,"description":"Names the input data table for PROC SEVSELECT to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"EMPIRICALCDF=","optional":true,"aliases":["EDF="],"description":"Specifies the method to use for computing the nonparametric or empirical estimate of the cumulative distribution function of the data.","help":"EMPIRICALCDF=AUTOMATIC | KAPLANMEIER | MODIFIEDKM | NOTURNBULL | STANDARD | TURNBULL","type":"choice","arguments":[{"name":"AUTOMATIC","aliases":["AUTO"],"description":"Specifies that the method be chosen automatically based on the data specification. If you do not specify any censoring or truncation, then the standard empirical estimation method (STANDARD) is chosen. If you specify both right-censoring and left-censoring, then Turnbull’s estimation method (TURNBULL) is chosen. For all other combinations of censoring and truncation, the Kaplan-Meier method (KAPLANMEIER) is chosen.","type":"standalone"},{"name":"KAPLANMEIER","aliases":["KM"],"description":"Specifies that the product limit estimator proposed by Kaplan and Meier (1958) be used. Specification of this method has no effect when both right-censoring and left-censoring are specified.","type":"standalone"},{"name":"MODIFIEDKM","aliases":["MKM"],"description":"Syntax: MODIFIEDKM | MKM <(options)> Specifies that the modified product limit estimator be used. Specification of this method has no effect when both right-censoring and left-censoring are specified. You can modify the default by using the following options: ALPHA | A=number specifies the value to use for α when the lower bound on the risk set size is defined as cxⁿ (where the superscript n equals α). This value must satisfy 0 < α < 1. C=number specifies the value to use for c when the lower bound on the risk set size is defined as cxⁿ (where the superscript n equals α). This value must satisfy c > 0. RSLB=number specifies the absolute lower bound on the risk set size to be included in the estimate.","type":"standalone"},{"name":"NOTURNBULL","description":"Specifies that the method be chosen automatically based on the data specification and that Turnbull’s method not be used. This is the default.","type":"standalone"},{"name":"STANDARD","aliases":["STD"],"description":"Specifies that the standard empirical estimation method be used. This ignores any censoring or truncation information even if specified, and can thus result in estimates that are more biased than those obtained with other methods more suitable for such data. Specification of this method has no effect when both right-censoring and left-censoring are specified.","type":"standalone"},{"name":"TURNBULL","aliases":["EM"],"description":"TURNBULL | EM <(options)> (Experimental ) Specifies that the Turnbull’s method be used. An iterative expectation-maximization (EM) algorithm proposed by Turnbull (1976) is used to compute the empirical estimates. You can modify the default behavior of the EM algorithm by using the following options: ENSUREMLE specifies that the final EDF estimates be maximum likelihood estimates. EPS=number specifies the maximum relative error to be allowed between estimates of two consecutive iterations. MAXITER=number specifies the maximum number of iterations to attempt to find the empirical estimates. If you do not specify this option, then PROC SEVSELECT uses a default value of 500. ZEROPROB=number specifies the threshold below which an empirical estimate of the probability is considered zero.","type":"standalone"}]},{"name":"INEST=","optional":true,"description":"Names the input data table that contains the initial values of the parameter estimates to start the optimization process. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"INEST=*CAS-libref.data-table*","type":"dataSet"},{"name":"INITSAMPLE=","optional":true,"description":"Specifies that a sample of the input data be used for initializing the distribution parameters. If you specify more than one initsample-option, then separate them with spaces. PROC SEVSELECT uses the uniform random sampling method to select the sample, the size and randomness of which are controlled by the following initsample-options:","help":"INITSAMPLE=FRACTION= | SEED= | SIZE=","type":"choice","arguments":[{"name":"FRACTION=","type":"value"},{"name":"SEED=","type":"value"},{"name":"SIZE=","type":"value"}]},{"name":"NOCLPRINT","optional":true,"description":"Suppresses the display of the “Class Level Information” table if you do not specify number. If you specify number, the values of the classification variables are displayed for only those variables whose number of levels is less than number. Specifying a number helps to reduce the size of the “Class Level Information” table if some classification variables have a large number of levels. This option has no effect if you do not specify the CLASS statement.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Turns off all displayed and graphical output. If you specify this option, then any value that you specify for the PRINT= option is ignored.","type":"standalone"},{"name":"OBJECTIVE=","optional":true,"description":"Names the symbol that represents the objective function in the specified SAS programming statements. For each model to be estimated, PROC SEVSELECT executes the programming statements to compute the value of this symbol for each observation. The values are added across all observations to obtain the value of the objective function. The optimization algorithm estimates the model parameters such that the objective function value is minimized. A separate optimization problem is solved for each candidate distribution.","help":"OBJECTIVE=*symbol-name*","type":"value"},{"name":"OUTEST=","optional":true,"description":"Names the output data table to contain estimates of the parameter values and their standard errors for each model whose parameter estimation process converges. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTEST=*CAS-libref.data-table*","type":"dataSet"},{"name":"OUTMODELINFO=","optional":true,"description":"Names the output data table to contain the information about each candidate distribution.","help":"OUTMODELINFO=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Names the output data table to contain the values of statistics of fit for each model whose parameter estimation process converges.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTORE=","optional":true,"description":"Names the item store to contain the context and results of the severity model estimation process. The resulting item store has a binary file format that cannot be modified. You can specify this item store in a subsequent PROC CCDM step by using the SEVERITYSTORE= option.","help":"OUTSTORE=*store-name*","type":"value"},{"name":"PRINT=","optional":true,"description":"Specifies the desired displayed output. If you specify more than one display-option, then separate them with spaces and enclose them in parentheses.","help":"PRINT=ALL | ALLFITSTATS | CONVSTATUS | DESCSTATS | DISTINFO | ESTIMATES | ESTIMATIONDETAILS | INITIALVALUES | NLOHISTORY | NLOSUMMARY | SELECTION | STATISTICS | NONE","type":"choice","arguments":[{"name":"ALL","description":"Displays all the output.","type":"standalone"},{"name":"ALLFITSTATS","description":"Displays the comparison of all the statistics of fit for all the models in one table.","type":"standalone"},{"name":"CONVSTATUS","description":"Displays the convergence status of the parameter estimation process.","type":"standalone"},{"name":"DESCSTATS","description":"Displays the descriptive statistics for the response variable.","type":"standalone"},{"name":"DISTINFO","description":"Displays the final estimates of parameters.","type":"standalone"},{"name":"ESTIMATES","description":"Displays the details of the estimation process for all the models in one table.","type":"standalone"},{"name":"ESTIMATIONDETAILS","description":"","type":"standalone"},{"name":"INITIALVALUES","description":"Displays the initial values and bounds used for estimating each model.","type":"standalone"},{"name":"NLOHISTORY","description":"Displays the iteration history of the nonlinear optimization process used for estimating the parameters.","type":"standalone"},{"name":"NLOSUMMARY","description":"Displays the summary of the nonlinear optimization process used for estimating the parameters.","type":"standalone"},{"name":"SELECTION","description":"Displays the model selection table.","type":"standalone"},{"name":"STATISTICS","description":"Displays the statistics of fit for each model.","type":"standalone"},{"name":"NONE","description":"Displays none of the output.","type":"standalone"}]},{"name":"SELECTNLOTECH=","optional":true,"description":"Specifies the nonlinear optimization technique to use for the intermediate steps of the regression effect selection process.","help":"SELECTNLOTECH=CONGRA | DBLDOG | NEWRAP | NMSIMP | NRRIDG | QUANEW | TRUREG","type":"choice","arguments":[{"name":"CONGRA","description":"Performs a conjugate-gradient optimization.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization.","type":"standalone"},{"name":"NEWRAP","description":"Performs a Newton-Raphson optimization that combines a line-search algorithm with ridging.","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NRRIDG","description":"Performs a Newton-Raphson optimization with ridging.","type":"standalone"},{"name":"QUANEW","description":"Performs a quasi-Newton optimization","type":"standalone"},{"name":"TRUREG","description":"Performs a trust region optimization.","type":"standalone"}]},{"name":"SELECTOUT","optional":true,"description":"Specifies that only the regression parameters that correspond to the selected effects be written to the OUTEST= data table.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the denominator to use for computing the covariance estimates.","help":"VARDEF=DF | N*option*","type":"value","arguments":[{"name":"DF","description":"Specifies that the number of nonmissing observations minus the model degrees of freedom (number of parameters) be used.","type":"standalone"},{"name":"N","description":"Specifies that the number of nonmissing observations be used.","type":"standalone"}]},{"name":"ZEROEST","optional":true,"description":"Specifies that zero be written to the OUTEST= data table as an estimate of the regression parameter that is not in the final model (because it is either collinear or not selected). If you omit this option, then the special missing value .R or .N is written for such regression parameters.","type":"standalone"}]},{"name":"ABORT","description":"Stops executing the current DATA step, SAS job, or SAS session. n is an integer value that enables you to specify a condition code: o when used with the CANCEL argument, the value is placed in the SYSINFO automatic macro variable o when not used with the CANCEL argument, the error code that is returned by SAS is ERROR. The value of ERROR depends on the operating system. The condition code n is returned to the operating system as the final SAS system exit code.","help":"ABORT &lt;ABEND&gt; &lt;CANCEL&gt; &lt;CANCEL FILE&gt; ...","arguments":[{"name":"n","optional":true,"placeholder":true,"description":"Replace <n> with an actual integer value. n is an integer value that enables you to specify a condition code: o when used with the CANCEL argument, the value is placed in the SYSINFO automatic macro variable o when not used with the CANCEL argument, the error code that is returned by SAS is ERROR. The value of ERROR depends on the operating system. The condition code n is returned to the operating system as the final SAS system exit code.","type":"value"},{"name":"ABEND","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the ABEND option of the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment; further action is based on how your operating environment and your site treat jobs that end abnormally. o windowing environment and interactive line mode","type":"standalone"},{"name":"CANCEL","optional":true,"description":"Causes the cancellation of the current submitted statements. The results depend on the method of operation: o batch mode and noninteractive mode o The entire SAS program and SAS system are terminated. o The error message is written to the SAS log. o windowing environment and interactive line mode o It only clears the current submitted program. o Other subsequent submitted programs are not affected. o The error message is written to the SAS log. o workspace server and stored process server o It only clears currently submitted program. o Other subsequent submit calls are not affected. o The error message is written to the SAS log. o SAS IntrNet application server","help":"CANCEL ","type":"standalone"},{"name":"CANCEL FILE","optional":true,"description":"Causes only the contents of the autoexec file or %INCLUDE file to be cleared by the %ABORT statement. Other submitted source statements will be executed after the autoexec or %INCLUDE file.","type":"standalone"},{"name":"NOLIST","optional":true,"description":"Suppresses the output of all variables to the SAS log. Requirement: NOLIST must be the last option in the ABORT statement.","type":"standalone"},{"name":"RETURN","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the RETURN option in the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment with a condition code indicating an error. o windowing environment and interactive line mode","type":"standalone"}]},{"name":"ARRAY","description":"Defines the elements of an array.","help":"ARRAY &lt;_ALL_&gt; &lt;_NUMERIC_&gt; &lt;_TEMPORARY_&gt; ...","arguments":[{"name":"_ALL_","optional":true,"description":"Specifies all variables.","type":"standalone"},{"name":"_CHARACTER_","optional":true,"description":"Specifies all character variables.","type":"standalone"},{"name":"_NUMERIC_","optional":true,"description":"Specifies all numeric variables.","type":"standalone"},{"name":"_TEMPORARY_","optional":true,"description":"Creates a list of temporary data elements.","type":"standalone"}]},{"name":"ATTRIB","description":"Associates a format, informat, label, and length with one or more variables.","help":"ATTRIB &lt;FORMAT=format&gt; &lt;INFORMAT=informat&gt; &lt;LABEL='label'&gt; ...","arguments":[{"name":"FORMAT=","optional":true,"description":"Associates a format with variables in a variable-list.","help":"FORMAT=*format*","type":"value"},{"name":"INFORMAT=","optional":true,"description":"Associates an informat with variables in a variable-list.","help":"INFORMAT=*informat*","type":"value"},{"name":"LABEL=","optional":true,"description":"Associates a label with variables in a variable-list.","help":"LABEL='*label*'","type":"value"},{"name":"LENGTH=","optional":true,"description":"Specifies the length of variables in a variable-list.","type":"value"},{"name":"TRANSCODE=","optional":true,"description":"Specifies whether character variables can be transcoded.","help":"TRANSCODE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"Specifies that character variables can be transcoded.","type":"standalone"},{"name":"NO","description":"Suppresses transcoding.","type":"standalone"}]}]},{"name":"BY","description":"A BY statement can be used in the SEVSELECT procedure to process the input data set in groups of observations defined by the BY variables.","help":"BY  *variable-list* "},{"name":"CALL","description":"Invokes a SAS CALL routine.","help":"CALL routine(parameter-1&lt;, ...parameter-n&gt;)"},{"name":"CLASS","description":"The CLASS statement names the classification variables to be used as explanatory variables in the analysis. The CLASS statement must precede the MODEL statement.","help":"CLASS &lt;DESCENDING&gt; &lt;MISSING&gt; &lt;ORDER=&lt;FORMATTED | FREQ | INTERNAL&gt;&gt; ...","arguments":[{"name":"DESCENDING","optional":true,"followsDelimiter":"/","aliases":["DESC"],"description":"Reverses the sort order of the classification variable. If both the DESCENDING and ORDER= options are specified, PROC BCHOICE orders the categories according to the ORDER= option and then reverses that order.","type":"standalone"},{"name":"MISSING","optional":true,"followsDelimiter":"/","description":"Treats missing values (., ._, .A, …, .Z for numeric variables and blanks for character variables) as valid values for the CLASS variable.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","description":"Specifies the sort order for the levels of classification variables. This ordering determines which parameters in the model correspond to each level in the data. By default, ORDER=FORMATTED. For ORDER=FORMATTED and ORDER=INTERNAL, the sort order is machine-dependent. When ORDER=FORMATTED is in effect for numeric variables for which you have supplied no explicit format, the levels are ordered by their internal values.","help":"ORDER=FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"FORMATTED","followsDelimiter":"/","description":"Levels sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Levels sorted by the descending frequency count (levels that have more observations come ealier in the order).","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Levels sorted by the unformatted value. The sort order is machine-dependent.","type":"standalone"}]},{"name":"PARAM=","optional":true,"followsDelimiter":"/","description":"Specifies the parameterization method for the classification variable or variables.","help":"PARAM=EFFECT | GLM | ORDINAL | POLYNOMIAL | REFERENCE | ORTHEFFECT | ORTHORDINAL | ORTHPOLY | ORTHREF","type":"choice","arguments":[{"name":"EFFECT","followsDelimiter":"/","description":"Specifies effect coding.","type":"standalone"},{"name":"GLM","followsDelimiter":"/","description":"Specifies less-than-full-rank, reference-cell coding; this option can be used only as a global option.","type":"standalone"},{"name":"ORDINAL","followsDelimiter":"/","aliases":["THERMOMETER"],"description":"Specifies the cumulative parameterization for an ordinal CLASS variable.","type":"standalone"},{"name":"POLYNOMIAL","followsDelimiter":"/","aliases":["POLY"],"description":"Specifies polynomial coding.","type":"standalone"},{"name":"REFERENCE","followsDelimiter":"/","aliases":["REF"],"description":"Specifies reference-cell coding.","type":"standalone"},{"name":"ORTHEFFECT","followsDelimiter":"/","description":"Orthogonalizes PARAM=EFFECT.","type":"standalone"},{"name":"ORTHORDINAL","followsDelimiter":"/","aliases":["ORTHOTHERM"],"description":"Orthogonalizes PARAM=ORDINAL.","type":"standalone"},{"name":"ORTHPOLY","followsDelimiter":"/","description":"Orthogonalizes PARAM=POLYNOMIAL.","type":"standalone"},{"name":"ORTHREF","followsDelimiter":"/","description":"Orthogonalizes PARAM=REFERENCE.","type":"standalone"}]},{"name":"REFERENCE=","optional":true,"followsDelimiter":"/","aliases":["REF="],"description":"Specifies the reference level that is used when you specify a nonsingular parameterization.","help":"REFERENCE='&lt;level&gt;' | FIRST | LAST","type":"choice","arguments":[{"name":"'","followsDelimiter":"/","description":"Specifies the level of the variable to use as the reference level. Specify the formatted value of the variable if a format is assigned. Replace <level> with an actual value.","help":"'&lt;level&gt;'","type":"standalone"},{"name":"FIRST","followsDelimiter":"/","description":"Designates the first ordered level as reference.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Designates the last ordered level as reference.","type":"standalone"}]},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"Specifies that design matrix columns that correspond to any effect that contains a split classification variable can be selected to enter or leave a model independently of the other design columns of that effect.","type":"standalone"}]},{"name":"CONTINUE","description":"Stops processing the current DO-loop iteration and resumes processing the next iteration.","help":"CONTINUE"},{"name":"DELETE","description":"Stops processing the current observation.","help":"DELETE"},{"name":"DESCRIBE","description":"Retrieves source code from a stored compiled DATA step program or a DATA step view.","help":"DESCRIBE"},{"name":"DISPLAY","description":"The DISPLAY statement enables you to specify a list of display tables to display or exclude. This statement is similar to the ODS SELECT, ODS EXCLUDE, and ODS TRACE statements. However, the DISPLAY statement can improve performance when a large number of tables could be generated (such as in BY-group processing). The procedure processes the DISPLAY statement on a CAS server and thus sends only a subset of ODS tables to the SAS client. Because ODS statements are processed on a SAS client, all the display tables generated are first sent to the client and then the client creates a subset. If both DISPLAY and ODS statements are used together, the DISPLAY statement takes precedence over the ODS statements.","help":"DISPLAY &lt;CASESENSITIVE&gt; &lt;EXCLUDE&gt; &lt;EXCLUDEALL&gt; ...","arguments":[{"name":"CASESENSITIVE","optional":true,"followsDelimiter":"/","description":"Performs a case-sensitive comparison of table names in the table-list to display table names when tables are subsetted for display. To preserve case, you must enclose table names in the table-list in quotation marks.","type":"standalone"},{"name":"EXCLUDE","optional":true,"followsDelimiter":"/","description":"Displays all display tables except those specified in the table-list.","type":"standalone"},{"name":"EXCLUDEALL","optional":true,"followsDelimiter":"/","description":"Suppresses display of all tables. This option takes precedence over the other options.","type":"standalone"},{"name":"TRACE","optional":true,"followsDelimiter":"/","description":"Displays the display table names, labels, and paths.","type":"standalone"}]},{"name":"DISPLAYOUT","description":"The DISPLAYOUT statement enables you to create CAS output tables from your displayed output. This statement is similar to the ODS OUTPUT statement. The table-spec-list specifies a list of CAS output tables to create. Each entry in the list has either a key or a key=value format: key=value specifies key as the ODS table name, path, or partial pathname, and specifies value as the CAS output table name. key specifies key as the ODS table name and also as the CAS output table name. Table names and partial pathnames are discussed under the DISPLAY statement. The DISPLAYOUT statement does not support regular expressions.","help":"DISPLAYOUT &lt;INCLUDEALL&gt; &lt;NOREPLACE&gt; &lt;REPEATED&gt; ...","arguments":[{"name":"INCLUDEALL","optional":true,"followsDelimiter":"/","description":"Creates output CAS tables for all display tables. The name of the created output CAS table is the same as the corresponding display table name. If you specify this option, the table-spec-list specification is ignored.","type":"standalone"},{"name":"NOREPLACE","optional":true,"followsDelimiter":"/","description":"Does not replace an existing CAS output table of the same name.","type":"standalone"},{"name":"REPEATED","optional":true,"followsDelimiter":"/","description":"Replicates the CAS output tables on all nodes.","type":"standalone"}]},{"name":"DIST","description":"The DIST statement specifies candidate distributions to be estimated by the SEVSELECT procedure. You can specify multiple DIST statements, and each statement can contain one or more distribution specifications.","help":"DIST _ALL_ _PREDEFINED_ _USER_ ...","arguments":[{"name":"BURR=","description":"Burr distribution","help":"BURR=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"EXP=","description":"Exponential distribution","help":"EXP=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"GAMMA=","description":"Gamma distribution","help":"GAMMA=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"GPD=","description":"Generalized Pareto distribution","help":"GPD=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"IGAUSS=","description":"Inverse Gaussian (Wald) distribution","help":"IGAUSS=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"LOGN=","description":"Lognormal distribution","help":"LOGN=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"PARETO=","description":"Pareto distribution","help":"PARETO=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"STWEEDIE=","description":"Scaled Tweedie distribution","help":"STWEEDIE=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"TWEEDIE=","description":"Tweedie distribution","help":"TWEEDIE=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"WEIBULL=","description":"Weibull distribution","help":"WEIBULL=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"_ALL_=","description":"Specifies all the predefined distributions and the distributions that you have defined in the libraries that you specify in the CMPLIB= system option.","help":"_ALL_=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"_PREDEFINED_=","description":"Specifies the list of eight predefined distributions: BURR, EXP, GAMMA, GPD, IGAUSS, LOGN, PARETO, and WEIBULL. Although the TWEEDIE and STWEEDIE distributions are available in the Sashelp.Svrtdist library along with these eight distributions, they are not included by this keyword. If you want to fit the TWEEDIE and STWEEDIE distributions, then you must specify them explicitly or use the _ALL_ keyword.","help":"_PREDEFINED_=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"_USER_=","description":"Specifies the list of all the distributions that you have defined in the libraries that you specify in the CMPLIB= system option.","help":"_USER_=INIT=","type":"choice","arguments":[{"name":"INIT=","type":"value"}]},{"name":"GLOBAL","optional":true,"aliases":["PROMOTED"],"description":"[option for OUTFUNCDEF=|OUTTAB= only] Promotes the data table to make it available globally.","type":"standalone"},{"name":"INFUNCDEF=","optional":true,"aliases":["INTAB="],"description":"Syntax: INFUNCDEF=\"CAS-table-name\" | INTAB=\"CAS-table-name\" | INFUNCDEF=CAS-table-name<(CASLIB=\"caslib\")> | INTAB=CAS-table-name<(CASLIB=\"caslib\")>","type":"value"},{"name":"LISTONLY","optional":true,"description":"Prints the list of all candidate distributions to the SAS log without doing any further processing on them. This option is especially useful when you use a shortcut keyword to include a list of distributions. It enables you to find out which distributions are included by the keyword.","type":"standalone"},{"name":"OUTFUNCDEF=","optional":true,"aliases":["OUTTAB="],"description":"Specifies the output data table on the CAS server to write the distribution function definitions to. The table is created in the caslib that is active for the current CAS session.","type":"value"},{"name":"VALIDATEONLY=","optional":true,"description":"Checks all candidate distributions for validity without doing any further processing on them. The first form checks whether each distribution’s first parameter is a scale parameter, which is a requirement for fitting a scale regression model for that distribution. You can disable that check by using the second form, which specifies the NOSCALEMODEL option; this is useful if you do not want to fit a scale regression model for a distribution.","help":"VALIDATEONLY=NOSCALEMODEL","type":"choice","arguments":[{"name":"NOSCALEMODEL","type":"standalone"}]}]},{"name":"DO","description":"Specifies a group of statements to be executed as a unit.","help":"DO &lt;OVER&gt; &lt;&gt; &lt;&gt; ...","arguments":[{"name":"BY","optional":true,"description":"Precedes an increment integer (other than 0) or an expression that generates an integer to be added to the value of the index variable in each iteration of the DO loop.","type":"standalone"},{"name":"OVER","optional":true,"description":"","type":"standalone"},{"name":"TO","optional":true,"description":"Separates the start and stop integers or expressions that control the number of times the portion of the DATA step between the iterative DO and END statements is processed.","type":"standalone"},{"name":"UNTIL","optional":true,"description":"...more SAS statements... END","type":"standalone"},{"name":"WHILE","optional":true,"description":"","type":"standalone"}]},{"name":"DO UNTIL","description":"Executes statements in a DO loop repetitively until a condition is true.","help":""},{"name":"DO WHILE","description":"Executes statements in a DO loop repetitively while a condition is true.","help":""},{"name":"DROP","description":"Excludes variables from output SAS data sets.","help":"DROP variable-list"},{"name":"EFFECT","description":"The EFFECT statement enables you to construct special collections of columns for design matrices. These collections are referred to as constructed effects to distinguish them from the usual model effects that are formed from continuous or classification variables.","help":"EFFECT  &lt;DETAILS&gt; NAME=COLLECTION | MULTIMEMBER | POLYNOMIAL | SPLINE&lt;NOEFFECT&gt; ...","arguments":[{"name":"NAME=","description":"Replace 'NAME' with the name of the effect, specified after the EFFECT keyword. This name can appear in only one EFFECT statement and cannot be the name of a variable in the input data set.","help":"NAME=COLLECTION | MULTIMEMBER | POLYNOMIAL | SPLINE","type":"choice","arguments":[{"name":"COLLECTION","description":"Is a collection effect that defines one or more variables as a single effect with multiple degrees of freedom. The variables in a collection are considered as a unit for estimation and inference. Option(s) available (specified after a slash (/) following the variable list): DETAILS Displays the constituents of the collection effect","type":"standalone"},{"name":"MULTIMEMBER","aliases":["MM"],"description":"Is a multimember classification effect whose levels are determined by one or more variables that appear in a CLASS statement. Options available (specified after a slash (/) following the variable list): DETAILS displays the levels of the multimember effect NOEFFECT specifies that observations with all missing levels for the multimember variables should have zero values in the corresponding design matrix columns STDIZE Standardizes the design matrix entries so that each observation has a sum of 1 WEIGHT= specifies the weight variable for the contributions of each of the classification effects","type":"standalone"},{"name":"POLYNOMIAL","aliases":["POLY"],"description":"Is a multivariate polynomial effect in the specified numeric variables. Options available (specified after a slash (/) following the variable list): DEGREE= specifies the degree of the polynomial DETAILS displays details of the specified polynomial MDEGREE= specifies the maximum degree of any variable in a term of the polynomial NOSEPARATE treats the polynomial as a single effect with multiple degrees of freedom STANDARDIZE= specifies centering and scaling suboptions for the variables that define the polynomial","type":"standalone"},{"name":"SPLINE","description":"Is a regression spline effect whose columns are univariate spline expansions of one or more variables. A spline expansion replaces the original variable with an expanded or larger set of new variables. Options available (specified after a slash (/) following the variable list): BASIS= specifies the type of basis (B-spline basis or truncated power function basis) for the spline expansion DATABOUNDARY uses the extremes of the data as boundary knots for a B-spline basis DEGREE= specifies the degree of the spline transformation DETAILS displays the knots and locations for each spline basis function KNOTMAX= requests equally spaced right-side boundary knots starting at the variables’ maximum and ending at the KNOTMAX= value KNOTMETHOD= specifies how to construct the knots for spline effects KNOTMIN= requests equally spaced left-side boundary knots starting at the KNOTMAX= value and ending at the variables’ minimum value","type":"standalone"}]},{"name":"BASIS=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies a basis for the spline expansion.","help":"BASIS=BSPLINE | TPF","type":"choice","arguments":[{"name":"BSPLINE","followsDelimiter":"/","description":"Specifies a B-spline basis for the spline expansion.","type":"standalone"},{"name":"TPF","followsDelimiter":"/","description":"Syntax: TPF(options) Specifies a truncated power function basis for the spline expansion. You can modify the number of columns when you request BASIS=TPF with the following options: NOINT excludes the intercept column. NOPOWERS excludes the intercept and polynomial columns.","type":"standalone"}]},{"name":"DATABOUNDARY","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that the extremes of the data be used as boundary knots when building a B-spline basis.","type":"standalone"},{"name":"DEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"DEGREE=*n*","type":"value"},{"name":"DETAILS","optional":true,"followsDelimiter":"/","description":"[For the COLLECTION | MULTIMEMBER | POLYNOMIAL |SPLINE effect-type] Requests a table that shows the: (1) constituents of the collection effect, or (2) levels of the multimember effect, or (3) details of the specified polynomial, or (4) knot locations and the knots associated with each spline basis function.","type":"standalone"},{"name":"KNOTMAX=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMAX=*value*","type":"value"},{"name":"KNOTMETHOD=","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies how to construct the knots for spline effects.","help":"KNOTMETHOD=EQUAL | LIST | LISTWITHBOUNDARY | MULTISCALE | PERCENTILES | RANGEFRACTIONS","type":"choice","arguments":[{"name":"EQUAL","followsDelimiter":"/","description":"Syntax: EQUAL<(n)> Specifies that n equally spaced knots be positioned between the extremes of the data. The default is n=3. For a B-spline basis, any needed boundary knots continue to be equally spaced unless the DATABOUNDARY option has also been specified. KNOTMETHOD=EQUAL is the default if no knot-method is specified.","type":"standalone"},{"name":"LIST","followsDelimiter":"/","description":"Syntax: LIST(number-list) Specifies the list of internal knots to be used in forming the spline basis columns. For a B-spline basis, the data extremes are used as boundary knots.","type":"standalone"},{"name":"LISTWITHBOUNDARY","followsDelimiter":"/","description":"Syntax: LISTWITHBOUNDARY(number-list) Specifies the list of all knots that are used in forming the spline basis columns.","type":"standalone"},{"name":"MULTISCALE","followsDelimiter":"/","description":"Syntax: MULTISCALE<(multiscale-options)> Specifies that multiple B-spline bases be generated, corresponding to sets with an increasing number of internal knots. You can control which scales are included with the following multiscale-options: STARTSCALE=n specifies the start scale, where n is a positive integer. The default is STARTSCALE=0. ENDSCALE=n specifies the end scale, where n is a positive integer. The default is ENDSCALE=7.","type":"standalone"},{"name":"PERCENTILES","followsDelimiter":"/","description":"Syntax: PERCENTILES(n) Requests that internal knots be placed at n equally spaced percentiles of the variable or variables named in the EFFECT statement.","type":"standalone"},{"name":"RANGEFRACTIONS","followsDelimiter":"/","description":"Syntax: RANGEFRACTIONS(fraction-list) Requests that internal knots be placed at each fraction of the ranges of the variables in the EFFECT statement.","type":"standalone"}]},{"name":"KNOTMIN=","optional":true,"followsDelimiter":"/","description":"","help":"KNOTMIN=*value*","type":"value"},{"name":"MDEGREE=","optional":true,"followsDelimiter":"/","description":"","help":"MDEGREE=*n*","type":"value"},{"name":"NATURALCUBIC","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Uses a natural cubic spline basis for the spline expansion. Natural cubic splines, also known as restricted cubic splines, are cubic splines that are constrained to be linear beyond the extreme knots.","type":"standalone"},{"name":"NOEFFECT","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that observations whose levels are all missing for the multimember variables should have 0 values in the corresponding design matrix columns.","type":"standalone"},{"name":"NOSEPARATE","optional":true,"followsDelimiter":"/","description":"[For the POLYNOMIAL effect-type only] Specifies that the polynomial be treated as a single effect with multiple degrees of freedom. The effect name that you specify is used as the constructed effect name, and the labels of the terms are used as labels of the corresponding parameters.","type":"standalone"},{"name":"SEPARATE","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that when multiple variables are specified in the EFFECT statement, the spline basis for each variable be treated as a separate effect. The names of these separated effects are formed by appending an underscore followed by the name of the variable to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"SPLIT","optional":true,"followsDelimiter":"/","description":"[For the SPLINE effect-type only] Specifies that each individual column in the design matrix that corresponds to the spline effect be treated as a separate effect that can enter or leave the model independently. Names for these split effects are generated by appending the variable name and an index for each column to the name that you specify in the EFFECT statement.","type":"standalone"},{"name":"STANDARDIZE","optional":true,"followsDelimiter":"/","description":"Specifies that the variables that define the polynomial be standardized. By default, the standardized variables receive prefix \"s_\" in the variable names. You can use the following centerscale-opts to specify how the center and scale are estimated: METHOD=MOMENTS specifies that the center be estimated by the variable mean and the scale be estimated by the standard deviation. METHOD=RANGE specifies that the center be estimated by the midpoint of the variable range and the scale be estimated as half the variable range. METHOD=WMOMENTS is the same as METHOD=MOMENTS except that weighted means and weighted standard deviations are used.","help":"STANDARDIZECENTER | CENTERSCALE | NONE | SCALE","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Specifies that variables be centered but not scaled.","type":"standalone"},{"name":"CENTERSCALE","followsDelimiter":"/","description":"Specifies that variables be centered and scaled. This is the default if you do not specify a standardization-opt.","type":"standalone"},{"name":"NONE","followsDelimiter":"/","description":"Specifies that no standardization be performed.","type":"standalone"},{"name":"SCALE","followsDelimiter":"/","description":"Specifies that variables be scaled but not centered.","type":"standalone"}]},{"name":"STDIZE","optional":true,"followsDelimiter":"/","description":"[For the MULTIMEMBER effect-type only] Specifies that for each observation, the entries in the design matrix that corresponds to the multimember effect be scaled to have a sum of one.","type":"standalone"},{"name":"WEIGHT=","optional":true,"followsDelimiter":"/","description":"","help":"WEIGHT=*wght-list*","type":"value"}]},{"name":"ELSE","description":"If the condition in an IF-THEN statement is false and an ELSE statement is present, then the ELSE action is carried out.","help":"ELSE &lt;DO&gt; &lt;IF&gt; &lt;THEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"IF","optional":true,"description":"Executes a SAS statement for observations that meet specific conditions.","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"}]},{"name":"END","description":"Ends a DO group or SELECT group processing.","help":"END"},{"name":"ENDRSUBMIT","description":"Marks the end of a block of statements that a client session submits to a server session for execution.","help":"ENDRSUBMIT"},{"name":"ERROR","description":"Sets _ERROR_ to 1. A message written to the SAS log is optional.","help":"ERROR &lt;message&gt;"},{"name":"EXECUTE","description":"Executes a stored compiled DATA step program.","help":"EXECUTE"},{"name":"FILE","description":"where file-specification identifies an external file that the DATA step uses to write output from a PUT statement. File-specification can have these forms: 'external-file' specifies the physical name of an external file, which is enclosed in quotation marks. The physical name is the name by which the operating environment recognizes the file. fileref specifies the fileref of an external file. Requirement: You must have previously associated fileref with an external file in a FILENAME statement or function, or in an appropriate operating environment command. There is only one exception to this rule: when you use the FILEVAR= option, the fileref is simply a placeholder. fileref(file) specifies a fileref that is previously assigned to an external file that is an aggregate grouping of files. Follow the fileref with the name of a file or member, which is enclosed in parentheses. LOG is a reserved fileref that directs the output that is produced by any PUT statements to the SAS log. PRINT is a reserved fileref that directs the output that is produced by any PUT statements to the same file as the output that is produced by SAS procedures. device-type specifies the type of device or the access method that is used if the fileref points to an input or output device or a location that is not a physical file: DISK, DUMMY, GTERM, PIPE, PLOTTER, PRINTER, TAPE, TEMP, TERMINAL, UPRINTER. type specifies the type of file in z/OS: DLI, HFS, MVS, PIPE, VSAM. operating-environment-options or host-options Additional specifications might be required when you specify some devices. See the SAS documentation for your operating environment before specifying a value other than DISK. Values in addition to the ones listed here might be available in some operating environments.","help":"FILE &lt;DISK&gt; &lt;DUMMY&gt; &lt;LOG&gt; ...","arguments":[{"name":"ALQ=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of blocks initially allocated to an external file when it is created. The value can range from 0 to 2,147,483,647. If the value is 0 (the default), the minimum number of blocks required for the given file format is used.","type":"value"},{"name":"BLKSIZE=","optional":true,"aliases":["BLK="],"description":"[Windows/UNIX Host Option] Specifies the number of bytes that are physically read or written in an I/O operation. The default is 8K. The maximum is 1M (Windows) or 1G-1(UNIX).","help":"BLKSIZE=*block-size*","type":"value"},{"name":"BLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"BOM","optional":true,"aliases":["BOMFILE"],"description":"[UNIX/z/OS Host Option] Includes a Byte Order Mark when a UNICODE-encoded file is created.","type":"standalone"},{"name":"BUFND=","optional":true,"description":"Indicates how many data buffers to use for the VSAM data set.","help":"BUFND=*value*","type":"value"},{"name":"BUFNI=","optional":true,"description":"Indicates how many index buffers to use for the VSAM data set.","help":"BUFNI=*value*","type":"value"},{"name":"BYTE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"CC=","optional":true,"description":"[OpenVMS Host Option] Specifies the carriage-control format of the SAS log and the procedure output file.","help":"CC=FORTRAN | PRINT | CR","type":"choice","arguments":[{"name":"FORTRAN","description":"Indicates FORTRAN carriage-control format. This is the default for print files.","type":"standalone"},{"name":"PRINT","description":"Indicates OpenVMS print format.","type":"standalone"},{"name":"CR","description":"Indicates OpenVMS carriage-return, carriage-control format. This is the default for nonprinting files.","type":"standalone"}]},{"name":"CLIENT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"CLOSE=","optional":true,"description":"[z/OS Host Option] Indicates how a tape volume is positioned at the end of the DATA step.","help":"CLOSE=REREAD | LEAVE | REWIND | FREE | DISP","type":"choice","arguments":[{"name":"REREAD","description":"Positions the tape at the logical beginning of the data set.","type":"standalone"},{"name":"LEAVE","description":"Positions the tape at the logical end of the data set.","type":"standalone"},{"name":"REWIND","description":"Rewinds the tape to the physical beginning of the volume.","type":"standalone"},{"name":"FREE","description":"Dynamically deallocates the tape volume.","type":"standalone"},{"name":"DISP","description":"Is implied by the control language.","type":"standalone"}]},{"name":"COLUMN=","optional":true,"aliases":["COL="],"description":"Specifies a variable that SAS automatically sets to the current column location of the pointer.","type":"value"},{"name":"COMMAND","optional":true,"description":"[Windows Host Option] Allows remote commands to be issued to DDE server applications that not use the SYSTEM topic name.","type":"standalone"},{"name":"CSRC","optional":true,"description":"[OpenVMS Host Option] Specifies that you want to use the CSRCESRV services (available with z/OS) to compress data on output. For example: data _null_; file myfile csrc; put ... ; run;","type":"standalone"},{"name":"DCB=","optional":true,"description":"specifies the fileref of an external file that was referenced in an earlier FILE or INFILE statement in the same DATA step. SAS uses that file's RECFM=, LRECL=, and BLKSIZE= information for the current file.","help":"DCB=*fileref*","type":"value"},{"name":"DELIMITER=","optional":true,"aliases":["DLM="],"description":"Specifies an alternate delimiter (other than a blank) to be used for LIST output.","type":"value"},{"name":"DEQ=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of blocks added when OpenVMS RMS automatically extends an external file during a write operation. The value can range from 0 to 65,535. The default value is 0, telling OpenVMS RMS to use the process's default value. A large value results in fewer file extensions over the life of the file; a small value results in numerous file extensions over the life of the file. A file with numerous file extensions might be noncontiguous, thereby slowing record access.","type":"value"},{"name":"DEVTYPE=","optional":true,"description":"Defines a character variable (minimum length 24) that SAS sets to the device type. SAS obtains the device type by using the z/OS operating environment DEVTYPE macro.","help":"DEVTYPE=*variable*","type":"value"},{"name":"DISK","optional":true,"description":"[device-type] Specifies that the device is a disk drive.","type":"standalone"},{"name":"DLI","optional":true,"description":"[type] For IMS-DL/I databases.","type":"standalone"},{"name":"DLMSOPT=","optional":true,"description":"Specifies a parsing option for the DLMSTR= T option that removes trailing blanks of the string delimiter.","help":"DLMSOPT='T'","type":"choice","arguments":[{"name":"'T'","description":"Removes trailing blanks of the string delimiter.","type":"standalone"}]},{"name":"DLMSTR=","optional":true,"description":"Specifies a character string as an alternate delimiter (other than a blank) to be used for LIST output","type":"value"},{"name":"DROPOVER","optional":true,"description":"Discards data items that exceed the output line length (as specified by the LINESIZE= or LRECL= options in the FILE statement).","type":"standalone"},{"name":"DSCB=","optional":true,"description":"Defines a character variable (minimum length 96) that SAS sets to the Data Set Control Block (DSCB) information from a non-VSAM data set.","help":"DSCB=*variable*","type":"value"},{"name":"DSD","optional":true,"description":"Specifies that data values that contain embedded delimiters, such as tabs or commas, be enclosed in quotation marks.","type":"standalone"},{"name":"DUMMY","optional":true,"description":"[device-type] Specifies that the output to the file is discarded. Tip: Specifying DUMMY can be useful for testing.","type":"standalone"},{"name":"ENCODING=","optional":true,"description":"Specifies the encoding to use when writing to the output file.","help":"ENCODING='warabic' | 'wbaltic' | 'wlatin2' | 'wcyrillic' | 'wgreek' | 'whebrew' | 'wturkish' | 'wvietnamese' | 'wlatin1' | 'utf-8' | 'ms-950' | 'ms-936' | 'ms-932' | 'ms-949'","type":"choice","arguments":[{"name":"'warabic'","description":"Arabic","type":"standalone"},{"name":"'wbaltic'","description":"Baltic","type":"standalone"},{"name":"'wlatin2'","description":"Central Europe","type":"standalone"},{"name":"'wcyrillic'","description":"Cyrillic","type":"standalone"},{"name":"'wgreek'","description":"Greek","type":"standalone"},{"name":"'whebrew'","description":"Hebrew","type":"standalone"},{"name":"'wturkish'","description":"Turkish","type":"standalone"},{"name":"'wvietnamese'","description":"Vietnamese","type":"standalone"},{"name":"'wlatin1'","description":"Western","type":"standalone"},{"name":"'utf-8'","description":"Unicode encoding","type":"standalone"},{"name":"'ms-950'","description":"Traditional Chinese","type":"standalone"},{"name":"'ms-936'","description":"Simplified Chinese","type":"standalone"},{"name":"'ms-932'","description":"Japanese","type":"standalone"},{"name":"'ms-949'","description":"Korean","type":"standalone"}]},{"name":"EOFCONNECT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes and is valid only when you are defining the server. This option indicates that if an end-of-file (EOF) character is received from a client, the server should try to connect to the next client.","type":"standalone"},{"name":"FAC=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file access attributes used for external files. Use this option to indicate the level of access you want to allow for an external file. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow read access, files opened for output allow WRITE access, and files opened for update allow READ and WRITE access. The form of the FAC= option is FAC=access-option-list where access-option-list can be one of the following: DEL specifies DELETE access. GET specifies READ access. PUT specifies WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want DELETE, READ, and WRITE access:","type":"value"},{"name":"FEEDBACK=","optional":true,"aliases":["FDBK="],"description":"Defines a numeric variable that SAS sets to the VSAM logical error code. This option is similar to the _FDBK_ automatic variable. When SAS sets the FEEDBACK variable, you must reset it to 0 in order to continue.","type":"value"},{"name":"FILEDATA=","optional":true,"description":"[UNIX/z/OS Host Option] The FILEDATA= option specifies that the file being processed is expected to contain either binary or text data.","help":"FILEDATA=BINARY | TEXT","type":"choice","arguments":[{"name":"BINARY","description":"The FILEDATA= option specifies that the file being processed is expected to contain binary data.","type":"standalone"},{"name":"TEXT","description":"The FILEDATA= option specifies that the file being processed is expected to contain text data.","type":"standalone"}]},{"name":"FILENAME=","optional":true,"description":"Defines a character variable, whose name you supply, that SAS sets to the value of the physical name of the file currently open for PUT statement output.","type":"value"},{"name":"FILEVAR=","optional":true,"description":"Defines a variable whose change in value causes the FILE statement to close the current output file and open a new one the next time the FILE statement executes.","type":"value"},{"name":"FLOWOVER","optional":true,"description":"Causes data that exceeds the current line length to be written on a new line.","type":"standalone"},{"name":"FOOTNOTES","optional":true,"aliases":["FOOTNOTE"],"description":"Specifies that the currently defined footnotes are printed.","type":"standalone"},{"name":"GSFCC=","optional":true,"description":"[OpenVMS Host Option] Specifies the file format of graphic stream files (GSF files). When specified in the FILENAME statement, it affects only the GSF files that are created using that fileref.","help":"GSFCC=PRINT | CR | NONE","type":"choice","arguments":[{"name":"PRINT","description":"Creates a GSF file. It is a VFC format file with carriage control set to null. These files can be used with most utilities with the exception of some file transfer protocols, such as Kermit. This is the default value for this option.","type":"standalone"},{"name":"CR","description":"Creates a carriage return carriage control file.","type":"standalone"},{"name":"NONE","description":"Creates a file with no carriage control. This format is useful if you plan to download the file to a personal computer.","type":"standalone"}]},{"name":"GTERM","optional":true,"description":"[device-type] Indicates that the output device type is a graphics device that will receive graphics data.","type":"standalone"},{"name":"HEADER=","optional":true,"description":"Defines a statement label that identifies a group of SAS statements that you want to execute each time SAS begins a new output page","type":"value"},{"name":"HFS","optional":true,"description":"[type] For UNIX System Services files.","type":"standalone"},{"name":"HOTLINK","optional":true,"description":"[Windows Host Option] Instructs SAS to use the DDE HOTLINK.","type":"standalone"},{"name":"IGNOREDOSEOF","optional":true,"description":"[Windows Host Option] Is used in the context of I/O operations on variable record format files. When this option is specified, any occurrence of ^Z is interpreted as character data and not as an end-of-file marker.","type":"standalone"},{"name":"JFCB=","optional":true,"description":"Defines a character variable (minimum length 176) that SAS sets to the Job File Control Block (JFCB).","help":"JFCB=*variable*","type":"value"},{"name":"KEY=","optional":true,"description":"[OpenVMS Host Option] Specifies which key SAS uses to read the records in an RMS file with indexed organization. The KEY= option is always used with the KEYVALUE= option.","type":"value"},{"name":"KEYLEN=","optional":true,"description":"Specifies a numeric SAS variable that, when used with GENKEY, specifies the length of the key that is to be compared to the keys in the file.","help":"KEYLEN=*variable*","type":"value"},{"name":"KEYPOS=","optional":true,"description":"Indicates the numeric variable that SAS sets to the position of the VSAM key field. This option enables you to read keys without knowing the key position in advance. This variable is set to the column number (starting from 1).","help":"KEYPOS=*variable*","type":"value"},{"name":"KEYVALUE=","optional":true,"description":"[OpenVMS Host Option] Specifies the key value with which to begin reading an indexed file.","type":"value"},{"name":"LINE=","optional":true,"description":"Defines a variable whose value is the current relative line number within the group of lines available to the output pointer.","type":"value"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Sets the maximum number of columns per line for reports and the maximum record length for data files.","type":"value"},{"name":"LINESLEFT=","optional":true,"aliases":["LL="],"description":"Defines a variable whose value is the number of lines left on the current page.","type":"value"},{"name":"LOG","optional":true,"description":"Is a reserved fileref that directs the output that is produced by any PUT statements to the SAS log.","type":"standalone"},{"name":"LRECL=","optional":true,"description":"Specifies the logical record length of the output file.","type":"value"},{"name":"MBC=","optional":true,"description":"[OpenVMS Host Option] Specifies the size of the I/O buffers that OpenVMS RMS allocates for a particular file. The value can range from 0 to 127 and represents the number of blocks used for each buffer. By default, this option is set to 0 and the default values for the process are used. The MBC= option (multiblock count) is used for both input and output to control the allocation for a particular file. If you want to control the allocation size for all the external files used during the current SAS session, you can use the MBC= option in every FILE, FILENAME, or INFILE statement. You can also use the DCL SET RMS_DEFAULT command to specify a process default, and let the SAS values default to the process's default values.","type":"value"},{"name":"MBF=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of I/O buffers you want OpenVMS RMS to allocate for a particular file. The value can range from 0 to 127 and represents the number of buffers used. By default, this option is set to a value of 2. If a value of 0 is specified, the default value for the process is used. The MBF= option (multibuffer count) is used for both input and output to control the number of buffers allocated for a particular file. If you want to control the number of buffers allocated for all the external files used during the SAS session, you can use the MBF= option in every FILE, FILENAME, or INFILE statement. The DCL SET RMS_DEFAULT command can be used to specify a process default. Then, you can let the SAS values default to the process's default values.","type":"value"},{"name":"MESSAGE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"MOD","optional":true,"description":"Writes the output lines after any existing lines in the file.","type":"standalone"},{"name":"MVS","optional":true,"description":"[type] For z/OS data sets.","type":"standalone"},{"name":"N=","optional":true,"description":"Specifies the number of lines that you want available to the output pointer in the current iteration of the DATA step.","help":"N=&lt;*n*&gt; | PAGESIZE","type":"choice","arguments":[{"name":"n","placeholder":true,"description":"Specifies the number of lines that are available to the output pointer. Replace n with an integer.","type":"value"},{"name":"PAGESIZE","aliases":["PS"],"description":"Specifies that the entire page is available to the output pointer.","type":"standalone"}]},{"name":"NOBLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"NOBOM","optional":true,"aliases":["NOBOMFILE"],"description":"[UNIX/z/OS Host Option] Specifies that a Byte Order Mark is not included when a UNICODE-encoded file is created.","type":"standalone"},{"name":"NOFOOTNOTES","optional":true,"aliases":["NOFOOTNOTE"],"description":"Specifies that the currently defined footnotes are not printed.","type":"standalone"},{"name":"NOPAD","optional":true,"description":"Specifies that records written to an external file are not padded with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Specifies that carriage-control characters are placed in the output lines.","type":"standalone"},{"name":"NOTAB","optional":true,"description":"[Windows Host Option] Instructs SAS to ignore tab characters between variables.","type":"standalone"},{"name":"NOTITLES","optional":true,"aliases":["NOTITLE"],"description":"Specifies that the current title lines are not printed on the pages of files.","type":"standalone"},{"name":"ODS=","optional":true,"description":"Specifies to use the Output Delivery System to format the output from a DATA step.","type":"value"},{"name":"OLD","optional":true,"description":"Replaces the previous contents of the file.","type":"standalone"},{"name":"PAD","optional":true,"description":"Specifies that records written to an external file are padded with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"PAGESIZE=","optional":true,"aliases":["PS="],"description":"Sets the number of lines per page for your reports.","help":"PAGESIZE=*value*","type":"value"},{"name":"PASSWD=","optional":true,"description":"Gives the appropriate password for a VSAM data set that has password protection.","help":"PASSWD=*value*","type":"value"},{"name":"PIPE","optional":true,"description":"[device-type] Specifies an unnamed pipe. Note: Some operating environments do not support pipes.","type":"standalone"},{"name":"PLOTTER","optional":true,"description":"[device-type] Specifies an unbuffered graphics output device.","type":"standalone"},{"name":"PRINT","optional":true,"description":"Either a reserved fileref that directs the output that is produced by any PUT statements to the same file as the output that is produced by SAS procedures, or an option that specifies that carriage-control characters are placed in the output lines.","type":"standalone"},{"name":"PRINTER","optional":true,"description":"[device-type] Specifies a printer or printer spool file.","type":"standalone"},{"name":"RC4STOP","optional":true,"description":"[VSAM Option] Stops the DATA step from executing if a return code greater than 4 is returned by the operating environment when the VSAM data set is opened.","type":"standalone"},{"name":"RECFM=","optional":true,"description":"[Windows/UNIX/z/OS Host Option] Specifies the record format of the external file. Under z/OS, the following values can be appended to the RECFM values:","help":"RECFM=F | P | S | V | N | s370V | S370VB | S370VBS | STREAMLF | FB | VB | U","type":"choice","arguments":[{"name":"F","description":"Fixed-record format","type":"standalone"},{"name":"P","description":"Print format.","type":"standalone"},{"name":"S","description":"Stream-record format.","type":"standalone"},{"name":"V","aliases":["D"],"description":"Variable-record format (the default)","type":"standalone"},{"name":"N","description":"Indicates binary format and causes the file to be treated as a byte stream. If LRECL is not specified, by default SAS reads 256 bytes at a time from the file.","type":"standalone"},{"name":"s370V","description":"Indicates the variable S370 record format (V).","type":"standalone"},{"name":"S370VB","description":"Indicates the variable block S370 record format (VB).","type":"standalone"},{"name":"S370VBS","description":"Indicates the variable block with spanned records S370 record format (VBS).","type":"standalone"},{"name":"STREAMLF","description":"[For OpenVMS] Specifies StreamLF record format. Records are delimited by LF.","type":"standalone"},{"name":"FB","description":"Specifies fixed-length records, blocked.","type":"standalone"},{"name":"VB","description":"Specifies variable-length records, blocked.","type":"standalone"},{"name":"U","description":"Specifies undefined-length records, unblocked.","type":"standalone"}]},{"name":"RECORDS=","optional":true,"description":"Defines a numeric variable that SAS sets to the number of logical records in a VSAM data set that has been opened for input.","help":"RECORDS=*variable*","type":"value"},{"name":"RECORG=","optional":true,"description":"[z/OS Host Option] Specifies the organization of records in a new VSAM data set. Use this option only if SMS is active.","help":"RECORG=KS | ES | RR | LS","type":"choice","arguments":[{"name":"KS","description":"Specifies a VSAM key-sequenced data set.","type":"standalone"},{"name":"ES","description":"Specifies a VSAM entry-sequenced data set.","type":"standalone"},{"name":"RR","description":"Specifies a VSAM relative-record data set.","type":"standalone"},{"name":"LS","description":"Specifies a VSAM linear-space data set.","type":"standalone"}]},{"name":"RESET","optional":true,"description":"[VSAM Option] Indicates that the VSAM file is reset to empty (no records) when it is opened. This option applies only to loading a VSAM data set that has been marked REUSE. You cannot use this option if the data set contains an alternate index.","type":"standalone"},{"name":"RETRY=","optional":true,"description":"[Windows Host Option]","help":"RETRY=*seconds*","type":"value"},{"name":"RRN=","optional":true,"description":"Defines a numeric variable that you set to the relative record number (RRN) of the record that you want to read or write. This option indicates that keyed direct access is being used; it is appropriate for RRDS only.","help":"RRN=*variable*","type":"value"},{"name":"SERVER","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"SHR=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file-sharing attributes used for external files. With this option, you can indicate the access level you want to give other users. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow shared read access, and files opened for output or UPDATE do not allow shared access. However, you can allow other users to have READ and WRITE access to a file that you are opening for input only. To accomplish this, use the SHR= option. The syntax of the SHR= option is SHR=share-option-list where share-option-list can be one of the following: DEL specifies DELETE access. GET specifies shared READ access. NONE specifies no shared access. PUT specifies shared WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want shared DELETE, READ, and WRITE access:","type":"value"},{"name":"STOPOVER","optional":true,"description":"Stops processing the DATA step immediately if a PUT statement attempts to write a data item that exceeds the current line length.","type":"standalone"},{"name":"TAPE","optional":true,"description":"[device-type] Specifies a tape drive.","type":"standalone"},{"name":"TEMP","optional":true,"description":"[device-type] Creates a temporary file that exists only as long as the filename is assigned.","type":"standalone"},{"name":"TERMINAL","optional":true,"description":"[device-type] Specifies the user's terminal.","type":"standalone"},{"name":"TERMSTR=","optional":true,"description":"[Windows/UNIX Host Option] Specifies the end-of-line character for the file. Use this option to share files between the UNIX and Windows operating environments.","help":"TERMSTR=CR | CRLF | LF | NULL | NONE | NL | LFCR | CRNL","type":"choice","arguments":[{"name":"CR","description":"Carriage return (CR).","type":"standalone"},{"name":"CRLF","description":"Carriage return (CR) followed by line feed (LF).","type":"standalone"},{"name":"LF","description":"Line feed only (the default).","type":"standalone"},{"name":"NULL","description":"NULL character (0x00).","type":"standalone"},{"name":"NONE","description":"Record terminators are not used. This parameter provides the same function as FILEDATA=BINARY.","type":"standalone"},{"name":"NL","description":"The newline character (x'15') is used as the record terminator. This parameter provides the same function as FILEDATA=TEXT.","type":"standalone"},{"name":"LFCR","description":"The sequence LF followed by CR is used as the record terminator.","type":"standalone"},{"name":"CRNL","description":"The sequence CR followed by NL is used as the record terminator.","type":"standalone"}]},{"name":"TITLES","optional":true,"aliases":["TITLE"],"description":"Specifies that the current title lines are printed on the pages of files.","type":"standalone"},{"name":"UCBNAME=","optional":true,"description":"Defines a character variable (minimum length 3) that SAS sets to the unit name (device address), which is derived from information in the unit control block (UCB).","help":"UCBNAME=*variable*","type":"value"},{"name":"UNBUF","optional":true,"description":"[UNIX Host Option] Tells SAS not to perform buffered writes to the file on any subsequent FILE statement. This option applies especially when you are reading from or writing to a data collection device. As explained in SAS Language Reference: Dictionary, it also prevents buffered reads on INFILE statements.","type":"standalone"},{"name":"UPRINTER","optional":true,"description":"[device-type] Specifies a Universal Printing printer definition name.","type":"standalone"},{"name":"VOLUME=","optional":true,"aliases":["VOLUMES="],"description":"Defines a character variable (with a minimum length of six characters) that SAS sets to the tape VOLSER or the disk volume serial number. In the case of a multivolume file, the VOLUME= variable contains the concatenated volume serial numbers up to the length of the variable or the first 30 volumes, whichever is less. The value in the VOLUME= variable contains the volume serial number of the first data set in the concatenation when the file is opened. This serial number changes if you open a subsequent data set in the concatenation.","type":"value"},{"name":"VSAM","optional":true,"description":"[type] For VSAM files.","type":"standalone"},{"name":"_FILE_=","optional":true,"description":"Names a character variable that references the current output buffer of this FILE statement.","help":"_FILE_=*variable*","type":"value"}]},{"name":"FORMAT","description":"Associates formats with variables.","help":"FORMAT &lt;DEFAULT=default-format&gt; ","arguments":[{"name":"DEFAULT=","optional":true,"description":"Specifies a temporary default format for displaying the values of variables that are not listed in the FORMAT statement. These default formats apply only to the current DATA step; they are not permanently associated with variables in the output data set. A DEFAULT= format specification applies to o variables that are not named in a FORMAT or ATTRIB statement o variables that are not permanently associated with a format within a SAS data set o variables that are not written with the explicit use of a format. Default: If you omit DEFAULT=, SAS uses BESTw. as the default numeric format and $w. as the default character format. Restriction: Use this option only in a DATA step.","help":"DEFAULT=*default-format*","type":"value"}]},{"name":"GO TO","aliases":["GOTO"],"description":"Jumps to a new statement.","help":"GO TO label "},{"name":"IF","description":"Continues processing only those observations that meet the condition of the specified expression.","help":"IF &lt;DO&gt; &lt;THEN&gt; &lt;WHEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"CALL","optional":true,"description":"Invokes a SAS CALL routine.","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"GO","optional":true,"aliases":["GOTO"],"description":"Jumps to a new statement.","help":"GO TO","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"PUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"RETURN","optional":true,"description":"Action statement in an IF-THEN construct. Stops executing statements at the current point in the DATA step and returns to a predetermined point in the step.","type":"standalone"},{"name":"SET","optional":true,"description":"Reads an observation from one or more SAS data sets.","type":"standalone"},{"name":"STOP","optional":true,"description":"Action statement in an IF-THEN construct. Stops execution of the current DATA step.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"},{"name":"WHEN","optional":true,"description":"WHEN statement in an IF-THEN-WHEN construct.","type":"standalone"}]},{"name":"INFILE","description":"file-specification identifies a file in one of the following forms: fileref specifies the assigned fileref or the allocated ddname of the file. A fileref must conform to the rules for ddnames. That is, it can consist of up to eight letters, numbers, or national characters ($, @, and #) and underscores (_). The first character must be either a letter or a national character. fileref(member) specifies a member of a partitioned data set, where the PDS or PDSE is specified by the assigned fileref or allocated ddname. If you specify a fileref that is not allocated, then SAS attempts to construct a data set name with the following three qualifiers: o the value of the SYSPREF= option (usually the user ID) o the specified fileref o DATA If a file is found that has this constructed data set name, then SAS opens it and reads it. The value of the FILEEXT= system option can affect the way SAS interprets PDS and PDSE member names. 'physical-filename' specifies a physical file, which can be a member of a partitioned data set (PDS), an extended partitioned data set (PDSE), or a UNIX System Services file, using the following syntax: o a fully qualified data set name. For example: 'myid.raw.datax' o a fully qualified data set name with a member in parentheses. For example: 'sas.raw.data(mem1)' o a partially qualified data set name with a period preceding it. For example: '.raw.data' o a partially qualified data set name with a period preceding it and a member name in parentheses. For example: '.raw.data(mem1)' o for PDS members, a fully or partially qualified data set name with a wildcard name in parentheses. For example: '.raw.data(mem*)', '.raw.data(*mem1)', '.raw.data(*)' o a UNIX System Services file. For example: '/u/userid/raw' or 'HFS:raw' or '/u/userid/data/*'","help":"INFILE &lt;DATALINES4&gt; &lt;DATALINES&gt; &lt;DISK&gt; ...","arguments":[{"name":"BACKWARD","optional":true,"aliases":["BKWD"],"description":"[VSAM Option] Causes SAS to read the VSAM data set backwards (INFILE only)","type":"standalone"},{"name":"BLKSIZE=","optional":true,"aliases":["BLK="],"description":"[Windows/UNIX Host Option] Specifies the number of bytes that are physically read or written in an I/O operation. The default is 8K. The maximum is 1M (Windows) or 1G-1(UNIX).","help":"BLKSIZE=*block-size*","type":"value"},{"name":"BLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"BUFND=","optional":true,"description":"Indicates how many data buffers to use for the VSAM data set.","help":"BUFND=*value*","type":"value"},{"name":"BUFNI=","optional":true,"description":"Indicates how many index buffers to use for the VSAM data set.","help":"BUFNI=*value*","type":"value"},{"name":"BYTE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"CCHHR=","optional":true,"description":"specifies a character variable to which the physical address (cylinder head record) of a record is returned. This applies to files on CKD disks only.","help":"CCHHR=*variable*","type":"value"},{"name":"CLIENT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"CLOSE=","optional":true,"description":"[z/OS Host Option] Indicates how a tape volume is positioned at the end of the DATA step.","help":"CLOSE=REREAD | LEAVE | REWIND | FREE | DISP","type":"choice","arguments":[{"name":"REREAD","description":"Positions the tape at the logical beginning of the data set.","type":"standalone"},{"name":"LEAVE","description":"Positions the tape at the logical end of the data set.","type":"standalone"},{"name":"REWIND","description":"Rewinds the tape to the physical beginning of the volume.","type":"standalone"},{"name":"FREE","description":"Dynamically deallocates the tape volume.","type":"standalone"},{"name":"DISP","description":"Is implied by the control language.","type":"standalone"}]},{"name":"COLUMN=","optional":true,"aliases":["COL="],"description":"Names a variable that SAS uses to assign the current column location of the input pointer. Like automatic variables, the COLUMN= variable is not written to the data set.","type":"value"},{"name":"CONTROLINTERVAL","optional":true,"aliases":["CTLINTV","CNV"],"description":"[VSAM Option] Indicates that you want to read physical VSAM control interval records rather than logical records. This option is typically used for diagnostic purposes (INFILE only).","type":"standalone"},{"name":"CSRC","optional":true,"description":"[OpenVMS Host Option] Specifies that you want to use the CSRCESRV services (available with z/OS) to compress data on output. For example: data _null_; file myfile csrc; put ... ; run;","type":"standalone"},{"name":"CVAF","optional":true,"description":"[VTOC Option under z/OS] Tells SAS to use the Common VTOC Access Facility (CVAF) of the IBM program product Data Facility/Device Support (DF/DS) for indexed VTOCs. If the VTOC is not indexed, or if your installation does not have CVAF, this option is ignored.","type":"standalone"},{"name":"DATALINES4","optional":true,"aliases":["CARDS4"],"description":"Specifies that the input data immediately follows the DATALINES4|CARDS4 statement in the DATA step. Using DATALINES4|CARDS4 allows you to use the INFILE statement options to control how the INPUT statement reads instream data lines.","type":"standalone"},{"name":"DATALINES","optional":true,"aliases":["CARDS"],"description":"Specifies that the input data immediately follows the DATALINES|CARDS statement in the DATA step. Using DATALINES|CARDS allows you to use the INFILE statement options to control how the INPUT statement reads instream data lines.","type":"standalone"},{"name":"DCB=","optional":true,"description":"specifies the fileref of an external file that was referenced in an earlier FILE or INFILE statement in the same DATA step. SAS uses that file's RECFM=, LRECL=, and BLKSIZE= information for the current file.","help":"DCB=*fileref*","type":"value"},{"name":"DELIMITER=","optional":true,"aliases":["DLM="],"description":"Specifies an alternate delimiter (other than a blank) to be used for LIST input.","type":"value"},{"name":"DISK","optional":true,"description":"[device-type] Specifies that the device is a disk drive.","type":"standalone"},{"name":"DLI","optional":true,"description":"[type] For IMS-DL/I databases.","type":"standalone"},{"name":"DLMSOPT=","optional":true,"description":"Specifies whether case-insensitive comparisons will be done, or trailing blanks of the string delimiter will be removed.","help":"DLMSOPT='I' | 'T'","type":"choice","arguments":[{"name":"'I'","description":"Specifies that case-insensitive comparisons will be done.","type":"standalone"},{"name":"'T'","description":"Specifies that trailing blanks of the string delimiter will be removed.","type":"standalone"}]},{"name":"DLMSTR=","optional":true,"description":"Specifies a character string as an alternate delimiter (other than a blank) to be used for LIST input","type":"value"},{"name":"DSD","optional":true,"description":"Specifies that when data values are enclosed in quotation marks, delimiters within the value are treated as character data. The DSD option changes how SAS treats delimiters when you use LIST input and sets the default delimiter to a comma. When you specify DSD, SAS treats two consecutive delimiters as a missing value and removes quotation marks from character values.","type":"standalone"},{"name":"DUMMY","optional":true,"description":"[device-type] Specifies that the output to the file is discarded. Tip: Specifying DUMMY can be useful for testing.","type":"standalone"},{"name":"ENCODING=","optional":true,"description":"Specifies the encoding to use when reading from the external file.","help":"ENCODING='warabic' | 'wbaltic' | 'wlatin2' | 'wcyrillic' | 'wgreek' | 'whebrew' | 'wturkish' | 'wvietnamese' | 'wlatin1' | 'utf-8' | 'ms-950' | 'ms-936' | 'ms-932' | 'ms-949'","type":"choice","arguments":[{"name":"'warabic'","description":"Arabic","type":"standalone"},{"name":"'wbaltic'","description":"Baltic","type":"standalone"},{"name":"'wlatin2'","description":"Central Europe","type":"standalone"},{"name":"'wcyrillic'","description":"Cyrillic","type":"standalone"},{"name":"'wgreek'","description":"Greek","type":"standalone"},{"name":"'whebrew'","description":"Hebrew","type":"standalone"},{"name":"'wturkish'","description":"Turkish","type":"standalone"},{"name":"'wvietnamese'","description":"Vietnamese","type":"standalone"},{"name":"'wlatin1'","description":"Western","type":"standalone"},{"name":"'utf-8'","description":"Unicode encoding","type":"standalone"},{"name":"'ms-950'","description":"Traditional Chinese","type":"standalone"},{"name":"'ms-936'","description":"Simplified Chinese","type":"standalone"},{"name":"'ms-932'","description":"Japanese","type":"standalone"},{"name":"'ms-949'","description":"Korean","type":"standalone"}]},{"name":"END=","optional":true,"description":"Specifies a variable that SAS sets to 1 when the current input data record is the last in the input file. Until SAS processes the last data record, the END= variable is set to 0. Like automatic variables, this variable is not written to the data set. Restriction: You cannot use the END= option with UNBUFFERED option, DATALINES or DATALINES4 statement, and an INPUT statement that reads multiple input data records.","type":"value"},{"name":"EOF=","optional":true,"description":"Specifies a statement label that is the object of an implicit GO TO when the INFILE statement reaches end of file.","type":"value"},{"name":"EOFCONNECT","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes and is valid only when you are defining the server. This option indicates that if an end-of-file (EOF) character is received from a client, the server should try to connect to the next client.","type":"standalone"},{"name":"EOV=","optional":true,"description":"Specifies a variable that SAS sets to 1 when the first record in a file in a series of concatenated files is read.","type":"value"},{"name":"ERASE=","optional":true,"description":"Defines a numeric SAS variable that you must set to 1 when you want to erase a VSAM record (INFILE only).","help":"ERASE=*variable*","type":"value"},{"name":"EXPANDTABS","optional":true,"description":"Specifies to expand tab characters to the standard tab setting, which is set at 8-column intervals that start at column 9.","type":"standalone"},{"name":"FAC=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file access attributes used for external files. Use this option to indicate the level of access you want to allow for an external file. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow read access, files opened for output allow WRITE access, and files opened for update allow READ and WRITE access. The form of the FAC= option is FAC=access-option-list where access-option-list can be one of the following: DEL specifies DELETE access. GET specifies READ access. PUT specifies WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want DELETE, READ, and WRITE access:","type":"value"},{"name":"FEEDBACK=","optional":true,"aliases":["FDBK="],"description":"Defines a numeric variable that SAS sets to the VSAM logical error code. This option is similar to the _FDBK_ automatic variable. When SAS sets the FEEDBACK variable, you must reset it to 0 in order to continue.","type":"value"},{"name":"FILEDATA=","optional":true,"description":"[UNIX/z/OS Host Option] The FILEDATA= option specifies that the file being processed is expected to contain either binary or text data.","help":"FILEDATA=BINARY | TEXT","type":"choice","arguments":[{"name":"BINARY","description":"The FILEDATA= option specifies that the file being processed is expected to contain binary data.","type":"standalone"},{"name":"TEXT","description":"The FILEDATA= option specifies that the file being processed is expected to contain text data.","type":"standalone"}]},{"name":"FILENAME=","optional":true,"description":"Specifies a variable that SAS sets to the physical StatementOptionName of the currently opened input file. Like automatic variables, the FILENAME= variable is not written to the data set.","type":"value"},{"name":"FILEVAR=","optional":true,"description":"Specifies a variable whose change in value causes the INFILE statement to close the current input file and open a new one.","type":"value"},{"name":"FIRSTOBS=","optional":true,"description":"Specifies a record number that SAS uses to begin reading input data records in the input file.","type":"value"},{"name":"FLOWOVER","optional":true,"description":"Causes an INPUT statement to continue to read the next input data record if it does not find values in the current input line for all the variables in the statement.","type":"standalone"},{"name":"GENKEY","optional":true,"description":"[VSAM Option] Causes SAS to use the KEY= variable as the leading portion of a record's key. VSAM retrieves the first record whose key matches the generic key (INFILE only).","type":"standalone"},{"name":"GTERM","optional":true,"description":"[device-type] Indicates that the output device type is a graphics device that will receive graphics data.","type":"standalone"},{"name":"HFS","optional":true,"description":"[type] For UNIX System Services files.","type":"standalone"},{"name":"HOTLINK","optional":true,"description":"[Windows Host Option] Instructs SAS to use the DDE HOTLINK.","type":"standalone"},{"name":"IDMS","optional":true,"description":"[type] For CA-IDMS files.","type":"standalone"},{"name":"IGNOREDOSEOF","optional":true,"description":"[Windows Host Option] Is used in the context of I/O operations on variable record format files. When this option is specified, any occurrence of ^Z is interpreted as character data and not as an end-of-file marker.","type":"standalone"},{"name":"ISAM","optional":true,"description":"[type] For ISAM files.","type":"standalone"},{"name":"KEY=","optional":true,"description":"[OpenVMS Host Option] Specifies which key SAS uses to read the records in an RMS file with indexed organization. The KEY= option is always used with the KEYVALUE= option.","type":"value"},{"name":"KEYLEN=","optional":true,"description":"Specifies a numeric SAS variable that, when used with GENKEY, specifies the length of the key that is to be compared to the keys in the file.","help":"KEYLEN=*variable*","type":"value"},{"name":"KEYPOS=","optional":true,"description":"Indicates the numeric variable that SAS sets to the position of the VSAM key field. This option enables you to read keys without knowing the key position in advance. This variable is set to the column number (starting from 1).","help":"KEYPOS=*variable*","type":"value"},{"name":"KEYVALUE=","optional":true,"description":"[OpenVMS Host Option] Specifies the key value with which to begin reading an indexed file.","type":"value"},{"name":"LENGTH=","optional":true,"description":"Specifies a variable that SAS sets to the length of the current input line.","type":"value"},{"name":"LINE=","optional":true,"description":"Specifies a variable that SAS sets to the line location of the input pointer in the input buffer. Like automatic variables, the LINE= variable is not written to the data set.","type":"value"},{"name":"LINESIZE=","optional":true,"aliases":["LS="],"description":"Specifies the record length that is available to the INPUT statement.","type":"value"},{"name":"LRECL=","optional":true,"description":"Specifies the logical record length.","type":"value"},{"name":"MBC=","optional":true,"description":"[OpenVMS Host Option] Specifies the size of the I/O buffers that OpenVMS RMS allocates for a particular file. The value can range from 0 to 127 and represents the number of blocks used for each buffer. By default, this option is set to 0 and the default values for the process are used. The MBC= option (multiblock count) is used for both input and output to control the allocation for a particular file. If you want to control the allocation size for all the external files used during the current SAS session, you can use the MBC= option in every FILE, FILENAME, or INFILE statement. You can also use the DCL SET RMS_DEFAULT command to specify a process default, and let the SAS values default to the process's default values.","type":"value"},{"name":"MBF=","optional":true,"description":"[OpenVMS Host Option] Specifies the number of I/O buffers you want OpenVMS RMS to allocate for a particular file. The value can range from 0 to 127 and represents the number of buffers used. By default, this option is set to a value of 2. If a value of 0 is specified, the default value for the process is used. The MBF= option (multibuffer count) is used for both input and output to control the number of buffers allocated for a particular file. If you want to control the number of buffers allocated for all the external files used during the SAS session, you can use the MBF= option in every FILE, FILENAME, or INFILE statement. The DCL SET RMS_DEFAULT command can be used to specify a process default. Then, you can let the SAS values default to the process's default values.","type":"value"},{"name":"MESSAGE","optional":true,"description":"Is used only in the context of named pipes. This option indicates the type of pipe. BYTE is the default value.","type":"standalone"},{"name":"MISSOVER","optional":true,"description":"Prevents an INPUT statement from reading a new input data record if it does not find values in the current input line for all the variables in the statement.","type":"standalone"},{"name":"MOD","optional":true,"description":"Indicates that data written to the file should be appended to the file","type":"standalone"},{"name":"MVS","optional":true,"description":"[type] For z/OS data sets.","type":"standalone"},{"name":"N=","optional":true,"description":"Specifies the number of lines that are available to the input pointer at one time.","type":"value"},{"name":"NBYTE=","optional":true,"description":"Specifies the StatementOptionName of a variable that contains the number of bytes to read from a file when you are reading data in stream record format (RECFM=S in the FILENAME statement).","type":"value"},{"name":"NEW","optional":true,"description":"Indicates that a new file is to be opened for output. If the file already exists, then it is deleted and re-created.","type":"standalone"},{"name":"NOBLOCK","optional":true,"description":"Is used only in the context of named pipes. This option indicates whether the client is to wait if no data is currently available. BLOCK is the default value.","type":"standalone"},{"name":"NOEXPANDTABS","optional":true,"description":"Specifies not to expand tab characters to the standard tab setting, which is set at 8-column intervals that start at column 9.","type":"standalone"},{"name":"NOPAD","optional":true,"description":"SAS does not pad the records that are read from an external file with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Specifies that the input file does not contain carriage-control characters.","type":"standalone"},{"name":"NOTAB","optional":true,"description":"[Windows Host Option] Instructs SAS to ignore tab characters between variables.","type":"standalone"},{"name":"NRLS","optional":true,"description":"[VSAM Option] Specifies not to use record-level sharing (RLS) to open an RLS-eligible data set (INFILE only).","type":"standalone"},{"name":"OBS=","optional":true,"description":"Use OBS= with FIRSTOBS= to read a range of records from the middle of a file.","help":"OBS=&lt;*record-number*&gt; | MAX","type":"choice","arguments":[{"name":"record-number","placeholder":true,"description":"Specifies the record number of the last record to read in an input file that is read sequentially.","type":"value"},{"name":"MAX","description":"Specifies the maximum number of observations to process, which will be at least as large as the largest signed, 32-bit integer.","type":"standalone"}]},{"name":"OLD","optional":true,"description":"Indicates that a new file is to be opened for output. If the file already exists, then the previous contents of the file are replaced.","type":"standalone"},{"name":"PAD","optional":true,"description":"SAS pads the records that are read from an external file with blanks to the length that is specified in the LRECL= option.","type":"standalone"},{"name":"PASSWD=","optional":true,"description":"Gives the appropriate password for a VSAM data set that has password protection.","help":"PASSWD=*value*","type":"value"},{"name":"PIPE","optional":true,"description":"[device-type] Specifies an unnamed pipe. Note: Some operating environments do not support pipes.","type":"standalone"},{"name":"PLOTTER","optional":true,"description":"[device-type] Specifies an unbuffered graphics output device.","type":"standalone"},{"name":"PRINT","optional":true,"description":"Specifies that the input file contains carriage-control characters.","type":"standalone"},{"name":"PRINTER","optional":true,"description":"[device-type] Specifies a printer or printer spool file.","type":"standalone"},{"name":"RBA=","optional":true,"description":"Specifies a numeric variable that you set to the relative byte address (RBA) of the data record that you want to read. The RBA= option indicates that addressed direct access is being used; it is appropriate for KSDS and ESDS. If you specify the CONTROLINTERVAL option, you can use the RBA= option to access control records in an RRDS (INFILE only).","help":"RBA=*variable*","type":"value"},{"name":"RC4STOP","optional":true,"description":"[VSAM Option] Stops the DATA step from executing if a return code greater than 4 is returned by the operating environment when the VSAM data set is opened.","type":"standalone"},{"name":"RECFM=","optional":true,"description":"[Windows/UNIX Host Option] Specifies the record format of the external file.","help":"RECFM=F | P | S | V | N | s370V | S370VB | S370VBS | STREAMLF","type":"choice","arguments":[{"name":"F","description":"Fixed-record format","type":"standalone"},{"name":"P","description":"Print format.","type":"standalone"},{"name":"S","description":"Stream-record format.","type":"standalone"},{"name":"V","aliases":["D"],"description":"Variable-record format (the default)","type":"standalone"},{"name":"N","description":"Indicates binary format and causes the file to be treated as a byte stream. If LRECL is not specified, by default SAS reads 256 bytes at a time from the file.","type":"standalone"},{"name":"s370V","description":"Indicates the variable S370 record format (V).","type":"standalone"},{"name":"S370VB","description":"Indicates the variable block S370 record format (VB).","type":"standalone"},{"name":"S370VBS","description":"Indicates the variable block with spanned records S370 record format (VBS).","type":"standalone"},{"name":"STREAMLF","description":"[For OpenVMS] Specifies StreamLF record format. Records are delimited by LF.","type":"standalone"}]},{"name":"RECORDS=","optional":true,"description":"Defines a numeric variable that SAS sets to the number of logical records in a VSAM data set that has been opened for input.","help":"RECORDS=*variable*","type":"value"},{"name":"RECORG=","optional":true,"description":"[z/OS Host Option] Specifies the organization of records in a new VSAM data set. Use this option only if SMS is active.","help":"RECORG=KS | ES | RR | LS","type":"choice","arguments":[{"name":"KS","description":"Specifies a VSAM key-sequenced data set.","type":"standalone"},{"name":"ES","description":"Specifies a VSAM entry-sequenced data set.","type":"standalone"},{"name":"RR","description":"Specifies a VSAM relative-record data set.","type":"standalone"},{"name":"LS","description":"Specifies a VSAM linear-space data set.","type":"standalone"}]},{"name":"RESET","optional":true,"description":"[VSAM Option] Indicates that the VSAM file is reset to empty (no records) when it is opened. This option applies only to loading a VSAM data set that has been marked REUSE. You cannot use this option if the data set contains an alternate index.","type":"standalone"},{"name":"RETRY=","optional":true,"description":"[Windows Host Option]","help":"RETRY=*seconds*","type":"value"},{"name":"RRN=","optional":true,"description":"Defines a numeric variable that you set to the relative record number (RRN) of the record that you want to read or write. This option indicates that keyed direct access is being used; it is appropriate for RRDS only.","help":"RRN=*variable*","type":"value"},{"name":"SCANOVER","optional":true,"description":"Causes the INPUT statement to scan the input data records until the character string that is specified in the @'character-string' expression is found.","type":"standalone"},{"name":"SEQUENTIAL","optional":true,"description":"[VSAM Option] Specifies sequential VSAM record retrieval when either the RBA= (for an ESDS) or the RRN= option (for an RRDS) is specified (INFILE only).","type":"standalone"},{"name":"SERVER","optional":true,"description":"[Windows Host Option] Is used only in the context of named pipes. This option specifies the mode of a named pipe. The default value is SERVER.","type":"standalone"},{"name":"SHAREBUFFERS","optional":true,"aliases":["SHAREBUFS"],"description":"Specifies that the FILE statement and the INFILE statement share the same buffer.","type":"standalone"},{"name":"SHR=","optional":true,"description":"[OpenVMS Host Option] Overrides the default file-sharing attributes used for external files. With this option, you can indicate the access level you want to give other users. You can allow READ, WRITE, UPDATE, and DELETE access (as well as no access). By default with external files, files opened for input allow shared read access, and files opened for output or UPDATE do not allow shared access. However, you can allow other users to have READ and WRITE access to a file that you are opening for input only. To accomplish this, use the SHR= option. The syntax of the SHR= option is SHR=share-option-list where share-option-list can be one of the following: DEL specifies DELETE access. GET specifies shared READ access. NONE specifies no shared access. PUT specifies shared WRITE access. UPD specifies UPDATE access. You can combine these values in any order. For example, specifying the following indicates that you want shared DELETE, READ, and WRITE access:","type":"value"},{"name":"SKIP","optional":true,"description":"[VSAM Option] Indicates skip-sequential processing of VSAM files. Skip-sequential processing finds the first record whose value is the same as the value specified by the KEY= option; records are read sequentially thereafter (INFILE only).","type":"standalone"},{"name":"START=","optional":true,"description":"Specifies a variable whose value SAS uses as the first column number of the record that the PUT _INFILE_ statement writes. Like automatic variables, the START variable is not written to the data set.","type":"value"},{"name":"STOPOVER","optional":true,"description":"Causes the DATA step to stop processing if an INPUT statement reaches the end of the current record without finding values for all variables in the statement.","type":"standalone"},{"name":"TAPE","optional":true,"description":"[device-type] Specifies a tape drive.","type":"standalone"},{"name":"TEMP","optional":true,"description":"[device-type] Creates a temporary file that exists only as long as the filename is assigned.","type":"standalone"},{"name":"TERMINAL","optional":true,"description":"[device-type] Specifies the user's terminal.","type":"standalone"},{"name":"TERMSTR=","optional":true,"description":"[Windows/UNIX Host Option] Specifies the end-of-line character for the file. Use this option to share files between the UNIX and Windows operating environments.","help":"TERMSTR=CR | CRLF | LF | NULL | NONE | NL | LFCR | CRNL","type":"choice","arguments":[{"name":"CR","description":"Carriage return (CR).","type":"standalone"},{"name":"CRLF","description":"Carriage return (CR) followed by line feed (LF).","type":"standalone"},{"name":"LF","description":"Line feed only (the default).","type":"standalone"},{"name":"NULL","description":"NULL character (0x00).","type":"standalone"},{"name":"NONE","description":"Record terminators are not used. This parameter provides the same function as FILEDATA=BINARY.","type":"standalone"},{"name":"NL","description":"The newline character (x'15') is used as the record terminator. This parameter provides the same function as FILEDATA=TEXT.","type":"standalone"},{"name":"LFCR","description":"The sequence LF followed by CR is used as the record terminator.","type":"standalone"},{"name":"CRNL","description":"The sequence CR followed by NL is used as the record terminator.","type":"standalone"}]},{"name":"TRUNCOVER","optional":true,"description":"Overrides the default behavior of the INPUT statement when an input data record is shorter than the INPUT statement expects. By default, the INPUT statement automatically reads the next input data record. TRUNCOVER enables you to read variable-length records when some records are shorter than the INPUT statement expects. Variables without any values assigned are set to missing.","type":"standalone"},{"name":"UNBUFFERED","optional":true,"aliases":["UNBUF"],"description":"Tells SAS not to perform a buffered (\"look ahead\") read.","type":"standalone"},{"name":"UPDATE=","optional":true,"description":"Defines a numeric SAS variable that indicates that not every record that it reads is to be updated. Use this option when you are updating records in a VSAM data set (INFILE only). When an INFILE and a FILE statement reference the same VSAM data set, records are retrieved for update by default.","help":"UPDATE=*variable*","type":"value"},{"name":"UPRINTER","optional":true,"description":"[device-type] Specifies a Universal Printing printer definition StatementOptionName.","type":"standalone"},{"name":"VSAM","optional":true,"description":"[type] For VSAM files.","type":"standalone"},{"name":"VTOC","optional":true,"description":"[type] For a Volume Table of Contents (VTOC).","type":"standalone"},{"name":"_INFILE_=","optional":true,"description":"Specifies a character variable that references the contents of the current input buffer for this INFILE statement.","type":"value"}]},{"name":"INFORMAT","description":"Associates informats with variables.","help":"INFORMAT &lt;DEFAULT= default-informat&gt; ","arguments":[{"name":"DEFAULT=","optional":true,"description":"Specifies a temporary default informat for reading values of the variables that are listed in the INFORMAT statement. If no variable is specified, then the DEFAULT= informat specification applies a temporary default informat for reading values of all the variables of that type included in the DATA step. Numeric informats are applied to numeric variables, and character informats are applied to character variables. These default informats apply only to the current DATA step. A DEFAULT= informat specification applies to o variables that are not named in an INFORMAT or ATTRIB statement o variables that are not permanently associated with an informat within a SAS data set o variables that are not read with an explicit informat in the current DATA step. Default: If you omit DEFAULT=, SAS uses w.d as the default numeric informat and $w. as the default character informat. Restriction: Use this argument only in a DATA step.","type":"value"}]},{"name":"INPUT","description":"Describes the arrangement of values in the input data record and assigns input values to the corresponding SAS variables.","help":"INPUT &lt;specification(s)&gt;&lt;@|@@&gt;"},{"name":"KEEP","description":"Specifies the variables to include in output SAS data sets.","help":"KEEP variable-list"},{"name":"LABEL","description":"Identifies a statement that is referred to by another statement.","help":""},{"name":"LEAVE","description":"Stops processing the current loop and resumes with the next statement in the sequence.","help":"LEAVE"},{"name":"LENGTH","description":"Specifies the number of bytes for storing variables.","help":"LENGTH &lt;DEFAULT=n&gt; ","arguments":[{"name":"DEFAULT=","optional":true,"description":"Changes the default number of bytes that SAS uses to store the values of any newly created numeric variables.","help":"DEFAULT=*n*","type":"value"}]},{"name":"LINK","description":"Directs program execution immediately to the statement label that is specified and, if followed by a RETURN statement, returns execution to the statement that follows the LINK statement.","help":"LINK label"},{"name":"LIST","description":"Writes to the SAS log the input data record for the observation that is being processed.","help":"LIST"},{"name":"LOSS","description":"The LOSS statement specifies the name of the response or loss variable whose distribution needs to be modeled. You can also specify additional options to indicate any truncation or censoring of the response. The specification of response variable is optional if at least one type of censoring is specified. You must specify a response variable if no censoring is specified. If you specify more than one LOSS statement, then the first statement is used.","help":"LOSS &lt;LEFTCENSORED=*variable-name* | *number*&gt; &lt;LEFTTRUNCATED=*variable-name* | *number*&lt;(*left-truncation-option*)&gt;&gt; &lt;RIGHTCENSORED=*variable-name* | *number*&gt; ...","arguments":[{"name":"LEFTCENSORED=","optional":true,"followsDelimiter":"/","aliases":["LC="],"description":"Specifies the left-censoring variable or a global left-censoring limit.","type":"value"},{"name":"LEFTTRUNCATED=","optional":true,"followsDelimiter":"/","aliases":["LT="],"description":"Specifies the left-truncation variable or a global left-truncation threshold.","help":"LEFTTRUNCATED=PROBOBSERVED= | POBS=","type":"choice","arguments":[{"name":"PROBOBSERVED=","type":"value"},{"name":"POBS=","type":"value"}]},{"name":"RIGHTCENSORED=","optional":true,"followsDelimiter":"/","aliases":["RC="],"description":"Specifies the right-censoring variable or a global right-censoring limit.","type":"value"},{"name":"RIGHTTRUNCATED=","optional":true,"followsDelimiter":"/","aliases":["RT="],"description":"Specifies the right-truncation variable or a global right-truncation threshold.","type":"value"}]},{"name":"MERGE","description":"Joins observations from two or more SAS data sets into a single observation.","help":"MERGE &lt;ALTER=&gt; &lt;BUFNO=&lt;n | nK | hexX&gt;... &gt; &lt;END=variable&gt; ...","arguments":[{"name":"ALTER=","optional":true,"description":"","type":"value"},{"name":"BUFNO=","optional":true,"description":"","help":"BUFNO=n | nK | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"BUFSIZE=","optional":true,"description":"","help":"BUFSIZE=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"CNTLLEV=","optional":true,"description":"","help":"CNTLLEV=LIB | MEM | REC","type":"choice","arguments":[{"name":"LIB","description":"","type":"standalone"},{"name":"MEM","description":"","type":"standalone"},{"name":"REC","description":"","type":"standalone"}]},{"name":"COMPRESS=","optional":true,"description":"","help":"COMPRESS=NO | YES | CHAR | BINARY","type":"choice","arguments":[{"name":"NO","description":"","type":"standalone"},{"name":"YES","description":"","type":"standalone"},{"name":"CHAR","description":"","type":"standalone"},{"name":"BINARY","description":"","type":"standalone"}]},{"name":"DLDMGACTION=","optional":true,"description":"","help":"DLDMGACTION=FAIL | ABORT | REPAIR | NOINDEX | PROMPT","type":"choice","arguments":[{"name":"FAIL","description":"","type":"standalone"},{"name":"ABORT","description":"","type":"standalone"},{"name":"REPAIR","description":"","type":"standalone"},{"name":"NOINDEX","description":"","type":"standalone"},{"name":"PROMPT","description":"","type":"standalone"}]},{"name":"DROP=","optional":true,"description":"","type":"value"},{"name":"ENCRYPT=","optional":true,"description":"","help":"ENCRYPT=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"ENCRYPTKEY=","optional":true,"description":"","type":"value"},{"name":"END=","optional":true,"description":"Names and creates a temporary variable that contains an end-of-file indicator.","help":"END=*variable*","type":"value"},{"name":"EXTENDOBSCOUNTER=","optional":true,"description":"","type":"value"},{"name":"FILECLOSE=","optional":true,"description":"","help":"FILECLOSE=DISP | LEAVE | REREAD | REWIND","type":"choice","arguments":[{"name":"DISP","description":"","type":"standalone"},{"name":"LEAVE","description":"","type":"standalone"},{"name":"REREAD","description":"","type":"standalone"},{"name":"REWIND","description":"","type":"standalone"}]},{"name":"FIRSTOBS=","optional":true,"description":"","help":"FIRSTOBS=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"GENMAX=","optional":true,"description":"","type":"value"},{"name":"GENNUM=","optional":true,"description":"","type":"value"},{"name":"IDXNAME=","optional":true,"description":"","type":"value"},{"name":"IDXWHERE=","optional":true,"description":"","help":"IDXWHERE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"IN=","optional":true,"description":"","type":"value"},{"name":"INDEX=","optional":true,"description":"","type":"value"},{"name":"KEEP=","optional":true,"description":"","type":"value"},{"name":"LABEL=","optional":true,"description":"","type":"value"},{"name":"OBS=","optional":true,"description":"","help":"OBS=n | nK | nM | nG | nT | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"nT","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"OUTREP=","optional":true,"description":"","type":"value"},{"name":"POINTOBS=","optional":true,"description":"","help":"POINTOBS=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"PW=","optional":true,"description":"","type":"value"},{"name":"PWREQ=","optional":true,"description":"","help":"PWREQ=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"READ=","optional":true,"description":"","type":"value"},{"name":"RENAME=","optional":true,"description":"","type":"value"},{"name":"REPEMPTY=","optional":true,"description":"","help":"REPEMPTY=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REPLACE=","optional":true,"description":"","help":"REPLACE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REUSE=","optional":true,"description":"","help":"REUSE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SGIO=","optional":true,"description":"","help":"SGIO=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SORTEDBY=","optional":true,"description":"","help":"SORTEDBY=by-clause &lt; / collate-name&gt; | _NULL_","type":"choice","arguments":[{"name":"by-clause","description":"","help":"by-clause &lt; / collate-name&gt;","type":"standalone"},{"name":"_NULL_","description":"","type":"standalone"}]},{"name":"SPILL=","optional":true,"description":"","help":"SPILL=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"TOBSNO=","optional":true,"description":"","type":"value"},{"name":"TRANTAB=","optional":true,"description":"","type":"value"},{"name":"TYPE=","optional":true,"description":"","type":"value"},{"name":"WHERE=","optional":true,"description":"","type":"value"},{"name":"WHEREUP=","optional":true,"description":"","help":"WHEREUP=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"WRITE=","optional":true,"description":"","type":"value"}]},{"name":"MODIFY","description":"Replaces, deletes, and appends observations in an existing SAS data set in place but does not create an additional copy.","help":"MODIFY &lt;END=variable&gt; &lt;KEY=index&gt; &lt;NOBS=variable&gt; ...","arguments":[{"name":"CUREOBS=","optional":true,"description":"Creates and names a variable that contains the observation number that was just read from the data set.","type":"value"},{"name":"END=","optional":true,"description":"Creates and names a temporary variable that contains an end-of-file indicator.","help":"END=*variable*","type":"value"},{"name":"KEY=","optional":true,"description":"Specifies a simple or composite index of the SAS data file that is being modified. The KEY= argument retrieves observations from that SAS data file based on index values that are supplied by like-named variables in another source of information.","help":"KEY=*index*","type":"value"},{"name":"KEYRESET=","optional":true,"description":"Controls whether a KEY= search should begin at the top of the index for the data set that is being read. When the value of the KEYRESET variable is 1, the index lookup begins at the top of the index. When the value of the KEYRESET variable is 0, the index lookup is not reset and the lookup continues where the prior lookup ended.","help":"KEYRESET=*variable*","type":"value"},{"name":"NOBS=","optional":true,"description":"Creates and names a temporary variable whose value is usually the total number of observations in the input data set. For certain SAS views, SAS cannot determine the number of observations. In these cases, SAS sets the value of the NOBS= variable to the largest positive integer value available in the operating environment.","help":"NOBS=*variable*","type":"value"},{"name":"POINT=","optional":true,"description":"Reads SAS data sets using random (direct) access by observation number. variable names a variable whose value is the number of the observation to read. The POINT= variable is available anywhere in the DATA step, but it is not added to any SAS data set.","help":"POINT=*variable*","type":"value"},{"name":"UNIQUE","optional":true,"description":"Causes a KEY= search always to begin at the top of the index for the data file being modified.","type":"standalone"},{"name":"UPDATEMODE=","optional":true,"description":"Specifies whether missing variable values in a transaction data set are to be allowed to replace existing variable values in a master data set.","help":"UPDATEMODE=MISSINGCHECK | NOMISSINGCHECK","type":"choice","arguments":[{"name":"MISSINGCHECK","description":"Prevents missing variable values in a transaction data set from replacing values in a master data set.","type":"standalone"},{"name":"NOMISSINGCHECK","description":"Allows missing variable values in a transaction data set to replace values in a master data set by preventing the check from being performed.","type":"standalone"}]}]},{"name":"NLOPTIONS","description":"The SEVSELECT procedure uses the nonlinear optimization (NLO) subsystem to perform nonlinear optimization of the likelihood function to obtain the estimates of distribution and regression parameters. You can use the NLOPTIONS statement to control different aspects of this optimization process. If you specify more than one NLOPTIONS statement, then the first statement is used.","help":"NLOPTIONS &lt;ABSCONV=r&gt; &lt;ABSFCONV=r[n]&gt; &lt;ABSGCONV=r[n]&gt; ...","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion. The default value of r is the negative square root of the largest double-precision value, which serves only as a protection against overflows.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function convergence criterion. The default value is r=0. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. The default value is r=1E-5. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"ABSXCONV=","optional":true,"aliases":["ABSXTOL="],"description":"Specifies an absolute parameter convergence criterion. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can terminate.","type":"value"},{"name":"FCONV2=","optional":true,"aliases":["FTOL2="],"description":"Specifies another function convergence criterion.","type":"value"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies a relative function convergence criterion.","type":"value"},{"name":"FSIZE=","optional":true,"description":"Specifies the FSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"FSIZE=*r*","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies a relative gradient convergence criterion.","type":"value"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Specifies the maximum number i of function calls in the optimization process. The default values are: TRUREG, NRRIDG, NEWRAP: 125 QUANEW, DBLDOG: 500 CONGRA: 1000 NMSIMP: 3000","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Specifies the maximum number i of iterations in the optimization process. The default values are: TRUREG, NRRIDG, NEWRAP: 50 QUANEW, DBLDOG: 200 CONGRA: 400 NMSIMP: 1000 These default values are also valid when i is specified as a missing value.","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Specifies an upper limit of r seconds of CPU time for the optimization process. The default value is the largest floating-point double representation of your computer. Note that the time specified by the MAXTIME= option is checked only once at the end of each iteration. Therefore, the actual running time can be much longer than that specified by the MAXTIME= option. The actual running time includes the rest of the time needed to finish the iteration and the time needed to generate the output of the results.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0. If you request more iterations than are actually needed for convergence to a stationary point, the optimization algorithms can behave strangely. For example, the effect of rounding errors can prevent the algorithm from continuing for the required number of iterations.","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH="],"description":"Specifies the optimization technique.","help":"TECHNIQUE=CONGRA | DBLDOG | NMSIMP | NEWRAP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Performs a conjugate-gradient optimization.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization.","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NEWRAP","description":"Performs a Newton-Raphson optimization that combines a line-search algorithm with ridging.","type":"standalone"},{"name":"NRRIDG","description":"Performs a Newton-Raphson optimization with ridging.","type":"standalone"},{"name":"QUANEW","description":"Performs a quasi-Newton optimization","type":"standalone"},{"name":"TRUREG","description":"Performs a trust region optimization. This is the default estimation method.","type":"standalone"},{"name":"NONE","description":"Does not perform any optimization. This option can be used as follows: – to perform a grid search without optimization – to compute estimates and predictions that cannot be obtained efficiently with any of the optimization techniques","type":"standalone"}]},{"name":"XCONV=","optional":true,"aliases":["XTOL="],"description":"Specifies the relative parameter convergence criterion. For all techniques except NMSIMP, termination requires a small relative parameter change in subsequent iterations. The default value is r=1E-8 for the NMSIMP technique and r=0 otherwise. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"XSIZE=","optional":true,"description":"Specifies the XSIZE parameter of the relative parameter termination criterion. The default value is r=0.","type":"value"}]},{"name":"OTHERWISE","description":"Specifies a statement to be executed if no WHEN condition is met.","help":"OTHERWISE &lt;DO&gt; ","arguments":[{"name":"DO","optional":true,"description":"Action statement.","type":"standalone"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates the output data table that contains the estimates of scoring functions and quantiles.","help":"OUTPUT &lt;COPYVARS=variable-list&gt; &lt;FUNCTIONS=(function&lt;(arg)&gt;&lt;=variable&gt; &lt;function&lt;(arg)&gt;&lt;=variable&gt;&gt; …)&gt; &lt;OUT=CAS-libref.data-table&gt; ...","arguments":[{"name":"COPYVARS=","optional":true,"description":"Specifies the names of the variables that you want to copy from the input DATA= data table to the OUT= data table. If you want to specify more than one name, then separate them by spaces.","help":"COPYVARS=*variable-list*","type":"value"},{"name":"FUNCTIONS=","optional":true,"description":"Specifies the scoring functions that you want to estimate.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC SEVSELECT to use. You must specify this option before any other options. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"},{"name":"QUANTILES=","optional":true,"description":"Specifies the quantiles that you want to estimate. To use this option, for each distribution that you specify in the DIST statement, the FCMP function D_QUANTILE must be defined in the search path that you specify by using the CMPLIB= system option.","help":"QUANTILES=CDF= | POINTS= | NAMES= | NDECIMAL=*quantile-options*","type":"value","arguments":[{"name":"CDF=","type":"value"},{"name":"POINTS=","type":"value"},{"name":"NAMES=","type":"value"},{"name":"NDECIMAL=","type":"value"}]}]},{"name":"OUTSCORELIB","description":"The OUTSCORELIB statement specifies the library to write scoring functions to. Scoring functions enable you to easily compute a distribution function on the fitted parameters of the distribution without going through a potentially complex process of extracting the fitted parameter estimates from other output such as the OUTEST= data set that is created by PROC SEVSELECT.","help":"OUTSCORELIB &lt;COMMONPACKAGE&gt; &lt;OUTBYID=SAS-data-set&gt; OUTLIB=fcmp-library-name ...","arguments":[{"name":"OUTLIB=","description":"Names the FCMP library to contain the scoring functions. PROC SEVSELECT writes the scoring functions to the FCMP library named fcmp-library-name. If a library or data set named fcmp-libraryname already exists, PROC SEVSELECT deletes it before proceeding","help":"OUTLIB=*fcmp-library-name*","type":"dataSet"},{"name":"COMMONPACKAGE","optional":true,"aliases":["ONEPACKAGE"],"description":"Requests that only one common package be created to contain all the scoring functions.","type":"standalone"},{"name":"OUTBYID=","optional":true,"description":"Names the output data set to contain the unique identifier for each BY group. This unique identifier is used as part of the name of the package or scoring function for each distribution. This is a required option when you specify a BY statement in PROC SEVSELECT.","help":"OUTBYID=*SAS-data-set*","type":"dataSet"}]},{"name":"PUT","description":"Writes lines to the SAS log, to the SAS output window, or to an external location that is specified in the most recent FILE statement.","help":"PUT &lt;_ALL_&gt; &lt;_INFILE_&gt; &lt;_ODS_&gt; ...","arguments":[{"name":"OVERPRINT","optional":true,"description":"Causes the values that follow the keyword OVERPRINT to print on the most recently written output line.","type":"standalone"},{"name":"_ALL_","optional":true,"description":"Writes the values of all variables, which includes automatic variables, that are defined in the current DATA step by using named output.","type":"standalone"},{"name":"_BLANKPAGE_","optional":true,"description":"Advances the pointer to the first line of a new page, even when the pointer is positioned on the first line and the first column of a new page.","type":"standalone"},{"name":"_INFILE_","optional":true,"description":"Writes the last input data record that is read either from the current input file or from the data lines that follow a DATELINES statement.","type":"standalone"},{"name":"_ODS_","optional":true,"description":"Moves data values for all columns (as defined by the ODS option in the FILE statement) into a special buffer, from which it is eventually written to the data component. The ODS option in the FILE statement defines the structure of the data component that holds the results of the DATA step.","type":"standalone"},{"name":"_PAGE_","optional":true,"description":"Advances the pointer to the first line of a new page. SAS automatically begins a new page when a line exceeds the current PAGESIZE= value.","type":"standalone"}]},{"name":"PUTLOG","description":"Writes a message to the SAS log.","help":"PUTLOG 'message'"},{"name":"RENAME","description":"Specifies new names for variables in output SAS data sets.","help":"RENAME old-name-1=new-name-1 ... &lt;old-name-n=new-name-n&gt;"},{"name":"REPLACE","description":"Replaces an observation in the same location.","help":"REPLACE &lt;data-set-name-1&gt;&lt;...data-set-name-n&gt;"},{"name":"RETAIN","description":"Causes a variable that is created by an INPUT or assignment statement to retain its value from one iteration of the DATA step to the next.","help":"RETAIN &lt;element-list(s) &lt;initial-value(s) |"},{"name":"RETURN","description":"Stops executing statements at the current point in the DATA step and returns to a predetermined point in the step.","help":"RETURN"},{"name":"RSUBMIT","description":"Marks the beginning of a block of statements that a client session submits to a server session for execution.","help":"RSUBMIT &lt;options&gt;; ENDRSUBMIT &lt;CANCEL&gt;"},{"name":"SCALEMODEL","description":"The SCALEMODEL statement specifies regression effects. A regression effect is formed from one or more regressor variables according to effect construction rules.","help":"SCALEMODEL &lt;DFMIXTURE=&lt;FULL | MEAN | QUANTILE&gt;... &gt; &lt;INCLUDE=n | INCLUDE=single-effect | INCLUDE=(effects)&gt; &lt;INFORMATIVE&gt; ...","arguments":[{"name":"DFMIXTURE=","optional":true,"followsDelimiter":"/","description":"Specifies the method for computing representative estimates of the cumulative distribution function (CDF).","help":"DFMIXTURE=FULL | MEAN | QUANTILE | RANDOM","type":"choice","arguments":[{"name":"FULL","followsDelimiter":"/","description":"Specifies that the representative distribution be the mixture of N distributions such that each distribution has a scale value that is implied by each of the N observations that are used for estimation. This method is the slowest.","type":"standalone"},{"name":"MEAN","followsDelimiter":"/","description":"Specifies that the representative distribution be the one-point mixture of the distribution whose scale value is the mean of the N scale values that are implied by the N observations that are used for estimation. If you do not specify the DFMIXTURE= option, then this method is used by default. This is also the fastest method.","type":"standalone"},{"name":"QUANTILE","followsDelimiter":"/","description":"Syntax: QUANTILE < (K=q) > specifies that the representative distribution be the mixture of a fixed number of distributions whose scale values are the quantiles from the sample of N scale values that are implied by the N observations in the current BY group (or in the entire DATA= data set if the BY statement is not specified). You can use the K= option to specify the number of distributions in the mixture. If you specify K=q, then the mixture contains (q - 1) distributions such that each distribution has as its scale one of the (q - 1)-quantiles.","type":"standalone"},{"name":"RANDOM","followsDelimiter":"/","description":"Syntax: RANDOM < (random-method-options) > specifies that the representative distribution be the mixture of a fixed number of distributions whose scale values are the scale values that are implied by a randomly chosen subset of the set of all observations in the current BY group (or in the entire DATA= data set if the BY statement is not specified). The same subset of observations is used for each distribution family. You can specify the following random-method-options to specify how the subset is chosen: K=r specifies the number of distributions to include in the mixture. If you do not specify this option, then PROC SEVSELECT uses the default of 15. SEED=number specifies the seed that is used to generate the uniform random sample of observation indices. If you do not specify this option, then PROC SEVSELECT generates a seed internally that is based on the current value of the system clock.","type":"standalone"}]},{"name":"INCLUDE=","optional":true,"followsDelimiter":"/","description":"Forces effects to be included in all models. If you specify INCLUDE=n, then the first n effects that are listed in the SCALEMODEL statement are included in all models. If you specify INCLUDE=single-effect or INCLUDE=(single-effect), then the specified effects are forced into all models. The INCLUDE= option has no effect if you do not specify the SELECTION statement.","type":"value"},{"name":"INFORMATIVE","optional":true,"followsDelimiter":"/","description":"Models missing values by using extra model effects. These effects consist of dummy variables that take the value 1 when the value of a continuous model variable involved in the effect is missing, and take the value 0 otherwise. The missing value in the original model effect is replaced by the average value of the effect for the nonmissing values.","type":"standalone"},{"name":"OFFSET=","optional":true,"followsDelimiter":"/","description":"Specifies the name of the offset variable in the scale regression model. An offset variable is a regressor variable whose regression coefficient is known to be 1.","help":"OFFSET=*offset-variable-name*","type":"value"},{"name":"START=","optional":true,"followsDelimiter":"/","description":"Specifies how to begin the selection process in the FORWARD, FORWARDSWAP, and STEPWISE selection methods from the initial model that you designate. If you specify START=n, then the starting model consists of the first n effects that are listed in the SCALEMODEL statement. If you specify START=single-effect or START=(single-effect), then the starting model consists of these specified effects.","type":"value"}]},{"name":"SELECT","description":"Executes one of several statements or groups of statements.","help":""},{"name":"SELECTION","description":"The SELECTION statement performs model selection by examining whether effects should be added to or removed from the model according to rules that are defined by model selection methods.","help":"SELECTION &lt;ADAPTIVE &lt;(GAMMA=nonnegative number)&gt;&gt; &lt;CHOOSE=&lt;AIC | AICC | SBC&gt;&gt; &lt;METHOD=&lt;BACKWARD | FORWARD | FORWARDSWAP&gt;... &gt; ...","arguments":[{"name":"ADAPTIVE=","optional":true,"description":"Applies adaptive weights to each of the coefficients when METHOD=LASSO. Ordinary least squares estimates of the model parameters are used to form the adaptive weights. You use the GAMMA= option to specify the power transformation that is applied to the parameters in forming the adaptive weights. By default, GAMMA=1.","help":"ADAPTIVE=GAMMA=","type":"choice","arguments":[{"name":"GAMMA=","type":"value"}]},{"name":"CHOOSE=","optional":true,"description":"Chooses from the list of models (at each step of the selection process) the model that yields the best value of the specified criterion.","help":"CHOOSE=AIC | AICC | SBC*criterion*","type":"value","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"AICC","description":"Specifies the corrected Akaike’s information criterion.","type":"standalone"},{"name":"SBC","description":"Specifies the Schwarz Bayesian information criterion.","type":"standalone"}]},{"name":"COMPETITIVE","optional":true,"description":"[method-option to be enclosed in parenthesis] Is applicable as a method-option only when METHOD=STEPWISE. If you specify the COMPETITIVE option, then the SELECT= criterion is evaluated for all models in which an effect currently in the model is dropped or an effect not yet in the model is added.","type":"standalone"},{"name":"DETAILS=","optional":true,"description":"Specifies the level of detail to be produced about the selection process. The default is DETAILS= SUMMARY.","help":"DETAILS=SUMMARY | STEPS | ALL | NONE","type":"choice","arguments":[{"name":"SUMMARY","description":"Produces a summary table that shows the effect that is added or removed at each step along with the criteria specified in the SELECT=, CHOOSE=, and STOP= method-options. The summary table is produced by default if you do not specify the DETAILS= option.","type":"standalone"},{"name":"STEPS","description":"Syntax: DETAILS=STEPS<(CANDIDATES(ALL | n))> Produces the preceding summary table and displays the results from fitting each model at each step. If you specify STEPS(CANDIDATES(n)), then the best n candidates are shown. If you specify STEPS(CANDIDATES(ALL)), then all candidates are shown.","type":"standalone"},{"name":"ALL","description":"Produces the preceding tables and a detailed listing of all candidates at each step along with their ranking in terms of the selection criterion for addition to or removal from the model.","type":"standalone"},{"name":"NONE","description":"Specifies that no details be produced about the selection process.","type":"standalone"}]},{"name":"FAST","optional":true,"description":"[method-option to be enclosed in parenthesis] Implements the computational algorithm of Lawless and Singhal (1978) to compute a first-order approximation to the remaining slope estimates for each subsequent elimination of a variable from the model. When applied in backward selection, this option essentially leads to approximating the selection process as the selection process of a linear regression model in which the crossproducts matrix equals the Hessian matrix in the full model under consideration. This option is available only when METHOD=BACKWARD is specified. It is computationally efficient because the model is not fit after removal of each effect.","type":"standalone"},{"name":"HIERARCHY=","optional":true,"description":"Specifies whether and how the model hierarchy requirement is applied. You can specify that only classification effects, or both classification and continuous effects, be subject to the hierarchy requirement. This option is ignored unless you also specify one of the following options: METHOD=FORWARD, METHOD=BACKWARD, or METHOD=STEPWISE.","help":"HIERARCHY=NONE | SINGLE | SINGLECLASS","type":"choice","arguments":[{"name":"NONE","description":"Specifies that model hierarchy not be maintained. Any single effect can enter or leave the model at any step of the selection process.","type":"standalone"},{"name":"SINGLE","description":"Specifies that only one effect enter or leave the model at one time, subject to the model hierarchy requirement.","type":"standalone"},{"name":"SINGLECLASS","description":"Is the same as HIERARCHY=SINGLE except that only CLASS effects are subject to the hierarchy requirement.","type":"standalone"}]},{"name":"LSCOEFFS","optional":true,"description":"[method-option to be enclosed in parenthesis] Requests a hybrid version of the LAR and LASSO methods, in which the sequence of models is determined by the LAR or LASSO algorithm but the coefficients of the parameters for the model at any step are determined by using ordinary least squares.","type":"standalone"},{"name":"MAXEFFECTS=","optional":true,"description":"Specifies the maximum number of effects in any model that is considered during the selection process. This option is ignored when METHOD=BACKWARD is specified.","help":"MAXEFFECTS=*n*","type":"value"},{"name":"MAXSTEPS=","optional":true,"description":"Specifies the maximum number of selection steps that are performed. The default value of n is the number of effects in the SCALEMODEL or MODEL statement when METHOD=FORWARD or METHOD=BACKWARD.","help":"MAXSTEPS=*n*","type":"value"},{"name":"METHOD=","optional":true,"aliases":["SELECTION="],"description":"Specifies the selection method to use.","help":"METHOD=BACKWARD | FORWARD | FORWARDSWAP | STEPWISE","type":"choice","arguments":[{"name":"BACKWARD","description":"Specifies the backward elimination method.","type":"standalone"},{"name":"FORWARD","description":"Specifies the forward selection method.","type":"standalone"},{"name":"FORWARDSWAP","description":"Specifies forward-swap selection, which is an extension of the forward selection method.","type":"standalone"},{"name":"STEPWISE","description":"specifies the stepwise regression method.","type":"standalone"}]},{"name":"MINEFFECTS=","optional":true,"description":"Specifies the minimum number of effects in any model that is considered during backward selection. This option is ignored unless METHOD=BACKWARD is specified.","help":"MINEFFECTS=*n*","type":"value"},{"name":"ORDERSELECT","optional":true,"description":"Specifies that effects in the selected model are displayed in the order in which they first entered the model. If you do not specify the ORDERSELECT option, then effects in the selected model are displayed in the order in which they appear in the MODEL statement.","type":"standalone"},{"name":"PLOT=","optional":true,"aliases":["PLOTS="],"description":"Controls the selection process plots that are produced through ODS Graphics. Each global-plot-option applies to all plots that the SELECTION statement generates, unless you alter the option by using a specific plot option that follows a plot-request. You can specify the following global-plot-options:","help":"PLOT=ALL | COEFFICIENTS | CRITERIA | FITBYROLE  | NONE","type":"choice","arguments":[{"name":"ALL","description":"produces all relevant plots.","type":"standalone"},{"name":"COEFFICIENTS","description":"Syntax: COEFFICIENTS | COEFFICIENTPANEL <(UNPACK | UNPACKPANEL)> Creates a panel of two plots. The upper plot shows the progression of the parameter values as the selection process proceeds. The lower plot shows the progression of the CHOOSE= criterion.","type":"standalone"},{"name":"CRITERIA","description":"Syntax: CRITERIA | CRITERIONPANEL <(UNPACK | UNPACKPANEL)> Creates a panel of model fit criteria. If you specify the UNPACK option, then each criterion progression is shown in a separate plot.","type":"standalone"},{"name":"FITBYROLE","description":"Plots the progression of a fit statistic on the training, test, and validation data. The fit statistic that is displayed depends on the type of model that is being fit. The fit by role plot is not produced if you do not specify a PARTITION statement.","help":"FITBYROLE ","type":"standalone"},{"name":"NONE","description":"Suppress all selection process plots, even if you specify other plot options.","type":"standalone"}]},{"name":"SELECT=","optional":true,"aliases":["CRITERION="],"description":"Specifies the criterion that the procedure uses to determine the order in which effects enter or leave at each step of the selection method. For each step, the effect whose addition to or removal from the current model yields the maximum improvement in the specified criterion is selected. You can use the traditional significance-level approach by specifying the SL criterion; for other supported criteria, see the chapter for the relevant procedure. This option is not valid when METHOD=LAR or METHOD=LASSO.","help":"SELECT=AIC | AICC | SBC","type":"choice","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"AICC","description":"Specifies the corrected Akaike’s information criterion.","type":"standalone"},{"name":"SBC","description":"Specifies the Schwarz Bayesian information criterion.","type":"standalone"}]},{"name":"SLENTRY=","optional":true,"aliases":["SLE="],"description":"Specifies the significance level for entry when STOP=SL or SELECT=SL. By default, SLENTRY=0.05.","type":"value"},{"name":"SLSTAY=","optional":true,"aliases":["SLS="],"description":"Specifies the significance level for staying in the model when STOP=SL or SELECT=SL.","type":"value"},{"name":"STOP=","optional":true,"description":"Specifies a criterion that is used to stop the selection process.","help":"STOP=SL | NONE | &lt;*criterion*&gt;","type":"choice","arguments":[{"name":"SL","description":"Stops the selection process at the step where the significance level of the candidate for entry is greater than the SLENTRY= value for addition steps when METHOD=FORWARD or METHOD=STEPWISE and where the significance level of the candidate for removal is greater than the SLSTAY= value when METHOD=BACKWARD or METHOD=STEPWISE.","type":"standalone"},{"name":"NONE","description":"Stops the selection process if no suitable add or drop candidates can be found or if a size-based limit is reached.","type":"standalone"},{"name":"criterion","placeholder":true,"description":"Stops the selection process if the selection process produces a local extremum of this criterion or if a size-based limit is reached.","type":"value"}]},{"name":"STOPHORIZON=","optional":true,"description":"Specifies the number of consecutive steps at which the STOP= criterion must worsen in order for a local extremum to be detected. The stop horizon value is ignored if you also specify STOP=NONE or STOP=SL. For example, suppose that STOP=AIC and the sequence of AIC values at steps 1 to 6 of a selection are 10, 7, 4, 6, 5, 2. If STOPHORIZON=2, then the AIC criterion is deemed to have a local minimum at step 3 because the AIC value at the next two steps are greater than the value 4 that occurs at step 3. However, if STOPHORIZON=3, then the value at step 3 is not deemed to be a local minimum because the AIC value at step 6 is lower than the AIC value at step 3. When METHOD=LAR or METHOD=LASSO, n is ignored and STOPHORIZON=1 is used. By default, STOPHORIZON=3.","help":"STOPHORIZON=*n*","type":"value"}]},{"name":"SET","description":"Reads an observation from one or more SAS data sets.","help":"SET &lt;END=variable&gt; &lt;INDSNAME=variable&gt; &lt;KEY=index&lt;/UNIQUE&gt;&gt; ...","arguments":[{"name":"ALTER=","optional":true,"description":"","type":"value"},{"name":"BUFNO=","optional":true,"description":"","help":"BUFNO=n | nK | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"BUFSIZE=","optional":true,"description":"","help":"BUFSIZE=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"CNTLLEV=","optional":true,"description":"","help":"CNTLLEV=LIB | MEM | REC","type":"choice","arguments":[{"name":"LIB","description":"","type":"standalone"},{"name":"MEM","description":"","type":"standalone"},{"name":"REC","description":"","type":"standalone"}]},{"name":"COMPRESS=","optional":true,"description":"","help":"COMPRESS=NO | YES | CHAR | BINARY","type":"choice","arguments":[{"name":"NO","description":"","type":"standalone"},{"name":"YES","description":"","type":"standalone"},{"name":"CHAR","description":"","type":"standalone"},{"name":"BINARY","description":"","type":"standalone"}]},{"name":"CUREOBS=","optional":true,"description":"Creates and names a variable that contains the observation number that was just read from the data set.","type":"value"},{"name":"DLDMGACTION=","optional":true,"description":"","help":"DLDMGACTION=FAIL | ABORT | REPAIR | NOINDEX | PROMPT","type":"choice","arguments":[{"name":"FAIL","description":"","type":"standalone"},{"name":"ABORT","description":"","type":"standalone"},{"name":"REPAIR","description":"","type":"standalone"},{"name":"NOINDEX","description":"","type":"standalone"},{"name":"PROMPT","description":"","type":"standalone"}]},{"name":"DROP=","optional":true,"description":"","type":"value"},{"name":"ENCRYPT=","optional":true,"description":"","help":"ENCRYPT=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"ENCRYPTKEY=","optional":true,"description":"","type":"value"},{"name":"END=","optional":true,"description":"Creates and names a temporary variable that contains an end-of-file indicator. The variable, which is initialized to zero, is set to 1 when SET reads the last observation of the last data set listed. This variable is not added to any new data set.","help":"END=*variable*","type":"value"},{"name":"EXTENDOBSCOUNTER=","optional":true,"description":"","type":"value"},{"name":"FILECLOSE=","optional":true,"description":"","help":"FILECLOSE=DISP | LEAVE | REREAD | REWIND","type":"choice","arguments":[{"name":"DISP","description":"","type":"standalone"},{"name":"LEAVE","description":"","type":"standalone"},{"name":"REREAD","description":"","type":"standalone"},{"name":"REWIND","description":"","type":"standalone"}]},{"name":"FIRSTOBS=","optional":true,"description":"","help":"FIRSTOBS=n | nK | nM | nG | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"GENMAX=","optional":true,"description":"Requests generations for a data set and specifies the maximum number of versions.","type":"value"},{"name":"GENNUM=","optional":true,"description":"","type":"value"},{"name":"IDXNAME=","optional":true,"description":"","type":"value"},{"name":"IDXWHERE=","optional":true,"description":"","help":"IDXWHERE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"IN=","optional":true,"description":"","type":"value"},{"name":"INDEX=","optional":true,"description":"","type":"value"},{"name":"INDSNAME=","optional":true,"description":"Creates and names a variable that stores the name of the SAS data set from which the current observation is read. The stored name can be a data set name or a physical name. The physical name is the name by which the operating environment recognizes the file.","help":"INDSNAME=*variable*","type":"value"},{"name":"KEEP=","optional":true,"description":"","type":"value"},{"name":"KEY=","optional":true,"description":"Provides nonsequential access to observations in a SAS data set, which are based on the value of an index variable or a key.","type":"value"},{"name":"KEYRESET=","optional":true,"description":"Controls whether a KEY= search should begin at the top of the index for the data set that is being read. When the value of the KEYRESET variable is 1, the index lookup begins at the top of the index. When the value of the KEYRESET variable is 0, the index lookup is not reset and the lookup continues where the prior lookup ended.","help":"KEYRESET=*variable*","type":"value"},{"name":"LABEL=","optional":true,"description":"","type":"value"},{"name":"NOBS=","optional":true,"description":"Creates and names a temporary variable whose value is usually the total number of observations in the input data set or data sets. If more than one data set is listed in the SET statement, NOBS= the total number of observations in the data sets that are listed. The number of observations includes those observations that are marked for deletion but are not yet deleted.","help":"NOBS=*variable*","type":"value"},{"name":"NOMISS","optional":true,"description":"","type":"standalone"},{"name":"OBS=","optional":true,"description":"","help":"OBS=n | nK | nM | nG | nT | hexX | MIN | MAX","type":"choice","arguments":[{"name":"n","description":"","type":"standalone"},{"name":"nK","description":"","type":"standalone"},{"name":"nM","description":"","type":"standalone"},{"name":"nG","description":"","type":"standalone"},{"name":"nT","description":"","type":"standalone"},{"name":"hexX","description":"","type":"standalone"},{"name":"MIN","description":"","type":"standalone"},{"name":"MAX","description":"","type":"standalone"}]},{"name":"OPEN=","optional":true,"description":"Allows you to delay the opening of any concatenated SAS data sets until they are ready to be processed.","help":"OPEN=IMMEDIATE | DEFER","type":"choice","arguments":[{"name":"IMMEDIATE","description":"During the compilation phase, opens all data sets that are listed in the SET statement.","type":"standalone"},{"name":"DEFER","description":"Opens the first data set during the compilation phase, and opens subsequent data sets during the execution phase. When the DATA step reads and processes all observations in a data set, it closes the data set and opens the next data set in the list.","type":"standalone"}]},{"name":"OUTREP=","optional":true,"description":"","type":"value"},{"name":"POINT=","optional":true,"description":"Specifies a temporary variable whose numeric value determines which observation is read. POINT= causes the SET statement to use random (direct) access to read a SAS data set.","help":"POINT=*variable*","type":"value"},{"name":"POINTOBS=","optional":true,"description":"","help":"POINTOBS=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"PW=","optional":true,"description":"","type":"value"},{"name":"PWREQ=","optional":true,"description":"","help":"PWREQ=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"READ=","optional":true,"description":"Assigns a read password to a SAS file and enables access to a read-protected SAS file.","type":"value"},{"name":"RENAME=","optional":true,"description":"","type":"value"},{"name":"REPEMPTY=","optional":true,"description":"","help":"REPEMPTY=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REPLACE=","optional":true,"description":"","help":"REPLACE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"REUSE=","optional":true,"description":"","help":"REUSE=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SGIO=","optional":true,"description":"","help":"SGIO=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"SORTEDBY=","optional":true,"description":"","help":"SORTEDBY=by-clause &lt; / collate-name&gt; | _NULL_","type":"choice","arguments":[{"name":"by-clause","description":"","help":"by-clause &lt; / collate-name&gt;","type":"standalone"},{"name":"_NULL_","description":"","type":"standalone"}]},{"name":"SPILL=","optional":true,"description":"","help":"SPILL=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"TOBSNO=","optional":true,"description":"","type":"value"},{"name":"TRANTAB=","optional":true,"description":"","type":"value"},{"name":"TYPE=","optional":true,"description":"","type":"value"},{"name":"UNIQUE","optional":true,"description":"","type":"standalone"},{"name":"WHERE=","optional":true,"description":"","type":"value"},{"name":"WHEREUP=","optional":true,"description":"","help":"WHEREUP=YES | NO","type":"choice","arguments":[{"name":"YES","description":"","type":"standalone"},{"name":"NO","description":"","type":"standalone"}]},{"name":"WRITE=","optional":true,"description":"","type":"value"}]},{"name":"STOP","description":"Stops execution of the current DATA step.","help":"STOP"},{"name":"WEIGHT","description":"The WEIGHT statement specifies the name of a variable whose values represent the weight of each observation. PROC SEVSELECT associates a weight of w to each observation, where w is the value of the WEIGHT variable for the observation. If the weight value is missing or less than or equal to 0, then the observation is ignored and a warning is written to the SAS log. When the WEIGHT statement is not specified, each observation is assigned a weight of 1. If you specify more than one WEIGHT statement, then the last statement is used. The weights are normalized so that they add up to the actual sample size.","help":"WEIGHT variable-name "},{"name":"WHEN","description":"Identifies SAS statements that are executed when a particular condition is true.","help":"WHEN &lt;DO&gt; ","arguments":[{"name":"DO","optional":true,"description":"Action statement.","type":"standalone"}]},{"name":"WHERE","description":"Selects observations from SAS data sets that meet a particular condition.","help":"WHERE where-expression-1"}],"supportSiteInformation":{"docsetId":"casecon","docsetVersion":"v_037","docsetTargetFile":"casecon_sevselect_toc.htm"}}