{"name":"SHAPLEY","statements":[{"name":"PROC SHAPLEY","description":"The SHAPLEY procedure estimates Shapley values of a query on the basis of the information that is provided in a reference table. Shapley values are a measure of variable importance for a single observation. You can use them to explain why a machine learning model yields a specific prediction for a query observation. They serve as an additive measure of importance whose sum equals the predicted output from the model that you are explaining. PROC SHAPLEY uses two methods to approximate the same Shapley values. The first method is kernel Shapley additive explanations (Kernel SHAP), which fits linear regression models to the scored output from machine learning models. The second method is hyperparameterized Shapley value estimation (HyperSHAP), which calculates the Shapley values for predictive models.","help":"PROC SHAPLEY  DATA=libref.data-table REFERENCEDATA=libref.data-table <options>;                 \n\tASTOREMODEL  RSTORE=libref.data-table;                 \n\tCODE  FILE=filename | TABLE=libref.data-table;                 \n\tFREQ  variable;                 \n\tINPUT  variables </ {LEVEL={INTERVAL | NOMINAL}} >;                 \n\tMETHOD method-type<(options)>;                 \n\tPREDICTEDTARGET  variable;                 \n\tWEIGHT  variable;                 ","arguments":[{"name":"DATA=","description":"names the input data table for PROC SHAPLEY to use","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"REFERENCEDATA=","description":"specifies the input reference data table","help":"REFERENCEDATA=*libref.data-table*","type":"dataSet"},{"name":"IMPUTE=","optional":true,"description":"specifies the method to use for imputing the missing observations","help":"IMPUTE=MEAN | NONE | WEIGHTEDMEAN","type":"choice"},{"name":"LOGLEVEL=","optional":true,"description":"controls the quantity and type of notes to print to the client log","help":"LOGLEVEL=0 | 1 | 2","type":"choice"}]},{"name":"ASTOREMODEL","description":"names an analytic store that contains the model to explain","help":"ASTOREMODEL  RSTORE=*libref.data-table*;                                              ","arguments":[{"name":"RSTORE=","description":"specifies the analytic store that contains the model to explain","help":"RSTORE=*libref.data-table*","type":"dataSet"}]},{"name":"CODE","description":"names the DATA step code that describes the model or the DS2 code that is used along with an analytic store that you specify in the ASTOREMODEL statement","help":"CODE  FILE=*filename* | TABLE=*libref.data-table*;                                              ","arguments":[{"name":"FILE=","optional":true,"description":"names the external file that contains the DATA step code that describes the model or the DS2 code to be used along with an analytic store that you specify in the ASTOREMODEL statement","help":"FILE=*filename*","type":"value"},{"name":"TABLE=","optional":true,"description":"names the data table that contains the DATA step code that describes the model or the DS2 code to be used along with an analytic store that you specify in the ASTOREMODEL statement","help":"TABLE=*libref.data-table*","type":"dataSet"}]},{"name":"FREQ","description":"identifies a numeric variable in the input data table that contains the frequency of occurrence of each observation","help":"FREQ  variable;                                              "},{"name":"INPUT","description":"specifies one or more variables as input variables","help":"INPUT  variables &lt;/ {LEVEL={INTERVAL | NOMINAL}} &gt;;                                              ","arguments":[{"name":"LEVEL=","optional":true,"followsDelimiter":"/","description":"specifies the type of all the variables in the statement","help":"LEVEL=INTERVAL | NOMINAL","type":"choice"}]},{"name":"METHOD","description":"specifies the method to use in the model explanations","help":"METHOD *method-type*&lt;(*options*)&gt;;                                              ","arguments":[{"name":"DEPTH=","optional":true,"description":"specifies the number of subsets to use in approximating the Shapley values","help":"DEPTH={*number*}","type":"value"},{"name":"BINWIDTH=","optional":true,"description":"specifies the bin width (relative to the standard deviation) to use in creating the binary encoding for interval variables","help":"BINWIDTH={*number*}","type":"value"},{"name":"INCLUDEMISSING","optional":true,"description":"treats missing values of nominal variables as a valid level","type":"standalone"},{"name":"SAMPLESIZE=","optional":true,"description":"specifies the approximate number of observations to generate","help":"SAMPLESIZE=*number*","type":"value"},{"name":"SEED=","optional":true,"description":"specifies the seed value for pseudorandom number generation","help":"SEED=*number*","type":"value"},{"name":"USERAWDATA","optional":true,"description":"uses the raw reference data to calculate Shapley values and skip generating data","type":"standalone"}]},{"name":"PREDICTEDTARGET","description":"names the variable that contains the model's predictions","help":"PREDICTEDTARGET  variable;                                              "},{"name":"WEIGHT","description":"variable is used to weight each observation to perform a weighted analysis of the data","help":"WEIGHT  variable;                                              "}]}