{"name":"SIM2D","statements":[{"name":"PROC SIM2D","description":"The SIM2D procedure uses an LU decomposition technique to produce a spatial simulation for a Gaussian random field with a specified mean and covariance structure in two dimensions. † The simulation can be conditional or unconditional. If it is conditional, a set of coordinates and associated field values are read from a SAS data set. The resulting simulation honors these data values. † You can specify the mean structure as a quadratic function in the coordinates. Specify the semivariance by naming the form and supplying the associated parameters, or by using the contents of an item store file that was previously created by PROC VARIOGRAM. † PROC SIM2D can handle anisotropic and nested semivariogram models. Seven covariance models are supported: Gaussian, exponential, spherical, cubic, pentaspherical, sine hole effect, and Matérn. A single nugget effect is also supported.","help":"PROC SIM2D <DATA=SAS-data-set> <NARROW> <NOPRINT> <OUTSIM=SAS-data-set> <PLOTS=ALL | EQUATE | NONE... >;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCOORDINATES <XCOORD=(variable-name)> <YCOORD=(variable-name)> ; \n   \n\tGRID <GRIDDATA=SAS-data-set> <XCOORD=(variable-name)> <YCOORD=(variable-name)> ...; \n   \n\tID variable ;     \n\tMEAN <CONST=var1> <CX=var2> <QDATA= SAS-data-set> ...;     \n\tRESTORE IN=store-name <INFO <( info-options )>> ; \n   \n\tSIMULATE <ANGLE=angle | ANGLE=(angle-1,...,angle-k)> <NUMREAL=number> <VAR=(variable-name)> ...; ","arguments":[{"name":"DATA=","optional":true,"description":"Specifies a SAS data set containing the x and y coordinate variables and the VAR= variables in the SIMULATE statement.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NARROW","optional":true,"description":"Restricts the variables included in the OUTSIM= data set.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results.","type":"standalone"},{"name":"OUTSIM=","optional":true,"description":"Specifies a SAS data set in which to store the simulation values, iteration number, simulate statement label, variable name, and grid location.","help":"OUTSIM=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Syntax: PLOTS <(global-plot-option)> <= plot-request <(options)>> PLOTS <(global-plot-option)> <= (plot-request <(options)> <... plot-request <(options)>>)> Controls the plots produced through ODS Graphics. The following global-plot-option is available:","help":"PLOTS=ALL | EQUATE | NONE | OBSERVATIONS | MEANS","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"EQUATE","description":"Specifies that all appropriate plots be produced in a way that the axes coordinates have equal size units.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"OBSERVATIONS","aliases":["OBSERV","OBS"],"description":"[Syntax: OBSERVATIONS<(observations-plot-options)>] Produces the observed data plot, with the following suboptions: GRADIENT specifies that observations be displayed as circles colored by the observed measurement. OUTLINE specifies that observations be displayed as circles with a border but with a completely transparent fill. OUTLINEGRADIENT is the same as OBSERVATIONS(GRADIENT) except that a border is shown around each observation. SHOWMISSING specifies that observations with missing values be displayed in addition to the observations with nonmissing values.","type":"standalone"},{"name":"MEANS","description":"[Syntax: MEANS<(means-plot-options)>] Specifies that a plot of the means and standard deviations of the simulation realizations at each grid point be produced, with the following prediction-plot-options: FILL=NONE | PRED | SE produces a surface plot for either the predicted values or the standard deviations. LINE=NONE | PRED | SE produces a contour line plot for either the predicted values or the standard deviations. OBS=obs-options produces an overlaid scatter plot of the observations in addition to the specified contour plots. The following obs-options are available: GRAD specifies that observations be displayed as circles colored by the observed measurement. LINEGRAD is the same as OBS=GRAD except that a border is shown around each observation. NONE specifies that no observations be displayed. OUTL specifies that observations be displayed as circles with a border but with a completely transparent fill.","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC SIM2D to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"COORDINATES","description":"Only one COORDINATES statement is allowed, and it is applied to all SIMULATE statements that have the VAR= specification. In other words, it is assumed that all the VAR= variables in all SIMULATE statements have the same x and y coordinates.","help":"COORDINATES &lt;XCOORD=(variable-name)&gt; &lt;YCOORD=(variable-name)&gt; ","arguments":[{"name":"XCOORD=","optional":true,"aliases":["XC="],"description":"Gives the name of the variable containing the x coordinate of the data in the DATA= data set.","type":"value"},{"name":"YCOORD=","optional":true,"aliases":["YC="],"description":"Gives the name of the variable containing the y coordinate of the data locations in the DATA= data set.","type":"value"}]},{"name":"GRID","description":"A single GRID statement is required and is applied to all SIMULATE statements.","help":"GRID &lt;GRIDDATA=SAS-data-set&gt; &lt;XCOORD=(variable-name)&gt; &lt;YCOORD=(variable-name)&gt; ...","arguments":[{"name":"GRIDDATA=","optional":true,"description":"Specifies a SAS data set containing the x and y grid coordinates.","help":"GRIDDATA=*SAS-data-set*","type":"dataSet"},{"name":"XCOORD=","optional":true,"aliases":["XC="],"description":"Gives the name of the variable containing the x coordinate of the grid locations in the GRIDDATA= data set.","type":"value"},{"name":"YCOORD=","optional":true,"aliases":["YC="],"description":"Gives the name of the variable containing the y coordinate of the grid locations in the GRIDDATA= data set.","type":"value"}]},{"name":"ID","description":"The ID statement specifies which variable to include for identification of the observations in the labels and tool tips of the OBSERVATIONS plot and the tool tips of the SIM plot. The ID statement has an effect only when you perform conditional simulation. In the SIM2D procedure you can specify only one ID variable in the ID statement. If no ID statement is given, then PROC SIM2D uses the observation number in the plots.","help":"ID variable "},{"name":"MEAN","description":"The MEAN statement is used to specify the quadratic surface to use as the mean function for the simulated SRF. There are three ways to specify the MEAN statement (shown in the above syntax).","help":"MEAN &lt;CONST=var1&gt; &lt;CX=var2&gt; &lt;QDATA= SAS-data-set&gt; ...","arguments":[{"name":"CONST=","optional":true,"description":"Specifies the variable in the QDATA= data set that correspond to the constant.","help":"CONST=*var1*","type":"value"},{"name":"CX=","optional":true,"description":"Specifies the variable in the QDATA= data set that correspond to the linear x.","help":"CX=*var2*","type":"value"},{"name":"CXY=","optional":true,"description":"Specifies the variable in the QDATA= data set that correspond to the linear xy.","help":"CXY=*var5*","type":"value"},{"name":"CY=","optional":true,"description":"Specifies the variable in the QDATA= data set that correspond to the linear y.","help":"CY=*var3*","type":"value"},{"name":"CYY=","optional":true,"description":"Specifies the variable in the QDATA= data set that correspond to the linear yy.","help":"CYY=*var4*","type":"value"},{"name":"QDATA=","optional":true,"description":"Specifies the data set containing the coefficients.","type":"value"}]},{"name":"RESTORE","description":"The RESTORE statement specifies an item store that provides spatial correlation model input for the PROC SIM2D simulation tasks. An item store is a binary file defined by the SAS System. You cannot modify the contents of an item store. The SIM2D procedure can use only item stores created by PROC VARIOGRAM.","help":"RESTORE IN=store-name &lt;INFO &lt;( info-options )&gt;&gt; ","arguments":[{"name":"IN=","description":"The store-name is a usual one- or two-level SAS name, as for SAS data sets. If you specify a one-level name, then the item store resides in the WORK library and is deleted at the end of the SAS session. Since item stores are often used for postprocessing tasks, typical usage specifies a two-level name of the form","help":"IN=*store-name*","type":"value"},{"name":"INFO=","optional":true,"followsDelimiter":"/","description":"Specifies that additional information about the input item store be printed. This information is provided in two ODS tables. One table displays the variables in the item store, in addition to the mean and standard deviation for each of them. These statistics are based on the observations that were used to produce the store results. The second table shows the model on top of the list of all fitted models for each direction angle in the item store. The INFO option has the following info-options: DETAILS DET specifies that more detailed information be displayed about the input item store. This option produces the full list of models for each direction angle in the item store, in addition to the model equivalence class.","help":"INFO=DETAILS | DET | ONLY","type":"choice","arguments":[{"name":"DETAILS","type":"standalone"},{"name":"DET","type":"standalone"},{"name":"ONLY","type":"standalone"}]}]},{"name":"SIMULATE","description":"The SIMULATE statement specifies details on the simulation and the covariance model used in the simulation.","help":"SIMULATE &lt;ANGLE=angle | ANGLE=(angle-1,...,angle-k)&gt; &lt;NUMREAL=number&gt; &lt;VAR=(variable-name)&gt; ...","arguments":[{"name":"ANGLE=","optional":true,"description":"Specifies the angle of the major axis for anisotropic models, measured in degrees clockwise from the N-S axis.","type":"value"},{"name":"FORM=","optional":true,"description":"Specifies the functional form (type) of the semivariogram model.","help":"FORM=SPHERICAL | EXPONENTIAL | GAUSSIAN","type":"choice","arguments":[{"name":"SPHERICAL","description":"Spherical form","type":"standalone"},{"name":"EXPONENTIAL","description":"Exponential form","type":"standalone"},{"name":"GAUSSIAN","description":"Gaussian form","type":"standalone"}]},{"name":"MDATA=","optional":true,"description":"Specifies the input data set that contains parameter values for the covariance or semivariogram model.","help":"MDATA=*SAS-data-set*","type":"dataSet"},{"name":"NUGGET=","optional":true,"description":"Specifies the nugget effect for the model.","help":"NUGGET=*number*","type":"value"},{"name":"NUMREAL=","optional":true,"aliases":["NUMR=","NR="],"description":"Specifies the number of realizations to produce for the spatial process specified by the covariance model.","help":"NUMREAL=*number*","type":"value"},{"name":"RANGE=","optional":true,"description":"Specifies the range parameter in semivariogram models.","type":"value"},{"name":"RATIO=","optional":true,"description":"Specifies the ratio of the length of the minor axis to the length of the major axis for anisotropic models.","type":"value"},{"name":"SCALE=","optional":true,"description":"Specifies the scale (or sill) parameter in semivariogram models.","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies the seed to use for the random number generator. The SEED= value has to be an integer.","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Gives the singularity criteria for solving the set of linear equations involved in the computation of the mean and covariance of the conditional distribution associated with a given SIMULATE statement.","help":"SINGULAR=*number*","type":"value"},{"name":"VAR=","optional":true,"description":"Specifies the single numeric variable used as the conditioning variable in the simulation.","type":"value"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_028","docsetTargetFile":"statug_sim2d_toc.htm"}}