{"name":"SIMILARITY","statements":[{"name":"PROC SIMILARITY","description":"The SIMILARITY procedure computes similarity measures associated with time-stamped data, time series, and/or other sequentially ordered numeric data. The procedure computes similarity measures for time- stamped transactional data (transactions) with respect to time by accumulating the data into a time series format (time series). The procedure computes similarity measures for sequentially ordered numeric data (sequences) by respecting the ordering of the data. † Given two ordered numeric sequences (input and target), a similarity measure is a metric that measures the distance between the input and target sequences while taking into account the ordering of the data. The SIMILARITY procedure computes similarity measures between an input sequence and a target sequence, as well as similarity measures that \"slide\" the target sequence with respect to the input sequence. The \"slides\" can be by observation index (sliding-sequence similarity measures) or by seasonal index (seasonal- sliding-sequence similarity measures).","help":"PROC SIMILARITY <DATA=SAS-data-set> <ORDER=> <OUT=SAS-data-set> <OUTMEASURE=SAS-data-set> <OUTPATH=SAS-data-set> <OUTSEQUENCE=SAS-data-set> <OUTSUM=INPUT | INPUTTARGET | TARGET... > <PLOTS=ALL | COSTS | DISTANCES... > <PRINT=DESCSTATS | PATHS | COSTS... > <PRINTDETAILS> <SEASONALITY=integer> <SORTNAMES>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tFCMPOPT <QUIET=<ON | OFF>> <TRACE=<ON | OFF>> ;\n    \n\tID ACCUMULATE=NONE|TOTAL|AVERAGE|AVG...  ALIGN=BEGINNING|MIDDLE|ENDING  END=date | datetime ...;\n    \n\tINPUT <ACCUMULATE=<NONE | TOTAL | AVERAGE>... > <DIF=(numlist)> <NORMALIZE=<NONE | ABSOLUTE | STANDARD>... > ...;\n    \n\tTARGET <ACCUMULATE=<NONE | TOTAL | AVERAGE>... > <COMPRESS=<GLOBALABS= | GLOBALPCT= | LOCALABS>... > <DIF=(numlist)> ...;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the SAS data set that contains the time series, transactional, or sequence input data for the procedure. If the DATA= option is not specified, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"ORDER=","optional":true,"description":"Specifies the order that the variables listed in the INPUT and TARGET statements are processed. This ordering affects the OUTSEQUENCE=, OUTPATH=, OUTMEASURE=, and OUTSUM= data sets, as well as the printed and graphical output.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data set to contain the time series variables specified in the subsequent INPUT and TARGET statements. If an ID variable is specified, it is also included in the OUT= data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTMEASURE=","optional":true,"description":"Names the output data set to contain the detailed similarity measures by time ID value. The form of the OUTMEASURE= data set is determined by the PROC SIMILARITY statement SORTNAMES and ORDER= options.","help":"OUTMEASURE=*SAS-data-set*","type":"dataSet"},{"name":"OUTPATH=","optional":true,"description":"Names the output data set to contain the path used to compute the similarity measures for each slide and warp. The form of the OUTPATH= data set is determined by the PROC SIMILARITY statement SORTNAMES and ORDER= options.","help":"OUTPATH=*SAS-data-set*","type":"dataSet"},{"name":"OUTSEQUENCE=","optional":true,"description":"Names the output data set to contain the sequences used to compute the similarity measures for each slide and warp. The form of the OUTSEQUENCE= data set is determined by the PROC SIMILARITY statement SORTNAMES and ORDER= options.","help":"OUTSEQUENCE=*SAS-data-set*","type":"dataSet"},{"name":"OUTSUM=","optional":true,"description":"Names the output data set to contain the similarity measure summary. The OUTSUM= data set is particularly useful when analyzing large numbers of series and only the summary of the results are needed. The form of the OUTSUM= data set is determined by the PROC SIMILARITY statement SORTNAMES and ORDER= options.","help":"OUTSUM=INPUT | INPUTTARGET | TARGET | TARGETINPUT","type":"choice","arguments":[{"name":"INPUT","description":"Specifies that each INPUT variable is processed and then the TARGET variables are processed. The results are stored and printed based only on the INPUT variables.","type":"standalone"},{"name":"INPUTTARGET","description":"Specifies that each INPUT variable is processed and then the TARGET variables are processed. The results are stored and printed based on both the INPUT and TARGET variables. This is the default.","type":"standalone"},{"name":"TARGET","description":"Specifies that each TARGET variable is processed and then the INPUT variables are processed. The results are stored and printed based only on the TARGET variables.","type":"standalone"},{"name":"TARGETINPUT","description":"Specifies that each TARGET variable is processed and then the INPUT variables are processed. The results are stored and printed based on both the TARGET and INPUT variables.","type":"standalone"}]},{"name":"PLOTS=","optional":true,"description":"Specifies the graphical output desired. The options are separated by spaces. By default, the SIMILARITY procedure produces no graphical output.","help":"PLOTS=ALL | COSTS | DISTANCES | INPUTS | MAPS | MEASURES | NORMALIZED | PATHS | SCALED | SEQUENCES | TARGETS | WARPS","type":"choice","arguments":[{"name":"ALL","description":"Same as PLOTS=(INPUTS TARGETS SEQUENCES NORMALIZED SCALED DISTANCES PATHS MAPS WARPS COST MEASURES).","type":"standalone"},{"name":"COSTS","description":"Plots time warp costs graphics.","type":"standalone"},{"name":"DISTANCES","description":"Plots similarity absolute and relative distances graphics. (OUTPATH= data set)","type":"standalone"},{"name":"INPUTS","description":"Plots input variable time series graphics. (OUT= data set)","type":"standalone"},{"name":"MAPS","description":"Plots time warp maps graphics. (OUTPATH= data set)","type":"standalone"},{"name":"MEASURES","description":"Plots similarity measure graphics. (OUTMEASURE= data set)","type":"standalone"},{"name":"NORMALIZED","description":"Plots both the input and target variable normalized sequence graphics. These plots are displayed only when the INPUT or TARGET statement NORMALIZE= option is specified.","type":"standalone"},{"name":"PATHS","description":"Plots time warp paths graphics. (OUTPATH= data set)","type":"standalone"},{"name":"SCALED","description":"Plots both the input variable scaled sequence graphics. These plots are displayed only when the INPUT statement SCALE= option is specified.","type":"standalone"},{"name":"SEQUENCES","description":"Plots both the input and target variable sequence graphics. (OUTSEQUENCE= data set)","type":"standalone"},{"name":"TARGETS","description":"Plots target variable time series graphics. (OUT= data set)","type":"standalone"},{"name":"WARPS","description":"Plots time warps graphics. (OUTPATH= data set)","type":"standalone"}]},{"name":"PRINT=","optional":true,"description":"Specifies the printed output desired. The options are separated by spaces. By default, the SIMILARITY procedure produces no printed output.","help":"PRINT=DESCSTATS | PATHS | COSTS | WARPS | SLIDES | SUMMARY | ALL","type":"choice","arguments":[{"name":"DESCSTATS","description":"Prints the descriptive statistics for the working time series.","type":"standalone"},{"name":"PATHS","description":"Prints the path statistics table.","type":"standalone"},{"name":"COSTS","description":"Prints the cost statistics table.","type":"standalone"},{"name":"WARPS","description":"Prints the warp summary table.","type":"standalone"},{"name":"SLIDES","description":"Prints the slides summary table.","type":"standalone"},{"name":"SUMMARY","description":"Prints the similarity measure summary table.","type":"standalone"},{"name":"ALL","description":"Same as PRINT=(DESCSTATS PATHS COSTS WARPS SLIDES SUMMARY)","type":"standalone"}]},{"name":"PRINTDETAILS","optional":true,"description":"Specifies that output requested with the PRINT= option be printed in greater detail.","type":"standalone"},{"name":"SEASONALITY=","optional":true,"description":"Specifies the length of the seasonal cycle where integer ranges from one to 10,000. For example, SEASONALITY=3 means that every group of three time periods forms a seasonal cycle. By default, the length of the seasonal cycle is one (no seasonality) or the length implied by the INTERVAL= option specified in the ID statement. For example, INTERVAL=MONTH implies that the length of the seasonal cycle is twelve.","help":"SEASONALITY=*integer*","type":"value"},{"name":"SORTNAMES","optional":true,"description":"Specifies that the variables specified in the INPUT and TARGET statements are processed in order sorted by the variable names. By default, the SIMILARITY procedure processes the variables in the order they are listed. The ORDER= option also affects the ordering of the analysis.","type":"standalone"}]},{"name":"BY","description":"A BY statement can be used with PROC SIMILARITY to obtain separate dummy variable definitions for groups of observations defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FCMPOPT","description":"The FCMPOPT statement specifies the options related to user-defined functions and subroutines.","help":"FCMPOPT &lt;QUIET=&lt;ON | OFF&gt;&gt; &lt;TRACE=&lt;ON | OFF&gt;&gt; ","arguments":[{"name":"QUIET=","optional":true,"description":"Specifies whether the nonfatal errors and warnings generated by the user-defined SAS language functions and subroutines are printed to the log. Nonfatal errors are usually associated with operations with missing values.","help":"QUIET=ON | OFF","type":"choice","arguments":[{"name":"ON","description":"Nonfatal errors and warnings generated by the user-defined SAS language functions and subroutines are printed to the log. This is the default.","type":"standalone"},{"name":"OFF","description":"Nonfatal errors and warnings generated by the user-defined SAS language functions and subroutines are not printed to the log.","type":"standalone"}]},{"name":"TRACE=","optional":true,"description":"Specifies whether the user-defined SAS language functions and subroutines tracings are printed to the log. Tracings are the results of every operation executed. This option is generally used for debugging. The default is TRACE=OFF.","help":"TRACE=ON | OFF","type":"choice","arguments":[{"name":"ON","description":"User-defined SAS language functions and subroutines tracings are printed to the log.","type":"standalone"},{"name":"OFF","description":"User-defined SAS language functions and subroutines tracings are not printed to the log. This is the default.","type":"standalone"}]}]},{"name":"ID","description":"The ID statement names a numeric variable that identifies observations in the input and output data sets. The ID variable’s values are assumed to be SAS date, time, or datetime values. In addition, the ID statement specifies the (desired) frequency associated with the time series. The ID statement options also specify how the observations are accumulated and how the time ID values are aligned to form the time series. The options specified affect all variables listed in subsequent INPUT and TARGET statements. If an ID statement is specified, the INTERVAL= option must also be specified. The other ID statement options are optional. If an ID statement is not specified, the observation number, with respect to the BY group, is used as the time ID.","help":"ID ACCUMULATE=NONE|TOTAL|AVERAGE|AVG...  ALIGN=BEGINNING|MIDDLE|ENDING  END=date | datetime ...","arguments":[{"name":"ACCUMULATE=","description":"Specifies how the data set observations are accumulated within each time period. The frequency (width of each time interval) is specified by the INTERVAL= option.","help":"ACCUMULATE=NONE | TOTAL | AVERAGE|AVG | MINIMUM|MIN | MEDIAN|MED | MAXIMUM|MAX | N | NMISS | NOBS | FIRST | LAST | STDDEV|STD | CSS | USS","type":"choice","arguments":[{"name":"NONE","description":"No accumulation occurs; the ID variable values must be equally spaced with respect to the frequency. This is the default option.","type":"standalone"},{"name":"TOTAL","description":"Observations are accumulated based on the total sum of their values.","type":"standalone"},{"name":"AVERAGE","description":"Observations are accumulated based on the average of their values.","help":"AVERAGE|AVG","type":"choice"},{"name":"MINIMUM","description":"Observations are accumulated based on the minimum of their values.","help":"MINIMUM|MIN","type":"choice"},{"name":"MEDIAN","description":"Observations are accumulated based on the median of their values.","help":"MEDIAN|MED","type":"choice"},{"name":"MAXIMUM","description":"Observations are accumulated based on the maximum of their values.","help":"MAXIMUM|MAX","type":"choice"},{"name":"N","description":"Observations are accumulated based on the number of nonmissing observations.","type":"standalone"},{"name":"NMISS","description":"Observations are accumulated based on the number of missing observations.","type":"standalone"},{"name":"NOBS","description":"Observations are accumulated based on the number of observations.","type":"standalone"},{"name":"FIRST","description":"Observations are accumulated based on the first of their values.","type":"standalone"},{"name":"LAST","description":"Observations are accumulated based on the last of their values.","type":"standalone"},{"name":"STDDEV","description":"Observations are accumulated based on the standard deviation of their values.","help":"STDDEV|STD","type":"choice"},{"name":"CSS","description":"Observations are accumulated based on the corrected sum of squares of their values.","type":"standalone"},{"name":"USS","description":"Observations are accumulated based on the uncorrected sum of squares of their values.","type":"standalone"}]},{"name":"ALIGN=","description":"Controls the alignment of SAS dates used to identify output observations.","help":"ALIGN=BEGINNING | MIDDLE | ENDING","type":"choice","arguments":[{"name":"BEGINNING","description":"SAS dates aligned in the BEGINNING.","type":"standalone"},{"name":"MIDDLE","description":"SAS dates aligned in the MIDDLE.","type":"standalone"},{"name":"ENDING","description":"SAS dates aligned in the ENDING.","type":"standalone"}]},{"name":"END=","description":"Specifies a SAS date or datetime literal value that represents the end of the data.","type":"value"},{"name":"FORMAT=","description":"Specifies the SAS format for the time ID values. If the FORMAT= option is not specified, the default format is implied from the INTERVAL= option.","help":"FORMAT=*format*","type":"value"},{"name":"INTERVAL=","description":"Specifies the frequency of the input time series or for the time series to be accumulated from the input data.","help":"INTERVAL=DAY | HOUR | MINUTE | SECOND | WEEK | MONTH | YEAR | QTR | TENDAY | SEMIMONTH | SEMIYEAR","type":"choice","arguments":[{"name":"DAY","description":"DAY interval","type":"standalone"},{"name":"HOUR","description":"HOUR interval","type":"standalone"},{"name":"MINUTE","description":"MINUTE interval","type":"standalone"},{"name":"SECOND","description":"SECOND interval","type":"standalone"},{"name":"WEEK","description":"WEEK interval","type":"standalone"},{"name":"MONTH","description":"MONTH interval","type":"standalone"},{"name":"YEAR","description":"YEAR interval","type":"standalone"},{"name":"QTR","description":"QTR interval","type":"standalone"},{"name":"TENDAY","description":"TENDAY interval","type":"standalone"},{"name":"SEMIMONTH","description":"SEMIMONTH interval","type":"standalone"},{"name":"SEMIYEAR","description":"SEMIYEAR interval","type":"standalone"}]},{"name":"NOTSORTED","description":"Specifies that the time ID values are not in sorted order. The ESM procedure sorts the data with respect to the time ID prior to analysis.","type":"standalone"},{"name":"SETMISSING=","description":"Specifies how missing values (either input or accumulated) are assigned in the accumulated time series. If a number n is specified (SETMISSING=n), missing values are set to that number.","help":"SETMISSING=MISSING | AVERAGE | MINIMUM | MEDIAN | MAXIMUM | FIRST | LAST | PREVIOUS | NEXT","type":"choice","arguments":[{"name":"MISSING","description":"Missing values are set to missing. This is the default option.","type":"standalone"},{"name":"AVERAGE","description":"Missing values are set to the accumulated average value.","type":"standalone"},{"name":"MINIMUM","description":"Missing values are set to the accumulated minimum value.","type":"standalone"},{"name":"MEDIAN","description":"Missing values are set to the accumulated median value.","type":"standalone"},{"name":"MAXIMUM","description":"Missing values are set to the accumulated maximum value.","type":"standalone"},{"name":"FIRST","description":"Missing values are set to the accumulated first nonmissing value.","type":"standalone"},{"name":"LAST","description":"Missing values are set to the accumulated last nonmissing value.","type":"standalone"},{"name":"PREVIOUS","description":"Missing values are set to the previous accumulated nonmissing value. Missing values at the beginning of the accumulated series remain missing.","type":"standalone"},{"name":"NEXT","description":"Missing values are set to the next accumulated nonmissing value. Missing values at the end of the accumulated series remain missing.","type":"standalone"}]},{"name":"START=","description":"Specifies a SAS date or datetime literal value that represents the beginning of the data. If the first time ID variable value is greater than the START= value, the series is prepended with missing values. If the first time ID variable value is less than the START= value, the series is truncated. The START= and END= options can be used to ensure that data associated with each BY group contains the same number of observations.","type":"value"},{"name":"ZEROMISS=","description":"Specifies how beginning and/or ending zero values (either input or accumulated) are interpreted in the accumulated time series.","help":"ZEROMISS=NONE | LEFT | RIGHT | BOTH","type":"choice","arguments":[{"name":"NONE","description":"Beginning and/or ending zeros are unchanged. This is the default.","type":"standalone"},{"name":"LEFT","description":"Beginning zeros are set to missing.","type":"standalone"},{"name":"RIGHT","description":"Ending zeros are set to missing.","type":"standalone"},{"name":"BOTH","description":"Both beginning and ending zeros are set to missing.","type":"standalone"}]}]},{"name":"INPUT","description":"The INPUT statement lists the input numeric variables in the DATA= data set whose values are to be accumulated to form the time series or represent ordered numeric sequences (when no ID statement is specified).","help":"INPUT &lt;ACCUMULATE=&lt;NONE | TOTAL | AVERAGE&gt;... &gt; &lt;DIF=(numlist)&gt; &lt;NORMALIZE=&lt;NONE | ABSOLUTE | STANDARD&gt;... &gt; ...","arguments":[{"name":"ACCUMULATE=","optional":true,"followsDelimiter":"/","description":"Specifies how the data set observations are accumulated within each time period for the variables listed in the INPUT statement.","help":"ACCUMULATE=NONE | TOTAL | AVERAGE | MINIMUM | MEDIAN | MAXIMUM | N | NMISS | NOBS | FIRST | LAST | STDDEV | CSS | USS","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No accumulation occurs; the ID variable values must be equally spaced with respect to the frequency. This is the default option.","type":"standalone"},{"name":"TOTAL","followsDelimiter":"/","description":"Observations are accumulated based on the total sum of their values.","type":"standalone"},{"name":"AVERAGE","followsDelimiter":"/","description":"Observations are accumulated based on the average of their values.","type":"standalone"},{"name":"MINIMUM","followsDelimiter":"/","description":"Observations are accumulated based on the minimum of their values.","type":"standalone"},{"name":"MEDIAN","followsDelimiter":"/","description":"Observations are accumulated based on the median of their values.","type":"standalone"},{"name":"MAXIMUM","followsDelimiter":"/","description":"Observations are accumulated based on the maximum of their values.","type":"standalone"},{"name":"N","followsDelimiter":"/","description":"Observations are accumulated based on the number of nonmissing observations.","type":"standalone"},{"name":"NMISS","followsDelimiter":"/","description":"Observations are accumulated based on the number of missing observations.","type":"standalone"},{"name":"NOBS","followsDelimiter":"/","description":"Observations are accumulated based on the number of observations.","type":"standalone"},{"name":"FIRST","followsDelimiter":"/","description":"Observations are accumulated based on the first of their values.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Observations are accumulated based on the last of their values.","type":"standalone"},{"name":"STDDEV","followsDelimiter":"/","description":"Observations are accumulated based on the standard deviation of their values.","type":"standalone"},{"name":"CSS","followsDelimiter":"/","description":"Observations are accumulated based on the corrected sum of squares of their values.","type":"standalone"},{"name":"USS","followsDelimiter":"/","description":"Observations are accumulated based on the uncorrected sum of squares of their values.","type":"standalone"}]},{"name":"DIF=","optional":true,"followsDelimiter":"/","description":"Specifies the differencing to be applied to the accumulated time series. The list of differencing orders must be separated by spaces or commas. For example, DIF=(1,3) specifies first, then third order, differencing. Differencing is applied after time series transformation. The TRANSFORM= option is applied before the DIF= option. Simple differencing is useful when you want to detrend the time series before computing the similarity measures.","type":"value"},{"name":"NORMALIZE=","optional":true,"followsDelimiter":"/","description":"Specifies the sequence normalization to be applied to the working input sequence.","help":"NORMALIZE=NONE | ABSOLUTE | STANDARD | [USER-DEFINED]","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No normalization is applied. This option is the default.","type":"standalone"},{"name":"ABSOLUTE","followsDelimiter":"/","description":"Absolute normalization is applied.","type":"standalone"},{"name":"STANDARD","followsDelimiter":"/","description":"Standard normalization is applied.","type":"standalone"},{"name":"[USER-DEFINED]","followsDelimiter":"/","description":"Normalization is computed by a user-defined subroutine created using the FCMP procedure, where [USER-DEFINED] is the subroutine name.","type":"standalone"}]},{"name":"SCALE=","optional":true,"followsDelimiter":"/","description":"Specifies the scaling of the working input sequence with respect to the working target sequence. Scaling is performed after normalization.","help":"SCALE=NONE | ABSOLUTE | STANDARD | [USER-DEFINED]","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No scaling is applied. This option is the default.","type":"standalone"},{"name":"ABSOLUTE","followsDelimiter":"/","description":"Absolute scaling is applied.","type":"standalone"},{"name":"STANDARD","followsDelimiter":"/","description":"Standard scaling is applied.","type":"standalone"},{"name":"[USER-DEFINED]","followsDelimiter":"/","description":"Scaling is computed by a user-defined subroutine created using the FCMP procedure, where [USER-DEFINED] is the subroutine name.","type":"standalone"}]},{"name":"SDIF=","optional":true,"followsDelimiter":"/","description":"Specifies the seasonal differencing to be applied to the accumulated time series. The list of seasonal differencing orders must be separated by spaces or commas. For example, SDIF=(1,3) specifies first, then third, order seasonal differencing. Differencing is applied after time series transformation. The TRANSFORM= option is applied before the SDIF= option. Seasonal differencing is useful when you want to deseasonalize the time series before computing the similarity measures.","type":"value"},{"name":"SETMISSING=","optional":true,"followsDelimiter":"/","description":"Specifies how missing values (either actual or accumulated) are interpreted in the accumulated time series or ordered sequence for variables listed in the INPUT statement.","help":"SETMISSING=MISSING | AVERAGE | MINIMUM | MEDIAN | MAXIMUM | FIRST | LAST | PREVIOUS | NEXT","type":"choice","arguments":[{"name":"MISSING","followsDelimiter":"/","description":"Missing values are set to missing. This is the default option.","type":"standalone"},{"name":"AVERAGE","followsDelimiter":"/","description":"Missing values are set to the accumulated average value.","type":"standalone"},{"name":"MINIMUM","followsDelimiter":"/","description":"Missing values are set to the accumulated minimum value.","type":"standalone"},{"name":"MEDIAN","followsDelimiter":"/","description":"Missing values are set to the accumulated median value.","type":"standalone"},{"name":"MAXIMUM","followsDelimiter":"/","description":"Missing values are set to the accumulated maximum value.","type":"standalone"},{"name":"FIRST","followsDelimiter":"/","description":"Missing values are set to the accumulated first nonmissing value.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Missing values are set to the accumulated last nonmissing value.","type":"standalone"},{"name":"PREVIOUS","followsDelimiter":"/","description":"Missing values are set to the previous accumulated nonmissing value. Missing values at the beginning of the accumulated series remain missing.","type":"standalone"},{"name":"NEXT","followsDelimiter":"/","description":"Missing values are set to the next accumulated nonmissing value. Missing values at the end of the accumulated series remain missing.","type":"standalone"}]},{"name":"TRANSFORM=","optional":true,"followsDelimiter":"/","description":"Specifies the time series transformation to be applied to the accumulated time series.","help":"TRANSFORM=NONE | LOG | SQRT | LOGISTIC | BOXCOX(number) | [USER-DEFINED]","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No transformation is applied. This option is the default.","type":"standalone"},{"name":"LOG","followsDelimiter":"/","description":"Logarithmic transformation is applied.","type":"standalone"},{"name":"SQRT","followsDelimiter":"/","description":"Square-root transformation is applied.","type":"standalone"},{"name":"LOGISTIC","followsDelimiter":"/","description":"Logistic transformation is applied.","type":"standalone"},{"name":"BOXCOX","followsDelimiter":"/","description":"Box-Cox transformation with parameter is applied, where the real number is between -5 and 5.","help":"BOXCOX(number)","type":"standalone"},{"name":"[USER-DEFINED]","followsDelimiter":"/","description":"Transformation is computed by a user-defined subroutine created using the FCMP procedure where [USER-DEFINED] is the subroutine name.","type":"standalone"}]},{"name":"TRIMMISSING=","optional":true,"followsDelimiter":"/","description":"Specifies how missing values (either actual or accumulated) are trimmed from the accumulated time series or ordered sequence for variables listed in the INPUT statement.","help":"TRIMMISSING=NONE | LEFT | RIGHT | BOTH","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No missing value trimming is applied.","type":"standalone"},{"name":"LEFT","followsDelimiter":"/","description":"Beginning missing values are trimmed.","type":"standalone"},{"name":"RIGHT","followsDelimiter":"/","description":"Ending missing values are trimmed.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Both beginning and ending missing value are trimmed. This is the default.","type":"standalone"}]},{"name":"ZEROMISS=","optional":true,"followsDelimiter":"/","description":"Specifies how beginning and/or ending zero values (either actual or accumulated) are interpreted in the accumulated time series or ordered sequence for variables listed in the INPUT statement.","help":"ZEROMISS=NONE | LEFT | RIGHT | BOTH","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Beginning and/or ending zeros are unchanged. This is the default.","type":"standalone"},{"name":"LEFT","followsDelimiter":"/","description":"Beginning zeros are set to missing.","type":"standalone"},{"name":"RIGHT","followsDelimiter":"/","description":"Ending zeros are set to missing.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Both beginning and ending zeros are set to missing.","type":"standalone"}]}]},{"name":"TARGET","description":"The TARGET statement lists the numeric target variables in the DATA= data set whose values are to be accumulated to form the time series or represent ordered numeric sequences (when no ID statement is specified). An input data set variable can be specified in only one INPUT or TARGET statement. Any number of TARGET statements can be used.","help":"TARGET &lt;ACCUMULATE=&lt;NONE | TOTAL | AVERAGE&gt;... &gt; &lt;COMPRESS=&lt;GLOBALABS= | GLOBALPCT= | LOCALABS&gt;... &gt; &lt;DIF=(numlist)&gt; ...","arguments":[{"name":"ACCUMULATE=","optional":true,"followsDelimiter":"/","description":"Specifies how the data set observations are accumulated within each time period for the variables listed in the TARGET statement.","help":"ACCUMULATE=NONE | TOTAL | AVERAGE | MINIMUM | MEDIAN | MAXIMUM | N | NMISS | NOBS | FIRST | LAST | STDDEV | CSS | USS","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No accumulation occurs; the ID variable values must be equally spaced with respect to the frequency. This is the default option.","type":"standalone"},{"name":"TOTAL","followsDelimiter":"/","description":"Observations are accumulated based on the total sum of their values.","type":"standalone"},{"name":"AVERAGE","followsDelimiter":"/","description":"Observations are accumulated based on the average of their values.","type":"standalone"},{"name":"MINIMUM","followsDelimiter":"/","description":"Observations are accumulated based on the minimum of their values.","type":"standalone"},{"name":"MEDIAN","followsDelimiter":"/","description":"Observations are accumulated based on the median of their values.","type":"standalone"},{"name":"MAXIMUM","followsDelimiter":"/","description":"Observations are accumulated based on the maximum of their values.","type":"standalone"},{"name":"N","followsDelimiter":"/","description":"Observations are accumulated based on the number of nonmissing observations.","type":"standalone"},{"name":"NMISS","followsDelimiter":"/","description":"Observations are accumulated based on the number of missing observations.","type":"standalone"},{"name":"NOBS","followsDelimiter":"/","description":"Observations are accumulated based on the number of observations.","type":"standalone"},{"name":"FIRST","followsDelimiter":"/","description":"Observations are accumulated based on the first of their values.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Observations are accumulated based on the last of their values.","type":"standalone"},{"name":"STDDEV","followsDelimiter":"/","description":"Observations are accumulated based on the standard deviation of their values.","type":"standalone"},{"name":"CSS","followsDelimiter":"/","description":"Observations are accumulated based on the corrected sum of squares of their values.","type":"standalone"},{"name":"USS","followsDelimiter":"/","description":"Observations are accumulated based on the uncorrected sum of squares of their values.","type":"standalone"}]},{"name":"COMPRESS=","optional":true,"followsDelimiter":"/","description":"Specifies the sliding sequence (global) and warping (local) compression range of the target sequence with respect to the input sequence. Compression of the target sequence is the same as expansion of the input sequence and vice versa. The compression limits are defined based on the length of the target sequence and are imposed on the target sequence.","help":"COMPRESS=GLOBALABS= | GLOBALPCT= | LOCALABS | LOCALPCT=","type":"choice","arguments":[{"name":"GLOBALABS=","followsDelimiter":"/","description":"Specifies the absolute global compression, where integer ranges from zero to 10,000. GLOBALABS=0 implies no global compression, which is the default unless the GLOBALPCT= option is specified.","type":"value"},{"name":"GLOBALPCT=","followsDelimiter":"/","description":"Specifies global compression as a percentage of the length of the target sequence, where number ranges from zero to 100. GLOBALPCT=0 implies no global compression, which is the default. GLOBALPCT=100 implies maximum allowable compression.","type":"value"},{"name":"LOCALABS","followsDelimiter":"/","description":"Specifies the absolute local compression, where integer ranges from zero to 10,000. The default is maximum allowable absolute local compression unless the LOCALPCT= option is specified.","type":"standalone"},{"name":"LOCALPCT=","followsDelimiter":"/","description":"Specifies local compression as a percentage of the length of the input sequence, where number ranges from zero to 100. The percentage specified by the LOCALPCT= option must be less than the GLOBALPCT= option. LOCALPCT=0 implies no local compression. LOCALPCT=100 implies maximum allowable local compression. The default is LOCALPCT=100.","type":"value"}]},{"name":"DIF=","optional":true,"followsDelimiter":"/","description":"Specifies the differencing to be applied to the accumulated time series. The list of differencing orders must be separated by spaces or commas. For example, DIF=(1,3) specifies first, then third order, differencing. Differencing is applied after time series transformation. The TRANSFORM= option is applied before the DIF= option. Simple differencing is useful when you want to detrend the time series before computing the similarity measures.","type":"value"},{"name":"EXPAND=","optional":true,"followsDelimiter":"/","description":"Specifies the sliding sequence (global) and warping (local) expansion range of the target sequence with respect to the input sequence. Expansion of the target sequence is the same as compression of the input sequence and vice versa. The expansion limits are defined based on the length of the input sequence, but are imposed on the target sequence.","help":"EXPAND=GLOBALABS= | GLOBALPCT= | LOCALABS | LOCALPCT=","type":"choice","arguments":[{"name":"GLOBALABS=","followsDelimiter":"/","description":"Specifies the absolute global expansion, where integer ranges from zero to 10,000. GLOBALABS=0 implies no global expansion, which is the default unless the GLOBALPCT= option is specified.","type":"value"},{"name":"GLOBALPCT=","followsDelimiter":"/","description":"Specifies global expansion as a percentage of the length of the target sequence, where number ranges from zero to 100. GLOBALPCT=0 implies no global expansion, which is the default. GLOBALPCT=100 implies maximum allowable expansion.","type":"value"},{"name":"LOCALABS","followsDelimiter":"/","description":"Specifies the absolute local expansion, where integer ranges from zero to 10,000. The default is maximum allowable absolute local expansion unless the LOCALPCT= option is specified.","type":"standalone"},{"name":"LOCALPCT=","followsDelimiter":"/","description":"Specifies local expansion as a percentage of the length of the input sequence, where number ranges from zero to 100. The percentage specified by the LOCALPCT= option must be less than the GLOBALPCT= option. LOCALPCT=0 implies no local expansion. LOCALPCT=100 implies maximum allowable local expansion. The default is LOCALPCT=100.","type":"value"}]},{"name":"MEASURE=","optional":true,"followsDelimiter":"/","description":"Specifies the similarity measure to be computed by using the working input and target sequences.","help":"MEASURE=SQRDEV | ABSDEV | MSQRDEV | MSQRDEVINP | MSQRDEVTAR | MSQRDEVMIN | MSQRDEVMAX | MABSDEV | MABSDEVINP | MABSDEVTAR | MABSDEVMIN | MABSDEVMAX | [USER-DEFINED]","type":"choice","arguments":[{"name":"SQRDEV","followsDelimiter":"/","description":"Squared deviation. This option is the default.","type":"standalone"},{"name":"ABSDEV","followsDelimiter":"/","description":"Absolute deviation","type":"standalone"},{"name":"MSQRDEV","followsDelimiter":"/","description":"Mean squared deviation","type":"standalone"},{"name":"MSQRDEVINP","followsDelimiter":"/","description":"Mean squared deviation relative to the length of the input sequence","type":"standalone"},{"name":"MSQRDEVTAR","followsDelimiter":"/","description":"Mean squared deviation relative to the length of the target sequence","type":"standalone"},{"name":"MSQRDEVMIN","followsDelimiter":"/","description":"Mean squared deviation relative to the minimum valid path length","type":"standalone"},{"name":"MSQRDEVMAX","followsDelimiter":"/","description":"Mean squared deviation relative to the maximum valid path length","type":"standalone"},{"name":"MABSDEV","followsDelimiter":"/","description":"Mean absolute deviation","type":"standalone"},{"name":"MABSDEVINP","followsDelimiter":"/","description":"Mean absolute deviation relative to the length of the input sequence","type":"standalone"},{"name":"MABSDEVTAR","followsDelimiter":"/","description":"Mean absolute deviation relative to the length of the target sequence","type":"standalone"},{"name":"MABSDEVMIN","followsDelimiter":"/","description":"Mean absolute deviation relative to the minimum valid path length","type":"standalone"},{"name":"MABSDEVMAX","followsDelimiter":"/","description":"Mean absolute deviation relative to the maximum valid path length","type":"standalone"},{"name":"[USER-DEFINED]","followsDelimiter":"/","description":"Measure computed by a user-defined function created by using the FCMP procedure, where [USER-DEFINED] is the function name.","type":"standalone"}]},{"name":"NORMALIZE=","optional":true,"followsDelimiter":"/","description":"Specifies the sequence normalization to be applied to the working target sequence.","help":"NORMALIZE=NONE | ABSOLUTE | STANDARD | [USER-DEFINED]","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No normalization is applied. This option is the default.","type":"standalone"},{"name":"ABSOLUTE","followsDelimiter":"/","description":"Absolute normalization is applied.","type":"standalone"},{"name":"STANDARD","followsDelimiter":"/","description":"Standard normalization is applied.","type":"standalone"},{"name":"[USER-DEFINED]","followsDelimiter":"/","description":"Normalization is computed by a user-defined subroutine created using the FCMP procedure, where [USER-DEFINED] is the subroutine name.","type":"standalone"}]},{"name":"PATH=","optional":true,"followsDelimiter":"/","description":"Specifies the similarity measure and warping path information to be computed using the working input and target sequences. The following similarity measures and warping path are provided:","help":"PATH=*option*","type":"value"},{"name":"SDIF=","optional":true,"followsDelimiter":"/","description":"Specifies the seasonal differencing to be applied to the accumulated time series. The list of seasonal differencing orders must be separated by spaces or commas. For example, SDIF=(1,3) specifies first, then third, order seasonal differencing. Differencing is applied after time series transformation. The TRANSFORM= option is applied before the SDIF= option. Seasonal differencing is useful when you want to deseasonalize the time series before computing the similarity measures.","type":"value"},{"name":"SETMISSING=","optional":true,"followsDelimiter":"/","description":"Specifies how missing values (either actual or accumulated) are interpreted in the accumulated time series or ordered sequence for variables listed in the TARGET statement.","help":"SETMISSING=MISSING | AVERAGE | MINIMUM | MEDIAN | MAXIMUM | FIRST | LAST | PREVIOUS | NEXT","type":"choice","arguments":[{"name":"MISSING","followsDelimiter":"/","description":"Missing values are set to missing. This is the default option.","type":"standalone"},{"name":"AVERAGE","followsDelimiter":"/","description":"Missing values are set to the accumulated average value.","type":"standalone"},{"name":"MINIMUM","followsDelimiter":"/","description":"Missing values are set to the accumulated minimum value.","type":"standalone"},{"name":"MEDIAN","followsDelimiter":"/","description":"Missing values are set to the accumulated median value.","type":"standalone"},{"name":"MAXIMUM","followsDelimiter":"/","description":"Missing values are set to the accumulated maximum value.","type":"standalone"},{"name":"FIRST","followsDelimiter":"/","description":"Missing values are set to the accumulated first nonmissing value.","type":"standalone"},{"name":"LAST","followsDelimiter":"/","description":"Missing values are set to the accumulated last nonmissing value.","type":"standalone"},{"name":"PREVIOUS","followsDelimiter":"/","description":"Missing values are set to the previous accumulated nonmissing value. Missing values at the beginning of the accumulated series remain missing.","type":"standalone"},{"name":"NEXT","followsDelimiter":"/","description":"Missing values are set to the next accumulated nonmissing value. Missing values at the end of the accumulated series remain missing.","type":"standalone"}]},{"name":"SLIDE=","optional":true,"followsDelimiter":"/","description":"Specifies the sliding of the target sequence with respect to the input sequence.","help":"SLIDE=NONE | INDEX | SEASON","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No sequence sliding. The input time series is compared with the target sequence directly with no sliding. This option is the default.","type":"standalone"},{"name":"INDEX","followsDelimiter":"/","description":"Slide by time index. The input time series is compared with the target sequence by observation index.","type":"standalone"},{"name":"SEASON","followsDelimiter":"/","description":"Slide by seasonal index. The input time series is compared with the target sequence by seasonal index.","type":"standalone"}]},{"name":"TRANSFORM=","optional":true,"followsDelimiter":"/","description":"Specifies the time series transformation to be applied to the accumulated time series.","help":"TRANSFORM=NONE | LOG | SQRT | LOGISTIC | BOXCOX(number) | [USER-DEFINED]","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No transformation is applied. This option is the default.","type":"standalone"},{"name":"LOG","followsDelimiter":"/","description":"Logarithmic transformation is applied.","type":"standalone"},{"name":"SQRT","followsDelimiter":"/","description":"Square-root transformation is applied.","type":"standalone"},{"name":"LOGISTIC","followsDelimiter":"/","description":"Logistic transformation is applied.","type":"standalone"},{"name":"BOXCOX","followsDelimiter":"/","description":"Box-Cox transformation with parameter is applied, where the real number is between -5 and 5.","help":"BOXCOX(number)","type":"standalone"},{"name":"[USER-DEFINED]","followsDelimiter":"/","description":"Transformation is computed by a user-defined subroutine created using the FCMP procedure where [USER-DEFINED] is the subroutine name.","type":"standalone"}]},{"name":"TRIMMISSING=","optional":true,"followsDelimiter":"/","description":"Specifies how missing values (either actual or accumulated) are trimmed from the accumulated time series or ordered sequence for variables listed in the TARGET statement.","help":"TRIMMISSING=NONE | LEFT | RIGHT | BOTH","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"No missing value trimming is applied.","type":"standalone"},{"name":"LEFT","followsDelimiter":"/","description":"Beginning missing values are trimmed.","type":"standalone"},{"name":"RIGHT","followsDelimiter":"/","description":"Ending missing values are trimmed.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Both beginning and ending missing value are trimmed. This is the default.","type":"standalone"}]},{"name":"ZEROMISS=","optional":true,"followsDelimiter":"/","description":"Specifies how beginning and/or ending zero values (either actual or accumulated) are interpreted in the accumulated time series or ordered sequence for variables listed in the TARGET statement.","help":"ZEROMISS=NONE | LEFT | RIGHT | BOTH","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Beginning and/or ending zeros are unchanged. This is the default.","type":"standalone"},{"name":"LEFT","followsDelimiter":"/","description":"Beginning zeros are set to missing.","type":"standalone"},{"name":"RIGHT","followsDelimiter":"/","description":"Ending zeros are set to missing.","type":"standalone"},{"name":"BOTH","followsDelimiter":"/","description":"Both beginning and ending zeros are set to missing.","type":"standalone"}]}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"v_008","docsetTargetFile":"etsug_similarity_toc.htm"}}