{"name":"SIMLIN","statements":[{"name":"PROC SIMLIN","description":"The SIMLIN procedure reads the coefficients for a set of linear structural equations, which are usually produced by the SYSLIN procedure. PROC SIMLIN then computes the reduced form and, if input data are given, uses the reduced form equations to generate predicted values. PROC SIMLIN is especially useful when dealing with sets of structural difference equations. The SIMLIN procedure can perform simulation or forecasting of the endogenous variables. † The SIMLIN procedure can be applied only to models that are: † o linear with respect to the parameters o linear with respect to the variables o square (as many equations as endogenous variables) o nonsingular (the coefficients of the endogenous variables form an invertible matrix)","help":"PROC SIMLIN <DATA= SAS-data-set> <EST= SAS-data-set> <ESTPRINT> <INTERIM= n> <NOPRINT> <NORED> <OUTEST= SAS-data-set> <START= n> <TOTAL> <TYPE= value>;     \n\tBY variables ;\n    \n\tENDOGENOUS variables ;\n    \n\tEXOGENOUS variables ;\n    \n\tID variables ;\n    \n\tLAGGED lag-var endogenous-var number ellipsis ;\n    \n\tOUTPUT <OUT= SAS-data-set> <PREDICTED= names> <RESIDUAL= names> ...;\n","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the SAS data set containing input data for the simulation. If the DATA= option is used, the data set specified must supply values for all exogenous variables throughout the simulation. If the DATA= option is not specified, no simulation of the system is performed, and only the reduced form and multipliers are computed.","type":"value"},{"name":"EST=","optional":true,"description":"Specifies the input data set containing the structural coefficients of the system. If EST= is omitted the most recently created SAS data set is used. The EST= data set is normally a \"TYPE=EST\" data set produced by the OUTEST= option of PROC SYSLIN. However, you can also build the EST= data set with a SAS DATA step.","type":"value"},{"name":"ESTPRINT","optional":true,"description":"Prints the structural coefficients read from the EST= data set.","type":"standalone"},{"name":"INTERIM=","optional":true,"description":"Requests that interim multipliers be computed for interims 1 through n. If not specified, no interim multipliers are computed. This feature is available only if there are no lags greater than 1.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses all printed output.","type":"standalone"},{"name":"NORED","optional":true,"description":"Suppresses the printing of the reduced form coefficients.","type":"standalone"},{"name":"OUTEST=","optional":true,"description":"Specifies an output SAS data set to contain the reduced form coefficients and multipliers, in addition to the structural coefficients read from the EST= data set. The OUTEST= data set has the same form as the EST= data set. If the OUTEST= option is not specified, the reduced form coefficients and multipliers are not written to a data set.","type":"value"},{"name":"START=","optional":true,"description":"Specifies the observation number in the DATA= data set where the dynamic simulation is to be started. By default, the dynamic simulation starts with the first observation in the DATA= data set for which all variables (including lags) are not missing.","type":"value"},{"name":"TOTAL","optional":true,"description":"Requests that the total multipliers be computed. This feature is available only if there are no lags greater than 1.","type":"standalone"},{"name":"TYPE=","optional":true,"description":"Specifies the type of estimates to be read from the EST= data set. The TYPE= value must match the value of the _TYPE_ variable for the observations that you want to select from the EST= data set (TYPE=2SLS, for example).","type":"value"}]},{"name":"BY","description":"A BY statement can be used with PROC SIMLIN to obtain separate analyses for groups of observations defined by the BY variables.","help":"BY variables "},{"name":"ENDOGENOUS","aliases":["ENDOG","ENDO"],"description":"List the names of the endogenous (jointly dependent) variables in the ENDOGENOUS statement. The ENDOGENOUS statement can be abbreviated as ENDOG or ENDO.","help":"ENDOGENOUS variables "},{"name":"EXOGENOUS","aliases":["EXOG","EXO"],"description":"List the names of the exogenous (independent) variables in the EXOGENOUS statement. The EXOGENOUS statement can be abbreviated as EXOG or EXO.","help":"EXOGENOUS variables "},{"name":"ID","description":"The ID statement can be used to restrict the variables copied from the DATA= data set to the OUT= data set. Use the ID statement to list the variables you want copied to the OUT= data set besides the exogenous, endogenous, lagged endogenous, and BY variables. If the ID statement is omitted, all the variables in the DATA= data set are copied to the OUT= data set.","help":"ID variables "},{"name":"LAGGED","description":"For each lagged endogenous variable, specify the name of the lagged variable, the name of the endogenous variable that was lagged, and the degree of the lag. Only one LAGGED statement is allowed. The following is an example of the use of the LAGGED statement: proc simlin est=e; endog y1 y2; lagged y1lag1 y1 1 y2lag1 y2 1 y2lag3 y2 3; run; This statement specifies that the variable Y1LAG1 contains the values of the endogenous variable Y1 lagged one period; the variable Y2LAG1 refers to the values of Y2 lagged one period; and the variable Y2LAG3 refers to the values of Y2 lagged three periods.","help":"LAGGED lag-var endogenous-var number ellipsis "},{"name":"OUTPUT","description":"The OUTPUT statement specifies that predicted and residual values be put in an output data set. A DATA= input data set must be supplied if the OUTPUT statement is used, and only one OUTPUT statement is allowed.","help":"OUTPUT &lt;OUT= SAS-data-set&gt; &lt;PREDICTED= names&gt; &lt;RESIDUAL= names&gt; ...","arguments":[{"name":"OUT=","optional":true,"description":"Names the output SAS data set to contain the predicted values and residuals. If OUT= is not specified, the output data set is named using the DATAn convention.","type":"value"},{"name":"PREDICTED=","optional":true,"aliases":["P="],"description":"Names the variables in the output data set that contain the predicted values of the simulation. These variables correspond to the endogenous variables in the order in which they are specified in the ENDOGENOUS statement. Specify up to as many names as there are endogenous variables. If you specify names on the PREDICTED= option for only some of the endogenous variables, predicted values for the remaining variables are not output. The names must not match any variable name in the input data set.","type":"value"},{"name":"RESIDUAL=","optional":true,"aliases":["R="],"description":"Names the variables in the output data set that contain the residual values from the simulation. The residuals are the differences between the actual values of the endogenous variables from the DATA= data set and the predicted values from the simulation. These variables correspond to the endogenous variables in the order in which they are specified in the ENDOGENOUS statement. Specify up to as many names as there are endogenous variables. The names must not match any variable name in the input data set.","type":"value"}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"v_010","docsetTargetFile":"etsug_simlin_toc.htm"}}