{"name":"SIMNORMAL","statements":[{"name":"PROC SIMNORMAL","description":"The SIMNORMAL procedure can perform conditional and unconditional simulation for a set of correlated normal or Gaussian random variables. † The means, variances, and covariances (or correlations) are read from an input TYPE=CORR or TYPE=COV data set. This data set is typically produced by the CORR procedure. Conditional simulations are performed by appending a special observation, identified by the value of ’COND’ for the _TYPE_ variable, which contains the conditioning value. † The output data set from PROC SIMNORMAL contains simulated values for each of the analysis variables. Optionally, the output data set also contains the seed stream and the values of the conditioning variables. PROC SIMNORMAL produces no printed output.","help":"PROC SIMNORMAL <DATA=SAS-data-set> <NUMREAL=n> <OUT=SAS-data-set> <OUTCOND> <OUTSEED> <SEED=seed-value> <SEEDBY> <SINGULAR1=number> <SINGULAR2=number>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCONDITION | COND variables ;\n    \n\tVAR variable ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the input data set that must be a specially structured TYPE=CORR, COV, UCORR, UCOV, or SSCP SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NUMREAL=","optional":true,"description":"Specifies the number of realizations to generate. A value of NUMREAL=500 generates 500 observations in the OUT=dataset, or 500 observations within each BY group if a BY statement is given.","help":"NUMREAL=*n*","type":"value"},{"name":"OUT=","optional":true,"description":"Specifies a SAS data set in which to store the simulated values for the VAR variables. If you omit the OUT=option, the output data set is created and given a default name by using the DATAn convention.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTCOND","optional":true,"description":"Requests that the values of the conditioning variables be included in the OUT= data set.","type":"standalone"},{"name":"OUTSEED","optional":true,"description":"Requests that the seed values be included in the OUT= data set. The variable Seed is added to the OUT= data set.","type":"standalone"},{"name":"SEED=","optional":true,"description":"Specifies the seed to use for the random number generator. If the SEED= value is omitted, the system clock is used.","help":"SEED=*seed-value*","type":"value"},{"name":"SEEDBY","optional":true,"description":"Specifies that the seed stream be reinitialized for each BY group. By default, a single random stream is used over all BY groups.","type":"standalone"},{"name":"SINGULAR1=","optional":true,"description":"Specifies the first singularity criterion, which is applied to the Cholesky decomposition of the covariance matrix. The SINGULAR1= value must be in the range (0,1). The default value is 10⁻⁸.","help":"SINGULAR1=*number*","type":"value"},{"name":"SINGULAR2=","optional":true,"description":"Specifies the second singularity criterion, which is applied to the sweeping of the covariance or correlation matrix to obtain the conditional covariance. The SINGULAR2= value must be in the range (0,1). The default value is 10⁻⁸.","help":"SINGULAR2=*number*","type":"value"}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CONDITION","description":"A CONDITION statement specifies the conditioning variables. The presence of a CONDITION statement requests that a conditional simulation be performed. The lack of a CONDITIONAL statement simply means that an unconditional simulation for the VAR variables is to be performed.","help":"CONDITION | COND variables "},{"name":"VAR","description":"Use the VAR statement to specify the analysis variables. Only numeric variables can be specified. If a VAR statement is not given, all numeric variables in the DATA= data set that are not in the CONDITION or BY statement are used.","help":"VAR variable "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_018","docsetTargetFile":"statug_simnorm_toc.htm"}}