{"name":"SPP","statements":[{"name":"PROC SPP","description":"The SPP procedure performs analysis for spatial point patterns in two dimensions. You can specify the point process rectangular window or rely on the input data set coordinates. Summary descriptions are available through the F, G, J, K functions, which compare the empirical function distributions to the theoretical homogeneous Poisson functions. † The SPP procedure uses ODS Graphics to create graphs as part of its output.","help":"PROC SPP <DATA=SAS-data-set> <DESCENDING> <NAMELEN=number> <PLOTS=ALL | HISTOGRAM | NONE>;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCOVTEST <TEST=<D | CM>> ; \n   \n\tMODEL <CENSCALE> <CL<(alpha-value)>> <CORRB> ...; \n   \n\tNLOPTIONS <ABSCONV= | ABSTOL=r> <ABSFCONV=r <n> | ABSFTOL=r<n>> <ABSGCONV= | ABSGTOL=r <n>> ...;     \n\tPARMS <PARMSDATA=SAS-data-set | PDATA=SAS-data-set> ;     \n\tPROCESS <AREA=> <EVENT=> <MARK=> ...; \n   \n\tTREND name = FIELD(field-definition); ","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the SAS data set containing the data to be analyzed. If you omit the DATA= option, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DESCENDING","optional":true,"aliases":["DESCEND","DESC"],"description":"Requests that the levels of the response variable for the binomial model that uses a single-variable response syntax be sorted in the reverse of the default order.","type":"standalone"},{"name":"NAMELEN=","optional":true,"description":"Specifies the length to which long effect names are shortened. The default and minimum value is 20.","help":"NAMELEN=*number*","type":"value"},{"name":"PLOTS=","optional":true,"description":"You can specify the following plot-requests:","help":"PLOTS=ALL | HISTOGRAM | NONE","type":"choice","arguments":[{"name":"ALL","description":"Requests that all default plots be produced.","type":"standalone"},{"name":"HISTOGRAM","description":"Creates a histogram for the predicted weights from the missingness model.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC SPP to obtain separate analyses of observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used. If your input data set is not sorted in ascending order, use one of the following alternatives: • Sort the data by using the SORT procedure with a similar BY statement. • Specify the NOTSORTED or DESCENDING option in the BY statement for the BCHOICE procedure. The NOTSORTED option does not mean that the data are unsorted but rather that the data are arranged in groups (according to values of the BY variables) and that these groups are not necessarily in alphabetical or increasing numeric order. • Create an index on the BY variables by using the DATASETS procedure (in Base SAS software).","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"COVTEST","description":"You use the COVTEST statement to perform covariate dependency tests that are based on an empirical distribution function (EDF). The COVTEST statement contains two essential parts: a process-name (which must be declared in a PROCESS statement that precedes the COVTEST statement) that you specify on the left side and a list of trend-names (which must be defined in a preceding TREND statement within the same PROC SPP call) that you specify on the right side. The procedure performs separate EDF tests for every trend-name that is specified in the right side of the COVTEST statement.","help":"COVTEST &lt;TEST=&lt;D | CM&gt;&gt; ","arguments":[{"name":"TEST=","optional":true,"description":"Requests the test statistics for any type of requested weighted tests. This option applies only if you have specified a trend on the right side of the COVTEST statement. The requested weighted test statistic is applied to every trend that is specified on the right side of the COVTEST statement. You can specify the following values: D requests the Kolmogorov-Smirnov D statistic. CM requests the Cramér–von Mises W² statistic.","help":"TEST=D | CM","type":"choice","arguments":[{"name":"D","description":"Requests the Kolmogorov-Smirnov D statistic.","type":"standalone"},{"name":"CM","description":"Requests the Cramér–von Mises W² statistic.","type":"standalone"}]}]},{"name":"MODEL","description":"The MODEL statement enables you to fit an inhomogeneous Poisson process model. You must specify a process-name as the dependent variable. In addition, the MODEL statement enables you to specify multiple trends as covariates. If you do not specify any trends as covariates in the MODEL statement, PROC SPP fits a second-degree polynomial. The process-name must be defined in a preceding PROCESS statement, and each trend-name must be defined in a preceding TREND statement.","help":"MODEL &lt;CENSCALE&gt; &lt;CL&lt;(alpha-value)&gt;&gt; &lt;CORRB&gt; ...","arguments":[{"name":"CENSCALE","optional":true,"followsDelimiter":"/","description":"Lists the centering and scaling (standardization) information for each coordinate and covariate in the model.","type":"standalone"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests a t-type confidence interval for the estimated parameters. You can also specify the significance level via the alpha-value. The default alpha-value is 0.05, which corresponds to the default confidence level of 95%.","type":"standalone"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Requests the estimated correlation matrix for the parameter estimates. To request the estimated correlation matrix for the model parameters with respect to the standardized covariates, specify both this model-option and the SOLUTION model-option.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Requests the estimated covariance matrix for the parameter estimates. To request the estimated covariance matrix for the model parameters with respect to the standardized covariates, specify this model-option and the SOLUTION model-option.","type":"standalone"},{"name":"GOF","optional":true,"followsDelimiter":"/","description":"Requests a goodness-of-fit test for the fitted intensity model. You can specify the number of Monte Carlo simulation runs as an integer in num-simulations. By default, the SPP procedure performs 100 simulations when you specify this option.","type":"standalone"},{"name":"GRID","optional":true,"followsDelimiter":"/","description":"Specifies the grid resolution for model fitting, where value-NX specifies the number of grids in the horizontal direction and value-NY specifies the number of grids in the vertical direction. By default, the SPP procedure fits the model on a 128 x 128 grid.","type":"standalone"},{"name":"ITHIST=","optional":true,"followsDelimiter":"/","description":"Requests an iteration history table for the model-fitting optimization. Specify this option to produce additional levels of output detail. You can specify the following value:","help":"ITHIST=PARM","type":"choice","arguments":[{"name":"PARM","type":"standalone"}]},{"name":"MTYPE=","optional":true,"followsDelimiter":"/","description":"Specifies the type of inhomogeneous intensity model to be fit by PROC SPP. You fit a negative binomial model only in order to diagnose overdispersion, so in this case no fitted intensity is produced, and likewise none of the goodness-of-fit tests or residual diagnostics that are based on the intensity are produced. You can specify the following values: POISSON fits a Poisson process model. NEGBINOMIAL fits a negative binomial model.","help":"MTYPE=POISSON | NEGBINOMIAL","type":"choice","arguments":[{"name":"POISSON","followsDelimiter":"/","description":"Fits a Poisson process model.","type":"standalone"},{"name":"NEGBINOMIAL","followsDelimiter":"/","description":"Fits a negative binomial model.","type":"standalone"}]},{"name":"OUTINTENSITY=","optional":true,"followsDelimiter":"/","description":"Specifies a SAS-data-set in which to store the output intensity estimate.","help":"OUTINTENSITY=*SAS-data-set*","type":"dataSet"},{"name":"OUTSIM=","optional":true,"followsDelimiter":"/","description":"Specifies a SAS-data-set in which to store a simulated point pattern from a fitted intensity model. Specify the number of iterations in <iter-value> to generate multiple point pattern data sets. By default, the number of simulation iterations is set to 1.","type":"value"},{"name":"POLYNOMIAL","optional":true,"followsDelimiter":"/","aliases":["POLY"],"description":"Specifies a polynomial trend in the coordinates. You can also specify the degree of the polynomial component. If you do not specify the degree, PROC SPP procedure uses a second-degree polynomial by default.","type":"standalone"},{"name":"RESIDUAL=","optional":true,"followsDelimiter":"/","description":"Requests residual diagnostics for the inhomogeneous Poisson process model. If you specify this option, you must also specify the residual bandwidth for computing smoothed residuals via the B= suboption.","help":"RESIDUAL=B=","type":"choice","arguments":[{"name":"B=","type":"value"}]},{"name":"SOLUTION","optional":true,"followsDelimiter":"/","description":"Displays the parameter estimates table in a location- and scale-standardized space. For optimization purposes, any polynomial coordinates and covariates in the model are centered and scaled. The parameters and the approximate covariance and the correlation matrices are displayed by default in the untransformed, unstandardized space. This option causes the output to be displayed on the basis of the actual fitted parameters in the transformed space. If you also specify the COVB or CORRB model-option (or both), then PROC SPP also displays the estimated covariance or correlation matrix, respectively (or both), in the transformed space.","type":"standalone"}]},{"name":"NLOPTIONS","description":"The NLOPTIONS statement specifies details about the nonlinear optimization technique that PROC SPP uses to maximize the log-likelihood function for the first-order intensity model. By default, PROC SPP uses the Newton-Raphson with ridging optimization technique.","help":"NLOPTIONS &lt;ABSCONV= | ABSTOL=r&gt; &lt;ABSFCONV=r &lt;n&gt; | ABSFTOL=r&lt;n&gt;&gt; &lt;ABSGCONV= | ABSGTOL=r &lt;n&gt;&gt; ...","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function difference convergence criterion.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion.","type":"value"},{"name":"ABSXCONV=","optional":true,"aliases":["ABSXTOL="],"description":"Specifies the absolute parameter convergence criterion.","type":"value"},{"name":"ASINGULAR=","optional":true,"aliases":["ASING="],"description":"Specifies an absolute singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"DAMPSTEP","optional":true,"aliases":["DS"],"description":"Specifies that the initial step-size value aⁿ (where n=0) for each line search (used by the QUANEW, CONGRA, or NEWRAP technique) cannot be larger than r times the step-size value used in the former iteration.","type":"standalone"},{"name":"FCONV2=","optional":true,"aliases":["FTOL2="],"description":"Specifies a second function convergence criterion.","type":"value"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies the relative function convergence criterion.","type":"value"},{"name":"FSIZE=","optional":true,"description":"Specifies the FSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"FSIZE=*r*","type":"value"},{"name":"GCONV2=","optional":true,"aliases":["GTOL2="],"description":"Specifies another relative gradient convergence criterion.","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies the relative gradient convergence criterion.","type":"value"},{"name":"HESCAL=","optional":true,"aliases":["HS="],"description":"Specifies the scaling version of the Hessian or crossproduct Jacobian matrix used in NRRIDG, TRUREG, LEVMAR, NEWRAP, or DBLDOG optimization.","help":"HESCAL=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","description":"Specifies that no scaling is done.","type":"standalone"},{"name":"1","description":"Specifies the Moré (1978) scaling update","type":"standalone"},{"name":"2","description":"Specifies the Dennis, Gay, and Welsch (1981) scaling update","type":"standalone"},{"name":"3","description":"Specifies that di is reset in each iteration","type":"standalone"}]},{"name":"INHESSIAN","optional":true,"aliases":["INHESS"],"description":"Specifies how the initial estimate of the approximate Hessian is defined for the quasi-Newton techniques QUANEW and DBLDOG.","type":"standalone"},{"name":"INSTEP=","optional":true,"aliases":["SALPHA=","RADIUS="],"description":"Reduces the length of the first trial step during the line search of the first iterations.","help":"INSTEP=*r*","type":"value"},{"name":"LCDEACT=","optional":true,"aliases":["LCD="],"description":"Specifies a threshold r for the Lagrange multiplier that decides whether an active inequality constraint remains active or can be deactivated.","type":"value"},{"name":"LCEPSILON=","optional":true,"aliases":["LCEPS=","LCE="],"description":"Specifies the range r, r ≥ 0, for active and violated boundary and linear constraints.","type":"value"},{"name":"LCSINGULAR=","optional":true,"aliases":["LCSING=","LCS="],"description":"Specifies a criterion r, r ≥ 0, used in the update of the QR decomposition that decides whether an active constraint is linearly dependent on a set of other active constraints.","type":"value"},{"name":"LINESEARCH=","optional":true,"aliases":["LIS=","SMETHOD=","SM="],"description":"Specifies the line-search method for the CONGRA, QUANEW, and NEWRAP optimization techniques.","help":"LINESEARCH=1 | 2 | 3 | 4 | 5 | 6 | 7 | 8","type":"choice","arguments":[{"name":"1","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is similar to one used by the Harwell subroutine library.","type":"standalone"},{"name":"2","description":"Specifies a line-search method that needs more function calls than gradient calls for quadratic and cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"3","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"4","description":"Specifies a line-search method that needs the same number of function and gradient calls for stepwise extrapolation and cubic interpolation","type":"standalone"},{"name":"5","description":"Specifies a line-search method that is a modified version of LIS=4.","type":"standalone"},{"name":"6","description":"Specifies golden section line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"7","description":"Specifies bisection line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"8","description":"Specifies Armijo line-search technique (Polak 1971), which uses only function values for linear approximation.","type":"standalone"}]},{"name":"LSPRECISION=","optional":true,"aliases":["LSP="],"description":"Specifies the degree of accuracy that should be obtained by the line-search algorithms LIS=2 and LIS=3. The default LSPRECISION= values are:","type":"value"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Requires the number of function calls to be no larger than i. The default values are:","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Requires the number of iterations to be no larger than i. The default values are: o For TECH= LEVMAR, NEWRAP, NRRIDG, TRUREG: i=50 o For TECH= DBLDOG, QUANEW: i=200 o For TECH= CONGRA: i=400","type":"value"},{"name":"MAXSTEP=","optional":true,"description":"Specifies an upper bound for the step length of the line-search algorithms during the first n iterations.","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Requires the CPU time to be no larger than r. The default value of the MAXTIME= option is the largest double floating-point number on your computer.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0.","type":"value"},{"name":"MSINGULAR=","optional":true,"aliases":["MSING="],"description":"Specifies a relative singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses output related to optimization such as the iteration history.","type":"standalone"},{"name":"PALL","optional":true,"description":"[Displays information about the starting values and final values of the optimization process.","type":"standalone"},{"name":"PHISTORY","optional":true,"aliases":["PHIST"],"description":"Displays the optimization history. The PHISTORY option is set automatically if the PALL or PRINT option is set.","type":"standalone"},{"name":"RESTART=","optional":true,"aliases":["REST="],"description":"Specifies that the QUANEW or CONGRA algorithm is restarted with a steepest descent/ascent search direction after at most i iterations, i > 0.","type":"value"},{"name":"SINGULAR=","optional":true,"aliases":["SING="],"description":"Specifies the singularity criterion r, 0 < r < 1, used, for example, for matrix inversion.","type":"value"},{"name":"SOCKET=","optional":true,"description":"Specifies the fileref that contains the information needed for remote monitoring.","help":"SOCKET=*fileref*","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH=","OMETHOD=","OM="],"description":"Specifies the optimization technique.","help":"TECHNIQUE=CONGRA | DBLDOG | LEVMAR | NEWRAP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Chooses one of four different conjugate-gradient optimization algorithms, which can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization, which uses the gradient to update an approximation of the Cholesky factor of the Hessian.","type":"standalone"},{"name":"LEVMAR","description":"Performs a highly stable but, for large problems, memory- and time-consuming Levenberg-Marquardt optimization technique, a slightly improved variant of the Moré (1978) implementation. This is the default optimization technique if there are fewer than 40 parameters to estimate.","type":"standalone"},{"name":"NEWRAP","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. The algorithm combines a line-search algorithm with ridging, and it can be modified with the LINESEARCH= option.","type":"standalone"},{"name":"NRRIDG","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. This algorithm does not perform a line search.","type":"standalone"},{"name":"QUANEW","description":"Chooses one of four different quasi-Newton optimization algorithms that can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"TRUREG","description":"Performs a usually very stable but, for large problems, memory- and time-consuming trust-region optimization technique. The algorithm is implemented similar to Gay (1983) and Moré and Sorensen (1983).","type":"standalone"},{"name":"NONE","description":"Does not perform any optimization. This option is similar to METHOD=NONE, but TECH=NONE also computes and displays residuals and goodness of fit statistics.","type":"standalone"}]},{"name":"UPDATE=","optional":true,"aliases":["UPD="],"description":"Specifies the update method for the quasi-Newton, double-dogleg, or conjugate-gradient optimization technique.","help":"UPDATE=BFGS | DBFGS | DDFP | DFP | PB | FR | PR | CD","type":"choice","arguments":[{"name":"BFGS","description":"Performs the original Broyden, Fletcher, Goldfarb, and Shanno (BFGS) update of the inverse Hessian matrix.","type":"standalone"},{"name":"DBFGS","description":"Performs the dual BFGS update of the Cholesky factor of the Hessian matrix. This is the default update method.","type":"standalone"},{"name":"DDFP","description":"Performs the dual Davidon, Fletcher, and Powell (DFP) update of the Cholesky factor of the Hessian matrix.","type":"standalone"},{"name":"DFP","description":"Performs the original DFP update of the inverse Hessian matrix.","type":"standalone"},{"name":"PB","description":"Performs the automatic restart update method of Powell (1977) and Beale (1972).","type":"standalone"},{"name":"FR","description":"Performs the Fletcher-Reeves update (Fletcher 1987).","type":"standalone"},{"name":"PR","description":"Performs the Polak-Ribiere update (Fletcher 1987).","type":"standalone"},{"name":"CD","description":"Performs a conjugate-descent update of Fletcher (1987).","type":"standalone"}]},{"name":"VERSION=","optional":true,"aliases":["VS="],"description":"Specifies the version of the quasi-Newton optimization technique with nonlinear constraints.","help":"VERSION=1 | 2","type":"choice","arguments":[{"name":"1","description":"Specifies the update of the U vector as in Powell (1978a, 1978b) (update like VF02AD).","type":"standalone"},{"name":"2","description":"Specifies the update of the U vector as in Powell (1982a, 1982b) (update like VMCWD).","type":"standalone"}]},{"name":"VSINGULAR=","optional":true,"aliases":["VSING="],"description":"Specifies a relative singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"XCONV=","optional":true,"aliases":["XTOL="],"description":"Specifies the relative parameter convergence criterion. Termination requires a small relative parameter change in subsequent iterations.","type":"value"},{"name":"XSIZE=","optional":true,"description":"Specifies the XSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"XSIZE=*r*","type":"value"}]},{"name":"PARMS","description":"The PARMS statement specifies initial values for the parameters in the MODEL statement. Alternatively, the PARMS statement can request a grid search over several values of these parameters. The PARMS statement is optional and must follow the associated MODEL statement.","help":"PARMS &lt;PARMSDATA=SAS-data-set | PDATA=SAS-data-set&gt; ","arguments":[{"name":"PARMSDATA=","optional":true,"followsDelimiter":"/","aliases":["PDATA="],"description":"Specifies the SAS data set from which to read model parameter values. The data set should contain the values in the sequence that is required by the PARMS statement in either of the following two ways: •Specify one single column under the variable Estimate (Est) that contains all the parameter values.","type":"value"}]},{"name":"PROCESS","description":"The PROCESS statement defines a point pattern for analysis. You must use a valid SAS variable name to define the process, and you can describe it by using variables that contain the x and y coordinates of the points within the point pattern. The variables must also be in the DATA= data set. You can specify only one PROCESS statement in PROC SPP.","help":"PROCESS &lt;AREA=&gt; &lt;EVENT=&gt; &lt;MARK=&gt; ...","arguments":[{"name":"AREA=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"BLOCKS","optional":true,"followsDelimiter":"/","description":"Specifies the block size that is required for calculating the confidence intervals of distance functions, where NX specifies the number of horizontal blocks and NY specifies the number of vertical blocks. The block size should be neither too small nor too large for this option to behave reasonably.","type":"standalone"},{"name":"BYTYPE=","optional":true,"followsDelimiter":"/","description":"Requests distance function calculation by values of the mark variable. This option produces individual distance function calculations for each mark type. You can specify the following options: ALL requests distance function calculation for all available character mark variable values in the DATA= data set. value-list requests distance function calculation for certain formatted mark variable values, which you specify as quoted strings in the value-list.","help":"BYTYPE=ALL","type":"choice","arguments":[{"name":"ALL","type":"standalone"}]},{"name":"CROSS=","optional":true,"followsDelimiter":"/","description":"Requests cross-type distance function analysis between different mark values. For cross-type analysis, you must specify a mark variable in the point pattern definition by using the MARK= pattern-option. The CROSS= option applies only to any requested distance functions K, L, G, J, or PCF. You must specify the TYPES suboption as follows:","type":"value"},{"name":"EVENT=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"F","optional":true,"followsDelimiter":"/","description":"Performs a test for complete spatial randomness that is based on the empty-space F function. You can specify the following suboption:","type":"standalone"},{"name":"G","optional":true,"followsDelimiter":"/","description":"Performs a test for complete spatial randomness that is based on the nearest-neighbor G function.","type":"standalone"},{"name":"GRID","optional":true,"followsDelimiter":"/","description":"Specifies a reference grid for computing the F/G/J function, where value-NX represents the number of horizontal divisions and value-NY represents the number of vertical divisions. By default, the SPP procedure uses a 50 x 50 grid.","type":"standalone"},{"name":"J","optional":true,"followsDelimiter":"/","description":"Performs a test for complete spatial randomness that is based on the J function. You can specify the following suboption:","type":"standalone"},{"name":"K","optional":true,"followsDelimiter":"/","description":"Performs a test for complete spatial randomness that is based on the K function.","type":"standalone"},{"name":"KERNEL=","optional":true,"followsDelimiter":"/","description":"Produces a nonparametric estimate of the first-order intensity, or a nonparametric smoothed estimate of a quantitative mark variable of the point pattern, depending on the kernel-suboptions. When you do not specify the kernel-suboptions, PROC SPP computes a nonparametric intensity estimate that is based on a default bandwidth and uses a Gaussian kernel. You can specify the following kernel-suboptions.","help":"KERNEL=TYPE= | B= | ADAPTIVE | OUT= | GRID","type":"choice","arguments":[{"name":"TYPE=","type":"value"},{"name":"B=","type":"value"},{"name":"ADAPTIVE","type":"standalone"},{"name":"OUT=","type":"value"},{"name":"GRID","type":"standalone"}]},{"name":"L","optional":true,"followsDelimiter":"/","description":"Performs a test for complete spatial randomness that is based on the L function.","type":"standalone"},{"name":"MARK=","optional":true,"followsDelimiter":"/","description":"","type":"value"},{"name":"MAXDIST=","optional":true,"followsDelimiter":"/","description":"Specifies the option to be used for computing the maximum distance for different distance functions.","help":"MAXDIST=&lt;*value*&gt; | MAX | CUT","type":"choice","arguments":[{"name":"value","placeholder":true,"followsDelimiter":"/","description":"Specifies a value for the maximum distance for performing distance function calculations. The value must be positive and larger than the value of the MINDIST=value option. You can specify any positive value for the maximum distance. However, values that are too large might produce artifacts that do not reflect the true underlying process.","type":"value"},{"name":"MAX","followsDelimiter":"/","description":"Uses the maximum possible distance, based on the suggestion by Baddeley and Turner (2013).","type":"standalone"},{"name":"CUT","followsDelimiter":"/","description":"Uses the maximum distance at certain cutoff values that are recommended by Baddeley (2014).","type":"standalone"}]},{"name":"MINDIST=","optional":true,"followsDelimiter":"/","description":"Specifies a positive number for the minimum distance (or starting) distance for all distance function calculations. The value of this option cannot be more than the value of MAXDIST= option.","help":"MINDIST=*value*","type":"value"},{"name":"NDIST=","optional":true,"followsDelimiter":"/","description":"Specifies the number of distance bins with which to compute all the specified distance functions. This is a global option that applies to all specified distance functions. When you specify a value for this option, the SPP procedure uses this value instead of others for distance function calculations.","help":"NDIST=*value*","type":"value"},{"name":"NSIM=","optional":true,"followsDelimiter":"/","description":"Specifies a positive integer for the number of simulations to be used to compute envelopes for the CSR tests in all distance functions. When you specify this option, it applies to all specified distance functions.","help":"NSIM=*value*","type":"value"},{"name":"OUTSIM=","optional":true,"followsDelimiter":"/","description":"Specifies the name of a SAS-data-set to contain the results of simulations in distance functions. This option is ignored unless one of the distance functions is specified in the PROCESS statement.","help":"OUTSIM=*SAS-data-set*","type":"dataSet"},{"name":"PCF=","optional":true,"followsDelimiter":"/","description":"Performs a test for complete spatial randomness that is based on the pair correlation function (PCF) function. The pair correlation function is calculated only when you specify EDGECORR=ON in the PROC SPP statement. You can specify the following suboption:","help":"PCF=B=","type":"choice","arguments":[{"name":"B=","type":"value"}]},{"name":"QUADRAT","optional":true,"followsDelimiter":"/","description":"Performs a test for complete spatial randomness. You can specify value-NX and value-NY to provide a quadrat specification that includes the number of horizontal and vertical divisions. If you do not specify the number of horizontal and vertical divisions, PROC SPP computes a default quadrat of 10 x 10. By default, the QUADRAT option displays only the Pearson chi-square test for CSR. If you also specify the DETAILS suboption, then PROC SPP displays the quadrat count in addition to the Pearson residual information.","type":"standalone"}]},{"name":"TREND","description":"The TREND statement enables you to define a spatial trend covariate, where name is a standard SAS variable name that names the trend and the FIELD suboption describes the field as follows: FIELD (X-variable, Y-variable, field-variable ) specifies a spatial field variable as a trend by using any spatial field covariates that are available in the DATA= data set, where X-variable specifies the X coordinate and Y-variable specifies the Y coordinate of the spatial field. The third argument is the field-variable, which is a numeric variable in the DATA= data set.","help":"TREND name = FIELD(field-definition)"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_028","docsetTargetFile":"statug_spp_toc.htm"}}