{"name":"SSM","statements":[{"name":"PROC SSM","description":"State space models (SSMs) are used for analyzing continuous response variables that are recorded sequentially according to a numeric indexing variable. In many cases, the indexing variable is time and the observations are collected at regular time intervals—for example, hourly, weekly, or monthly. In such cases, the resulting data are called time series data. In other cases, the indexing variable might not be time or the observations might not be equally spaced according to the indexing variable. These more general types of sequential data are called longitudinal data. Because of their sequential nature, these types of data exhibit some characteristic features. For example, chronologically closer measurements tend to be highly correlated while measurements farther apart are essentially uncorrelated. Data can be trending in a particular direction and can have seasonal or other periodic patterns. SSMs are specially designed to model such sequential data. They apply to both univariate and multivariate response situations and can easily incorporate predictor (independent variable) information when it is available. † The SSM procedure performs state space modeling of univariate and multivariate time series and longitudinal data.","help":"PROC SSM <BREAKPEAKS> <DATA=SAS-data-set> <NOPRINT> <OPTIMIZER( <TECHNIQUE=technique> <MAXITER=integer>)> <PLOTS=ALL | AO | MAXSHOCK... > <PRINTALL> <STATEINFO> <ZSPARSE>;     \n\tABORT <ABEND> <CANCEL> <CANCEL FILE> ...;     \n\tARRAY specification <...> ;     \n\tBY variables; \n   \n\tCALL routine(parameter-1<, ...parameter-n>); \n   \n\tCOMPONENT <PRINT=<FILTER | SMOOTH>> ; \n   \n\tDELETE;     \n\tDEPLAG name(response-variable) lag-term1 <lag-term2 …> ;     \n\tDO <OVER> <> <> ...; \n   \n\tELSE <DO> <IF> <THEN> ...; \n   \n\tEND;     \n\tEVAL <PRINT=<FILTER | SMOOTH>> ; \n   \n\tGOTO label;     \n\tID <INTERVAL=value> ; \n   \n\tIF <DO> <THEN> <WHEN> ...; \n   \n\tIRREGULAR <PRINT=SMOOTH> <VARIANCE=variable | number> ;     \n\tLINK statement-label; \n   \n\tMODEL <PRINT=<FILTER | SMOOTH>> ; \n   \n\t;     \n\tOUTPUT <ALPHA=number> <AO(<ALPHA=number> <MAXNUM=number> <MAXPCT=number>)> <BREAK(<ALPHA=number> <MAXNUM=number> <MAXPCT=number>)> ...; \n   \n\tPARMS <LOWER=(number1 number2 …) | LOWER=(number)> <UPPER=(number1 number2 …) | UPPER=(number)> ;     \n\tPUT <_PAGE_> ; \n   \n\tRETURN;     \n\t; \n   \n\tSTATE <A1(nd)> <CHECKBREAK<( ELEMENTWISE | OVERALL)>> <COV( D ) <= (var1 var2 …) | (number1 number2 …)>COV( G ) <= (var1 var2 …) | (number1 number2 …)>COV( I ) <= (variable) | (number)>COV( RANK=integer )> ...;  \n  \n\tSTOP ;     \n\tTREND <AR= φ1 φ2 …φp> <CHECKBREAK<( ELEMENTWISE | OVERALL)>> <CROSS=(var1, var2, …) | CROSS(MATCHPARM)=(var1, var2, …)> ...; \n   \n\tWHEN <DO> ; ","arguments":[{"name":"BREAKPEAKS","optional":true,"description":"Prints an alternate form of the break summary tables when the CHECKBREAK option is used in the STATE or TREND statement or when the MAXSHOCK option is used in the OUTPUT statement. In this alternate form, the summary tables report the significant peaks of the shock statistics curves.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the name of the SAS data set that contains the variables needed for the analysis. If you do not specify this option, PROC SSM uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NOPRINT","optional":true,"description":"Turns off all the printing and plotting for the procedure. Any subsequent print options are ignored.","type":"standalone"},{"name":"OPTIMIZER=","optional":true,"description":"Specifies options that are associated with the optimizer used in the maximum likelihood parameter estimation. The default settings of the optimization process are adequate in most problems. However, in some cases it might be useful to change the optimization technique or to change the maximum number of iterations. You can specify one of the following techniques: ACTIVESET corresponds to the active-set method. DBLDOG corresponds to the double-dogleg method. INTERIORPOINT corresponds to the primal-dual interior point method. NEWRAP corresponds to the Newton-Raphson method. QUANEW corresponds to the (dual) quasi-Newton method. TRUREG corresponds to the trust region method.","help":"OPTIMIZER=TECHNIQUE= | MAXITER=","type":"choice","arguments":[{"name":"TECHNIQUE=","type":"value"},{"name":"MAXITER=","type":"value"}]},{"name":"PLOTS=","optional":true,"description":"Controls the plots produced with ODS Graphics. When you specify only one plot-request, you can omit the parentheses around it. The following global-plot-option is supported:","help":"PLOTS=ALL | AO | MAXSHOCK | NONE | RESIDUAL","type":"choice","arguments":[{"name":"ALL","description":"Produces all plots appropriate for the particular analysis.","type":"standalone"},{"name":"AO","description":"Syntax: AO< (prediction-error-plot-options)> Produces the prediction error plots—one for each response variable. You can specify the following prediction-error-plot-options: NORMAL produces a summary panel of the prediction error diagnostics, which consist of the following: o histogram of prediction errors o normal quantile plot of prediction errors STD produces a scatter plot of standardized prediction errors against time.","type":"standalone"},{"name":"MAXSHOCK","description":"Produces a scatter plot of maximal state shock statistics against time.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"RESIDUAL","description":"Syntax: RESIDUAL <(residual-plot-options)> Produces the residuals plots—one for each response variable. You can specify the following residual-plot-options: NORMAL produces a summary panel of the residual diagnostics, which consist of the following: o histogram of residuals o normal quantile plot of residuals STD produces a scatter plot of standardized residuals against time.","type":"standalone"}]},{"name":"PRINTALL","optional":true,"description":"Turns on all the printing options for the procedure. All subsequent NOPRINT options in the procedure are ignored.","type":"standalone"},{"name":"STATEINFO","optional":true,"description":"Prints two tables that provide information about the composition of the state vector in terms of the components specified in the model. One table describes the composition of state αt, and the other table describes the diffuse vector δ and the regressors, which are part of the initial condition specification α1.","type":"standalone"},{"name":"ZSPARSE","optional":true,"description":"Enables the exploitation of the sparsity of the Ζt matrices in the observation equation during the modeling calculations (see the section State Space Model and Notation for further information). The use of this option can improve the computational efficiency of models that have a large state dimension and sparse Ζt matrices—that is, many of their elements are zero. You should use the ZSPARSE option only when the state dimension is sufficiently large (at least 30) and a good percentage (at least 50%) of Ζt entries are zero; otherwise, the computational efficiency can in fact degrade. Example:","type":"standalone"}]},{"name":"ABORT","description":"Stops executing the current DATA step, SAS job, or SAS session.","help":"ABORT &lt;ABEND&gt; &lt;CANCEL&gt; &lt;CANCEL FILE&gt; ...","arguments":[{"name":"ABEND","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the ABEND option of the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment; further action is based on how your operating environment and your site treat jobs that end abnormally. o windowing environment and interactive line mode","type":"standalone"},{"name":"CANCEL","optional":true,"description":"Causes the cancellation of the current submitted statements. The results depend on the method of operation: o batch mode and noninteractive mode o The entire SAS program and SAS system are terminated. o The error message is written to the SAS log. o windowing environment and interactive line mode o It only clears the current submitted program. o Other subsequent submitted programs are not affected. o The error message is written to the SAS log. o workspace server and stored process server o It only clears currently submitted program. o Other subsequent submit calls are not affected. o The error message is written to the SAS log. o SAS IntrNet application server","type":"standalone"},{"name":"CANCEL FILE","optional":true,"description":"Causes only the contents of the autoexec file or %INCLUDE file to be cleared by the %ABORT statement. Other submitted source statements will be executed after the autoexec or %INCLUDE file.","type":"standalone"},{"name":"NOLIST","optional":true,"description":"suppresses the output of all variables to the SAS log.","type":"standalone"},{"name":"RETURN","optional":true,"description":"Causes abnormal termination of the current SAS job or session. Results depend on the method of operation: o batch mode and noninteractive mode o stops processing immediately o sends an error message to the SAS log that states that execution was terminated by the RETURN option in the ABORT macro statement o does not execute any subsequent statements or check syntax o returns control to the operating environment with a condition code indicating an error. o windowing environment and interactive line mode","type":"standalone"}]},{"name":"ARRAY","description":"An ARRAY specification is in a form as follows: name[dimension](variables) The ARRAY statement is used to associate a name with a list of variables. Each of the variables in the variable list must be defined using a VAR statement. The ARRAY statement is required when you are specifying a constraint by FOREACH statement.","help":"ARRAY specification &lt;...&gt; "},{"name":"BY","description":"A BY statement can be used in the SSM procedure to process a data set in groups of observations that are defined by the BY variables. The model specified by using the MODEL and other statements is applied to all the groups defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. The BY variables are one or more variables in the input data set. The BY variables cannot be used in the model specification; in particular, they cannot be used as response variables or regressors in a MODEL statement.","help":"BY variables"},{"name":"CALL","description":"Invokes a SAS CALL routine.","help":"CALL routine(parameter-1&lt;, ...parameter-n&gt;)"},{"name":"COMPONENT","description":"The COMPONENT statement specifies a component (a linear combination of state elements), named name. You can use name later as a term in the right-hand side of the MODEL statement, which defines the observation equation. The estimate of name is output to the OUT= data set that is specified in the OUTPUT statement. In addition, you can print the component estimate by using the PRINT= option.","help":"COMPONENT &lt;PRINT=&lt;FILTER | SMOOTH&gt;&gt; ","arguments":[{"name":"PRINT=","optional":true,"followsDelimiter":"/","description":"Requests printing of the filtered or smoothed estimate of the specified component.","help":"PRINT=FILTER | SMOOTH","type":"choice","arguments":[{"name":"FILTER","followsDelimiter":"/","description":"Requests printing of the filtered estimate of the specified component.","type":"standalone"},{"name":"SMOOTH","followsDelimiter":"/","description":"Requests printing of the smoothed estimate of the specified component.","type":"standalone"}]}]},{"name":"DELETE","description":"Stops processing the current observation.","help":"DELETE"},{"name":"DEPLAG","description":"The DEPLAG statement defines a term, named name, that consists of a linear combination of lagged response variables. You can use name later as a right-hand-side term in the MODEL statement for the response variable, as specified in name(response-variable). For a multivariate model, a separate DEPLAG statement is needed for each MODEL statement that has a right-hand-side term that involves lagged response variables. The linear combination of lagged response variables is specified by using one or more lag-terms. Each lag-term specifies the lags that are associated with one of the response variables. A lag-term is specified in one of the following forms: lag-response-variable(LAGS=maximum-lag) lag-response-variable(LAGS=(integer1 integer2 …)) lag-response-variable(LAGS=maximum-lag COEFF=(number1 number2 …) | (variable1 variable2 …)) lag-response-variable(LAGS=(integer1 integer2 …) COEFF=(number1 number2 …) | (variable1 variable2 …))","help":"DEPLAG name(response-variable) lag-term1 &lt;lag-term2 …&gt; "},{"name":"DO","description":"","help":"DO &lt;OVER&gt; &lt;&gt; &lt;&gt; ...","arguments":[{"name":"BY","optional":true,"description":"Precedes an increment integer (other than 0) or an expression that generates an integer to be added to the value of the index variable in each iteration of the DO loop.","type":"standalone"},{"name":"OVER","optional":true,"description":"","type":"standalone"},{"name":"TO","optional":true,"description":"Separates the start and stop integers or expressions that control the number of times the portion of the DATA step between the iterative DO and END statements is processed.","type":"standalone"},{"name":"UNTIL","optional":true,"description":"...more SAS statements... END","type":"standalone"},{"name":"WHILE","optional":true,"description":"","type":"standalone"}]},{"name":"ELSE","description":"If the condition in a IF-THEN statement is false and an ELSE statement is present, then the ELSE action is carried out.","help":"ELSE &lt;DO&gt; &lt;IF&gt; &lt;THEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"IF","optional":true,"description":"Executes a SAS statement for observations that meet specific conditions.","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN-ELSE construct.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"}]},{"name":"END","description":"Ends a DO group or SELECT group processing.","help":"END"},{"name":"EVAL","description":"The EVAL statement defines a linear combination, named name, of the terms used in the right-hand side of a MODEL statement. You can specify any variables (for example, predictor variables and names of components) in the expression of the EVAL statement; however, you cannot specify in this expression any observation disturbances that are specified by the IRREGULAR statement and any model terms that are specified by the DEPLAG statement. Suppose C1 and C2 are two components (defined by COMPONENT statements elsewhere in the program), T1 is a trend component, and X1 is a regression variable used in a model. The following are valid examples of the EVAL statement: eval e1 = c1 - c2; eval e2 = t1 + c1 + x1; eval e2 = t1 + 2*c1 - 1.5*x1;","help":"EVAL &lt;PRINT=&lt;FILTER | SMOOTH&gt;&gt; ","arguments":[{"name":"PRINT=","optional":true,"followsDelimiter":"/","description":"Requests printing of the filtered or smoothed estimate of the specified linear combination.","help":"PRINT=FILTER | SMOOTH","type":"choice","arguments":[{"name":"FILTER","followsDelimiter":"/","description":"Requests printing of the filtered estimateof the specified linear combination.","type":"standalone"},{"name":"SMOOTH","followsDelimiter":"/","description":"Requests printing of the smoothed estimate of the specified linear combination.","type":"standalone"}]}]},{"name":"GOTO","description":"Jumps to a new statement.","help":"GOTO label"},{"name":"ID","description":"The ID statement names a numeric variable to associate a sequence value—usually related to a time stamp—to the observations in the input data set. The observations within a BY group must be ordered in ascending order by the ID variable. Often the ID variable’s values are SAS date, time, or datetime values, and each observation within a BY group has a unique ID value. Generally, however, the ID variable can be any numeric variable, and there can be multiple observations with the same ID value. If the ID values are SAS date, time, or datetime values, you can specify the associated unit of time—for example, day, week or month—by using the INTERVAL= option. If an ID statement is not specified, the observation number, with respect to the BY group, is used as the time ID. Whenever an ID variable is specified, a variable, _ID_DELTA_, is automatically created that can be used as any input data set variable in the programming statements. _ID_DELTA_ contains the distance between two successive ID values. The first _ID_DELTA_ value is arbitrarily taken as one. If the INTERVAL= option is specified, the distance between the ID values is measured in terms of the number of intervals; therefore, for regularly spaced data, _ID_DELTA_ is identically equal to one.","help":"ID &lt;INTERVAL=value&gt; ","arguments":[{"name":"INTERVAL=","optional":true,"description":"Specifies the unit of time interval that is used for measuring the ID values. INTERVAL=value is used in conjunction with the ID variable to check that the input data are in the proper order.","help":"INTERVAL=*value*","type":"value"}]},{"name":"IF","description":"","help":"IF &lt;DO&gt; &lt;THEN&gt; &lt;WHEN&gt; ...","arguments":[{"name":"AND","optional":true,"description":"","type":"standalone"},{"name":"DO","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"GO","optional":true,"aliases":["GOTO"],"description":"Jumps to a new statement.","help":"GO TO","type":"standalone"},{"name":"NOT","optional":true,"description":"","type":"standalone"},{"name":"OR","optional":true,"description":"","type":"standalone"},{"name":"OUTPUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"PUT","optional":true,"description":"Action statement in an IF-THEN construct.","type":"standalone"},{"name":"SET","optional":true,"description":"Reads an observation from one or more SAS data sets.","type":"standalone"},{"name":"STOP","optional":true,"description":"Action statement in an IF-THEN construct. Stops execution of the current DATA step.","type":"standalone"},{"name":"THEN","optional":true,"description":"If the conditions that are specified in the IF clause are met, the IF-THEN statement executes a SAS statement for observations that are read from a SAS data set, for records in an external file, or for computed values.","type":"standalone"},{"name":"WHEN","optional":true,"description":"WHEN statement in an IF-THEN-WHEN construct.","type":"standalone"}]},{"name":"IRREGULAR","description":"The IRREGULAR statement specifies a one-dimensional white noise component, which can be used to specify the observation error in a MODEL statement.","help":"IRREGULAR &lt;PRINT=SMOOTH&gt; &lt;VARIANCE=variable | number&gt; ","arguments":[{"name":"PRINT=","optional":true,"description":"Requests printing of the smoothed estimate of the specified irregular component.","help":"PRINT=*SMOOTH*","type":"value"},{"name":"VARIANCE=","optional":true,"description":"Specifies the variance of the white noise. Any nonnegative value, including 0, is permissible. If the variable contains unknown parameters, they are estimated from the data. Similarly, if the VARIANCE= option is not specified, the variance is estimated from the data.","type":"value"}]},{"name":"LINK","description":"Directs program execution immediately to the statement label that is specified and, if followed by a RETURN statement, returns execution to the statement that follows the LINK statement.","help":"LINK statement-label"},{"name":"MODEL","description":"A MODEL statement specifies an observation equation that describes a response variable as a sum of regression effects and components that are defined in the program. The response variable must be a numeric variable from the input data set. The variables used in the right-hand side of the model expression can be numeric variables from the input data set, numeric variables defined by using programming statements, or names of components that are specified in the COMPONENT, DEPLAG, TREND, or IRREGULAR statements. For a multivariate model, a separate MODEL statement is needed for each of the response variables. In this case, the observation errors, which are specified in an IRREGULAR statement, must be different in each MODEL statement.","help":"MODEL &lt;PRINT=&lt;FILTER | SMOOTH&gt;&gt; ","arguments":[{"name":"PRINT=","optional":true,"followsDelimiter":"/","description":"Requests printing of the filtered or smoothed estimate of the specified response variable. The filtered estimate is produced during the filtering phase, and the smoothed estimate is produced by the smoothing phase of the Kalman filter and smoother algorithm. The filtered estimate is also called the one-step-ahead forecast of the response variable. The smoothed estimate corresponds to the full-sample prediction of the response variable. Since the full-sample prediction of a nonmissing response value is that value itself, full-sample predictions are printed only for the missing response values.","help":"PRINT=FILTER | SMOOTH","type":"choice","arguments":[{"name":"FILTER","followsDelimiter":"/","description":"Requests printing of the filtered estimateof the specified linear combination.","type":"standalone"},{"name":"SMOOTH","followsDelimiter":"/","description":"Requests printing of the smoothed estimate of the specified linear combination.","type":"standalone"}]}]},{"name":"OTHERWISE","description":">","help":""},{"name":"OUTPUT","description":"The OUTPUT statement creates an optional output data set and also provides options to control certain aspects of the procedure output. If the OUT= option is specified, then an output data set is created to store estimates of the model components and series forecasts. If the OUT= option is omitted, then no data set is created by the OUTPUT statement. Other options in the OUTPUT statement produce additional information in the printed output generated by the procedure. For example, the AO and BREAK options control the search for additive outliers and structural breaks in the data, respectively.","help":"OUTPUT &lt;ALPHA=number&gt; &lt;AO(&lt;ALPHA=number&gt; &lt;MAXNUM=number&gt; &lt;MAXPCT=number&gt;)&gt; &lt;BREAK(&lt;ALPHA=number&gt; &lt;MAXNUM=number&gt; &lt;MAXPCT=number&gt;)&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies the significance level of the forecast confidence intervals. For example, ALPHA=0.05, which is the default, results in a 95% confidence interval.","help":"ALPHA=*number*","type":"value"},{"name":"AO=","optional":true,"description":"Controls the additive outlier search (see the section Delete-One Cross Validation and the Additive Outlier Detection for more information). The ALPHA= suboption specifies the significance level for reporting the outliers. The default is ALPHA=0.05. The MAXNUM= suboption limits the number of outliers to search. The default is MAXNUM=5. The MAXPCT= suboption is similar to the MAXNUM= suboption. In the MAXPCT= option you can limit the number of outliers to search for according to a percentage of the series length. The default is MAXPCT=1. When you specify both of these options, the lesser of the two search numbers is used.","help":"AO=MAXNUM= | MAXPCT=","type":"choice","arguments":[{"name":"MAXNUM=","type":"value"},{"name":"MAXPCT=","type":"value"}]},{"name":"BREAK=","optional":true,"description":"Controls the structural break search (for more information, see the section Structural Breaks in the State Evolution). In order for this option to have any effect, the CHECKBREAK option in one of the STATE or TREND statements, or the MAXSHOCK option in the OUTPUT statement, must be turned on. The ALPHA= suboption specifies the significance level for reporting the breaks. The default is ALPHA=0.05. The MAXNUM= suboption limits the number of breaks to search. The default is MAXNUM=5. The MAXPCT= suboption is similar to the MAXNUM= suboption. In the MAXPCT= option, you can limit the number of breaks to search for according to a percentage of the number of distinct time points in the data. The default is MAXPCT=1. When you specify both of these options, the lesser of the two search numbers is used.","help":"BREAK=MAXNUM= | MAXPCT=","type":"choice","arguments":[{"name":"MAXNUM=","type":"value"},{"name":"MAXPCT=","type":"value"}]},{"name":"MAXSHOCK","optional":true,"description":"Causes the computation of the maximal state shock chi-square statistic at each distinct time point in the input data set. These statistics are output to the data set that is specified in the OUT= option. A time series plot of these statistics is produced if the PLOTS=MAXSHOCK option is specified in the PROC SSM statement. These statistics are useful for detecting structural breaks in the state evolution process. This option can be computationally expensive for a model with large state size.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies an output data set for the forecasts. The output data set contains the ID variable (if specified), the response variables, the one-step-ahead and out-of-sample response variable forecasts, the forecast confidence intervals, the smoothed values of the response series, and the one-step-ahead and smoothed estimates of the model components—including expressions that are defined by using the EVAL statement.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PDV","optional":true,"description":"Causes the inclusion of the variables (variables in the program data vector) that are defined by using the programming statements in the SSM procedure in the OUT= data set. The parameters defined by the PARMS statement are also included. The output data set contains the values of these variables evaluated for all the rows in the input data set that is specified in the DATA= option. The parameters in the PARMS statement contain their estimated values.","type":"standalone"},{"name":"PRESS","optional":true,"description":"Prints the prediction error sum of squares (PRESS) and the generalized cross validation error sum of squares (GCV). The PRESS table also reports the number of summands that are used in these sums of squares.","type":"standalone"}]},{"name":"PARMS","description":"The PARMS statement declares the parameters of a model and optionally sets their initial values. You can also specify the lower and upper limits of their validity range. The parameters declared by using the PARMS statement are called named parameters throughout this chapter. A model can have additional parameters: any unspecified quantity in the model specification becomes part of the parameter vector.","help":"PARMS &lt;LOWER=(number1 number2 …) | LOWER=(number)&gt; &lt;UPPER=(number1 number2 …) | UPPER=(number)&gt; ","arguments":[{"name":"LOWER=","optional":true,"followsDelimiter":"/","description":"Specifies the lower bounds for the specified parameters. The list can contain exactly one number, which is taken to be the lower bound for all the listed parameters in the statement, or it must contain as many values as the number of parameters specified. A missing value, denoted by ., is a permissible value, which signifies that the parameter has no lower bound.","type":"value"},{"name":"UPPER=","optional":true,"followsDelimiter":"/","description":"Specifies the upper bounds for the specified parameters. The list can contain exactly one number, which is taken to be the upper bound for all the listed parameters in the statement, or it must contain as many values as the number of parameters specified. A missing value, denoted by ., is a permissible value, which signifies that the parameter has no upper bound.","type":"value"}]},{"name":"PUT","description":"The PUT statement writes text data to the current output file.","help":"PUT &lt;_PAGE_&gt; ","arguments":[{"name":"_PAGE_","optional":true,"description":"Outputs any pending line data and moves to the top of the next page.","type":"standalone"}]},{"name":"RETURN","description":"Stops executing statements at the current point in the DATA step and returns to a predetermined point in the step.","help":"RETURN"},{"name":"SELECT","description":"","help":""},{"name":"STATE","description":"The STATE statement specifies a subsection of αt, the overall state vector at time t. It is assumed that the subsections that are specified by using different STATE statements are mutually independent.","help":"STATE &lt;A1(nd)&gt; &lt;CHECKBREAK&lt;( ELEMENTWISE | OVERALL)&gt;&gt; &lt;COV( D ) &lt;= (var1 var2 …) | (number1 number2 …)&gt;COV( G ) &lt;= (var1 var2 …) | (number1 number2 …)&gt;COV( I ) &lt;= (variable) | (number)&gt;COV( RANK=integer )&gt; ...","arguments":[{"name":"A1","optional":true,"description":"Specifies that the last nd elements of the state subsection be treated as diffuse. This becomes the dimension of the relevant subsection of the diffuse vector δ.","type":"standalone"},{"name":"CHECKBREAK=","optional":true,"description":"Turns on the checking of breaks for this state subsection. The ELEMENTWISE suboption requests the elementwise checking of any unexpected change in the state subsection as it evolves from one time point to the next. The OVERALL suboption requests a similar check for the entire state subsection—that is, in this case the change is measured as a multidimensional change. The ELEMENTWISE suboption is the default. Unless the PRINT=BREAKDETAIL option is specified, only a summary of the most significant breaks is produced. If the PRINT=BREAKDETAIL is specified, tables that contain the break significance statistics at every distinct time point are produced—one for the ELEMENTWISE suboption and one for the OVERALL suboption.","help":"CHECKBREAK=ELEMENTWISE | OVERALL","type":"choice","arguments":[{"name":"ELEMENTWISE","type":"standalone"},{"name":"OVERALL","type":"standalone"}]},{"name":"COV=","optional":true,"description":"Specifies the relevant block of the disturbance covariance Qt (for t >= 2) in the transition equation. As with the T option, the absence of this option signifies that this Q-block consists of only zeros. The structure of the Q-block is also similarly specified. However, the following differences exist: o The list that is specified to form the covariance must result in a symmetric, positive semidefinite matrix. o You can specify a rank constraint on the Q-block by specifying COV(RANK=integer), where the specified integer must lie between 1 and dim. A rank constraint is permissible only for the general form and only when its elements are not specified by using a list.","help":"COV=RANK=","type":"choice","arguments":[{"name":"RANK=","type":"value"}]},{"name":"COV1=","optional":true,"description":"Specifies the relevant block of the initial state covariance Q1. The different options in this case have the same meaning as the options of the COV option. However, the following differences exist: o If the elements of Q1 are specified by a list of variables in parentheses, then these variables must evaluate to constant values. In particular, they can depend on parameters that are specified by the PARMS statements; however, they cannot depend on any of the input data columns.","help":"COV1=RANK=","type":"choice","arguments":[{"name":"RANK=","type":"value"}]},{"name":"PRINT=","optional":true,"description":"Requests printing of the respective system matrices and the printing of the break statistics at each distinct time point. You can specify PRINT=AR or PRINT=MA only if you specify the TYPE=VARMA option. If any of these matrices are time-varying, the matrix that corresponds to the first time instance is printed. For the BREAKDETAIL suboption to have any effect, the CHECKBREAK option must be turned on. If TYPE= option is used, the result of PRINT=COV can be different than the matrix supplied in the COV= option.","help":"PRINT=AR | BREAKDETAIL | COV | COV1 | MA | T","type":"choice","arguments":[{"name":"AR","description":"Specify this option only if you specify the TYPE=VARMA option.","type":"standalone"},{"name":"BREAKDETAIL","description":"For this option to take effect, the CHECKBREAK option must be turned on.","type":"standalone"},{"name":"COV","description":"If TYPE= option is used, the result of PRINT=COV can be different than the matrix supplied in the COV= option.","type":"standalone"},{"name":"COV1","description":"If TYPE= option is used, the result of PRINT=COV can be different than the matrix supplied in the COV= option.","type":"standalone"},{"name":"MA","description":"Specify this option only if you specify the TYPE=VARMA option.","type":"standalone"},{"name":"T","description":"Requests printing of the break statistics at each distinct time point.","type":"standalone"}]},{"name":"SINPUT=","optional":true,"description":"Specifies the relevant dim-dimensional block of the state input vector Ct. The absence of this option signifies that this block of the Ct vector consists of only zeros. If the elements of Ct are specified by a list of variables in parentheses, then these variables must be independent of unknown parameters. In particular, they cannot be functions of parameters that are defined by the PARMS statements.","type":"value"},{"name":"T","optional":true,"description":"Specifies the relevant block of the transition matrix Tt. The absence of this option signifies that this block consists of only zeros. You can specify the structure of the T-block by specifying T(I) for the identity form, T(D) for the diagonal form, and T(G) for a general unstructured form. In addition, you can explicitly specify the entries of the T-block by specifying a list of numbers in parentheses, or by specifying in parentheses a list of variables that are defined by using the programming statements. The unspecified elements of the T-block are included in the list of parameters to be estimated from the data. If the elements of the T-block are supplied by a list in parentheses, the number of elements in the list depends on its structure.","type":"standalone"},{"name":"TYPE=","optional":true,"description":"Syntax: TYPE=WN TYPE=RW TYPE=LL <(SLOPECOV(I | D | G) <= (var1, var2, …) | (number1, number2, …)> )> TYPE=LL (SLOPECOV( RANK=integer) ) TYPE=SEASON (LENGTH=integer <DROPH=number-list> <KEEPH=number-list> ) TYPE=CYCLE <( <CT> <RHO=variable | number> <PERIOD=variable | number> )> TYPE=VARMA ( <p <(I | D)> =integer> <q<(D)>=integer> )","help":"TYPE=RW | LL | SEASON | CYCLE | VARMA*WN*","type":"value","arguments":[{"name":"RW","description":"dim-variate random walk","type":"standalone"},{"name":"LL","description":"Syntax: TYPE=LL <(SLOPECOV(I | D | G) <= (var1, var2, …) | (number1, number2, …)> )> Syntax: LL (SLOPECOV( RANK=integer) ) dim-variate local linear","type":"standalone"},{"name":"SEASON","description":"Syntax: SEASON (LENGTH=integer <DROPH=number-list> <KEEPH=number-list> ) dim-variate season","type":"standalone"},{"name":"CYCLE","description":"Syntax: CYCLE <( <CT> <RHO=variable | number> <PERIOD=variable | number> )> dim-variate cycle","type":"standalone"},{"name":"VARMA","description":"Syntax: VARMA ( <p <(I | D)> =integer> <q<(D)> =integer> ) dim-variate VARMA","type":"standalone"}]},{"name":"W","optional":true,"description":"Syntax: W(D)= (var1 var2 …) | (number1 number2 …) W(G)= (var1 var2 …) | (number1 number2 …) W(I) <= (variable) | (number) >","type":"standalone"}]},{"name":"STOP","description":"The STOP statement halts the execution of all statements that contain it, including DO statements and other control or looping statements. Execution continues with the next top-level source statement.","help":"STOP "},{"name":"TREND","description":"The TREND statement defines a term in the model that follows a stochastic pattern of a certain predefined type. The options in the TREND statement enable you to specify a wide variety of commonly used stochastic patterns. Each TREND statement in effect stands for a special pair of STATE and COMPONENT statements. You can specify more than one TREND statement. Each separate TREND statement defines a component that is assumed to be independent of all other component specifications in the model. Very often the TREND statement is used to specify a component that captures the time-varying level of the data. However, in many cases it is also used to define components of a more general nature; for example, it can be used to define a noise component that follows a stationary ARMA model.","help":"TREND &lt;AR= φ1 φ2 …φp&gt; &lt;CHECKBREAK&lt;( ELEMENTWISE | OVERALL)&gt;&gt; &lt;CROSS=(var1, var2, …) | CROSS(MATCHPARM)=(var1, var2, …)&gt; ...","arguments":[{"name":"AR=","optional":true,"description":"Lists the values of the coefficients of the nonseasonal autoregressive polynomial.","type":"value"},{"name":"CHECKBREAK=","optional":true,"description":"Turns on the checking of breaks for this trend component. The ELEMENTWISE suboption requests the elementwise checking of any unexpected change in the state subsection that is associated with the trend component. The OVERALL suboption requests a similar check for the entire state subsection—that is, in this case the change is measured as a multidimensional change. The ELEMENTWISE suboption is the default. Unless the PRINT=BREAKDETAIL option is specified, only a summary of the most significant breaks is produced. If the PRINT=BREAKDETAIL is specified, tables that contain the break significance statistics at every distinct time point are produced—one for the ELEMENTWISE suboption and one for the OVERALL suboption. If the CROSS= option is specified and the CROSS= list contains more than one variable, the OVERALL suboption considers subsections that are associated with each CROSS= variable separately.","help":"CHECKBREAK=ELEMENTWISE | OVERALL","type":"choice","arguments":[{"name":"ELEMENTWISE","type":"standalone"},{"name":"OVERALL","type":"standalone"}]},{"name":"CROSS=","optional":true,"description":"Creates a linear combination of one or more independent trend components that is based on the variables in the list. If the parameters of the trend are specified by options such as the LEVELVAR= option or the PHI= option, these parameters are shared by these constituent trends.","help":"CROSS=MATCHPARM","type":"choice","arguments":[{"name":"MATCHPARM","type":"standalone"}]},{"name":"LEVELVAR=","optional":true,"description":"Specifies the disturbance variance parameter for all the trend types.","type":"value"},{"name":"NODIFFUSE","optional":true,"description":"Causes the diffuse elements in the initial state of the state subsection underlying the trend component to be treated as nondiffuse. This option is applicable to all trend types except ARIMA. For the ARIMA trend type, this option is ignored even if the nonseasonal or seasonal differencing orders are nonzero. The diffuse elements are assumed to be independent, zero-mean, Gaussian variables. Their variances become part of the parameter vector and are estimated by using the data. This option is useful for creating a trend component that can be interpreted as a deviation from an overall trend component (with diffuse initialization), which is defined separately.","type":"standalone"},{"name":"PHI=","optional":true,"description":"Specifies the value of φ for trend types DLL, DECAY, DECAY(OU), GROWTH, and GROWTH(OU). For the type DLL, the specified value must be between 0.0 and 1.0. For types DECAY and DECAY(OU), φ must be strictly negative. For types GROWTH and GROWTH(OU), φ must be strictly positive. If variable contains unknown parameters, they are estimated from the data. Similarly, if the PHI= option is not specified, φ is estimated from the data.","type":"value"},{"name":"PRINT=","optional":true,"description":"Requests printing of the respective system matrices of the state equation that underlies the specified trend, the printing of its filtered and smoothed estimates, and the printing of the break statistics at each distinct time point. For the BREAKDETAIL suboption to have any effect, the CHECKBREAK option must be turned on. If any of these matrices are time-varying, the matrix that corresponds to the first time instance is printed.","help":"PRINT=BREAKDETAIL | COV | COV1 | FILTER | SMOOTH | T","type":"choice","arguments":[{"name":"BREAKDETAIL","description":"For this option to take effect, the CHECKBREAK option must be turned on.","type":"standalone"},{"name":"COV","description":"If TYPE= option is used, the result of PRINT=COV can be different than the matrix supplied in the COV= option.","type":"standalone"},{"name":"COV1","description":"If TYPE= option is used, the result of PRINT=COV1 can be different than the matrix supplied in the COV1= option.","type":"standalone"},{"name":"FILTER","description":"Requests printing of the filtered estimate of the respective system matrices of the state equation that underlies the specified trend.","type":"standalone"},{"name":"SMOOTH","description":"Requests printing of the smoothed estimate of the respective system matrices of the state equation that underlies the specified trend.","type":"standalone"},{"name":"T","description":"Requests printing of the the printing of the break statistics at each distinct time point.","type":"standalone"}]},{"name":"SAR=","optional":true,"description":"Lists the values of the coefficients of the seasonal autoregressive polynomial.","type":"value"},{"name":"SLOPEVAR=","optional":true,"description":"Specifies the second disturbance variance parameter for trend types LL and DLL. Any nonnegative value, including 0, is permissible. If variable contains unknown parameters, they are estimated from the data.","type":"value"},{"name":"SMA=","optional":true,"description":"Lists the values of the coefficients of the seasonal moving average polynomial.","type":"value"}]},{"name":"WHEN","description":"","help":"WHEN &lt;DO&gt; ","arguments":[{"name":"DO","optional":true,"description":"","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"v_010","docsetTargetFile":"etsug_ssm_toc.htm"}}