{"name":"STATESPACE","statements":[{"name":"PROC STATESPACE","description":"The STATESPACE procedure uses the state space model to analyze and forecast multivariate time series. The STATESPACE procedure is appropriate for jointly forecasting several related time series that have dynamic interactions. By taking into account the autocorrelations among all the variables in a set, the STATESPACE procedure can give better forecasts than methods that model each series separately. † By default, the STATESPACE procedure automatically selects a state space model appropriate for the time series, making the procedure a good tool for automatic forecasting of multivariate time series. Alternatively, you can specify the state space model by giving the form of the state vector and the state transition and innovation matrices.","help":"PROC STATESPACE <ARMAX=n> <BACK=n> <CANCORR> <COVB> <DATA=SAS-data-set> <DETTOL=value> <DIMMAX=n> <INTERVAL=interval> <INTPER=n> <ITPRINT> <KLAG=n> <LAGMAX=k> <LEAD=n> <MAXIT=n> <MINIC> <NOCENTER> <NOEST> <NOPRINT> <OUT=SAS-data-set> <OUTAR=SAS-data-set> <OUTMODEL=SAS-data-set> <PARMTOL=value> <PASTMIN=n> <PRINT> <PRINTOUT=SHORT | LONG | NONE> <RESIDEST> <SIGCORR=value> <SINGULAR=value>;     \n\tBY variable ... ;\n    \n\tFORM variable value ... ;\n    \n\tID variable ;\n    \n\tINITIAL <F(row,column)=value> <G(row,column)=value> ;\n    \n\tRESTRICT <F (row,column)= value> <G (row,column)= value> ;\n    \n\tVAR variable (difference, difference, ...) ... ;\n","arguments":[{"name":"ARMAX=","optional":true,"description":"Specifies the maximum order of the preliminary autoregressive models. The ARMAX= option controls the autoregressive orders for which information criteria are printed, and controls the number of lags printed in the schematic representation of partial autocorrelations. The default is ARMAX=10.","help":"ARMAX=*n*","type":"value"},{"name":"BACK=","optional":true,"description":"Starts forecasting n periods before the end of the input data. The BACK= option value must not be greater than the number of observations. The default is BACK=0.","help":"BACK=*n*","type":"value"},{"name":"CANCORR","optional":true,"description":"Prints the canonical correlations and information criterion for each candidate state vector considered.","type":"standalone"},{"name":"COVB","optional":true,"description":"Prints the inverse of the observed information matrix for the parameter estimates. This matrix is an estimate of the covariance matrix for the parameter estimates.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the name of the SAS data set to be used by the procedure. If the DATA= option is omitted, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DETTOL=","optional":true,"description":"Specifies the convergence criterion. The DETTOL= and PARMTOL= option values are used together to test for convergence of the estimation process. If, during an iteration, the relative change of the parameter estimates is less than the PARMTOL= value and the relative change of the determinant of the innovation variance matrix is less than the DETTOL= value, then iteration ceases and the current estimates are accepted. The default is DETTOL=1E–5.","help":"DETTOL=*value*","type":"value"},{"name":"DIMMAX=","optional":true,"description":"Specifies the upper limit to the dimension of the state vector. The DIMMAX= option can be used to limit the size of the model selected. The default is DIMMAX=10.","help":"DIMMAX=*n*","type":"value"},{"name":"INTERVAL=","optional":true,"description":"Specifies the time interval between observations. The INTERVAL= value is used in conjunction with the ID variable to check that the input data are in order and have no missing periods. The INTERVAL= option is also used to extrapolate the ID values past the end of the input data.","help":"INTERVAL=*interval*","type":"value"},{"name":"INTPER=","optional":true,"description":"Specifies that each input observation corresponds to n time periods. For example, the options INTERVAL=MONTH and INTPER=2 specify bimonthly data and are equivalent to specifying INTERVAL=MONTH2. If the INTERVAL= option is not specified, the INTPER= option controls the increment used to generate ID values for the forecast observations. The default is INTPER=1.","help":"INTPER=*n*","type":"value"},{"name":"ITPRINT","optional":true,"description":"Prints the iterations during the estimation process.","type":"standalone"},{"name":"KLAG=","optional":true,"description":"Sets an upper limit for the number of lags of the sample autocovariance matrix used in computing the approximate likelihood function. If the data have a strong moving average character, a larger KLAG= value might be necessary to obtain good estimates. The default is KLAG=15.","help":"KLAG=*n*","type":"value"},{"name":"LAGMAX=","optional":true,"description":"Specifies the number of lags for which the sample autocovariance matrix is computed. The LAGMAX= option controls the number of lags printed in the schematic representation of the autocorrelations.","help":"LAGMAX=*k*","type":"value"},{"name":"LEAD=","optional":true,"description":"Specifies how many forecast observations are produced. The forecasts start at the point set by the BACK= option. The default is LEAD=0, which produces no forecasts.","help":"LEAD=*n*","type":"value"},{"name":"MAXIT=","optional":true,"description":"Sets an upper limit to the number of iterations in the maximum likelihood or conditional least squares estimation. The default is MAXIT=50.","help":"MAXIT=*n*","type":"value"},{"name":"MINIC","optional":true,"description":"Writes to the OUTAR= data set only the preliminary Yule-Walker estimates for the VAR model that produces the minimum AIC.","type":"standalone"},{"name":"NOCENTER","optional":true,"description":"Prevents subtraction of the sample mean from the input series (after any specified differencing) before the analysis.","type":"standalone"},{"name":"NOEST","optional":true,"description":"Suppresses the final maximum likelihood estimation of the selected model.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses all printed output.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Writes the residuals, actual values, forecasts, and forecast standard errors to a SAS data set.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTAR=","optional":true,"description":"Writes the Yule-Walker estimates of the preliminary autoregressive models to a SAS data set.","help":"OUTAR=*SAS-data-set*","type":"dataSet"},{"name":"OUTMODEL=","optional":true,"description":"Writes the parameter estimates and their standard errors to a SAS data set.","help":"OUTMODEL=*SAS-data-set*","type":"dataSet"},{"name":"PARMTOL=","optional":true,"description":"Specifies the convergence criterion. The DETTOL= and PARMTOL= option values are used together to test for convergence of the estimation process. If, during an iteration, the relative change of the parameter estimates is less than the PARMTOL= value and the relative change of the determinant of the innovation variance matrix is less than the DETTOL= value, then iteration ceases and the current estimates are accepted. The default is PARMTOL=0.001.","help":"PARMTOL=*value*","type":"value"},{"name":"PASTMIN=","optional":true,"description":"Specifies the minimum number of lags to include in the canonical correlation analysis. The default is PASTMIN=0.","help":"PASTMIN=*n*","type":"value"},{"name":"PRINT","optional":true,"description":"Prints the forecasts.","type":"standalone"},{"name":"PRINTOUT=","optional":true,"description":"Determines the amount of detail printed.","help":"PRINTOUT=SHORT | LONG | NONE","type":"choice","arguments":[{"name":"SHORT","description":"Prints the output for the preliminary autoregressive models, and rhe descriptive statistics and state space model estimation output. This is the default.","type":"standalone"},{"name":"LONG","description":"Prints the lagged covariance matrices, the partial autoregressive matrices, and estimates of the residual covariance matrices from the sequence of autoregressive models.","type":"standalone"},{"name":"NONE","description":"Suppresses the output for the preliminary autoregressive models. The descriptive statistics and state space model estimation output are still printed.","type":"standalone"}]},{"name":"RESIDEST","optional":true,"description":"Computes the final estimates by using conditional least squares on the raw data. This type of estimation might be more stable than the default maximum likelihood method but is usually more computationally expensive.","type":"standalone"},{"name":"SIGCORR=","optional":true,"description":"Specifies the multiplier of the degrees of freedom for the penalty term in the information criterion used to select the state space form. The default is SIGCORR=2. The larger the value of the SIGCORR= option, the smaller the state vector tends to be. Hence, a large value causes a simpler model to be fit.","help":"SIGCORR=*value*","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Specifies the criterion for testing for singularity of a matrix. A matrix is declared singular if a scaled pivot is less than the SINGULAR= value when sweeping the matrix. The default is SINGULAR=1E–7.","help":"SINGULAR=*value*","type":"value"}]},{"name":"BY","description":"A BY statement can be used with the STATESPACE procedure to obtain separate analyses on observations in groups defined by the BY variables.","help":"BY variable ... "},{"name":"FORM","description":"The FORM statement specifies the number of times a variable is included in the state vector. Values can be specified for any variable listed in the VAR statement. If a value is specified for each variable in the VAR statement, the state vector for the state space model is entirely specified, and automatic selection of the state space model is not performed. The following statements illustrate the use of the FORM statement: proc statespace data=in; var x y; form x 3 y 2; run;","help":"FORM variable value ... "},{"name":"ID","description":"The ID statement specifies a variable that identifies observations in the input data set. The variable specified in the ID statement is included in the OUT= data set. The values of the ID variable are extrapolated for the forecast observations based on the values of the INTERVAL= and INTPER= options.","help":"ID variable "},{"name":"INITIAL","description":"The INITIAL statement gives initial values to the specified elements of the F and G matrices. These initial values are used as starting values for the iterative estimation.","help":"INITIAL &lt;F(row,column)=value&gt; &lt;G(row,column)=value&gt; ","arguments":[{"name":"F=","optional":true,"description":"Initializes the specified elements of the F matrix to the specified value.","type":"value"},{"name":"G=","optional":true,"description":"Initializes the specified elements of the G matrix to the specified value.","type":"value"}]},{"name":"RESTRICT","description":"The RESTRICT statement restricts the specified elements of the F and G matrices to the specified values. To use the restrict statement, you need to know the form of the model. Either specify the form of the model with the FORM statement, or do a preliminary run (perhaps with the NOEST option) to find the form of the model that PROC STATESPACE selects for the data. The following is an example of a RESTRICT statement: restrict f(3,2)=0 g(4,1)=0 g(5,1)=0 ;","help":"RESTRICT &lt;F (row,column)= value&gt; &lt;G (row,column)= value&gt; ","arguments":[{"name":"F=","optional":true,"description":"Restricts the specified elements of the F matrix to the specified value.","type":"value"},{"name":"G=","optional":true,"description":"Restricts the specified elements of the G matrix to the specified value.","type":"value"}]},{"name":"VAR","description":"The VAR statement specifies the variables in the input data set to model and forecast. The VAR statement also specifies differencing of the input variables. The VAR statement is required. Differencing is specified by following the variable name with a list of difference periods separated by commas. The order in which variables are listed in the VAR statement controls the order in which variables are included in the state vector. Usually, potential inputs should be listed before potential outputs.","help":"VAR variable (difference, difference, ...) ... "}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"latest","docsetTargetFile":"etsug_statespa_toc.htm"}}