{"name":"SURVEYSELECT","statements":[{"name":"PROC SURVEYSELECT","description":"The SURVEYSELECT procedure provides a variety of methods for selecting probability-based random samples. The procedure can select a simple random sample or can sample according to a complex multistage sample design that includes stratification, clustering, and unequal probabilities of selection. With probability sampling, each unit in the survey population has a known, positive probability of selection. This property of probability sampling avoids selection bias and enables you to use statistical theory to make valid inferences from the sample to the survey population. † PROC SURVEYSELECT provides the following equal probability sampling methods: o simple random sampling (without replacement) o unrestricted random sampling (with replacement) o systematic random sampling o sequential random sampling o Bernoulli sampling † This procedure also provides the following probability proportional to size (PPS) methods: o PPS sampling without replacement o PPS sampling with replacement o PPS systematic sampling o PPS algorithms for selecting two units per stratum o sequential PPS sampling with minimum replacement","help":"PROC SURVEYSELECT <CERTSIZE><CERTSIZE=certain | CERTSIZE=SAS-data-set | CERTSIZE=P><DATA=SAS-data-set><JTPROBS><MAXSIZE><MAXSIZE=max | MAXSIZE=SAS-data-set><METHOD=PPS | PPS_BREWER | PPS_MURTHY... ><MINSIZE><MINSIZE=min | MINSIZE=SAS-data-set><NMAX=n><NMIN=n><NOPRINT><OUT=SAS-data-set><OUTALL><OUTHITS><OUTSEED><OUTSIZE><OUTSORT=SAS-data-set><REPS=nreps><SAMPRATE=r | SAMPRATE=(values) | SAMPRATE=SAS-data-set><SAMPSIZE=n | SAMPSIZE=(values) | SAMPSIZE=SAS-data-set><SEED=number | SEED=SAS-data-set><SELECTALL><SORT=NEST | SERP><STATS>;     \n\tCONTROL variables ;\n\tFREQ variable ;\n\tID variables ;\n\tSAMPLINGUNIT <PPS><PRESORTED> ;\n\tSIZE variable ;\n\tSTRATA <ALLOC=<PROPORTIONAL | OPTIMAL | NEYMAN>... ><COST><COST=(values) | SAS-data-set> ...;","arguments":[{"name":"CERTSIZE","optional":true,"description":"Requests certainty selection, where the certainty size values are provided in the secondary input data set.","type":"standalone"},{"name":"CERTSIZE=","optional":true,"description":"Specifies the certainty size value, or names a SAS data set that contains certainty size values for the strata; or specifies the certainty proportion p.","type":"value"},{"name":"DATA=","optional":true,"description":"","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"JTPROBS","optional":true,"description":"Includes joint probabilities of selection in the OUT= output data set.","type":"standalone"},{"name":"MAXSIZE","optional":true,"description":"Requests adjustment of size measures according to the stratum maximum size values provided in the secondary input data set.","type":"standalone"},{"name":"MAXSIZE=","optional":true,"description":"Specifies the maximum size value, or names a SAS data set that contains the maximum size values for the strata.","type":"value"},{"name":"METHOD=","optional":true,"aliases":["M="],"description":"Specifies the method for sample selection.","help":"METHOD=PPS | PPS_BREWER | PPS_MURTHY | PPS_SAMPFORD | PPS_SEQ | PPS_SYS | PPS_WR | SEQ | SRS | SYS | URS","type":"choice","arguments":[{"name":"PPS","description":"Requests selection with probability proportional to size and without replacement.","type":"standalone"},{"name":"PPS_BREWER","description":"Requests selection according to Brewer’s method.","type":"standalone"},{"name":"PPS_MURTHY","description":"Requests selection according to Murthy’s method.","type":"standalone"},{"name":"PPS_SAMPFORD","description":"Requests selection according to Sampford’s method.","type":"standalone"},{"name":"PPS_SEQ","description":"Requests sequential selection with probability proportional to size and with minimum replacement.","type":"standalone"},{"name":"PPS_SYS","description":"Requests systematic selection with probability proportional to size.","type":"standalone"},{"name":"PPS_WR","description":"Requests selection with probability proportional to size and with replacement.","type":"standalone"},{"name":"SEQ","description":"Requests sequential selection according to Chromy’s method.","type":"standalone"},{"name":"SRS","description":"Requests simple random sampling, which is selection with equal probability and without replacement.","type":"standalone"},{"name":"SYS","description":"Requests systematic random sampling.","type":"standalone"},{"name":"URS","description":"Requests unrestricted random sampling, which is selection with equal probability and with replacement.","type":"standalone"}]},{"name":"MINSIZE","optional":true,"description":"Requests adjustment of size measures according to the stratum minimum size values provided in the secondary input data set.","type":"standalone"},{"name":"MINSIZE=","optional":true,"description":"Specifies the minimum size value, or names a SAS data set that contains the minimum size values for the strata.","type":"value"},{"name":"NMAX=","optional":true,"description":"Specifies the maximum stratum sample size n for the SAMPRATE= option.","help":"NMAX=*n*","type":"value"},{"name":"NMIN=","optional":true,"description":"Specifies the minimum stratum sample size n for the SAMPRATE= option. When you specify the SAMPRATE= option, PROC SURVEYSELECT calculates the stratum sample size by multiplying the total number of units in the stratum by the specified sampling rate. If this sample size is less than the value NMIN=n, then PROC SURVEYSELECT selects n units.","help":"NMIN=*n*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the display of all output.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Names the output data set that contains the sample.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"OUTALL","optional":true,"description":"Includes all observations from the input data set in the output data set.","type":"standalone"},{"name":"OUTHITS","optional":true,"description":"Includes a separate observation in the output data set for each selection when the same unit is selected more than once.","type":"standalone"},{"name":"OUTSEED","optional":true,"description":"Includes the initial seed for each stratum in the output data set.","type":"standalone"},{"name":"OUTSIZE","optional":true,"description":"Includes additional design and sampling frame parameters in the output data set.","type":"standalone"},{"name":"OUTSORT=","optional":true,"description":"Names an output data set that contains the sorted input data set.","help":"OUTSORT=*SAS-data-set*","type":"dataSet"},{"name":"REPS=","optional":true,"description":"Specifies the number of sample replicates. The value of nreps must be a positive integer.","help":"REPS=*nreps*","type":"value"},{"name":"SAMPRATE=","optional":true,"aliases":["RATE="],"description":"Specifies the sampling rate, or stratum sampling rates (separated with blanks or commas), or names a SAS data set that contains stratum sampling rates.","type":"value"},{"name":"SAMPSIZE=","optional":true,"aliases":["N="],"description":"Specifies the sample size, or sample sizes for the strata (separated with blanks or commas), or names a SAS data set that contains the sample sizes for the strata.","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies the initial seed for random number generation, or names a SAS data set that contains initial seeds for the strata.","type":"value"},{"name":"SELECTALL","optional":true,"description":"Requests that PROC SURVEYSELECT select all stratum units when the stratum sample size exceeds the total number of units in the stratum.","type":"standalone"},{"name":"SORT=","optional":true,"description":"Specifies the type of sorting by CONTROL variables.","help":"SORT=NEST | SERP","type":"choice","arguments":[{"name":"NEST","description":"Requests nested sorting.","type":"standalone"},{"name":"SERP","description":"Requests hierarchic serpentine sorting.","type":"standalone"}]},{"name":"STATS","optional":true,"description":"Includes selection probabilities and sampling weights in the OUT= output data set for equal probability selection methods when you do not specify a STRATA statement.","type":"standalone"}]},{"name":"CONTROL","description":"The CONTROL statement names variables for sorting the input data set before sample selection. The CONTROL variables can be character or numeric. If you also specify a STRATA statement, PROC SURVEYSELECT sorts by CONTROL variables within strata.","help":"CONTROL variables "},{"name":"FREQ","description":"The FREQ statement names a numeric variable that contains the frequency of occurrence of each observation. If you use a FREQ statement, PROC SURVEYSELECT assumes that an observation represents n observations, where n is the value of the FREQ variable for the observation. The FREQ statement is not available when you specify a SAMPLINGUNIT statement.","help":"FREQ variable "},{"name":"ID","description":"The ID statement names one or more variables from the DATA= input data set to include in the OUT= output data set of selected units. If there is no ID statement, PROC SURVEYSELECT includes all variables from the input data set in the output data set. The ID variables can be either character or numeric.","help":"ID variables "},{"name":"SAMPLINGUNIT","aliases":["CLUSTER"],"description":"The SAMPLINGUNIT statement names variables that identify the sampling units as groups of observations (clusters). The combinations of categories of SAMPLINGUNIT variables define the sampling units. If there is a STRATA statement, sampling units are nested within strata. When you use a SAMPLINGUNIT statement to define units (clusters), PROC SURVEYSELECT selects a sample of these units by using the selection method and design parameters that you specify in the PROC SURVEYSELECT statement. If you do not use a SAMPLINGUNIT statement, then PROC SURVEYSELECT uses the input data set observations as sampling units by default. The SAMPLINGUNIT variables are one or more variables in the DATA= input data set. These variables can be either character or numeric. The formatted values of the SAMPLINGUNIT variables determine the SAMPLINGUNIT variable levels. Thus, you can use formats to group values into levels.","help":"SAMPLINGUNIT &lt;PPS&gt;&lt;PRESORTED&gt;","arguments":[{"name":"PPS","optional":true,"followsDelimiter":"/","description":"Computes a sampling unit’s size measure as the number of observations in the sampling unit. The procedure then uses these size measures to select a sample according to the PPS selection method that you specify with the METHOD= option in the PROC SURVEYSELECT statement.","type":"standalone"},{"name":"PRESORTED","optional":true,"followsDelimiter":"/","description":"Requests that PROC SURVEYSELECT not sort the input data set by the SAMPLINGUNIT variables within strata. By default, the procedure sorts the input data set by the SAMPLINGUNIT variables, which groups the observations into sampling units and orders the units by the SAMPLINGUNIT variables.","type":"standalone"}]},{"name":"SIZE","description":"The SIZE statement names one and only one size measure variable, which contains the sampling unit size measures that are used for selection with probability proportional to size.","help":"SIZE variable "},{"name":"STRATA","aliases":["STRATUM"],"description":"You can specify a STRATA statement to partition the input data set into nonoverlapping groups defined by the STRATA variables.","help":"STRATA &lt;ALLOC=&lt;PROPORTIONAL | OPTIMAL | NEYMAN&gt;... &gt;&lt;COST&gt;&lt;COST=(values) | SAS-data-set&gt; ...","arguments":[{"name":"ALLOC=","optional":true,"followsDelimiter":"/","aliases":["ALLOCATE="],"description":"Specifies the method for allocating the total sample size among the strata.","help":"ALLOC=PROPORTIONAL | OPTIMAL | NEYMAN | (&lt;*values*&gt;) | &lt;*SAS-data-set*&gt;","type":"choice","arguments":[{"name":"PROPORTIONAL","followsDelimiter":"/","description":"Requests proportional allocation, which allocates the total sample size in proportion to the stratum sizes, where the stratum size is the number of sampling units in the stratum.","type":"standalone"},{"name":"OPTIMAL","followsDelimiter":"/","description":"Requests optimal allocation, which allocates the total sample size among the strata in proportion to stratum sizes, stratum variances, and stratum costs.","type":"standalone"},{"name":"NEYMAN","followsDelimiter":"/","description":"Requests Neyman allocation, which allocates the total sample size among the strata in proportion to the stratum sizes and variances.","type":"standalone"},{"name":"(values)","placeholder":true,"followsDelimiter":"/","description":"Lists stratum allocation proportions. You can separate values with blanks or commas.","type":"value"},{"name":"SAS-data-set","placeholder":true,"followsDelimiter":"/","description":"Names a SAS data set that contains stratum allocation proportions.","type":"dataSet"}]},{"name":"COST","optional":true,"followsDelimiter":"/","description":"Indicates that stratum costs are included in the secondary input data set.","type":"standalone"},{"name":"COST=","optional":true,"followsDelimiter":"/","aliases":["COSTS="],"description":"COST=(values) Specifies stratum costs, which are required if you specify the ALLOC=OPTIMAL option. You can separate values with blanks or commas.","type":"value"},{"name":"NOSAMPLE","optional":true,"followsDelimiter":"/","aliases":["NOSAMP"],"description":"Requests that SURVEYSELECT allocate the total sample size among the strata but not select the sample.","type":"standalone"},{"name":"VAR","optional":true,"followsDelimiter":"/","description":"Indicates that stratum variances are included in the secondary input data set.","type":"standalone"},{"name":"VAR=","optional":true,"followsDelimiter":"/","description":"VAR=(values) Lists stratum variances, which are required if you specify ALLOC=OPTIMAL or ALLOC=NEYMAN. You can separate values with blanks or commas.","type":"value"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"latest","docsetTargetFile":"statug_surveyselect_toc.htm"}}