{"name":"SURVEYMEANS","statements":[{"name":"PROC SURVEYMEANS","description":"The SURVEYMEANS procedure estimates characteristics of a survey population by using statistics computed from a survey sample. You can estimate statistics such as means, totals, proportions, quantiles, and ratios. PROC SURVEYMEANS also provides domain analysis, which computes estimates for subpopulations or domains. The procedure also estimates variances and confidence limits and performs t tests for these statistics. PROC SURVEYMEANS uses either the Taylor series (linearization) method or replication (subsampling) methods to estimate sampling errors of estimators based on complex sample designs. The sample design can be a complex survey sample design with stratification, clustering, and unequal weighting.","help":"PROC SURVEYMEANS <ALL> <ALLGEO> <ALPHA=α> <CLM> <CLSUM> <CV> <CVSUM> <DATA=SAS-data-set> <DECILES> <DF> <GEOMEAN> <GMSTDERR> <LCLM> <LCLSUM> <MAX> <MEAN> <MEDIAN> <MIN> <MISSING> <NCLUSTER> <NMISS> <NOBS> <NOMCAR> <NONSYMCL> <NOSPARSE> <ORDER=DATA | FORMATTED | FREQ... > <PERCENTILE=(values)> <Q1> <Q3> <QUANTILE=(values)> <QUARTILES> <RANGE> <RATE=value | SAS-data-set> <STACKING> <STD> <STDERR> <SUM> <SUMWGT> <T> <TOTAL=value | SAS-data-set> <UCLM> <UCLSUM> <VAR> <VARMETHOD=BRR | JACKKNIFE | TAYLOR> <VARSUM>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCLASS variables ;\n    \n\tCLUSTER variables ;\n    \n\tDOMAIN variables <variable*variable variable*variable*variable ... > ;\n    \n\tPOSTSTRATA <PSPCT=SAS-data-set | values> <PSTOTAL=SAS-data-set | values> ;\n    \n\tRATIO <’label’> variables / variables ;\n    \n\tREPWEIGHTS <DF=df> <JKCOEFS=jackknife-coefficient-specification> ;\n    \n\tSTRATA <LIST> ;\n    \n\tVAR variables ;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"ALL","optional":true,"description":"All available statistics except those associated with geometric means","type":"standalone"},{"name":"ALLGEO","optional":true,"description":"All available statistics associated with geometric means","type":"standalone"},{"name":"ALPHA=","optional":true,"description":"Sets the confidence level for confidence limits. The value of the ALPHA= option must be between 0 and 1, and the default value is 0.05. A confidence level of α produces 100(1-α)% confidence limits. The default of ALPHA=0.05 produces 95% confidence limits.","type":"value"},{"name":"CLM","optional":true,"description":"100(1-α)% two-sided confidence limits for the MEAN, where α is determined by the ALPHA= option; the default is α=0.05","type":"standalone"},{"name":"CLSUM","optional":true,"description":"100(1-α)% two-sided confidence limits for the SUM, where α is determined by the ALPHA= option; the default is α=0.05","type":"standalone"},{"name":"CV","optional":true,"description":"Coefficient of variation for MEAN","type":"standalone"},{"name":"CVSUM","optional":true,"description":"Coefficient of variation for SUM","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be analyzed by PROC SURVEYMEANS. If you omit the DATA= option, the procedure uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DECILES","optional":true,"description":"The 10th, the 20th, ..., and the 90th percentiles including their standard errors and confidence limits.","type":"standalone"},{"name":"DF","optional":true,"description":"Degrees of freedom for the t test","type":"standalone"},{"name":"GEOMEAN","optional":true,"description":"Geometric mean of a numeric variable that contains positive values","type":"standalone"},{"name":"GMSTDERR","optional":true,"description":"Standard error of the GEOMEAN. When you request GEOMEAN, the procedure computes GMSTDERR by default.","type":"standalone"},{"name":"LCLM","optional":true,"description":"100(1-α)% one-sided confidence limit of the MEAN, where α is determined by the ALPHA= option; the default is α=0.05.","type":"standalone"},{"name":"LCLSUM","optional":true,"description":"100(1-α)% one-sided confidence limit of the SUM, where α is determined by the ALPHA= option; the default is α=0.05.","type":"standalone"},{"name":"MAX","optional":true,"description":"Maximum value","type":"standalone"},{"name":"MEAN","optional":true,"description":"Mean for a numeric variable, or the proportion in each category for a categorical variable","type":"standalone"},{"name":"MEDIAN","optional":true,"description":"Median for a numeric variable","type":"standalone"},{"name":"MIN","optional":true,"description":"Minimum value","type":"standalone"},{"name":"MISSING","optional":true,"description":"Treats missing values as a valid (nonmissing) category for all categorical variables, which include CLASS, STRATA, CLUSTER, and DOMAIN variables. By default, if you do not specify the MISSING option, an observation is excluded from the analysis if it has a missing value.","type":"standalone"},{"name":"NCLUSTER","optional":true,"description":"Number of clusters","type":"standalone"},{"name":"NMISS","optional":true,"description":"Number of missing observations","type":"standalone"},{"name":"NOBS","optional":true,"description":"Number of nonmissing observations","type":"standalone"},{"name":"NOMCAR","optional":true,"description":"Requests that the procedure treat missing values in the variance computation as not missing completely at random (NOMCAR) for Taylor series variance estimation. When you specify the NOMCAR option, PROC SURVEYREG computes variance estimates by analyzing the nonmissing values as a domain or subpopulation, where the entire population includes both nonmissing and missing domains.]","type":"standalone"},{"name":"NONSYMCL","optional":true,"description":"Requests nonsymmetric confidence limits for quantiles when you request quantiles with PERCENTILE= or QUANTILE= option.","type":"standalone"},{"name":"NOSPARSE","optional":true,"description":"Suppresses the display of analysis variables with zero frequency. By default, the procedure displays all continuous variables and all levels of categorical variables.","type":"standalone"},{"name":"ORDER=","optional":true,"description":"Specifies the order in which to sort the levels of the categorical variables are to be reported.","help":"ORDER=DATA | FORMATTED | FREQ | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Levels sorted by the order of appearance in the input data set.","type":"standalone"},{"name":"FORMATTED","description":"Levels sorted by the external formatted value, except for numeric variables with no explicit format, which are sorted by their unformatted (internal) value.","type":"standalone"},{"name":"FREQ","description":"Levels sorted by the descending frequency count; levels with the most observations come first in the order.","type":"standalone"},{"name":"INTERNAL","description":"Levels sorted by the unformatted value.","type":"standalone"}]},{"name":"PERCENTILE=","optional":true,"description":"Specifies percentiles you want the procedure to compute. You can separate values with blanks or commas. Each value must be between 0 and 100. You can also use the statistic-keywords DECILES, MEDIAN, Q1, Q3, and QUARTILES to request common percentiles.","type":"value"},{"name":"Q1","optional":true,"description":"Lower quartile","type":"standalone"},{"name":"Q3","optional":true,"description":"Upper quartile","type":"standalone"},{"name":"QUANTILE=","optional":true,"description":"Specifies quantiles you want the procedure to compute. You can separate values with blanks or commas. Each value must be between 0 and 1. You can also use the statistic-keywords DECILES, MEDIAN, Q1, Q3, and QUARTILES to request common quantiles.","type":"value"},{"name":"QUARTILES","optional":true,"description":"Lower quartile (25%th percentile), median (50%th percentile), and upper quartile (75%th percentile), including their standard errors and confidence limits.","type":"standalone"},{"name":"RANGE","optional":true,"description":"Range calculated as the difference between maximum value and minimum value (MAX - MIN).","type":"standalone"},{"name":"RATE=","optional":true,"aliases":["R="],"description":"Specifies the sampling rate as a nonnegative value, or specifies an input data set that contains the stratum sampling rates. The procedure uses this information to compute a finite population correction for Taylor series variance estimation. The procedure does not use the RATE= option for BRR or jackknife variance estimation, which you request with the VARMETHOD=BRR or VARMETHOD=JACKKNIFE option.","type":"value"},{"name":"STACKING","optional":true,"description":"Requests that the procedure produce the output data sets by using a stacking table structure, which was the default before SAS 9. The new default is to produce a rectangular table structure in the output data sets. A rectangular structure creates one observation for each analysis variable in the data set. A stacking structure creates only one observation in the output data set for all analysis variables. The STACKING option affects the following tables:","type":"standalone"},{"name":"STD","optional":true,"description":"Standard deviation of the SUM. When you request SUM, the procedure computes STD by default.","type":"standalone"},{"name":"STDERR","optional":true,"description":"Standard error of the MEAN or RATIO. When you request MEAN or RATIO, the procedure computes STDERR by default.","type":"standalone"},{"name":"SUM","optional":true,"description":"Weighted sum or estimated population total when the appropriate sampling weights are used.","type":"standalone"},{"name":"SUMWGT","optional":true,"description":"Sum of the weights","type":"standalone"},{"name":"T","optional":true,"description":"Student's t statistic","type":"standalone"},{"name":"TOTAL=","optional":true,"aliases":["N="],"description":"Specifies the total number of primary sampling units (PSUs) in the study population as a positive value, or specifies an input data set that contains the stratum population totals. The procedure uses this information to compute a finite population correction for Taylor series variance estimation. The procedure does not use the TOTAL= option for BRR or jackknife variance estimation, which you request with the VARMETHOD=BRR or VARMETHOD=JACKKNIFE option.","type":"value"},{"name":"UCLM","optional":true,"description":"100(1-α)% one-sided confidence limit of the MEAN, where α is determined by the ALPHA= option; the default is α=0.05.","type":"standalone"},{"name":"UCLSUM","optional":true,"description":"100(1-α)% one-sided confidence limit of the SUM, where α is determined by the ALPHA= option; the default is α=0.05.","type":"standalone"},{"name":"VAR","optional":true,"description":"Variance of the MEAN or RATIO","type":"standalone"},{"name":"VARMETHOD=","optional":true,"description":"Specifies the variance estimation method.","help":"VARMETHOD=BRR | JACKKNIFE | TAYLOR","type":"choice","arguments":[{"name":"BRR","description":"Requests variance estimation by balanced repeated replication (BRR). You can specify the following method-options in parentheses after the VARMETHOD=BRR option: DFADJ computes the degrees of freedom as the number of nonmissing strata for an analysis variable. FAY <=value> requests Fay’s method, which is a modification of the BRR method. HADAMARD=SAS-data-set H=SAS-data-set names a SAS data set that contains the Hadamard matrix for BRR replicate construction. OUTWEIGHTS=SAS-data-set names an output SAS data set to store the replicate weights that PROC SURVEYPHREG creates for BRR variance estimation. The OUTWEIGHTS= method-option is not available when you provide replicate weights with a REPWEIGHTS statement. PRINTH displays the Hadamard matrix used to construct replicates for BRR. When you provide the Hadamard matrix in the HADAMARD= method-option, PROC SURVEYPHREG displays only the rows and columns that are actually used to construct replicates. REPS=number specifies the number of replicates for BRR variance estimation. The value of number must be an integer greater than 1.","type":"standalone"},{"name":"JACKKNIFE","description":"Requests variance estimation by the delete-1 jackknife method. You can specify the following method-options in parentheses following VARMETHOD=JACKKNIFE: DFADJ computes the degrees of freedom as the number of nonmissing strata for an analysis variable. OUTWEIGHTS=SAS-data-set names an output SAS data set that contains replicate weights. The OUTWEIGHTS= method-option is not available when you provide replicate weights with the REPWEIGHTS statement. OUTJKCOEFS=SAS-data-set names an output SAS data set that contains jackknife coefficients.","type":"standalone"},{"name":"TAYLOR","description":"Requests Taylor series variance estimation. This is the default method if you do not specify the VARMETHOD= option or a REPWEIGHTS statement.","type":"standalone"}]},{"name":"VARSUM","optional":true,"description":"Variance of the SUM","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC SURVEYMENAS to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CLASS","aliases":["CLASSES"],"description":"The CLASS statement names variables to be analyzed as categorical variables. For categorical variables, PROC SURVEYMEANS estimates the proportion in each category or level, instead of the overall mean. PROC SURVEYMEANS always analyzes character variables as categorical. If you want categorical analysis for a numeric variable, you must include that variable in the CLASS statement. The CLASS variables are one or more variables in the DATA= input data set. These variables can be either character or numeric. The formatted values of the CLASS variables determine the categorical variable levels. Thus, you can use formats to group values into levels. When determining levels of a CLASS variable, an observation with missing values for this CLASS variable is excluded, unless you specify the MISSING option. You can use multiple CLASS statements to specify categorical variables.","help":"CLASS variables "},{"name":"CLUSTER","aliases":["CLUSTERS"],"description":"The CLUSTER statement names variables that identify the clusters in a clustered sample design. The combinations of categories of CLUSTER variables define the clusters in the sample. If there is a STRATA statement, clusters are nested within strata. If you provide replicate weights for BRR or jackknife variance estimation with the REPWEIGHTS statement, you do not need to specify a CLUSTER statement. If your sample design has clustering at multiple stages, you should identify only the first-stage clusters (primary sampling units (PSUs)), in the CLUSTER statement. The CLUSTER variables are one or more variables in the DATA= input data set. These variables can be either character or numeric, but the procedure treats them as categorical variables. The formatted values of the CLUSTER variables determine the CLUSTER variable levels. Thus, you can use formats to group values into levels.","help":"CLUSTER variables "},{"name":"DOMAIN","description":"The DOMAIN statement requests analysis for domains (subpopulations), in addition to analysis for the entire study population. The DOMAIN statement names the variables that identify domains, which are called domain variables. It is common practice to compute statistics for domains. The formation of these domains might not be known at the design stage. Therefore, the sample sizes for the domains are often random. Use a DOMAIN statement to incorporate this variability into the variance estimation. Note that a DOMAIN statement is different from a BY statement. In a BY statement, you treat the sample sizes as fixed in each subpopulation, and you perform analysis within each BY group independently.","help":"DOMAIN variables &lt;variable*variable variable*variable*variable ... &gt; "},{"name":"POSTSTRATA","description":"The POSTSTRATA statement names variables that form the poststrata to adjust the sampling weight for analyzing the survey. The combinations of categories of POSTSTRATA variables define the poststrata in the sample. The POSTSTRATA variables are one or more variables in the DATA= input data set. These variables can be either character or numeric. The formatted values of the POSTSTRATA variables determine the categorical levels. Thus, you can use formats to group values into levels. You must specify either poststratification totals or poststratification proportions, but not both, in the POSTSTRATA statement after a slash (/).","help":"POSTSTRATA &lt;PSPCT=SAS-data-set | values&gt; &lt;PSTOTAL=SAS-data-set | values&gt; ","arguments":[{"name":"PSPCT=","optional":true,"followsDelimiter":"/","aliases":["POSTPCT="],"description":"Syntax: PSPCT=SAS-data-set | values POSTPCT=SAS-data-set | values Specifies an input data set that contains the population poststratum proportions or specifies the population poststratum proportions as positive values. The SURVEYMEANS procedure uses this information to compute weight adjustment for poststratification. You can provide poststratification proportions by specifying POSTPCT=SAS-data-set, which names a SAS data set that contains the poststratification variables and the poststratum poststratification. This data set is called the poststratum proportion data set.","type":"value"},{"name":"PSTOTAL=","optional":true,"followsDelimiter":"/","aliases":["POSTTOTAL=","PSCONTROL="],"description":"Syntax: PSTOTAL=SAS-data-set | values POSTTOTAL=SAS-data-set | values PSCONTROL=SAS-data-set | values Specifies an input data set that contains the poststratum totals or specifies the population poststratum totals as positive values. The SURVEYMEANS procedure uses this information to compute weight adjustment for poststratification. You can provide poststratification totals by specifying PSTOTAL=SAS-data-set, which names a SAS data set that contains the poststratification variables and the poststratum totals. This data set is called the poststratum total data set. A poststratum total data set must contain all the poststratification variables that are listed in the POSTSTRATA statement and all the variables listed in the BY statement. If there are formats associated with the POSTSTRATA variables and the BY variables, then the formats in the poststratum total data set for these variables must be consistent with those in the DATA= data set in the PROC SURVEYMEANS statement. A poststratum total data set must have a variable named _PSTOTAL_ that contains the poststratum totals. The value of _PSTOTAL_ must be positive. When poststratum levels are easy to identify, their corresponding poststratum totals can be specified as a list of positive numbers.","type":"value"}]},{"name":"RATIO","description":"The RATIO statement requests ratio analysis for means or proportions of analysis variables. A ratio statement names the variables whose means are used as numerators or denominators in a ratio. Variables that appear before the slash (/) are called numerator variables and are used as numerators. Variables that appear after the slash (/) are called denominator variables and are used as denominators. These variables can be any number of analysis variables, either continuous or categorical, except those named in the BY, CLUSTER, REPWEIGHTS, STRATA, and WEIGHT statements. You can optionally specify a label for each RATIO statement to identify the ratios in the output. Labels must be enclosed in single quotes.","help":"RATIO &lt;’label’&gt; variables / variables "},{"name":"REPWEIGHTS","aliases":["REPWEIGHT","REPWGTS","REPWGT","REPWT","REPWTS"],"description":"The REPWEIGHTS statement names variables that provide replicate weights for BRR or jackknife variance estimation, which you request with the VARMETHOD=BRR or VARMETHOD=JACKKNIFE option in the PROC SURVEYREG statement. If you do not provide replicate weights for these methods by using a REPWEIGHTS statement, then the procedure constructs replicate weights for the analysis. Each REPWEIGHTS variable should contain the weights for a single replicate, and the number of replicates equals the number of REPWEIGHTS variables. The REPWEIGHTS variables must be numeric, and the variable values must be nonnegative numbers.","help":"REPWEIGHTS &lt;DF=df&gt; &lt;JKCOEFS=jackknife-coefficient-specification&gt; ","arguments":[{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom for the analysis. The value of df must be a positive number. PROC SURVEYPHREG also use the DF= value in computing the denominator degrees of freedom for the F statistics in Wald type tests and confidence intervals.","help":"DF=*df*","type":"value"},{"name":"JKCOEFS=","optional":true,"followsDelimiter":"/","description":"Specifies jackknife coefficients for VARMETHOD=JACKKNIFE. The default value for the jackknife coefficient is (R-1)/R, where R is the total number of replicates. You can specify an alternative value with one of the following three forms: JKCOEFS=value specifies a single jackknife coefficient for all replicates. The coefficient value must be a nonnegative number. JKCOEFS=(values) specifies jackknife coefficients for VARMETHOD=JACKKNIFE, where each coefficient corresponds to an individual replicate identified by a REPWEIGHTS variable. You can separate values with blanks or commas. The coefficient values must be nonnegative numbers. The number of values must equal the number of replicate weight variables named in the REPWEIGHTS statement. List these values in the same order in which you list the corresponding replicate weight variables in the REPWEIGHTS statement.","help":"JKCOEFS=*jackknife-coefficient-specification*","type":"value"}]},{"name":"STRATA","aliases":["STRATUM"],"description":"The STRATA statement specifies variables that form the strata in a stratified sample design. The combinations of categories of STRATA variables define the strata in the sample. If your sample design has stratification at multiple stages, you should identify only the first-stage strata in the STRATA statement. If you provide replicate weights for BRR or jackknife variance estimation with a REPWEIGHTS statement, you do not need to specify a STRATA statement. The STRATA variables are one or more variables in the DATA= input data set. These variables can be either character or numeric, but the procedure treats them as categorical variables. The formatted values of the STRATA variables determine the STRATA variable levels. Thus, you can use formats to group values into levels.","help":"STRATA &lt;LIST&gt; ","arguments":[{"name":"LIST","optional":true,"followsDelimiter":"/","description":"Displays a \"Stratum Information\" table, which includes values of the STRATA variables and the number of observations, number of clusters, population total, and sampling rate for each stratum.","type":"standalone"}]},{"name":"VAR","aliases":["VARIABLE"],"description":"The VAR statement names the variables to be analyzed. If you want a categorical analysis for a numeric variable, you must also name that variable in the CLASS statement. For categorical variables, PROC SURVEYMEANS estimates the proportion in each category or level, instead of the overall mean. Character variables are always analyzed as categorical variables. When you specify a variable in a RATIO statement, but not in a VAR statement, the procedure includes this variable as an analysis variable. If you do not specify a VAR statement, then PROC SURVEYMEANS analyzes all variables in the DATA= input data set, except those named in the BY, CLUSTER, DOMAIN, REPWEIGHTS, STRATA, and WEIGHT statements.","help":"VAR variables "},{"name":"WEIGHT","aliases":["WGT"],"description":"The WEIGHT statement names the variable that contains the sampling weights. This variable must be numeric, and the sampling weights must be positive numbers. If an observation has a weight that is nonpositive or missing, then the procedure omits that observation from the analysis. If you do not specify a WEIGHT statement but provide replicate weights with a REPWEIGHTS statement, PROC SURVEYPMEANS uses the average of each observation’s replicate weights as the observation’s weight. If you do not specify a WEIGHT statement or a REPWEIGHTS statement, PROC SURVEYMEANS assigns all observations a weight of one.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_026","docsetTargetFile":"statug_surveymeans_toc.htm"}}