{"name":"TEXTSENTIMENT","statements":[{"name":"PROC TEXTSENTIMENT","description":"The TEXTSENTIMENT procedure enables you to validate language interpretation for textual information (LITI) syntax and to compile an LI binary from a table of LITI rules. It also enables you to save the compiled model as a table.","help":"PROC TEXTSENTIMENT  DATA=libref.data-table<LANGUAGE=language PREDEFINEDSENTIMENT SYNTAXERRORS=libref.data-table>;\n\t         ASTORESETTINGS <options>;\n\t         ID variable;\n\t         INPUT variable;\n\t         OUTPUT OUT=libref.data-table <option>;\n\t         SAVESTATE RSTORE=libref.data-table;","arguments":[{"name":"DATA=","description":"names the input data table for PROC TEXTSENTIMENT to use that contains the textual LITI rules. The input data table must contain a rule ID variable and a rule variable. The default is the most recently created data table.","help":"DATA=*libref.data-table*;","type":"dataSet"},{"name":"LANGUAGE=","optional":true,"description":"specifies the language to be used for compiling the language-specific LI binary. You can specify the name or two-letter ISO 639-1 language code of a licensed language. By default, LANGUAGE=EN; this specifies the English language.","help":"LANGUAGE=*language*","type":"value"},{"name":"PREDEFINEDSENTIMENT","optional":true,"description":"includes the predefined sentiment model in the LI binary. If you omit this option, the predefined model is not included.","type":"standalone"},{"name":"SYNTAXERRORS=","optional":true,"description":"specifies the output table to contain the syntax error information about LITI rules. If you omit this option, syntax checking is not performed.","help":"SYNTAXERRORS=*libref.data-table*","type":"dataSet"}]},{"name":"ASTORESETTINGS","description":"The ASTORESETTINGS statement enables you to configure the category analytic store that you save by using the SAVESTATE statement.","help":"ASTORESETTINGS &lt;MATCHTYPE=*ALL|BEST|LONGEST*  MAXCHAR=*integer* OUTPUTMODE=*DATAGRID|DEFAULT* TEXT=\"*string*\"&gt;;","arguments":[{"name":"MATCHTYPE=","optional":true,"description":"specifies which LITI match algorithm to use. By default, MATCHTYPE=LONGEST. You can specify the following algorithms:","help":"MATCHTYPE=ALL | BEST | LONGEST","type":"choice","arguments":[{"name":"ALL","description":"specifies that overlapping matches are possible.","type":"standalone"},{"name":"BEST","description":"specifies that the highest priority of overlapping concept matches is used.","type":"standalone"},{"name":"LONGEST","description":"specifies that the longest of any overlapping concept matches is used.","type":"standalone"}]},{"name":"MAXCHAR=","optional":true,"description":"specifies the length of output character variables while you are scoring the concept analytic store model. By default, MAXCHAR=1024. The minimum value is 9, and the maximum value is 536,870,911.","help":"MAXCHAR=*integer*","type":"value"},{"name":"OUTPUTMODE=","optional":true,"description":"specifies which output tables to generate when the concept analytic store model is scored. You can specify the following values:","help":"OUTPUTMODE=DATAGRID | DEFAULT","type":"choice","arguments":[{"name":"DATAGRID","description":"specifies that the concept analytic store model create one output table that contains sentiment results and concept match results. Each document corresponds to one output row of data grids.","type":"standalone"},{"name":"DEFAULT","description":"specifies that the concept analytic store model create two output tables from the input table. The two tables contain sentiment results and concept match results.","type":"standalone"}]},{"name":"TEXT=","optional":true,"description":"specifies the name of the variable that contains documents for scoring the model. By default, TEXT=\"_text_\". This is the name of the text variable to be saved in the analytic store model. When the analytic store is used, a procedure requires a table that contains this variable name.","help":"TEXT=\"*string*\"","type":"value"}]},{"name":"ID","description":"The ID statement specifies the name of the rule ID variable in the input data table. The value of this variable, which can be of numeric or character type, identifies the rules to be validated.","help":"ID *variable*;"},{"name":"INPUT","description":"The INPUT statement specifies the name of the rule variable in the input data table.","help":"INPUT *variable*;"},{"name":"OUTPUT","description":"The OUTPUT statement specifies the output table to contain the compiled LI binary.","help":"OUTPUT  OUT=*libref.data-table*&lt;COPYVARS=*variable*|(*variables*)&gt;;","arguments":[{"name":"OUT=","description":"specifies the output table to contain the compiled LI binary.","help":"OUT=*libref.data-table*","type":"dataSet"},{"name":"COPYVARS=","optional":true,"description":"transfers one or more variables from the input data table to the output data table.","help":"COPYVARS=*variable* <br/> COPYVARS=(*variables*)","type":"value"}]},{"name":"SAVESTATE","description":"The SAVESTATE statement specifies the output table to contain the compiled sentiment analytic store model.","help":"SAVESTATE  RSTORE=*libref.data-table*;","arguments":[{"name":"RSTORE=","description":"specifies the output table to contain the compiled sentiment analytic store model. The analytic store model can be used by PROC ASTORE in a subsequent scoring step. The concept analytic store format does not support LITI models that have rules that use the CLAUS_n operator.","help":"RSTORE=*libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casvta","docsetVersion":"latest","docsetTargetFile":"casvta_textsentiment_toc.htm"}}