{"name":"TEXTMINE","statements":[{"name":"PROC TEXTMINE","description":"The TEXTMINE procedure integrates natural language processing and statistical analysis to analyze large-scale textual data in SAS Viya. It supports a wide range of fundamental text analysis features, which include tokenizing, stemming, part-of-speech tagging, noun group extraction, default or customized stop lists and start lists, entity parsing, multiword tokens, synonym lists, term weighting, term-by-document matrix creation, dimension reduction with singular value decomposition (SVD), and topic discovery. (The procedure uses the tmMine action of the textMining action set to accomplish these tasks, but it does not use all of the action’s capabilities.)","help":"PROC TEXTMINE  DATA=libref.data-table<options>;\n\t VARIABLES variable;\n\t<TARGET variable;>\n\t DOC_ID variable;\n\t<PARSE parse-options;\n\t SAVESTATE RSTORE=libref.data-model;\n\t SELECT label-list GROUP=group-optionKEEP | IGNORE;\n\t SPELLCHECK spell-options;\n\t SVD svd-options>","arguments":[{"name":"DATA=","description":"names the input data table for PROC TEXTSENTIMENT to use that contains the textual LITI rules. The input data table must contain a rule ID variable and a rule variable. The default is the most recently created data table.","help":"DATA=*libref.data-table*;","type":"dataSet"},{"name":"LANGUAGE=","optional":true,"description":"names the language that is used by the documents in the input SAS data table. The current release supports the following languages: Arabic, Chinese, Croatian, Czech, Danish, Dutch, English, Farsi, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Kazakh, Korean, Norwegian, Polish, Portuguese, Romanian, Russian, Slovak, Slovene, Spanish, Swedish, Tagalog, Thai, Turkish, and Vietnamese. By default, LANGUAGE=ENGLISH.","help":"LANGUAGE=*language*","type":"value"},{"name":"NEWVARNAMES","optional":true,"description":"adds leading and trailing underscore characters to variable names in some output tables.","type":"standalone"},{"name":"NTHREADS=","optional":true,"description":"specifies the number of threads to be used. By default, the number of threads is the same as the number of CPUs.","help":"NTHREADS=*nthreads*","type":"value"}]},{"name":"DOC_ID","description":"The DOC_ID statement specifies the variable that contains the ID of each document. In the input data table, each row corresponds to one document. The ID of each document must be unique; it can be either a number or a string of characters.","help":"DOC_ID *variable*;"},{"name":"PARSE","description":"The PARSE statement specifies the options for parsing the input documents and creating the term-by-document matrix.","help":"PARSE &lt;COMPLEXTAG ENTITIES=STD | NONE |  MULTITERM=*libref.data-table* NONOUNGROUPS NOSTEMMING NOTAGGING SHOWDROPPEDTERMS START=*libref.data-table* STOP=*libref.data-table* SYNONYM=*libref.data-table* CELLWGT=LOG | NONE |  REDUCEF=*n* TERMWGTENTROPY | MI | NONE OUTCHILD=*libref.data-table* OUTCONFIG=*libref.data-table* OUTPARENT=*libref.data-table* OUTPOS=*libref.data-table* OUTTERMS=*libref.data-table*&gt;;","arguments":[{"name":"CELLWGT=","optional":true,"description":"specifies how the elements in the term-by-document matrix are weighted. You can specify the following values:","help":"CELLWGT=LOG | NONE","type":"choice","arguments":[{"name":"LOG","description":"weights cells by using the log formulation.","type":"standalone"},{"name":"NONE","description":"specifies that no cell weight be applied.","type":"standalone"}]},{"name":"COMPLEXTAG","optional":true,"description":"includes the complexTag variable in the OUTPOS= table and in the output OUTTERMS= table. For some terms, this variable contains a finer level of detail of the part of speech. The information in the complexTag column is used during the accumulation phase of parsing and during scoring so that consistent results are returned.","type":"standalone"},{"name":"ENTITIES=","optional":true,"description":"determines whether to use the standard LITI file for entity extraction. By default, ENTITIES=NONE. You can specify the following values:","help":"ENTITIES=STD | NONE","type":"choice","arguments":[{"name":"STD","description":"uses the standard LITI file for entity extraction. A term such as \"George W. Bush\" is recognized as an entity and given the corresponding entity role and attribute. For this term, the entity role is nlpPerson and the attribute is Entity. Although the entity is treated as the single term \"george w. bush\", individual tokens such as \"george\", \"w\", and \"bush\" are also included.","type":"standalone"},{"name":"NONE","description":"does not use the standard LITI file for entity extraction.","type":"standalone"}]},{"name":"MULTITERM=","optional":true,"description":"specifies the input SAS data table that contains a case-sensitive list of multiword terms. The multiterm data table must have the variable Multiterm, and each row must be formatted in the following manner: the multiword term itself, followed by a colon; a number that represents the token type, followed by a colon; and finally, the part of speech that the multiword term represents. (Token type 3 is the most common token type for multiterm lists; it represents compound words.)","help":"MULTITERM=*libref.data-table*","type":"dataSet"},{"name":"NONOUNGROUPS","optional":true,"description":"suppresses standard noun group extraction. (By default, PROC TEXTMINE extracts noun groups, returns noun phrases without determiners or prepositions, and unless the NOSTEMMING option is specified, stems noun group elements.)","type":"standalone"},{"name":"NONG","optional":true,"description":"suppresses standard noun group extraction. (By default, PROC TEXTMINE extracts noun groups, returns noun phrases without determiners or prepositions, and unless the NOSTEMMING option is specified, stems noun group elements.)","type":"standalone"},{"name":"NOSTEMMING","optional":true,"description":"suppresses stemming of words. (By default, words are stemmed using dictionary-based stemming, also known as lemmatization; that is, terms such as \"advises\" and \"advising\" are mapped to the parent term \"advise.\")","type":"standalone"},{"name":"NOTAGGING","optional":true,"description":"suppresses tagging of terms. (By default, terms are tagged, and PROC TEXTMINE identifies a term’s part of speech and provides this informatoin in the Role variable of the OUTTERMS= data table.)","type":"standalone"},{"name":"OUTCHILD=","optional":true,"description":"specifies the output data table to contain a compressed representation of the sparse term-by-document matrix. The term counts are not weighted. The data table saves only the kept, representative terms. Unlike in the OUTPARENT= data table, the child frequencies in the OUTCHILD= data table are not attributed to their corresponding parent.","help":"OUTCHILD=*libref.data-table*","type":"dataSet"},{"name":"OUTCONFIG=","optional":true,"description":"specifies the output data table to contain configuration information that is used for the current run of PROC TEXTMINE. the primary purpose of this data table is to relay the configuration information from the TEXTMINE procedure to the TMSCORE procedure. PROC TMSCORE uses options that are consistent with PROC TEXTMINE. Thus, the data table that is created by the OUTCONFIG= option becomes an input data table for PROC TMSCORE and ensures that the parsing options are consistent between the two runs.","help":"OUTCONFIG=*libref.data-table*","type":"dataSet"},{"name":"OUTPARENT=","optional":true,"description":"specifies the output data table to contain a compressed representation of the sparse term-by-document matrix. The term counts can be weighted, if requested. The data table contains only the kept, representative terms, and the child frequencies are attributed to the corresponding parent. (To obtain information about the children, use the OUTCHILD= option.)","help":"OUTPARENT=*libref.data-table*","type":"dataSet"},{"name":"REDUCEF=","optional":true,"description":"removes terms that are not in at least n documents. The value of n must be a positive integer. By default, REDUCEF=4.","help":"REDUCEF=*n*","type":"value"},{"name":"SHOWDROPPEDTERMS","optional":true,"description":"includes the terms that have a keep status of N in the OUTTERMS= and OUTCHILD= data tables.","type":"standalone"},{"name":"START=","optional":true,"description":"specifies the input data table that contains the terms to keep for the analysis. These terms are displayed in the OUTTERMS= data table with a keep status of Y. All other terms are displayed with a keep status of N if the SHOWDROPPEDTERMS option is specified or not displayed if that option is omitted. The START= data table must have a Term variable and can also have a Role variable. You cannot specify both the START= and STOP= options.","help":"START=*libref.data-table*","type":"dataSet"},{"name":"STOP=","optional":true,"description":"specifies the input data table that contains the terms to exclude from the analysis. These terms are displayed in the OUTTERMS= data table with a keep status of N if the SHOWDROPPEDTERMS option is specified. The terms are not identified as parents or children. The STOP= data table must have a Term variable and can also have a Role variable. You cannot specify both the STOP= and START= options.","help":"STOP=*libref.data-table*","type":"dataSet"},{"name":"SYNONYM=","optional":true,"description":"specifies the input data table that contains the terms to exclude from the analysis. These terms are displayed in the OUTTERMS= data table with a keep status of N if the SHOWDROPPEDTERMS option is specified. The terms are not identified as parents or children. The STOP= data table must have a Term variable and can also have a Role variable. You cannot specify both the STOP= and START= options.","help":"SYNONYM=*libref.data-table*","type":"dataSet"},{"name":"TERMWGT=","optional":true,"description":"specifies how terms are weighted. You can specify the following values:","help":"TERMWGT=ENTROPY | MI | NONE","type":"choice","arguments":[{"name":"ENTROPY","description":"uses the entropy formulation to weight terms.","type":"standalone"},{"name":"MI","description":"uses the mutual information formulation to weight terms (you must also specify the TARGET statement).","type":"standalone"},{"name":"NONE","description":"requests that no term weight be applied.","type":"standalone"}]}]},{"name":"SAVESTATE","description":"The SAVESTATE statement saves a text mining model to a binary object that is contained in a data table. The object is referred to as the analytic store and contains the necessary information for scoring a text mining model by using the ASTORE procedure. Only complete text models that consist of both parsing and document projections can be saved to the analytic store by PROC TEXTMINE.","help":"SAVESTATE  RSTORE=*libref.data-table*;","arguments":[{"name":"RSTORE=","description":"specifies a data table in which to save the text mining model.","help":"RSTORE=*libref.data-table*","type":"dataSet"}]},{"name":"SELECT","description":"The SELECT statement enables you to specify the parts of speech or entities or attributes that you want to include in or exclude from your analysis. Exclusion by the SELECT statement is different from exclusion that is indicated by the _keep variable in the OUTTERMS= data table. Terms that are excluded by the SELECT statement cannot be included in the OUTTERMS= data table, whereas terms that have a _keep value of N can be included in the OUTTERMS= data table if the SHOWDROPPEDTERMS option is specified. Terms that are excluded by the SELECT statement are excluded from the OUTPOS= data table, but terms that have a _keep value of N are included in the OUTPOS= data table.","help":"SELECT *label-list*&lt;GROUP=*group-option*&gt;*KEEP|IGNORE*;","arguments":[{"name":"label-list","placeholder":true,"description":"specifies one or more labels that are parts of speech, entities, or attributes. Each label must be enclosed in double quotation marks and separated by spaces from other labels. Labels are not case-sensitive. Terms that have these labels are either ignored during parsing (when the IGNORE option is specified) or kept in the parsing results in the OUTPOS= and OUTTERMS= data tables (when the KEEP option is specified).","type":"value"},{"name":"IGNORE","description":"ignores during parsing all terms whose labels are specified in the label-list, but keeps all other terms in the parsing results (in the OUTPOS= and OUTTERMS= data tables).","type":"standalone"},{"name":"KEEP","description":"keeps in the parsing results (in the OUTPOS= and OUTTERMS= data tables) only the terms whose labels are specified in the label-list.","type":"standalone"},{"name":"GROUP=","optional":true,"description":"specifies whether the labels are attributes, entities, or parts of speech. The group type must be enclosed in double quotation marks and is not case-sensitive. All labels that are specified in the label-list in the same SELECT statement should belong to the specified group. If you need to select labels from more than one group, you can use multiple SELECT statements (one for each group that you need to select from). You cannot specify multiple SELECT statements for the same group. By default, Num and Punct in the \"ATTRIBUTES\" group are ignored, but this default is overridden by a SELECT statement that specifies GROUP=\"ATTRIBUTES\". By default, GROUP=\"POS\".","help":"GROUP=\"ATTRIBUTES\" | \"ENTITIES\" | \"POS\"","type":"choice","arguments":[{"name":"\"ATTRIBUTES\"","type":"standalone"},{"name":"\"ENTITIES\"","type":"standalone"},{"name":"\"POS\"","type":"standalone"}]}]},{"name":"SPELLCHECK","description":"The SPELLCHECK statement specifies the options for learning misspelled terms and their corrections. The misspelled term is considered the child term, and its correction is referred to as its parent term. Candidate misspelled terms occur rarely in the collection. The predicted, correctly spelled term must be similar in spelling to the incorrect child and must also occur frequently.","help":"SPELLCHECK &lt;DICTTABLE=*libref.data-table* DIFFROLE MAXCHILDREN=*n* MAXSPELLDIST=*n* MINPARENTS=*n*&gt;;","arguments":[{"name":"DICTTABLE=","optional":true,"description":"specifies a data table to use as a dictionary. The SPELLCHECK statement assumes that all terms in this table are spelled correctly. This table must contain a column named _term_ that holds the terms whose spelling will not be corrected.","help":"DICTTABLE=*libref.data-table*","type":"dataSet"},{"name":"DIFFROLE","optional":true,"description":"specifies that a misspelled term can be corrected to a term whose part of speech differs. When you omit this option, terms are compared only if they are the same part of speech.","type":"standalone"},{"name":"MAXCHILDREN=","optional":true,"description":"specifies the maximum number of documents that a term can appear in and still be considered a child term. A child term identifies a predicted misspelled term whose correction is the parent term that is assigned to it. If the number of documents that contain a term is greater than n, the term is not treated as a misspelled term candidate, and the SPELLCHECK statement does not correct it. By default, MAXCHILDREN=6.","help":"MAXCHILDREN=*n*","type":"value"},{"name":"MAXSPELLDIST=","optional":true,"description":"specifies the maximum allowable spelling edit distance between a term that is considered misspelled and the term that is considered its correction. The SPELLCHECK statement computes the distance between a misspelled term candidate and a correct term candidate. The shorter the distance, the greater the possibility that the misspelled term is changed to match the correctly spelled term. By default, MAXSPELLDIST=15.","help":"MAXSPELLDIST=*n*","type":"value"},{"name":"MINPARENTS=","optional":true,"description":"specifies the minimum number of documents that a term must appear in to be considered a parent term. A parent term represents the predicted correction of its child term. If the number of documents that contain a term is less than n, the term is not treated as a correctly spelled term candidate. By default, MINPARENTS=3.","help":"MINPARENTS=*n*","type":"value"}]},{"name":"SVD","description":"The SVD statement specifies the options for calculating a truncated singular value decomposition (SVD) of the large, sparse term-by-document matrix that is created during the parsing phase of PROC TEXTMINE.","help":"SVD &lt;COL=*variable* ENTRY=*variable* ROW=*variable* K=*k* MAX_K=*n* RESOLUTION=*LOW|MED|HIGH* TOL=*epsilon* EXACTWEIGHT IN_TERMS=*libref.data-table* NOCUTOFFS NUMLABELS=*n* ROTATION=*PROMAX|VARIMAX* OUTDOCPRO=*libref.data-table* OUTTOPICS=*libref.data-table* OUTWORDPRO=*libref.data-table* SVDS=*libref.data-table* SVDU=*libref.data-table* SVDV=*libref.data-table*&gt;;","arguments":[{"name":"COL=","optional":true,"description":"specifies the variable that contains the column indices of the term-by-document matrix. You must specify this option when you run PROC TEXTMINE in SVD-only mode (that is, when you specify the SVD statement but not the PARSE statement).","help":"COL=*variable*","type":"value"},{"name":"ENTRY=","optional":true,"description":"specifies the variable that contains the entries of the term-by-document matrix. You must specify this option when you run PROC TEXTMINE in SVD-only mode (that is, when you specify the SVD statement but not the PARSE statement).","help":"ENTRY=*variable*","type":"value"},{"name":"EXACTWEIGHT","optional":true,"description":"specifies that the weights aggregated during topic derivation not be rounded. By default, the calculated weights are rounded to the nearest 0.001.","type":"standalone"},{"name":"IN_TERMS=","optional":true,"description":"specifies the input data table that contains information about the terms in the document collection. This data table should contain the following variables: Term, Role, Attribute, Freq, Numdocs, _keep, Key, Parent, Parent_id, _ispar, Weight. The terms are required to generate topic names in the OUTTOPICS= data table. This option is only for topic discovery in SVD-only mode. This option conflicts with the PARSE statement, and only one of the two can be specified. If you want to run SVD-only mode without topic discovery, then you can omit this option.","help":"IN_TERMS=*libref.data-table*","type":"dataSet"},{"name":"K=","optional":true,"description":"specifies the number of columns in the matrices U, V, and S. This value is the number of dimensions of the data table after SVD is performed. If the value of k is too large, then PROC TEXTMINE runs for an unnecessarily long time. This option takes precedence over the MAX_K= option. This option also controls the number of topics that are extracted from the text corpus when the ROTATION= option is specified.","help":"K=*k*","type":"value"},{"name":"MAX_K=","optional":true,"description":"specifies the maximum value that PROC TEXTMINE should return as the recommended value of k (the number of columns in the matrices U, V, and S) when the RESOLUTION= option is specified (to recommend the value of k). PROC TEXTMINE attempts to calculate k dimensions (as opposed to recommending it) when it performs SVD. This option is ignored if the K= option is specified. This option also controls the number of topics that are extracted from the text corpus when the ROTATION= option is specified.","help":"MAX_K=*n*","type":"value"},{"name":"NOCUTOFFS","optional":true,"description":"uses all weights in the U matrix to form the document projections. When topics are requested, weights below the term cutoff (as calculated in the OUTTOPICS= data table) are set to 0 before the projection is formed.","type":"standalone"},{"name":"NUMLABELS=","optional":true,"description":"specifies the number of terms to use in the descriptive label for each topic. The descriptive label provides a brief synopsis of the discovered topics. The labels are stored in the OUTTOPICS= data table. By default, NUMLABELS=5.","help":"NUMLABELS=*n*","type":"value"},{"name":"OUTDOCPRO=","optional":true,"description":"specifies the output data table to contain the projections (embeddings) of the columns of the term-by-document matrix by using the columns of U. Because each column of the term-by-document matrix corresponds to a document, the output forms a new representation of the input documents in a space that has much lower dimensionality. You can copy the variables from the data table that is specified in the DATA= option in the PROC TEXTMINE statement to the data table that is specified in this option. You can also specify the following suboptions:","help":"OUTDOCPRO=*libref.data-table* &lt;KEEPVARIABLES=*variable-list* NONORMDOC&gt;","type":"dataSet","arguments":[{"name":"KEEPVARIABLES=","description":"attaches the content of the variables that are specified in the variable-list to the output. These variables must appear in the data table that is specified in the DATA= option in the PROC TEXTMINE statement.","help":"KEEPVARIABLES=*variable-list*","type":"value"},{"name":"KEEPVARS=","description":"attaches the content of the variables that are specified in the variable-list to the output. These variables must appear in the data table that is specified in the DATA= option in the PROC TEXTMINE statement.","help":"KEEPVARS=*variable-list*","type":"value"},{"name":"NONORMDOC","description":"suppresses normalization of the columns that contain the projections of documents to have a unit norm.","type":"standalone"}]},{"name":"OUTTOPICS=","optional":true,"description":"specifies the output data table to contain the topics that are discovered.","help":"OUTTOPICS=*libref.data-table* ","type":"dataSet"},{"name":"OUTWORDPRO=","optional":true,"description":"specifies the output data table to contain the word projections (embeddings) of the rows of the term-by-document matrix by using the columns of V.","help":"OUTWORDPRO=*libref.data-table* ","type":"dataSet"},{"name":"RESOLUTION=","optional":true,"description":"specifies how to calculate the recommended number of dimensions (resolution) for the singular value decomposition (SVD). By default, RESOLUTION=HIGH. If you specify this option, you must also specify the MAX_K= option. A low-resolution SVD returns fewer dimensions than a high-resolution SVD. This option recommends the value of k (the number of columns in the matrices U, V, and S) heuristically based on the value that you specify in the MAX_K= option. Assume that the MAX_K= option is set to n and an SVD that has n dimensions accounts for t% of the total variance. You can specify the following values:","help":"RESOLUTION=LOW | MED | HIGH","type":"choice","arguments":[{"name":"LOW","description":"recommends a k that explains (2/3) * t% of the total variance.","type":"standalone"},{"name":"MED","description":"recommends a k that explains (5/6) * t% of the total variance.","type":"standalone"},{"name":"HIGH","description":"always recommends the maximum number of dimensions; that is, k=n.","type":"standalone"}]},{"name":"ROTATION=","optional":true,"description":"specifies the type of rotation to be used in order to maximize the explanatory power of each topic. By default, ROTATION=VARIMAX. You can specify the following values:","help":"ROTATION=PROMAX | VARIMAX","type":"choice","arguments":[{"name":"PROMAX","description":"uses an oblique rotation on the original left-singular vectors and generates topics that might be correlated.","type":"standalone"},{"name":"VARIMAX","description":"uses an orthogonal rotation on the original left-singular vectors and generates uncorrelated topics.","type":"standalone"}]},{"name":"ROW=","optional":true,"description":"specifies the variable that contains the row indices of the term-by-document matrix. You must specify this option when you run PROC TEXTMINE in SVD-only mode (that is, when you specify the SVD statement but not the PARSE statement).","help":"ROW=*variable*","type":"value"},{"name":"SVDS=","optional":true,"description":"specifies the output data table to contain the calculated singular values.","help":"SVDS=*libref.data-table* ","type":"dataSet"},{"name":"SVDU=","optional":true,"description":"specifies the data table to contain the calculated left-singular vectors.","help":"SVDU=*libref.data-table* ","type":"dataSet"},{"name":"SVDV=","optional":true,"description":"specifies the data table to contain the calculated right-singular vectors.","help":"SVDV=*libref.data-table* ","type":"dataSet"},{"name":"TOL=","optional":true,"description":"specifies the maximum allowable tolerance for the singular value. The default value of epsilon is 10^-6, which is more than adequate for most text mining problems.","help":"TOL=*epsilon* ","type":"value"}]},{"name":"TARGET","description":"The TARGET statement specifies the variable that contains the information about the category that a document belongs to. The target variable can be any nominal or ordinal variable; it is used in calculating mutual information term weighting.","help":"TARGET *variable*;"},{"name":"VARIABLES","description":"The VARIABLES statement specifies the variable that contains the text to be processed.","help":"VARIABLES *variable*;"}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"latest","docsetTargetFile":"casml_textmine_toc.htm"}}