{"name":"TEXTSUMMARY","statements":[{"name":"PROC TEXTSUMMARY","description":"The TEXTSUMMARY procedure uses natural language processing (NLP) techniques to summarize a document by selecting representative sentences from within the document to become the summary. This procedure computes a summary for each document in a data set.","help":"PROC TEXTSUMMARY <options>;\n\t ID variable;\n\t INPUT variable;\n\t OUTPUT OUT=libref.data-table<option>;","arguments":[{"name":"DATA=","optional":true,"description":"names the input data table for PROC TEXTSUMMARY to use that contains the text data to be summarized. The default is the most recently created data table.","help":"DATA=*libref.data-table*;","type":"dataSet"},{"name":"ENTITIES","optional":true,"description":"specifies that predefined concepts and noun groups be used to compute the summarization. By default, predefined concepts and noun groups are not used.","type":"standalone"},{"name":"LANGUAGE=","optional":true,"description":"specifies the language that is used in the text variable of the input table. You can specify the name or two-letter ISO 639-1 language code of a licensed language. By default, LANGUAGE=EN; this specifies the English language.","help":"LANGUAGE=*language*","type":"value"},{"name":"MAXSENTENCES=","optional":true,"description":"specifies the maximum length of the summary in number of sentences. The value of maxsentences can range from 1 to 32. By default, MAXSENTENCES=5.","help":"MAXSENTENCES=*maxsentences*","type":"value"}]},{"name":"ID","description":"The ID statement specifies the variable that contains the ID of each document. In the input data table, each row corresponds to one document. The ID of each document can be either a number or a string of characters.","help":"ID *variable*;"},{"name":"INPUT","description":"The INPUT statement specifies the variable that contains the text to be processed.","help":"INPUT *variable*;"},{"name":"OUTPUT","description":"The OUTPUT statement enables you to control aspects of the output table.","help":"OUTPUT  OUT=*libref.data-table*&lt;COPYVARS=*variable*|(*variables*)&gt;;","arguments":[{"name":"OUT=","description":"specifies the output table to contain the summaries from individual documents.","help":"OUT=*libref.data-table*","type":"dataSet"},{"name":"NOELLIPSES","optional":true,"description":"eliminates ellipsis points (…) between nonconsecutive sentences in the document summary. By default, ellipsis points are added to the summary to indicate nonconsecutive selected sentences.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"casvta","docsetVersion":"latest","docsetTargetFile":"casvta_textsummary_toc.htm"}}