{"name":"TEXTPROFILE","statements":[{"name":"PROC TEXTPROFILE","description":"The TEXTPROFILE procedure describes statistical characteristics of textual data in order to provide a profile of a data set and enable comparisons between data sets. This procedure can enable you to make good decisions about cleaning or filtering text data sets. It can help you decide what models to use with the data. You can also use this procedure to detect patterns such as bias in the data.","help":"PROC TEXTPROFILE DATA=libref.data-tableDOCUMENT=documentINTERMEDIATE=intermediateLANGUAGE=languageSENTENCES=sentencesTOKENS=tokens ; \n\tID variable;\n\tINPUT variable;\n\tOUTPUT NOREFERENCEOUT=libref.data-table;","arguments":[{"name":"DATA=","description":"names the input data table for PROC TEXTPROFILE to use.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"DOCUMENT=","optional":true,"description":"specifies the output table that contains statistics about document-level information complexity.","help":"DOCUMENT=*document*","type":"value"},{"name":"INTERMEDIATE=","optional":true,"description":"specifies the output table that contains the token count of each sentence in each document.","help":"INTERMEDIATE=*intermediate*","type":"value"},{"name":"LANGUAGE=","optional":true,"description":"names the language that is used by the documents in the input SAS data table. The languages that the current release supports are Arabic, Chinese, Croatian, Czech, Danish, Dutch, English, Farsi, Finnish, French, German, Greek, Hebrew, Hindi, Hungarian, Indonesian, Italian, Japanese, Kazakh, Korean, Norwegian, Polish, Portuguese, Romanian, Russian, Slovak, Slovene, Spanish, Swedish, Tagalog, Thai, Turkish, and Vietnamese. By default, LANGUAGE=ENGLISH.","help":"LANGUAGE=*language*","type":"value"},{"name":"SENTENCES=","optional":true,"description":"specifies the output table that contains statistics about sentence-level information complexity based on the token count.","help":"SENTENCES=*sentences*","type":"value"},{"name":"TOKENS=","optional":true,"description":"specifies the output table that contains statistics about word-level information density based on the unique tokens. A token is a sequence of characters that are grouped together to represent a single, atomic unit of meaning. Tokens are usually words, but they can also be characters or parts of words.","help":"TOKENS=*tokens*","type":"value"}]},{"name":"ID","description":"The ID statement specifies the variable that contains the ID of each document. In the input data table, each row corresponds to one document. The ID of each document can be either a number or a string of characters.","help":"ID *variable*;","arguments":[{"name":"variable","placeholder":true,"description":"names the ID variable.","type":"value"}]},{"name":"INPUT","description":"The INPUT statement specifies the variable that contains the text to be processed.","help":"INPUT *variable*;","arguments":[{"name":"variable","placeholder":true,"description":"names the INPUT variable.","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates an output data table that contains the generated rules.","help":"OUTPUT *NOREFERENCE**OUT=libref.data-table*;","arguments":[{"name":"NOREFERENCE","optional":true,"description":"excludes reference statistics in the output. By default, reference statistics are included in the output when you omit this option.","type":"standalone"},{"name":"OUT=","optional":true,"description":"specifies the output table that contains statistics about information complexity, information density, and vocabulary diversity. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the output data table.","help":"OUT=*libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casvta","docsetVersion":"latest","docsetTargetFile":"casvta_textprofile_toc.htm"}}