{"name":"TEXTRULE","statements":[{"name":"PROC TEXTRULE","description":"The TEXTRULE procedure generates language interpretation for textual information (LITI) concept or fact rules by using annotated data.","help":"PROC TEXTRULE DATA=libref.data-tableCUTOFF=nEXCLUDE=libref.data-tableGENERATEFACTLANGUAGE=languageNOPREDEFINEDNERREDUCE=n ; \n\tID variable;\n\tINPUT END=_end_LABEL=_concept_START=_start_END=TEXT=_sentence_;\n\tOUTPUT OUT=libref.data-table;","arguments":[{"name":"DATA=","description":"names the input data table for PROC TEXTRULE to use. The input data table contains annotated sentences. Each row corresponds to one sentence and must contain five variables.","help":"DATA=*libref.data-table*","type":"dataSet"},{"name":"CUTOFF=","optional":true,"description":"specifies the maximum number of rules that are returned. By default, CUTOFF=500, which means that PROC TEXTRULE returns the first 500 rules according to their frequency.","help":"CUTOFF=*n*","type":"value"},{"name":"EXCLUDE=","optional":true,"description":"specifies the input table that contains the rules that you want to exclude. libref.data-table is a two-level name, where libref refers to the library, and data-table specifies the name of the input data table.","help":"EXCLUDE=*libref.data-table*","type":"dataSet"},{"name":"GENERATEFACT","optional":true,"description":"determines whether to generate the fact rules. When you specify this option, PROC TEXTRULE generates fact rules only. By default, the procedure generates concept rules only.","type":"standalone"},{"name":"LANGUAGE=","optional":true,"description":"specifies the language that is used in the text variable of the input table. This value is either the name or the two-letter ISO 639-1 language code of a licensed language. If you omit this option, then the default language (English) is used.","help":"LANGUAGE=*language*","type":"value"},{"name":"NOPREDEFINEDNER","optional":true,"description":"determines whether the predefined concepts model should be used to generate concept rules. If you omit this option, the predefined concepts model is used to generate concept rules.","type":"standalone"},{"name":"REDUCE=","optional":true,"description":"removes the rules from the output table if their frequency is less than n. The value of n must be a positive integer. By default, REDUCE=1, which means that no rule is removed.","help":"REDUCE=*n*","type":"value"}]},{"name":"ID","description":"The ID statement specifies the variable that contains the IDs of each sentence. This variable can be either a number or a string of characters. It is used to group data for generating fact rules.","help":"ID *variable*;","arguments":[{"name":"variable","placeholder":true,"description":"names the ID variable.","type":"value"}]},{"name":"INPUT","description":"The INPUT statement specifies the options for input variables that contain the annotated data.","help":"INPUT *variable*;","arguments":[{"name":"END=","description":"specifies the variable that contains the end position of the tagged term in the sentence. By default, END=_end_.","help":"END=*variable*","type":"value"},{"name":"LABEL=","description":"specifies the variable that contains the label of tagged terms. The labels are used as concept names in generated rules. By default, LABEL=_concept_.","help":"LABEL=*variable*","type":"value"},{"name":"START=","description":"specifies the variable that contains the start position of the tagged term in the sentence. By default, START=_start_.","help":"START=*variable*","type":"value"},{"name":"TEXT=","description":"specifies the variable that contains the text to be processed. This text contains tagged terms. By default, TEXT=_sentence_.","help":"TEXT=*variable*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates an output data table that contains the generated rules.","help":"OUTPUT *OUT=libref.data-table*;","arguments":[{"name":"OUT=","description":"specifies the name of the output data table.","help":"OUT=*libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casvta","docsetVersion":"latest","docsetTargetFile":"casvta_textrule_toc.htm"}}