{"name":"TIMEID","statements":[{"name":"PROC TIMEID","description":"The TIMEID procedure evaluates a variable in an input data set for its suitability as a time ID variable in SAS procedures and solutions that are used for time series analysis. PROC TIMEID assesses how well a time interval specification fits SAS date or datetime values, or observation numbers used to index a time series. The time interval used in this analysis can be either specified explicitly as input to PROC TIMEID or inferred by the procedure based on values of the time ID variable. The TIMEID procedure produces diagnostic information in the form of data sets and ODS tabular and plotted output. These diagnostic results summarize characteristics of the time ID variable that can help determine its use as an index in other time series procedures and solutions. † PROC TIMEID is intended for use as a tool to either identify the time interval of a variable or prepare problematic data sets for use in subsequent time series analyses. In particular, this procedure can be used to investigate inconsistencies between time ID values and the ID statement options used in other SAS procedures and solutions.","help":"PROC TIMEID <DATA=SAS-data-set> <MAXERROR=number> <NBYOBS=number> <OUTFREQ=SAS-data-set> <OUTINTERVAL=SAS-data-set> <OUTINTERVALDETAILS=SAS-data-set> <PLOT=COUNTS|INTCNTS|INTERVALCOUNTS | OFFSETS | PERIODS|SPANS... > <PRINT=COUNTS|INTCNTS|INTERVALCOUNTS | INTERVAL | OFFSETS... >;     \n\tBY variables ; ;     \n\tID <ALIGN=<BEGINNING|BEG|B | MIDDLE|MID|M | ENDING|END|E>... > <DUPLICATES> <FORMAT=format> ...; ","arguments":[{"name":"DATA=","optional":true,"description":"Names the SAS data set that contains the input data for the procedure. If the DATA= option is not specified, the most recently created SAS data set is used.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"MAXERROR=","optional":true,"description":"Limits the number of warning and error messages produced during the execution of the procedure to the specified value. The default is MAXERRORS=50. This option is particularly useful in BY-group processing where it can be used to suppress recurring messages.","help":"MAXERROR=*number*","type":"value"},{"name":"NBYOBS=","optional":true,"description":"Limits the number of observations that are used to analyze the time ID variable. The NBYOBS= option should be used instead of the OBS= data set option when BY variables are specified. The NBYOBS= option excludes observations from incomplete BY groups in the analysis. This option guarantees that any truncation of the DATA= data set occurs at a BY-group boundary. Only BY groups that are completely contained within the first number of observations are processed. When the NBYOBS= option is omitted, all observations are processed.","help":"NBYOBS=*number*","type":"value"},{"name":"OUTFREQ=","optional":true,"description":"Names the output data set to contain the frequency counts of each unique value of the time ID variable. The frequency counts are performed on time ID values that are recorded in the DATA= data set. The time ID values are not aligned with respect to an interval prior to computation of the frequency counts.","help":"OUTFREQ=*SAS-data-set*","type":"dataSet"},{"name":"OUTINTERVAL=","optional":true,"description":"Names the output data set to contain the time ID interval information that is summarized across all BY groups in the DATA= data set.","help":"OUTINTERVAL=*SAS-data-set*","type":"dataSet"},{"name":"OUTINTERVALDETAILS=","optional":true,"description":"Names the output data set to contain the time ID interval information for each BY group.","help":"OUTINTERVALDETAILS=*SAS-data-set*","type":"dataSet"},{"name":"PLOT=","optional":true,"description":"Specifies the graphical output desired. By default, the TIMEID procedure produces no graphical output. The following global-options are available:","help":"PLOT=COUNTS | OFFSETS | PERIODS | VALUES | ALL","type":"choice","arguments":[{"name":"COUNTS","aliases":["INTCNTS","INTERVALCOUNTS"],"description":"Plots a histogram of the time ID interval counts.","type":"standalone"},{"name":"OFFSETS","description":"Plots a histogram of the time offsets for the time ID values.","type":"standalone"},{"name":"PERIODS","aliases":["SPANS"],"description":"Plots a histogram of the spans between adjacent time ID values.","type":"standalone"},{"name":"VALUES","description":"Plots a panel of the counts, offsets, and spans for each of the time ID values.","type":"standalone"},{"name":"ALL","description":"Is equivalent to specifying PLOT=(INTERVALCOUNTS SPANS OFFSETS VALUES).","type":"standalone"}]},{"name":"PRINT=","optional":true,"description":"Specifies the printed output desired. By default, the TIMEID procedure produces no printed output.","help":"PRINT=COUNTS | INTERVAL | OFFSETS | PERIODS | VALUES | ALL","type":"choice","arguments":[{"name":"COUNTS","aliases":["INTCNTS","INTERVALCOUNTS"],"description":"Prints a table that contains the counts of time ID values per interval.","type":"standalone"},{"name":"INTERVAL","description":"Prints a summary of information about the time interval.","type":"standalone"},{"name":"OFFSETS","description":"Prints a table that contains the time offsets for the time ID values.","type":"standalone"},{"name":"PERIODS","aliases":["SPANS"],"description":"Prints tables that contain statistics on the spans between adjacent time ID values.","type":"standalone"},{"name":"VALUES","description":"Prints tables that contain offset span and count information for the time ID values.","type":"standalone"},{"name":"ALL","description":"Is equivalent to specifying PRINT=(INTERVALCOUNTS SPANS INTERVAL OFFSETS VALUES).","type":"standalone"}]}]},{"name":"BY","description":"A BY statement can be used with PROC TIMEID to obtain separate analyses for groups of observations defined by the BY variables.","help":"BY variables ; "},{"name":"ID","description":"The ID statement names a numeric variable that identifies observations in the input and output data sets. The ID variable’s values are assumed to be SAS date or datetime values. The ID statement options specify how the time ID values are spaced and aligned relative to a SAS date or datetime interval. The INTERVAL= option specifies the fundamental spacing that is used as the basis for counting intervals, offsets, and spans in the data. Specification of the ID variable in an ID statement is required.","help":"ID &lt;ALIGN=&lt;BEGINNING|BEG|B | MIDDLE|MID|M | ENDING|END|E&gt;... &gt; &lt;DUPLICATES&gt; &lt;FORMAT=format&gt; ...","arguments":[{"name":"ALIGN=","optional":true,"description":"Specifies the alignment of the identifying SAS date or datetime that is used to represent intervals. The value of the ALIGN= option is used in the analysis of the time ID variable.","help":"ALIGN=BEGINNING|BEG|B | MIDDLE|MID|M | ENDING|END|E | INFER*alignment*","type":"value","arguments":[{"name":"BEGINNING","aliases":["BEG","B"],"description":"Specifies that the identifying date for the interval is the beginning date in the interval.","type":"standalone"},{"name":"MIDDLE","aliases":["MID","M"],"description":"Specifies that the identifying date for the interval is the middle date in the interval.","type":"standalone"},{"name":"ENDING","aliases":["END","E"],"description":"Specifies that the identifying date for the interval is the ending date in the interval.","type":"standalone"},{"name":"INFER","description":"Specifies that the alignment of values within time intervals be inferred from the time ID values.","type":"standalone"}]},{"name":"DUPLICATES","optional":true,"description":"Specifies that multiple observations in the DATA= data set can fall within the same time interval as defined by the time ID variable. When this option is omitted and multiple time ID values are encountered in a single time interval, error messages are written to the SAS log.","type":"standalone"},{"name":"FORMAT=","optional":true,"description":"Specifies the SAS format used for time ID values in the data sets and in printed and plotted output that is generated by PROC TIMEID. If the FORMAT= option is not specified, the format applied to the input time ID variable is used. If neither of these formats is specified, the format is inferred from the INTERVAL= option.","help":"FORMAT=*format*","type":"value"},{"name":"INTERVAL=","optional":true,"description":"Specifies the proposed time interval and shift that describe the time ID values in the input data set.","help":"INTERVAL=DAY | HOUR | MINUTE | SECOND | WEEK | MONTH | YEAR | QTR | TENDAY | SEMIMONTH | SEMIYEAR | WEEKDAY | YEARV | R445YR | R454YR | R544YR | R445QTR | R454QTR | R544QTR | R445MON | R454MON | R544MON | WEEKV*interval*","type":"value","arguments":[{"name":"DAY","description":"Specifies daily intervals. Abbreviations are DAY, DAYS, and DAILY. The starting subperiod s is in days (DAY).","type":"standalone"},{"name":"HOUR","description":"Specifies hourly intervals. Aliases are HOUR, DTHOUR, HOURS, DTHOURS, HOURLY, DTHOURLY, HR, and DTHR. The starting subperiod s is in hours (HOUR).","type":"standalone"},{"name":"MINUTE","description":"Specifies minute intervals. Aliases are MINUTE, DTMINUTE, MINUTES, DTMINUTES, MIN, and DTMIN. The starting subperiod s is in minutes (MINUTE).","type":"standalone"},{"name":"SECOND","description":"Specifies second intervals. Aliases are SECOND, DTSECOND, SECONDS, DTSECONDS, SEC and DTSEC. The starting subperiod s is in seconds (SECOND).","type":"standalone"},{"name":"WEEK","description":"Specifies weekly intervals of seven days. Abbreviations are WEEK, WEEKS, and WEEKLY. The starting subperiod s is in days (DAY), with the days of the week numbered as 1=Sunday, 2=Monday, 3=Tuesday, 4=Wednesday, 5=Thursday, 6=Friday, and 7=Saturday. For example, WEEK.7 means weekly with Saturday as the first day of the week.","type":"standalone"},{"name":"MONTH","description":"Specifies monthly intervals. Abbreviations are MONTH, MONTHS, MONTHLY, and MON. The starting subperiod s is in months (MONTH). For example, MONTH2.2 intervals are February– March, April–May, June–July, August–September, October–November, and December–January of the following year.","type":"standalone"},{"name":"YEAR","description":"Specifies yearly intervals. Abbreviations are YEAR, YEARS, YEARLY, YR, ANNUAL, A NNUALLY, and ANNUALS. The starting subperiod s is in months (MONTH).","type":"standalone"},{"name":"QTR","description":"Specifies quarterly intervals (every three months). Abbreviations are QTR, QUARTER, QUARTERS, QUARTERLY, QTRLY, and QTRS. The starting subperiod s is in months (MONTH).","type":"standalone"},{"name":"TENDAY","description":"Specifies 10-day intervals. TENDAY breaks the month into three periods, the 1st through the 10th day of the month, the th through the th day of the month, and the remainder of the month. (TENDAY is a special interval typically used for reporting automobile sales data.) The starting subperiod s is in TENDAY periods.","type":"standalone"},{"name":"SEMIMONTH","description":"Specifies semimonthly intervals. SEMIMONTH breaks each month into two periods, starting on the st and th days. Abbreviations are SEMIMONTH, SEMIMONTHS, SEMIMONTHLY, and SEMIMON. The starting subperiod s is in SEMIMONTH periods.","type":"standalone"},{"name":"SEMIYEAR","description":"Specifies semiannual intervals (every six months). Abbreviations are SEMIYEAR, SEMIYEARS, SEMIYEARLY, SEMIYR, SEMIANNUAL, and SEMIANN. The starting subperiod s is in months (MONTH).","type":"standalone"},{"name":"WEEKDAY","description":"Specifies daily intervals with weekend days included in the preceding weekday. Note that for a five-day work week that starts on Monday, the appropriate interval is WEEKDAY5.2. Abbreviations are WEEKDAY and WEEKDAYS. The starting subperiod s is in weekdays (WEEKDAY).","type":"standalone"},{"name":"YEARV","description":"Specifies ISO 8601 yearly intervals. The ISO 8601 year starts on the Monday on or immediately preceding January th. Note that it is possible for the ISO 8601 year to start in December of the preceding year. Also, some ISO 8601 years contain a leap week.","type":"standalone"},{"name":"R445YR","description":"Is the same as YEARV except that the starting subperiod s is in retail 4-4-5 months (R445MON).","type":"standalone"},{"name":"R454YR","description":"Is the same as YEARV except that the starting subperiod s is in retail 4-5-4 months (R454MON).","type":"standalone"},{"name":"R544YR","description":"Is the same as YEARV except that the starting subperiod s is in retail 5-4-4 months (R544MON).","type":"standalone"},{"name":"R445QTR","description":"Specifies retail 4-4-5 quarterly intervals (every 13 ISO 8601 weeks). Some fourth quarters contain a leap week. The starting subperiod s is in retail 4-4-5 months (R445MON).","type":"standalone"},{"name":"R454QTR","description":"Specifies retail 4-5-4 quarterly intervals (every 13 ISO 8601 weeks). Some fourth quarters contain a leap week.","type":"standalone"},{"name":"R544QTR","description":"Specifies retail 5-4-4 quarterly intervals (every 13 ISO 8601 weeks). Some fourth quarters contain a leap week. The starting subperiod s is in retail 5-4-4 months (R544MON).","type":"standalone"},{"name":"R445MON","description":"Specifies retail 4-4-5 monthly intervals. The 3rd, 6th, 9th, and 12th months are five ISO 8601 weeks long with the exception that some th months contain leap weeks. All other months are four ISO 8601 weeks long. R445MON intervals begin with the 1st, 5th, 9th, 14th, 18th, 22nd, 27th, 31st, 35th, 40th, 44th, and 48th weeks of the ISO year. The starting subperiod s is in retail 4-4-5 months (R445MON).","type":"standalone"},{"name":"R454MON","description":"Specifies retail 4-5-4 monthly intervals. The 2nd, 5th, 8th, and 11th months are five ISO 8601 weeks long. All other months are four ISO 8601 weeks long with the exception that some 12th months contain leap weeks. R454MON intervals begin with the 1st, 5th, 10th, 14th, 18th, 23rd, 27th, 31st, 36th, 40th, 44th, and 49th weeks of the ISO year.","type":"standalone"},{"name":"R544MON","description":"Specifies retail 5-4-4 monthly intervals. The 1st, 4th, 7th, and 10th months are five ISO 8601 weeks long. All other months are four ISO 8601 weeks long with the exception that some th months contain leap weeks. R544MON intervals begin with the 1st, 6th, 10th, 14th, 19th, 23rd, 27th, 32nd, 36th, 40th, 45th, and 49th weeks of the ISO year. The starting subperiod s is in retail 5-4-4 months (R544MON).","type":"standalone"},{"name":"WEEKV","description":"Specifies ISO 8601 weekly intervals of seven days. Each week starts on Monday. The starting subperiod s is in days (DAY). Note that WEEKV differs from WEEK in that WEEKV.1 starts on Monday, WEEKV.2 starts on Tuesday, and so forth.","type":"standalone"}]},{"name":"NOTSORTED","optional":true,"description":"Specifies that the observations in the DATA= data set are not sorted by the time ID variable. When this option is omitted, error messages are generated for time ID values that are not sorted in ascending order.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"latest","docsetTargetFile":"etsug_timeid_toc.htm"}}