{"name":"TMSCORE","statements":[{"name":"PROC TMSCORE","description":"The TMSCORE procedure scores textual data in SAS Viya. In text mining, scoring is the process of applying parsing and singular value decomposition (SVD) projections to new textual data. The TMSCORE procedure performs this scoring of new documents, and its primary outputs are the Outparent data table (which holds the parsing results of the term-by-document matrix) and the Outdocpro data table (which holds the reduced dimensional representation of the score collection). PROC TMSCORE uses some of the output data tables of the TEXTMINE procedure as input data to ensure consistency between scoring and training. During scoring, the new textual data must be parsed using the same settings that the training data were parsed with, indexed using only the subset of terms that were used during training, and projected onto the reduced-dimensional subspace of the singular value decomposition that was derived from the training data. To facilitate this process, you specify the CONFIG=, TERMS=, and SVDU= options in PROC TEXTMINE to create three data tables (Outconfig, Outterms, and Svdu, respectively), and then you specify those three data tables as inputs to PROC TMSCORE.","help":"PROC TMSCORE <CONFIG=CAS-libref.data-table> <DATA=CAS-libref.data-table> <OUTPARENT=CAS-libref.data-table> <SVDDOCPRO=CAS-libref.data-table> <SVDU=CAS-libref.data-table> <TERMS=CAS-libref.data-table>;     \n\tDOC_ID variable ;\n    \n\tVARIABLES variable ; | VAR variable ;\n","arguments":[{"name":"CONFIG=","optional":true,"description":"Specifies the input data table that contains configuration information for PROC TMSCORE. CASlibref. data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"CONFIG=*CAS-libref.data-table*","type":"dataSet"},{"name":"DATA=","optional":true,"aliases":["DOC="],"description":"Names the input data table for PROC TMSCORE to use. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"OUTPARENT=","optional":true,"description":"Specifies the output data table to contain a compressed representation of the sparse term-by-document frequency matrix. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"OUTPARENT=*CAS-libref.data-table*","type":"dataSet"},{"name":"SVDDOCPRO=","optional":true,"description":"Specifies the output data table to contain the reduced dimensional projections for each document. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the output data table.","help":"SVDDOCPRO=*CAS-libref.data-table*","type":"dataSet"},{"name":"SVDU=","optional":true,"description":"Specifies the input data table that contains the U matrix, which is created during training by PROC TEXTMINE. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"SVDU=*CAS-libref.data-table*","type":"dataSet"},{"name":"TERMS=","optional":true,"description":"Specifies the input data table of terms to be used by PROC TMSCORE. CAS-libref.data-table is a two-level name, where CAS-libref refers to the caslib and session identifier, and data-table specifies the name of the input data table.","help":"TERMS=*CAS-libref.data-table*","type":"dataSet"}]},{"name":"DOC_ID","description":"This statement specifies the variable that contains the ID of each document. The ID of each document must be unique; it can be either a number or a string of characters.","help":"DOC_ID variable "},{"name":"VARIABLES","aliases":["VAR"],"description":"This statement specifies the variable that contains the text to be processed.","help":"VARIABLES variable ; | VAR variable "}],"supportSiteInformation":{"docsetId":"casml","docsetVersion":"v_017","docsetTargetFile":"casml_tmscore_toc.htm"}}