{"name":"TPSPLINE","statements":[{"name":"PROC TPSPLINE","description":"The TPSPLINE procedure uses the penalized least squares method to fit a nonparametric regression model. It computes thin-plate smoothing splines to approximate smooth multivariate functions observed with noise. The TPSPLINE procedure allows great flexibility in the possible form of the regression surface. In particular, PROC TPSPLINE makes no assumptions of a parametric form for the model. The generalized cross validation (GCV) function can be used to select the amount of smoothing. † The TPSPLINE procedure uses the penalized least squares method to fit the data with a flexible model in which the number of effective parameters can be as large as the number of unique design points. Hence, as the sample size increases, the model space also increases, enabling the thin-plate smoothing spline to fit more complicated situations. † The main features of the TPSPLINE procedure are as follows: † o provides penalized least squares estimates o supports the use of multidimensional data o supports multiple SCORE statements o fits both semiparametric models and nonparametric models o provides options for handling large data sets o supports multiple dependent variables o enables you to choose a particular model by specifying the model degrees of freedom or smoothing parameter o supports graphical displays produced through ODS Graphics","help":"PROC TPSPLINE <DATA=SAS-data-set>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tFREQ variable ;\n    \n\tID variables ;\n    \n\tMODEL <ALPHA=number> <DF=number> <DISTANCE=number> ...;\n    \n\tOUTPUT <OUT=SAS-data-set> <PRED> <RESID> ...;\n    \n\tSCORE <DATA=SAS-data-set> <OUT=SAS-data-set> <PRED> ...;\n","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be read by PROC TPSPLINE. The default value is the most recently created data set.","help":"DATA=*SAS-data-set*","type":"dataSet"}]},{"name":"BY","description":"You can specify a BY statement with PROC TPSPLINE to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","aliases":["FREQUENCY"],"description":"If one variable in your input data set represents the frequency of occurrence for other values in the observation, specify the variable’s name in a FREQ statement. PROC TPSPLINE treats the data as if each observation appears n times, where n is the value of the FREQ variable for the observation.","help":"FREQ variable "},{"name":"ID","description":"The variables in the ID statement are copied from the input data set to the OUT= data set. If you omit the ID statement, only the variables used in the MODEL statement and requested statistics are included in the output data set.","help":"ID variables "},{"name":"MODEL","description":"The MODEL statement specifies the dependent variables, the independent regression variables, which are listed with no parentheses, and the independent smoothing variables, which are listed inside parentheses.","help":"MODEL &lt;ALPHA=number&gt; &lt;DF=number&gt; &lt;DISTANCE=number&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"followsDelimiter":"/","description":"Specifies the significance level α of the confidence limits on the final thin-plate smoothing spline estimate when you request confidence limits to be included in the output data set. Specify number as a value between 0 and 1. The default value is 0.05.","help":"ALPHA=*number*","type":"value"},{"name":"DF=","optional":true,"followsDelimiter":"/","description":"Specifies the degrees of freedom of the thin-plate smoothing spline estimate.","help":"DF=*number*","type":"value"},{"name":"DISTANCE=","optional":true,"followsDelimiter":"/","aliases":["D="],"description":"You can use the DISTANCE= option to reduce the number of unique design points by treating nearby data as replicates.","help":"DISTANCE=*number*","type":"value"},{"name":"LAMBDA0=","optional":true,"followsDelimiter":"/","description":"Specifies the smoothing parameter, λo, to be used in the thin-plate smoothing spline estimate","help":"LAMBDA0=*number*","type":"value"},{"name":"LAMBDA=","optional":true,"followsDelimiter":"/","description":"Specifies a set of values for the λ parameter.","help":"LAMBDA=*list-of-values*","type":"value"},{"name":"LOGNLAMBDA0=","optional":true,"followsDelimiter":"/","aliases":["LOGNL0="],"description":"Specifies the smoothing parameter, λo, on the log scale.","help":"LOGNLAMBDA0=*number*","type":"value"},{"name":"LOGNLAMBDA=","optional":true,"followsDelimiter":"/","aliases":["LOGNL="],"description":"Specifies a set of values for the smoothing parameter, λo, on the log scale.","help":"LOGNLAMBDA=*list-of-values*","type":"value"},{"name":"M=","optional":true,"followsDelimiter":"/","description":"Specifies the order of the derivative in the penalty term. The M= value must be a positive integer.","help":"M=*number*","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set containing diagnostic measures calculated after fitting the model.","help":"OUTPUT &lt;OUT=SAS-data-set&gt; &lt;PRED&gt; &lt;RESID&gt; ...","arguments":[{"name":"ADIAG","optional":true,"description":"Diagonal element of the hat matrix associated with the observation","type":"standalone"},{"name":"COEF","optional":true,"description":"Coefficients","type":"standalone"},{"name":"LCLM","optional":true,"description":"Lower limit of the confidence interval for the expected value of the dependent variables.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies the name of the new data set to contain the diagnostic measures. This specification is required.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PRED","optional":true,"description":"Predicted values","type":"standalone"},{"name":"RESID","optional":true,"description":"Residual values","type":"standalone"},{"name":"STD","optional":true,"description":"Standard error of the mean predicted value","type":"standalone"},{"name":"UCLM","optional":true,"description":"Upper limit of the confidence interval for the expected value of the dependent variables.","type":"standalone"}]},{"name":"SCORE","description":"The SCORE statement calculates predicted values for a new data set. If you have multiple data sets to predict, you can specify multiple SCORE statements. You must use a SCORE statement for each data set.","help":"SCORE &lt;DATA=SAS-data-set&gt; &lt;OUT=SAS-data-set&gt; &lt;PRED&gt; ...","arguments":[{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set containing the smoothing variables x and regression variables z.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"LCLM","optional":true,"description":"Lower limit of the Bayesian confidence interval for the expected value of the dependent variables. By default, PROC TPSPLINE computes 95% confidence limits.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies the name of the SAS data set to contain the predictions.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PRED","optional":true,"description":"Predicted values","type":"standalone"},{"name":"STD","optional":true,"description":"Standard error of the mean predicted value","type":"standalone"},{"name":"UCLM","optional":true,"description":"Upper limit of the Bayesian confidence interval for the expected value of the dependent variables. By default, PROC TPSPLINE computes 95% confidence limits.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_033","docsetTargetFile":"statug_tpspline_toc.htm"}}