{"name":"TRANSREG","statements":[{"name":"PROC TRANSREG","description":"The TRANSREG (transformation regression) procedure fits linear models, optionally with smooth, spline, Box-Cox, and other nonlinear transformations of the variables. You can use PROC TRANSREG to fit a curve through a scatter plot or fit multiple curves, one for each level of a classification variable. You can also constrain the functions to be parallel or monotone or have the same intercept. PROC TRANSREG can be used to code experimental designs and classification variables prior to their use in other analyses.","help":"PROC TRANSREG <ADDITIVE> <ADPREFIX=name> <AIPREFIX=name> <ALPHA=number> <APPROXIMATIONS> <CANONICAL> <CCC> <CCONVERGE=n> <CDPREFIX=name> <CEC> <CILPREFIX=name> <CIPREFIX=name> <CIUPREFIX=name> <CL> <CLI> <CLM> <CMLPREFIX=name> <CMUPREFIX=name> <COEFFICIENTS> <CONVERGE=n> <COORDINATES<=n>> <CPC> <CPREFIX=n> <CQC> <DAPPROXIMATIONS> <DATA=SAS-data-set> <DEPENDENT=name> <DESIGN<=n>> <DETAIL> <DREPLACE> <HISTORY> <IAPPROXIMATIONS> <INDIVIDUAL> <IREPLACE> <LEVERAGE<=name>> <LILPREFIX=name> <LIUPREFIX=name> <LMLPREFIX=name> <LMUPREFIX=name> <LPREFIX=n> <MACRO(keyword=name...)> <MAXITER=n> <MEANS> <MEC> <METHOD=CANALS | MORALS | REDUNDANCY... > <MONOTONE=two-letters> <MPC> <MQC> <MRC> <MREDUNDANCY> <NCAN=n> <NOINT> <NOMISS> <NOPRINT> <NORESTOREMISSING> <NOSCORES> <NOZEROCONSTANT> <NSR> <ORDER=DATA | FREQ | FORMATTED... > <OUTTEST=SAS-data-set> <PBOXCOXTABLE> <PLOTS=ALL | BOXCOX|BOX | FIT... > <PPREFIX=name> <PREDICTED> <RDPREFIX=name> <REDUNDANCY=STANDARDIZE | UNSTANDARDIZE> <REFERENCE=NONE | MISSING | ZERO> <REITERATE> <REPLACE> <RESIDUALS> <RPREFIX=name> <RSQUARE> <SEPARATORS=’string-1’ <’string-2’>> <SHORT> <SINGULAR=n> <SOLVE> <SS2> <TDPREFIX=name> <TEST> <TIPREFIX=name> <TSTANDARD=CENTER | NOMISS | ORIGINAL... > <TSUFFIX=n> <TYPE=’text’|name> <UNTIE=two-letters> <UTILITIES>;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tFREQ variable ;\n    \n\tID variables ;\n    \n\tMODEL BSPLINE CLASS EPOINT ...;\n    \n\tOUTPUT <ADPREFIX=name> <AIPREFIX=name> <OUT=SAS-data-set> ...;\n    \n\tWEIGHT variable;\n","arguments":[{"name":"ADDITIVE","optional":true,"aliases":["ADD"],"description":"Creates an additive model by multiplying the values of each independent variable (after the TSTANDARD= standardization) by that variable’s corresponding multiple regression coefficient. This process scales the independent variables so that the predicted-values variable for the final dependent variable is simply the sum of the final independent variables. An additive model is a univariate multiple regression model. As a result, the ADDITIVE a-option is not valid if METHOD=CANALS, or if METHOD=REDUNDANCY or METHOD=UNIVARIATE with more than one dependent variable.","type":"standalone"},{"name":"ADPREFIX=","optional":true,"aliases":["ADP="],"description":"Specifies a prefix for naming the dependent variable predicted values. The default is ADPREFIX=P when you specify the PREDICTED o-option; otherwise, it is ADPREFIX=A. When you specify the ADPREFIX= o-option, the PREDICTED o-option is automatically specified for you. The ADPREFIX= o-option is the same as the PPREFIX= o-option.","help":"ADPREFIX=*name*","type":"value"},{"name":"AIPREFIX=","optional":true,"aliases":["AIP="],"description":"Specifies a prefix for naming the independent variable approximations. The default is AIPREFIX=A. When you specify the AIPREFIX= o-option, the IAPPROXIMATIONS o-option is automatically specified for you.","help":"AIPREFIX=*name*","type":"value"},{"name":"ALPHA=","optional":true,"aliases":["ALP="],"description":"Specifies the level of significance for all of the confidence limits. By default, ALPHA=0.05.","help":"ALPHA=*number*","type":"value"},{"name":"APPROXIMATIONS","optional":true,"aliases":["APPROX","APP"],"description":"Is equivalent to specifying both the DAPPROXIMATIONS and the IAPPROXIMATIONS o-options. If you specify METHOD=UNIVARIATE, then the APPROXIMATIONS o-option specifies only the DAPPROXIMATIONS o-option.","type":"standalone"},{"name":"CANONICAL","optional":true,"aliases":["CAN"],"description":"Outputs canonical variables to the OUT= data set. When you specify METHOD=CANALS, the CANONICAL o-option is automatically specified for you. The CDPREFIX= o-option specifies a prefix for naming the dependent canonical variables (default Cand), and the CIPREFIX= o-option specifies a prefix for naming the independent canonical variables (default Cani).","type":"standalone"},{"name":"CCC","optional":true,"description":"Outputs canonical correlation coefficients to the OUT= data set.","type":"standalone"},{"name":"CCONVERGE=","optional":true,"aliases":["CCO="],"description":"Specifies the minimum change in the criterion being optimized (squared multiple correlation for METHOD=MORALS and METHOD=UNIVARIATE, average squared multiple correlation for METHOD=REDUNDANCY, average squared canonical correlation for METHOD=CANALS) that is required to continue iterating. By default, CCONVERGE=0.0.","help":"CCONVERGE=*n*","type":"value"},{"name":"CDPREFIX=","optional":true,"aliases":["CDP="],"description":"Provides a prefix for naming the canonical dependent variables. The default is CDPREFIX=Cand. When you specify the CDPREFIX= o-option, the CANONICAL o-option is automatically specified for you.","help":"CDPREFIX=*name*","type":"value"},{"name":"CEC","optional":true,"description":"Outputs canonical elliptical point model coordinates to the OUT= data set.","type":"standalone"},{"name":"CILPREFIX=","optional":true,"aliases":["CIL="],"description":"Specifies a prefix for naming the conservative-individual-lower confidence limits. The default prefix is CIL. When you specify the CILPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"CILPREFIX=*name*","type":"value"},{"name":"CIPREFIX=","optional":true,"aliases":["CIP="],"description":"Provides a prefix for naming the canonical independent variables. The default is CIPREFIX=Cani. When you specify the CIPREFIX= o-option, the CANONICAL o-option is automatically specified for you.","help":"CIPREFIX=*name*","type":"value"},{"name":"CIUPREFIX=","optional":true,"aliases":["CIU="],"description":"Specifies a prefix for naming the conservative-individual-upper confidence limits. The default prefix is CIU. When you specify the CIUPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"CIUPREFIX=*name*","type":"value"},{"name":"CL","optional":true,"description":"Requests confidence limits on the parameter estimates in the displayed output.","type":"standalone"},{"name":"CLI","optional":true,"description":"Outputs individual confidence limits to the OUT= data set. The names of the confidence limits variables are constructed from the original dependent variable names and the prefixes specified in the following o-options: LILPREFIX= (default LIL for liberal individual lower), CILPREFIX= (default CIL for conservative individual lower), LIUPREFIX= (default LIU for liberal individual upper), and CIUPREFIX= (default CIU for conservative individual upper). When there are no monotonicity constraints, the liberal and conservative limits are the same.","type":"standalone"},{"name":"CLM","optional":true,"description":"Outputs mean confidence limits to the OUT= data set. The names of the confidence limits variables are constructed from the original dependent variable names and the prefixes specified in the following o-options: LMLPREFIX= (default LML for liberal mean lower), CMLPREFIX= (default CML for conservative mean lower), LMUPREFIX= (default LMU for liberal mean upper), and CMUPREFIX= (default CMU for conservative mean upper). When there are no monotonicity constraints, the liberal and conservative limits are the same.","type":"standalone"},{"name":"CMLPREFIX=","optional":true,"aliases":["CML="],"description":"Specifies a prefix for naming the conservative-mean-lower confidence limits. The default prefix is CML. When you specify the CMLPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"CMLPREFIX=*name*","type":"value"},{"name":"CMUPREFIX=","optional":true,"description":"Specifies a prefix for naming the conservative-mean-upper confidence limits. The default prefix is CMU. When you specify the CMUPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"CMUPREFIX=*name*","type":"value"},{"name":"COEFFICIENTS","optional":true,"aliases":["COE"],"description":"Outputs either multiple regression coefficients or raw canonical coefficients to the OUT= data set. If you specify METHOD=CANALS (in the MODEL or PROC TRANSREG statement), then the COEFFICIENTS o-option outputs the first n canonical variables, where n is the value of the NCAN= a-option (specified in the MODEL or PROC TRANSREG statement). Otherwise, the COEFFICIENTS o-option includes multiple regression coefficients in the OUT= data set. In addition, when you specify the CLASS expansion for any independent variable, the COEFFICIENTS o-option also outputs marginal means.","type":"standalone"},{"name":"CONVERGE=","optional":true,"aliases":["CON="],"description":"Specifies the minimum average absolute change in standardized variable scores that is required to continue iterating. By default, CONVERGE=0.00001. Average change is computed over only those variables that can be transformed by the iterations; that is, all LINEAR, OPSCORE, MONOTONE, UNTIE, SPLINE, MSPLINE, and SSPLINE variables and nonoptimal transformation variables with missing values.","help":"CONVERGE=*n*","type":"value"},{"name":"COORDINATES=","optional":true,"aliases":["COO="],"description":"Outputs either ideal point or vector model coordinates for preference mapping to the OUT= data set. When METHOD=CANALS, these coordinates are computed from canonical coefficients; otherwise, the coordinates are computed from multiple regression coefficients. For details, see the section Point Models.","type":"value"},{"name":"CPC","optional":true,"description":"Outputs canonical point model coordinates to the OUT= data set.","type":"standalone"},{"name":"CPREFIX=","optional":true,"aliases":["CPR="],"description":"Specifies the number of first characters of a CLASS expansion variable’s name to use in constructing names for coded variables. Coded variable names are constructed from the first n characters of the CLASS expansion variable’s name and the first 32 - n characters of the formatted CLASS expansion variable’s value. For example, if the variable ClassVariable has values 1, 2, and 3, then, by default, the coded variables are named ClassVariable1, ClassVariable2, and ClassVariable3. However, with CPREFIX=5, the coded variables are named Class1, Class2, and Class3. When CPREFIX=0, coded variable names are created entirely from the CLASS expansion variable’s formatted values. Valid values range from –1 to 31, where –1 indicates the default calculation and 0 to 31 are the number of prefix characters to use. The default, –1, sets n to 32 – min(32, max(2, fl)), where fl is the format length. When you specify CPREFIX= as an a-option or an o-option, it specifies the default for all CLASS variables. When you specify CPREFIX= as a t-option, it overrides the default only for selected variables.","help":"CPREFIX=*n*","type":"value"},{"name":"CQC","optional":true,"description":"Outputs canonical quadratic point model coordinates to the OUT= data set.","type":"standalone"},{"name":"DAPPROXIMATIONS","optional":true,"aliases":["DAP"],"description":"Outputs the approximations of the transformed dependent variables to the OUT= data set. These are the target values for the optimal transformations. With METHOD=UNIVARIATE and METHOD=MORALS, the dependent variable approximations are the ordinary predicted values from the linear model. The names of the approximation variables are constructed from the ADPREFIX= o-option (default A) and the original dependent variable names. For ordinary predicted values, use the PREDICTED o-option instead of the DAPPROXIMATIONS o-option, since the PREDICTED o-option uses a more relevant prefix (\"P\" instead of \"A\") and a more relevant variable label suffix (\"Predicted Values\" instead of \"Approximations\").","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be analyzed. If you do not specify the DATA= option, PROC TRANSREG uses the most recently created SAS data set. The data set must be an ordinary SAS data set; it cannot be a special TYPE= data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"DEPENDENT=","optional":true,"aliases":["DEP="],"description":"Specifies the untransformed dependent variable for OUT= data sets with METHOD=MORALS when there is more than one dependent variable. The default is DEPENDENT=_DEPEND_.","help":"DEPENDENT=*name*","type":"value"},{"name":"DESIGN=","optional":true,"aliases":["DES="],"description":"Specifies that your primary goal is design matrix coding, not analysis. Specifying the DESIGN o-option makes the procedure run faster. The DESIGN o-option sets the default method to UNIVARIATE and the default MAXITER= value to zero. It suppresses computing the regression coefficients, unless they are needed for some other option. Furthermore, when the DESIGN o-option is specified, the MODEL statement is not required to have an equal sign. When no MODEL statement equal sign is specified, all variables are considered independent variables, all options that require dependent variables are ignored, and the IREPLACE o-option is automatically specified for you.","type":"value"},{"name":"DETAIL","optional":true,"aliases":["DET"],"description":"Reports on details of the model specification. For example, it reports the knots and coefficients for splines, reference levels for CLASS variables, Box-Cox results, the smoothing parameter, and so on. The DETAIL option can take two optional suboptions, NOCOEFFICIENTS and NOKNOTS (or NOC and NOK). To suppress knots from the details listing, specify DETAIL(NOKNOTS). To suppress coefficients from the details listing, specify DETAIL(NOCOEFFICIENTS). To suppress both knots and coefficients from the details listing, specify DETAIL(NOKNOTS NOCOEFFICIENTS).","type":"standalone"},{"name":"DREPLACE","optional":true,"aliases":["DRE"],"description":"Replaces the original dependent variables with the transformed dependent variables in the OUT= data set. The names of the transformed variables in the OUT= data set correspond to the names of the original dependent variables in the input data set. By default, both the original dependent variables and the transformed dependent variables (with names constructed from the TDPREFIX= (default T) o-option and the original dependent variable names) are included in the OUT= data set.","type":"standalone"},{"name":"HISTORY","optional":true,"aliases":["HIS"],"description":"Displays the iteration histories even when the NOPRINT a-option is specified.","type":"standalone"},{"name":"IAPPROXIMATIONS","optional":true,"aliases":["IAP"],"description":"Outputs the approximations of the transformed independent variables to the OUT= data set. These are the target values for the optimal transformations. The names of the approximation variables are constructed from the AIPREFIX= o-option (default A) and the original independent variable names. When you specify the AIPREFIX= o-option, the IAPPROXIMATIONS o-option is automatically specified for you. The IAPPROXIMATIONS o-option is not valid when METHOD=UNIVARIATE.","type":"standalone"},{"name":"INDIVIDUAL","optional":true,"aliases":["IND"],"description":"Fits each model for each dependent variable individually. This means, for example, that when INDIVIDUAL is specified, missing values in one dependent variable will not cause that observation to be deleted for the other models with the other dependent variables. In contrast, by default, missing values in any variable in any model can cause the observation to be deleted for all models. The INDIVIDUAL a-option can be specified only with METHOD=MORALS.","type":"standalone"},{"name":"IREPLACE","optional":true,"aliases":["IRE"],"description":"Replaces the original independent variables with the transformed independent variables in the OUT= data set. The names of the transformed variables in the OUT= data set correspond to the names of the original independent variables in the input data set. By default, both the original independent variables and the transformed independent variables (with names constructed from the TIPREFIX= o-option (default T) and the original independent variable names) are included in the OUT= data set.","type":"standalone"},{"name":"LEVERAGE=","optional":true,"aliases":["LEV="],"description":"Creates a variable with the specified name in the OUT= data set that contains leverages. Specifying the LEVERAGE o-option is equivalent to specifying LEVERAGE=Leverage.","type":"value"},{"name":"LILPREFIX=","optional":true,"aliases":["LIL="],"description":"Specifies a prefix for naming the liberal-individual-lower confidence limits. The default prefix is LIL. When you specify the LILPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"LILPREFIX=*name*","type":"value"},{"name":"LIUPREFIX=","optional":true,"aliases":["LIU="],"description":"Specifies a prefix for naming the liberal-individual-upper confidence limits. The default prefix is LIU. When you specify the LIUPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"LIUPREFIX=*name*","type":"value"},{"name":"LMLPREFIX=","optional":true,"aliases":["LML="],"description":"Specifies a prefix for naming the liberal-mean-lower confidence limits. The default prefix is LML. When you specify the LMLPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"LMLPREFIX=*name*","type":"value"},{"name":"LMUPREFIX=","optional":true,"aliases":["LMU="],"description":"Specifies a prefix for naming the liberal-mean-upper confidence limits. The default prefix is LMU. When you specify the LMUPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"LMUPREFIX=*name*","type":"value"},{"name":"LPREFIX=","optional":true,"aliases":["LPR="],"description":"Specifies the number of first characters of a CLASS expansion variable’s label (or name if no label is specified) to use in constructing labels for coded variables. Coded variable labels are constructed from the first n characters of the CLASS expansion variable’s name and the first 127 - n characters of the formatted CLASS expansion variable’s value. Valid values range from –1 to 127. Values of 0 to 127 specify the number of name or label characters to use. The default is –1, which specifies that PROC TRANSREG should pick a value depending on the length of the prefix and the formatted class value. When you specify LPREFIX= as an a-option or an o-option, it determines the default for all CLASS variables. When you specify LPREFIX= as a t-option, it overrides the default only for selected variables.","help":"LPREFIX=*n*","type":"value"},{"name":"MACRO=","optional":true,"aliases":["MAC"],"description":"Creates macro variables. Most of the options available within the MACRO o-option are rarely needed. By default, PROC TRANSREG creates a macro variable named _TrgInd with a complete list of independent variables created by the procedure. PROC TRANSREG, also by default, creates a macro variable named _TrgIndN, which contains the number of variables in the _TrgInd list. The available keywords are as follows. DN=name -- specifies the name of a macro variable that contains the number of dependent variables. By default, a macro variable named _TrgDepN is created. This is the number of variables in the DL= list and the number of macro variables created by the DV= and DE= specifications. IN=name -- specifies the name of a macro variable that contains the number of independent variables. By default, a macro variable named _TrgIndN is created. This is the number of variables in the IL= list and the number of macro variables created by the IV= and IE= specifications. DL=name -- specifies the name of a macro variable that contains the list of the dependent variables. By default, a macro variable named _TrgDep is created. These are the variable names of the final transformed variables in the OUT= data set. For example, if there are three dependent variables, y1–y3, then _TrgDep contains, by default, Ty1 Ty2 Ty3 (or y1 y2 y3 if you specify the REPLACE o-option). IL=name -- specifies the name of a macro variable that contains the list of the independent variables. By default, a macro variable named _TrgInd is created. These are the variable names of the final transformed variables in the OUT= data set. For example, if there are three independent variables, x1–x3, then _TrgInd contains, by default, Tx1 Tx2 Tx3 (or x1 x2 x3 if you specify the REPLACE o-option). DV=prefix -- specifies a prefix for creating a list of macro variables, each of which contains one dependent variable name. For example, if there are three dependent variables, y1–y3, and you specify macro(dv=Dep), then three macro variables, Dep1, Dep2, and Dep3, are created, containing Ty1, Ty2, and Ty3, respectively (or y1, y2, and y3 if you specify the REPLACE o-option). By default, no list is created. IV=prefix -- specifies a prefix for creating a list of macro variables, each of which contains one independent variable name. For example, if there are three independent variables, x1–x3, and you specify macro(iv=Ind), then three macro variables, Ind1, Ind2, and Ind3, are created, containing Tx1, Tx2, and TX3, respectively (or x1, x2, and x3 if you specify the REPLACE o-option). By default, no list is created. DE=prefix -- specifies a prefix for creating a list of macro variables, each of which contains one dependent variable effect. This list shows the origin of each model term. Each effect consists of two or more parts, and each part consists of a value in 32 columns followed by a blank. For example, if you specify macro(de=d), then a macro variable d1 is created for identity(y).","help":"MACRO=IE= | DE= | IV= | DV= | IL= | DL= | IN= | DN=","type":"choice","arguments":[{"name":"IE=","type":"value"},{"name":"DE=","type":"value"},{"name":"IV=","type":"value"},{"name":"DV=","type":"value"},{"name":"IL=","type":"value"},{"name":"DL=","type":"value"},{"name":"IN=","type":"value"},{"name":"DN=","type":"value"}]},{"name":"MAXITER=","optional":true,"aliases":["MAX="],"description":"Specifies the maximum number of iterations (see the section Controlling the Number of Iterations). By default, MAXITER=30. You can specify MAXITER=0 to save time when no transformations are requested.","help":"MAXITER=*n*","type":"value"},{"name":"MEANS","optional":true,"aliases":["MEA"],"description":"Outputs marginal means for CLASS variable expansions to the OUT= data set.","type":"standalone"},{"name":"MEC","optional":true,"description":"Outputs multiple regression elliptical point model coordinates to the OUT= data set.","type":"standalone"},{"name":"METHOD=","optional":true,"description":"Specifies the iterative algorithm. By default, METHOD=UNIVARIATE, unless you specify options that cannot be handled by the UNIVARIATE algorithm. Specifically, the default is METHOD=MORALS for the following situations: o if you specify LINEAR, OPSCORE, MONOTONE, UNTIE, SPLINE, MSPLINE, or SSPLINE transformations for the independent variables o if you specify the ADDITIVE a-option with more than one dependent variable o if you specify the IAPPROXIMATIONS o-option o if you specify the INDIVIDUAL a-option","help":"METHOD=CANALS | MORALS | REDUNDANCY | UNIVARIATE","type":"choice","arguments":[{"name":"CANALS","description":"Specifies canonical correlation with alternating least squares. This jointly transforms all dependent and independent variables to maximize the average of the first n squared canonical correlations, where n is the value of the NCAN= a-option.","type":"standalone"},{"name":"MORALS","description":"Specifies multiple optimal regression with alternating least squares. This transforms each dependent variable, along with the set of independent variables, to maximize the squared multiple correlation.","type":"standalone"},{"name":"REDUNDANCY","description":"Jointly transforms all dependent and independent variables to maximize the average of the squared multiple correlations.","type":"standalone"},{"name":"UNIVARIATE","description":"Transforms each dependent variable to maximize the squared multiple correlation, while the independent variables are not transformed.","type":"standalone"}]},{"name":"MONOTONE=","optional":true,"aliases":["MON="],"description":"Specifies the first and last special missing value in the list of those special missing values to be estimated with within-variable order and category constraints. By default, there are no order constraints on missing value estimates. The two-letters value must consist of two letters in alphabetical order. For example, MONOTONE=DF means that the estimate of .D must be less than or equal to the estimate of .E, which must be less than or equal to the estimate of .F; no order constraints are placed on estimates of ._, .A through .C, and .G through .Z.","help":"MONOTONE=*two-letters*","type":"value"},{"name":"MPC","optional":true,"description":"Outputs multiple regression point model coordinates to the OUT= data set.","type":"standalone"},{"name":"MQC","optional":true,"description":"Outputs multiple regression quadratic point model coordinates to the OUT= data set.","type":"standalone"},{"name":"MRC","optional":true,"description":"Outputs multiple regression coefficients to the OUT= data set.","type":"standalone"},{"name":"MREDUNDANCY","optional":true,"aliases":["MRE"],"description":"Outputs multiple redundancy analysis coefficients to the OUT= data set.","type":"standalone"},{"name":"NCAN=","optional":true,"aliases":["NCA="],"description":"Specifies the number of canonical variables to use in the METHOD=CANALS algorithm. By default, NCAN=1. The value of the NCAN= a-option must be ≥ 1.","help":"NCAN=*n*","type":"value"},{"name":"NOINT","optional":true,"aliases":["NOI"],"description":"Omits the intercept from the OUT= data set and suppresses centering of data. You cannot specify the NOINT a-option with iterative transformations since there is no provision for optimal scaling without an intercept. The NOINT a-option can be specified only when there is no implicit intercept and when all of the data in a BY group absolutely will not change during the iterations.","type":"standalone"},{"name":"NOMISS","optional":true,"aliases":["NOM"],"description":"Excludes all observations with missing values from the analysis, but does not exclude them from the OUT= data set. If you omit the NOMISS a-option, PROC TRANSREG simultaneously computes the optimal transformations of the nonmissing values and estimates the missing values that minimize squared error.","type":"standalone"},{"name":"NOPRINT","optional":true,"aliases":["NOP"],"description":"Suppresses the display of all output unless you specify the HISTORY a-option. The NOPRINT a-option without the HISTORY a-option disables the Output Delivery System (ODS), including ODS Graphics, for the duration of the procedure run. The NOPRINT a-option with the HISTORY a-option disables all output except the iteration history, again including ODS Graphics, for the duration of the procedure run.","type":"standalone"},{"name":"NORESTOREMISSING","optional":true,"aliases":["NORESTORE","NOR"],"description":"Specifies that missing values should not be restored when the OUT= data set is created. By default, the coded CLASS variable contains a row of missing values for observations in which the CLASS variable is missing. When you specify the NORESTOREMISSING o-option, these observations contain a row of zeros instead. This is useful when PROC TRANSREG is used to code experimental designs for discrete choice models and there is a constant alternative indicated by a missing value.","type":"standalone"},{"name":"NOSCORES","optional":true,"aliases":["NOS"],"description":"Excludes original variables, transformed variables, predicted values, residuals, and scores from the OUT= data set. You can use the NOSCORES o-option with various other options to create an OUT= data set that contains only a coefficient partition (for example, a data set consisting entirely of coefficients and coordinates).","type":"standalone"},{"name":"NOZEROCONSTANT","optional":true,"aliases":["NOZERO","NOZ"],"description":"Specifies that constant variables are expected and should not be zeroed. By default, constant variables are zeroed. This option is useful when PROC TRANSREG is used to code experimental designs for discrete choice models. When these designs are very large, it might be more efficient to use the DESIGN= a-option. It might be that attributes are constant within a block of n observations, so you need to specify the NOZEROCONSTANT a-option to get the correct results. You can specify this option in the PROC TRANSREG, MODEL, and OUTPUT statements.","type":"standalone"},{"name":"NSR","optional":true,"description":"Specifies that no restrictions are placed on the use of SMOOTH and SSPLINE and the ordinary least squares is used to find the coefficients and predicted values. By default, only certain types of models can be specified with SMOOTH and ordinary least squares is not used to find the coefficients and predicted values.","type":"standalone"},{"name":"ORDER=","optional":true,"aliases":["ORD="],"description":"Specifies the order in which the CLASS variable levels are to be reported. The default is ORDER=INTERNAL. For ORDER=FORMATTED and ORDER=INTERNAL, the sort order is machine dependent. When you specify ORDER= as an a-option or an o-option, it determines the default ordering for all CLASS variables. When you specify ORDER= as a t-option, it overrides the default ordering only for selected variables.","help":"ORDER=DATA | FREQ | FORMATTED | INTERNAL","type":"choice","arguments":[{"name":"DATA","description":"Sorts by order of appearance in the input data set.","type":"standalone"},{"name":"FREQ","description":"Sorts by formatted value.","type":"standalone"},{"name":"FORMATTED","description":"Sorts by descending frequency count; levels with the most observations appear first.","type":"standalone"},{"name":"INTERNAL","description":"Sorts by unformatted value.","type":"standalone"}]},{"name":"OUTTEST=","optional":true,"description":"Specifies an output data set to contain hypothesis tests results. When you specify the OUTTEST= option, the data set contains ANOVA results. When you specify the SS2 a-option, regression tables are also output. When you specify the UTILITIES o-option, conjoint analysis part-worth utilities are also output.","help":"OUTTEST=*SAS-data-set*","type":"dataSet"},{"name":"PBOXCOXTABLE","optional":true,"aliases":["PBO"],"description":"Prints the Box-Cox table with the log likelihood displayed as a function of lambda. The important information in this table is displayed in the Box-Cox plot, so when ODS Graphics is in effect and the plot is produced, the table is not produced by default. When ODS Graphics is not in effect or when the plot is not produced, the table is produced by default. Specify the PBOXCOXTABLE option if you want to see the table in addition to the plot.","type":"standalone"},{"name":"PLOTS=","optional":true,"description":"Controls the plots produced through ODS Graphics. When you specify only one plot request, you can omit the parentheses around the plot request. Syntax: PLOTS <(global-plot-options)> <= plot-request <(options)>> PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> The global plot options include the following: INTERPOLATE |INT uses observations that are excluded from the analysis for interpolation in the fit and transformation plots. By default, observations with zero weight are excluded from all plots. These include observations with a zero, negative, or missing weight or frequency and observations excluded due to missing and invalid values. ONLY | ONL suppresses the default plots. Only plots specifically requested are displayed.","help":"PLOTS=ALL | BOXCOX|BOX | FIT | NONE | OBSERVEDBYPREDICTED|OBP|OBS | PBSPLINE|PBS | PREFMAP|PRE | RESIDUALS|RES | SCATTER|SCA | TRANSFORMATION|TRA","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"BOXCOX","description":"[Syntax: BOXCOX <( options )> ] Requests a display of the results of the Box-Cox transformation. These results are displayed by default when there is a Box-Cox transformation. The BOXCOX plot request has the following options: P=n adds t or T=t² curves to the legend for the functions where p(t) < n, where t is the t statistic corresponding to the optimal lambda. You can specify P=0 to suppress the legend and P=1 to see all curves in the legend. The default value comes from the BOXCOX(variable / ALPHA=p) specification, which by default is 0.05. RMSE | RMS plots the root mean square error as a function of lambda. T plots t statistics rather than F=t² statistics. UNPACKPANEL | UNPACK |UNP plots the t or F=t² and log-likelihood plots in separate panels.","help":"BOXCOX|BOX","type":"choice"},{"name":"FIT","description":"[Syntax: FIT <( options )> ] Requests a regression fit plot. This plot is produced by default whenever it is appropriate. It is produced when the dependent variable is specified with the IDENTITY transform, and when there is one quantitative independent variable (for example, IDENTITY for linear fit or SPLINE or one of the other transformations for a nonlinear fit) and at most one CLASS variable. When there is a CLASS variable, separate fits are produced within levels based on your model. You would specify the FIT plot request only to specify a FIT option or with the ONLY global plot option. The FIT plot request has the following options: NOCLM suppresses the confidence limits in regression fit plots. NOCLI suppresses the individual prediction limits in regression fit plots. NOOBS suppresses the observations showing only the fit function and optionally the confidence and prediction limits.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"OBSERVEDBYPREDICTED","description":"Plots the transformed dependent variable as a function of the regression predicted values.","help":"OBSERVEDBYPREDICTED|OBP|OBS","type":"choice"},{"name":"PBSPLINE","description":"[Syntax: PBSPLINE <( UNPACKPANEL )> PBS <( UNPACK )> Requests the penalized B-spline criterion plots. You would specify the PBSPLINE plot request only to specify a PBSPLINE option or with the ONLY global plot option. The PBSPLINE plot request has the following option: UNPACKPANEL | UNPACK |UNP plots each criterion plot in a separate panel.","help":"PBSPLINE|PBS","type":"choice"},{"name":"PREFMAP","description":"Plots ideal point or vector preference mapping results when either two IDENTITY or two POINT independent variables are specified along with the COORDINATES option.","help":"PREFMAP|PRE","type":"choice"},{"name":"RESIDUALS","description":"[Syntax: RESIDUALS <( options )> RES <( options )> Plots the residuals as a function of each of the transformed independent variables, except coded CLASS variables. The RESIDUALS plot request has the following options: CLASS | CLA plots the residuals as a function of each of the transformed independent variables, including coded CLASS variables. Note that the ALL plot request, which you use to request all plots, specifies the RESIDUALS plot request without the CLASS option. UNPACKPANEL | UNPACK | UNP plots the residuals in separate plots, not several per panel. SMOOTH | SMO adds a LOESS smooth function to the residuals plots.","help":"RESIDUALS|RES","type":"choice"},{"name":"SCATTER","description":"Plots the scatter plot of observed data, before the transformations, for models with a single quantitative dependent variable, a single quantitative independent variable, and at most one CLASS independent variable.","help":"SCATTER|SCA","type":"choice"},{"name":"TRANSFORMATION","description":"Syntax: TRANSFORMATION <( options )> TRA <( options )> Plots the variable transformations. The TRANSFORMATION plot request has the following options: DEPENDENTS | DEP plots only the dependent variable transformations. INDEPENDENTS | IND plots only the independent variable transformations. UNPACKPANEL | UNPACK | UNP plots the transformations in separate plots, not several per panel.","help":"TRANSFORMATION|TRA","type":"choice"}]},{"name":"PPREFIX=","optional":true,"aliases":["PDPREFIX=","PDP="],"description":"Specifies a prefix for naming the dependent variable predicted values. The default is PPREFIX=P when you specify the PREDICTED o-option; otherwise, it is PPREFIX=A. When you specify the PPREFIX= o-option, the PREDICTED o-option is automatically specified for you. The PPREFIX= o-option is the same as the ADPREFIX= o-option.","help":"PPREFIX=*name*","type":"value"},{"name":"PREDICTED","optional":true,"aliases":["PRE"],"description":"Outputs predicted values, which for METHOD=UNIVARIATE and METHOD=MORALS are the ordinary predicted values from the linear model, to the OUT= data set. The names of the predicted values’ variables are constructed from the PPREFIX= o-option (default P) and the original dependent variable names. When you specify the PPREFIX= o-option, the PREDICTED o-option is automatically specified for you.","type":"standalone"},{"name":"RDPREFIX=","optional":true,"aliases":["RPD="],"description":"Specifies a prefix for naming the residual (dependent) variables to the OUT= data set. The default is RDPREFIX=R. When you specify the RDPREFIX= o-option, the RESIDUALS o-option is automatically specified for you.","help":"RDPREFIX=*name*","type":"value"},{"name":"REDUNDANCY=","optional":true,"aliases":["RED="],"description":"Outputs redundancy variables to the OUT= data set, either standardized or unstandardized. Specifying the REDUNDANCY o-option is the same as specifying REDUNDANCY=STANDARDIZE. The results of the REDUNDANCY o-option depends on the TSTANDARD= option. You must specify TSTANDARD=Z to get results based on standardized data. The TSTANDARD= option controls how the data that go into the redundancy analysis are scaled, and REDUNDANCY=STANDARDIZE| UNSTANDARDIZE controls how the redundancy variables are scaled. The REDUNDANCY o-option is automatically specified for you when you specify the METHOD=REDUNDANCY a-option. The RPREFIX= o-option specifies a prefix (default Red) for naming the redundancy variables.","help":"REDUNDANCY=STANDARDIZE | UNSTANDARDIZE","type":"choice","arguments":[{"name":"STANDARDIZE","description":"Outputs redundancy variables to the OUT= data set, standardized.","type":"standalone"},{"name":"UNSTANDARDIZE","description":"Outputs redundancy variables to the OUT= data set, unstandardized.","type":"standalone"}]},{"name":"REFERENCE=","optional":true,"description":"Specifies how reference levels of CLASS variables are to be treated. You can specify the REFERENCE= option in the PROC TRANSREG, MODEL, or OUTPUT statement, and you can specify it independently for the OUT= data set and the displayed output. When you specify it in only one statement, it sets the option for both the displayed output and the OUT= data set.","help":"REFERENCE=NONE | MISSING | ZERO","type":"choice","arguments":[{"name":"NONE","description":"Reference levels are suppressed. This is the default.","type":"standalone"},{"name":"MISSING","description":"Reference levels are displayed and output with missing values.","type":"standalone"},{"name":"ZERO","description":"Reference levels are displayed and output with zeros.","type":"standalone"}]},{"name":"REITERATE","optional":true,"aliases":["REI"],"description":"Enables PROC TRANSREG to use previous transformations as starting points. The REITERATE a-option affects only variables that are iteratively transformed (specified as LINEAR, OPSCORE, MONOTONE, UNTIE, SPLINE, MSPLINE, and SSPLINE). For iterative transformations, the REITERATE a-option requests a search in the input data set for a variable that consists of the value of the TDPREFIX= or TIPREFIX= o-option followed by the original variable name. If such a variable is found, it is used to provide the initial values for the first iteration. The final transformation is a member of the transformation family defined by the original variable, not the transformation family defined by the initialization variable.","type":"standalone"},{"name":"REPLACE","optional":true,"aliases":["REP"],"description":"Is equivalent to specifying both the DREPLACE and the IREPLACE o-options.","type":"standalone"},{"name":"RESIDUALS","optional":true,"aliases":["RES"],"description":"Outputs the differences between the transformed dependent variables and their predicted values. The names of the residual variables are constructed from the RDPREFIX= o-option (default R) and the original dependent variable names.","type":"standalone"},{"name":"RPREFIX=","optional":true,"aliases":["RPR="],"description":"Provides a prefix for naming the redundancy variables. The default is RPREFIX=Red. When you specify the RPREFIX= o-option, the REDUNDANCY o-option is automatically specified for you.","help":"RPREFIX=*name*","type":"value"},{"name":"RSQUARE","optional":true,"aliases":["RSQ"],"description":"Prints a table with only the model R square.","type":"standalone"},{"name":"SEPARATORS=","optional":true,"aliases":["SEP="],"description":"Specifies separators for creating CLASS expansion variable labels. By default, SEPARATORS=’ ’ ’ * ’ (\"blank\" and \"blank asterisk blank\"). The first value is used to separate variable names and values in interactions. The second value is used to separate interaction components. For example, the label for the coded variable for the A=1 and B=2 cell is, by default, ’A 1 * B 2’. If SEPARATORS=’=’ ’x’ is specified, then the label is ’A=1xB=2’. When you specify SEPARATORS= as an a-option or an o-option, it determines the default separators for all CLASS variables. When you specify SEPARATORS= as a t-option, it overrides the default only for selected variables.","type":"value"},{"name":"SHORT","optional":true,"aliases":["SHO"],"description":"Suppresses the iteration histories.","type":"standalone"},{"name":"SINGULAR=","optional":true,"aliases":["SIN="],"description":"Specifies the largest value within rounding error of zero. By default, SINGULAR=1E–12. PROC TRANSREG uses the value of the SINGULAR= a-option for checking 1 - R² when constructing full-rank matrices of predictor variables, checking denominators before dividing, and so on. PROC TRANSREG computes the regression coefficients by sweeping with rational pivoting.","help":"SINGULAR=*n*","type":"value"},{"name":"SOLVE","optional":true,"aliases":["SOL","DUMMY","DUM"],"description":"Provides a canonical initialization. When there are no monotonicity constraints, when there is at most one canonical variable in each set, and when there is enough available memory, PROC TRANSREG (with the SOLVE a-option) can usually directly solve for the optimal solution in only one iteration. The initialization iteration is number 0, which is slower and uses more memory than other iterations. However, for some models, specifying the SOLVE a-option can greatly decrease the amount of time required to find the optimal transformations. During iteration 0, each variable is replaced by an expanded variable and the model is fit to the larger, expanded set of variables. For example, an OPSCORE variable is expanded into coded (or \"dummy\") variables, as if CLASS were specified, and a SPLINE variable is expanded into a B-spline basis, as if BSPLINE were specified. Then for each expanded variable, the results of iteration zero are constructed by multiplying the expanded basis times the β subvector to get the optimal transformation. This a-option can be useful even in models where a direct solution is not possible, because it provides good initial transformations of all the variables.","type":"standalone"},{"name":"SS2","optional":true,"description":"Produces a regression table based on Type II sums of squares. Tests of the contribution of each transformation to the overall model are displayed and output to the OUTTEST= data set when you specify the OUTTEST= option. When you specify the SS2 a-option, the TEST a-option is automatically specified for you.","type":"standalone"},{"name":"TDPREFIX=","optional":true,"aliases":["TDP="],"description":"Specifies a prefix for naming the transformed dependent variables. By default, TDPREFIX=T. The TDPREFIX= o-option is ignored when you specify the DREPLACE o-option.","help":"TDPREFIX=*name*","type":"value"},{"name":"TEST","optional":true,"aliases":["TES"],"description":"Generates an ANOVA table. PROC TRANSREG tests the null hypothesis that the vector of scoring coefficients for all of the transformations is zero.","type":"standalone"},{"name":"TIPREFIX=","optional":true,"aliases":["TIP="],"description":"Specifies a prefix for naming the transformed independent variables. By default, TIPREFIX=T. The TIPREFIX= o-option is ignored when you specify the IREPLACE o-option.","help":"TIPREFIX=*name*","type":"value"},{"name":"TSTANDARD=","optional":true,"description":"Specifies the standardization of the transformed variables for the hypothesis tests and in the OUT= data set. By default, TSTANDARD=ORIGINAL. When you specify TSTANDARD= as an a-option or an o-option, it determines the default standardization for all variables. When you specify TSTANDARD= as a t-option, it overrides the default standardization only for selected variables.","help":"TSTANDARD=CENTER | NOMISS | ORIGINAL | Z","type":"choice","arguments":[{"name":"CENTER","description":"Centers the output variables to mean zero, but the variances are the same as the variances of the input variables.","type":"standalone"},{"name":"NOMISS","description":"Sets the means and variances of the transformed variables in the OUT= data set, computed over all output values that correspond to nonmissing values in the input data set, to the means and variances computed from the nonmissing observations of the original variables. The TSTANDARD=NOMISS specification is useful with missing data. When a variable is linearly transformed, the final variable contains the original nonmissing values and the missing value estimates. In other words, the nonmissing values are unchanged. If your data have no missing values, TSTANDARD=NOMISS and TSTANDARD=ORIGINAL produce the same results.","type":"standalone"},{"name":"ORIGINAL","description":"Sets the means and variances of the transformed variables to the means and variances of the original variables. This is the default.","type":"standalone"},{"name":"Z","description":"Standardizes the variables to mean zero, variance one.","type":"standalone"}]},{"name":"TSUFFIX=","optional":true,"aliases":["TSU="],"description":"Specifies the number of characters in \"Transformation\" to append to variable labels for transformed variables. By default, all characters are used.","help":"TSUFFIX=*n*","type":"value"},{"name":"TYPE=","optional":true,"aliases":["TYP="],"description":"Specifies the valid value for the _TYPE_ variable in the input data set. If PROC TRANSREG finds an input _TYPE_ variable, it uses only observations with a _TYPE_ value that matches the TYPE= value. This enables a PROC TRANSREG OUT= data set containing coefficients to be used as input to PROC TRANSREG without requiring a WHERE statement to exclude the coefficients. If a _TYPE_ variable is not in the data set, all observations are used. The default is TYPE=’SCORE’, so if you do not specify the TYPE= a-option, only observations with _TYPE_=’SCORE’ are used. Do not confuse this a-option with the data set TYPE= option. The DATA= data set must be an ordinary SAS data set.","type":"value"},{"name":"UNTIE=","optional":true,"aliases":["UNT="],"description":"Specifies the first and last special missing values in the list of those special missing values that are to be estimated with within-variable order constraints but no category constraints. The two-letters value must consist of two letters in alphabetical order. By default, there are category constraints but no order constraints on special missing value estimates.","help":"UNTIE=*two-letters*","type":"value"},{"name":"UTILITIES","optional":true,"aliases":["UTI"],"description":"Produces a table of the part-worth utilities from a conjoint analysis. Utilities, their standard errors, and the relative importance of each factor are displayed and output to the OUTTEST= data set when you specify the OUTTEST= option. When you specify the UTILITIES a-option, the TEST a-option is automatically specified for you.","type":"standalone"}]},{"name":"BY","description":"You can specify a BY statement with PROC TRANSREG to obtain separate analyses on observations in groups defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","description":"If one variable in your input data set represents the frequency of occurrence for other values in the observation, specify the variable’s name in a FREQ statement. PROC TRANSREG treats the data as if each observation appears n times, where n is the value of the FREQ variable for the observation. Noninteger values of the FREQ variable are truncated to the largest integer less than the FREQ value. The observation is used in the analysis only if the value of the FREQ statement variable is greater than or equal to 1.","help":"FREQ variable "},{"name":"ID","description":"The ID statement includes additional character or numeric variables in the OUT= data set. The variables must be contained in the input data set. The first variable is used to label points in PREFMAP plots. These variables are also used in some plots as tip variables.","help":"ID variables "},{"name":"MODEL","description":"these depend on the transform chosen. The t-options are listed after a slash in the parentheses that enclose the variable list (either 'dependents or independents). The a-options control the algorithm used, details of iteration, details of how the intercept and coded variables are generated, and displayed output details. The a-options are listed after the entire model specification (the dependents, independents, transformations, and t-options) and after a slash. You can also specify the algorithm options in the PROC TRANSREG statement. When you specify the DESIGN o-option, dependents and an equal sign are not required. The operators *, |, and @ from the GLM procedure are available for interactions with the CLASS expansion and the IDENTITY transformation. They are used as follows: Class(a * b ... c | d ... e | f ... @ n) Identity(a * b ... c | d ... e | f ... @ n) In addition, transformations and spline expansions can be crossed with classification variables as follows: transform(var) * class(group) transform(var) | class(group)","help":"MODEL BSPLINE CLASS EPOINT ...","arguments":[{"name":"ARSIN","aliases":["ARS"],"description":"Finds an inverse trigonometric sine transformation. Variables specified in the ARSIN transform must be numeric and in the interval (-1.0 ≤ x ≤ 1.0), and they are typically continuous.","type":"standalone"},{"name":"BOXCOX","aliases":["BOX"],"description":"Finds a Box-Cox (1964) transformation of the specified variables. The BOXCOX transformation can be used only with dependent variables. The ALPHA=, CLL=, CONVENIENT, GEOMETRICMEAN, LAMBDA=, and PARAMETER= t-options can be used with the BOXCOX transformation. Variables specified in the BOXCOX transform must be numeric, and they are typically continuous.","type":"standalone"},{"name":"BSPLINE","aliases":["BSP"],"description":"Expands each variable to a B-spline basis. You can specify the DEGREE=, KNOTS=, NKNOTS=, and EVENLY= t-options with the BSPLINE expansion. When DEGREE=n (3 by default) with k knots (0 by default), n+k+l variables are created. In addition, the original variable appears in the OUT= data set before the ID variables. For example, bspline(x) expands x into x_0 x_1 x_2 x_3 and outputs x as well. The x_: variables contain the B-spline basis vectors (which are the same basis vectors that the SPLINE and MSPLINE transformations use internally). The columns of the BSPLINE expansion sum to a column of ones, so an implicit intercept model is fit when the BSPLINE expansion is specified. If you specify the BSPLINE expansion for more than one variable, the model is less than full rank. Variables specified in a BSPLINE expansion must be numeric, and they are typically continuous.","type":"standalone"},{"name":"CLASS","aliases":["CLA"],"description":"Expands the variables to a set of coded or \"dummy\" variables. PROC TRANSREG uses the values of the formatted variables to determine class membership. The specification class(x1 x2) fits a simple main-effects model, class(x1 | x2) fits a main-effects and interactions model, and class(x1|x2|x3|x4@2 x1*x2*x3) fits a model with all main effects, all two-way interactions, and one three-way interaction. Variables specified with the CLASS expansion can be either character or numeric; numeric variables should be discrete.","type":"standalone"},{"name":"EPOINT","aliases":["EPO"],"description":"Expands the variables for an elliptical response surface regression or for an elliptical ideal point regression. Specify the COORDINATES o-option to output PREFMAP ideal elliptical point model coordinates to the OUT= data set. Each axis of the ellipse (or ellipsoid) is oriented in the same direction as one of the variables. The EPOINT expansion creates a new variable for each original variable. The value of each new variable is the square of each observed value for the corresponding original variable. The regression analysis then uses both sets of variables (original and squared). Variables specified with the EPOINT expansion must be numeric, and they are typically continuous.","type":"standalone"},{"name":"EXP","description":"Exponentiates variables (x is transformed to a^x). To specify the value of a, use the PARAMETER= t-option. By default, a is the mathematical constant e=2.718... Variables specified with the EXP transform must be numeric, and they are typically continuous.","type":"standalone"},{"name":"IDENTITY","aliases":["IDE"],"description":"Specifies variables that are not changed by the iterations. Typically, the IDENTITY transformation is used with a simple variable list, such as identity(x1-x5). However, you can also specify interaction terms. For example, identity(x1 | x2) creates x1, x2, and the product x1*x2; and identity(x1 | x2 | x3) creates x1, x2, x1*x2, x3, x1*x3, x2*x3, and x1*x2*x3. Variables specified in the IDENTITY transform must be numeric.","type":"standalone"},{"name":"LINEAR","aliases":["LIN"],"description":"Finds an optimal linear transformation of each variable. For variables with no missing values, the transformed variable is the same as the original variable. For variables with missing values, the transformed nonmissing values have a different scale and origin than the original values. Variables specified in the LINEAR transform must be numeric.","type":"standalone"},{"name":"LOG","description":"Transforms variables to logarithms (x is transformed to LOGa(x)). To specify the base of the logarithm, use the PARAMETER= t-option. The default is a natural logarithm with base e=2.718... Variables specified with the LOG transform must be numeric and positive, and they are typically continuous.","type":"standalone"},{"name":"LOGIT","description":"Finds a logit transformation on the variables. The logit of x is LOG(x/(1-x)). Unlike other transformations, LOGIT does not have a three-letter abbreviation. Variables specified with the LOGIT transform must be numeric and in the interval (0.0 < x < 1.0), and they are typically continuous.","type":"standalone"},{"name":"MONOTONE","aliases":["MON"],"description":"Finds a monotonic transformation of each variable, with the restriction that ties are preserved. The Kruskal (1964) secondary least-squares monotonic transformation is used. This transformation weakly preserves order and category membership (ties). Variables specified with the MONOTONE transform must be numeric, and they are typically discrete.","type":"standalone"},{"name":"MSPLINE","aliases":["MSP"],"description":"Finds a monotonically increasing B-spline transformation with monotonic coefficients (de Boor; 1978; de Leeuw; 1986) of each variable. You can specify the DEGREE=, KNOTS=, NKNOTS=, and EVENLY= t-options with MSPLINE. By default, PROC TRANSREG fits a quadratic spline with no knots. Variables specified with the MSPLINE transform must be numeric, and they are typically continuous.","type":"standalone"},{"name":"OPSCORE","aliases":["OPS"],"description":"Finds an optimal scoring of each variable. The OPSCORE transformation assigns scores to each class (level) of the variable. The Fisher (1938) optimal scoring method is used. Variables specified with the OPSCORE transform can be either character or numeric; numeric variables should be discrete.","type":"standalone"},{"name":"PBSPLINE","aliases":["PBS"],"description":"Is a noniterative penalized B-spline transformation (Eilers and Marx; 1996). The PBSPLINE transformation can be used only with independent variables. By default with PBSPLINE, a cubic spline is fit with 100 evenly spaced knots, three evenly spaced exterior knots, and a difference matrix of order three (DEGREE=3 NKNOTS=100 EVENLY=3 PARAMETER=3). Variables specified in the PBSPLINE transform must be numeric, and they are typically continuous.","type":"standalone"},{"name":"POINT","aliases":["POI"],"description":"Expands the variables for a circular response surface regression or for a circular ideal point regression. Specify the COORDINATES o-option to output PREFMAP ideal point model coordinates to the OUT= data set. The POINT expansion creates a new variable having a value for each observation that is the sum of squares of all the POINT variables. This new variable is added to the set of variables and is used in the regression analysis.","type":"standalone"},{"name":"POWER","aliases":["POW"],"description":"Raises variables to a specified power (x is transformed to x^a). You must specify the power parameter, a, by specifying the PARAMETER= t-option following the variables. Here is an example: power(variable / parameter=number)","type":"standalone"},{"name":"PSPLINE","aliases":["PSP"],"description":"Expands each variable to a piecewise polynomial basis. You can specify the DEGREE=, KNOTS=, NKNOTS=, and EVENLY t-options with PSPLINE. When DEGREE= (3 by default) with k knots (0 by default), n + k variables are created. In addition, the original variable appears in the OUT= data set before the ID variables. For example, pspline (x / nknots=1) expands x into x_1 x_2 x_3 x_4 and outputs x as well. Unlike BSPLINE, an intercept is not implicit in the columns of PSPLINE. Variables specified with the PSPLINE expansion must be numeric, and they are typically continuous.","type":"standalone"},{"name":"QPOINT","aliases":["QPO"],"description":"Expands the variables for a quadratic response surface regression or for a quadratic ideal point regression. Specify the COORDINATES o-option to output PREFMAP quadratic ideal point model coordinates to the OUT= data set. For m QPOINT variables, m(m+1)/2 new variables are created containing the squares and crossproducts of the original variables. The regression analysis uses both sets (original and crossed). Variables specified with the QPOINT expansion must be numeric, and they are typically continuous.","type":"standalone"},{"name":"RANK","aliases":["RAN"],"description":"Transforms variables to ranks. Ranks are averaged within ties. The smallest input value is assigned the smallest rank. Variables specified in the RANK transform must be numeric.","type":"standalone"},{"name":"SMOOTH","aliases":["SMO"],"description":"Is a noniterative smoothing spline transformation (Reinsch; 1967). You can specify the smoothing parameter with either the SM= or the PARAMETER= t-option. The default smoothing parameter is SM=0. The SMOOTH transformation can be used only with independent variables. Variables specified with the SMOOTH transform must be numeric, and they are typically continuous. How the results of the SMOOTH transformation are used in PROC TRANSREG has changed with this release. In particular, some aspects of the syntax along the coefficients and predicted values have changed.","type":"standalone"},{"name":"SPLINE","aliases":["SPL"],"description":"Finds a B-spline transformation (de Boor; 1978) of each variable. By default, PROC TRANSREG fits a cubic spline with no knots. You can specify the DEGREE=, KNOTS=, NKNOTS=, and EVENLY= t-options with SPLINE. Variables specified with the SPLINE transform must be numeric, and they are typically continuous.","type":"standalone"},{"name":"SSPLINE","aliases":["SSP"],"description":"Finds an iterative smoothing spline transformation of each variable. The SSPLINE transformation does not generally minimize squared error. You can specify the smoothing parameter with either the SM= t-option or the PARAMETER= t-option. The default smoothing parameter is SM=0. Variables specified with the SSPLINE transform must be numeric, and they are typically continuous. How the results of the SSPLINE transformation are used in PROC TRANSREG has changed with this release to be consistent with the changes to SMOOTH. In particular, some aspects of the syntax along the coefficients and predicted values have changed.","type":"standalone"},{"name":"UNTIE","aliases":["UNT"],"description":"Finds a monotonic transformation of each variable without the restriction that ties are preserved. PROC TRANSREG uses the Kruskal (1964) primary least-squares monotonic transformation method. This transformation weakly preserves order but not category membership (it might untie some previously tied values). Variables specified with the UNTIE transform must be numeric, and they are typically discrete.","type":"standalone"},{"name":"ADDITIVE","optional":true,"followsDelimiter":"/","aliases":["ADD"],"description":"Creates an additive model by multiplying the values of each independent variable (after the TSTANDARD= standardization) by that variable’s corresponding multiple regression coefficient. This process scales the independent variables so that the predicted-values variable for the final dependent variable is simply the sum of the final independent variables. An additive model is a univariate multiple regression model. As a result, the ADDITIVE a-option is not valid if METHOD=CANALS, or if METHOD=REDUNDANCY or METHOD=UNIVARIATE with more than one dependent variable.","type":"standalone"},{"name":"ALPHA=","optional":true,"followsDelimiter":"/","aliases":["ALP="],"description":"Specifies the level of significance for all of the confidence limits. By default, ALPHA=0.05.","help":"ALPHA=*number*","type":"value"},{"name":"CCONVERGE=","optional":true,"followsDelimiter":"/","aliases":["CCO="],"description":"Specifies the minimum change in the criterion being optimized (squared multiple correlation for METHOD=MORALS and METHOD=UNIVARIATE, average squared multiple correlation for METHOD=REDUNDANCY, average squared canonical correlation for METHOD=CANALS) that is required to continue iterating. By default, CCONVERGE=0.0.","help":"CCONVERGE=*n*","type":"value"},{"name":"CL","optional":true,"followsDelimiter":"/","description":"Requests confidence limits on the parameter estimates in the displayed output.","type":"standalone"},{"name":"CONVERGE=","optional":true,"followsDelimiter":"/","aliases":["CON="],"description":"Specifies the minimum average absolute change in standardized variable scores that is required to continue iterating. By default, CONVERGE=0.00001. Average change is computed over only those variables that can be transformed by the iterations; that is, all LINEAR, OPSCORE, MONOTONE, UNTIE, SPLINE, MSPLINE, and SSPLINE variables and nonoptimal transformation variables with missing values.","help":"CONVERGE=*n*","type":"value"},{"name":"CPREFIX=","optional":true,"followsDelimiter":"/","aliases":["CPR="],"description":"Specifies the number of first characters of a CLASS expansion variable’s name to use in constructing names for coded variables. Coded variable names are constructed from the first n characters of the CLASS expansion variable’s name and the first 32 - n characters of the formatted CLASS expansion variable’s value. For example, if the variable ClassVariable has values 1, 2, and 3, then, by default, the coded variables are named ClassVariable1, ClassVariable2, and ClassVariable3. However, with CPREFIX=5, the coded variables are named Class1, Class2, and Class3. When CPREFIX=0, coded variable names are created entirely from the CLASS expansion variable’s formatted values. Valid values range from –1 to 31, where –1 indicates the default calculation and 0 to 31 are the number of prefix characters to use. The default, –1, sets n to 32 – min(32, max(2, fl)), where fl is the format length. When you specify CPREFIX= as an a-option or an o-option, it specifies the default for all CLASS variables. When you specify CPREFIX= as a t-option, it overrides the default only for selected variables.","help":"CPREFIX=*n*","type":"value"},{"name":"DETAIL","optional":true,"followsDelimiter":"/","aliases":["DET"],"description":"Reports on details of the model specification. For example, it reports the knots and coefficients for splines, reference levels for CLASS variables, Box-Cox results, the smoothing parameter, and so on. The DETAIL option can take two optional suboptions, NOCOEFFICIENTS and NOKNOTS (or NOC and NOK). To suppress knots from the details listing, specify DETAIL(NOKNOTS). To suppress coefficients from the details listing, specify DETAIL(NOCOEFFICIENTS). To suppress both knots and coefficients from the details listing, specify DETAIL(NOKNOTS NOCOEFFICIENTS).","type":"standalone"},{"name":"HISTORY","optional":true,"followsDelimiter":"/","aliases":["HIS"],"description":"Displays the iteration histories even when the NOPRINT a-option is specified.","type":"standalone"},{"name":"INDIVIDUAL","optional":true,"followsDelimiter":"/","aliases":["IND"],"description":"Fits each model for each dependent variable individually. This means, for example, that when INDIVIDUAL is specified, missing values in one dependent variable will not cause that observation to be deleted for the other models with the other dependent variables. In contrast, by default, missing values in any variable in any model can cause the observation to be deleted for all models. The INDIVIDUAL a-option can be specified only with METHOD=MORALS.","type":"standalone"},{"name":"LPREFIX=","optional":true,"followsDelimiter":"/","aliases":["LPR="],"description":"Specifies the number of first characters of a CLASS expansion variable’s label (or name if no label is specified) to use in constructing labels for coded variables. Coded variable labels are constructed from the first n characters of the CLASS expansion variable’s name and the first 127 - n characters of the formatted CLASS expansion variable’s value. Valid values range from –1 to 127. Values of 0 to 127 specify the number of name or label characters to use. The default is –1, which specifies that PROC TRANSREG should pick a value depending on the length of the prefix and the formatted class value. When you specify LPREFIX= as an a-option or an o-option, it determines the default for all CLASS variables. When you specify LPREFIX= as a t-option, it overrides the default only for selected variables.","help":"LPREFIX=*n*","type":"value"},{"name":"MAXITER=","optional":true,"followsDelimiter":"/","aliases":["MAX="],"description":"Specifies the maximum number of iterations (see the section Controlling the Number of Iterations). By default, MAXITER=30. You can specify MAXITER=0 to save time when no transformations are requested.","help":"MAXITER=*n*","type":"value"},{"name":"METHOD=","optional":true,"followsDelimiter":"/","description":"Specifies the iterative algorithm. By default, METHOD=UNIVARIATE, unless you specify options that cannot be handled by the UNIVARIATE algorithm. Specifically, the default is METHOD=MORALS for the following situations: o if you specify LINEAR, OPSCORE, MONOTONE, UNTIE, SPLINE, MSPLINE, or SSPLINE transformations for the independent variables o if you specify the ADDITIVE a-option with more than one dependent variable o if you specify the IAPPROXIMATIONS o-option o if you specify the INDIVIDUAL a-option","help":"METHOD=CANALS | MORALS | REDUNDANCY | UNIVARIATE","type":"choice","arguments":[{"name":"CANALS","followsDelimiter":"/","description":"Specifies canonical correlation with alternating least squares. This jointly transforms all dependent and independent variables to maximize the average of the first n squared canonical correlations, where n is the value of the NCAN= a-option.","type":"standalone"},{"name":"MORALS","followsDelimiter":"/","description":"Specifies multiple optimal regression with alternating least squares. This transforms each dependent variable, along with the set of independent variables, to maximize the squared multiple correlation.","type":"standalone"},{"name":"REDUNDANCY","followsDelimiter":"/","description":"Jointly transforms all dependent and independent variables to maximize the average of the squared multiple correlations.","type":"standalone"},{"name":"UNIVARIATE","followsDelimiter":"/","description":"Transforms each dependent variable to maximize the squared multiple correlation, while the independent variables are not transformed.","type":"standalone"}]},{"name":"MONOTONE=","optional":true,"followsDelimiter":"/","aliases":["MON="],"description":"Specifies the first and last special missing value in the list of those special missing values to be estimated with within-variable order and category constraints. By default, there are no order constraints on missing value estimates. The two-letters value must consist of two letters in alphabetical order. For example, MONOTONE=DF means that the estimate of .D must be less than or equal to the estimate of .E, which must be less than or equal to the estimate of .F; no order constraints are placed on estimates of ._, .A through .C, and .G through .Z.","help":"MONOTONE=*two-letters*","type":"value"},{"name":"NCAN=","optional":true,"followsDelimiter":"/","aliases":["NCA="],"description":"Specifies the number of canonical variables to use in the METHOD=CANALS algorithm. By default, NCAN=1. The value of the NCAN= a-option must be ≥ 1.","help":"NCAN=*n*","type":"value"},{"name":"NOINT","optional":true,"followsDelimiter":"/","aliases":["NOI"],"description":"Omits the intercept from the OUT= data set and suppresses centering of data. You cannot specify the NOINT a-option with iterative transformations since there is no provision for optimal scaling without an intercept. The NOINT a-option can be specified only when there is no implicit intercept and when all of the data in a BY group absolutely will not change during the iterations.","type":"standalone"},{"name":"NOMISS","optional":true,"followsDelimiter":"/","aliases":["NOM"],"description":"Excludes all observations with missing values from the analysis, but does not exclude them from the OUT= data set. If you omit the NOMISS a-option, PROC TRANSREG simultaneously computes the optimal transformations of the nonmissing values and estimates the missing values that minimize squared error.","type":"standalone"},{"name":"NOPRINT","optional":true,"followsDelimiter":"/","aliases":["NOP"],"description":"Suppresses the display of all output unless you specify the HISTORY a-option. The NOPRINT a-option without the HISTORY a-option disables the Output Delivery System (ODS), including ODS Graphics, for the duration of the procedure run. The NOPRINT a-option with the HISTORY a-option disables all output except the iteration history, again including ODS Graphics, for the duration of the procedure run.","type":"standalone"},{"name":"NOZEROCONSTANT","optional":true,"followsDelimiter":"/","aliases":["NOZERO","NOZ"],"description":"Specifies that constant variables are expected and should not be zeroed. By default, constant variables are zeroed. This option is useful when PROC TRANSREG is used to code experimental designs for discrete choice models. When these designs are very large, it might be more efficient to use the DESIGN= a-option. It might be that attributes are constant within a block of n observations, so you need to specify the NOZEROCONSTANT a-option to get the correct results. You can specify this option in the PROC TRANSREG, MODEL, and OUTPUT statements.","type":"standalone"},{"name":"NSR","optional":true,"followsDelimiter":"/","description":"Specifies that no restrictions are placed on the use of SMOOTH and SSPLINE and the ordinary least squares is used to find the coefficients and predicted values. By default, only certain types of models can be specified with SMOOTH and ordinary least squares is not used to find the coefficients and predicted values.","type":"standalone"},{"name":"ORDER=","optional":true,"followsDelimiter":"/","aliases":["ORD="],"description":"Specifies the order in which the CLASS variable levels are to be reported. The default is ORDER=INTERNAL. For ORDER=FORMATTED and ORDER=INTERNAL, the sort order is machine dependent. When you specify ORDER= as an a-option or an o-option, it determines the default ordering for all CLASS variables. When you specify ORDER= as a t-option, it overrides the default ordering only for selected variables.","help":"ORDER=DATA | FREQ | FORMATTED | INTERNAL","type":"choice","arguments":[{"name":"DATA","followsDelimiter":"/","description":"Sorts by order of appearance in the input data set.","type":"standalone"},{"name":"FREQ","followsDelimiter":"/","description":"Sorts by formatted value.","type":"standalone"},{"name":"FORMATTED","followsDelimiter":"/","description":"Sorts by descending frequency count; levels with the most observations appear first.","type":"standalone"},{"name":"INTERNAL","followsDelimiter":"/","description":"Sorts by unformatted value.","type":"standalone"}]},{"name":"PBOXCOXTABLE","optional":true,"followsDelimiter":"/","aliases":["PBO"],"description":"Prints the Box-Cox table with the log likelihood displayed as a function of lambda. The important information in this table is displayed in the Box-Cox plot, so when ODS Graphics is in effect and the plot is produced, the table is not produced by default. When ODS Graphics is not in effect or when the plot is not produced, the table is produced by default. Specify the PBOXCOXTABLE option if you want to see the table in addition to the plot.","type":"standalone"},{"name":"REFERENCE=","optional":true,"followsDelimiter":"/","description":"Specifies how reference levels of CLASS variables are to be treated. You can specify the REFERENCE= option in the PROC TRANSREG, MODEL, or OUTPUT statement, and you can specify it independently for the OUT= data set and the displayed output. When you specify it in only one statement, it sets the option for both the displayed output and the OUT= data set.","help":"REFERENCE=NONE | MISSING | ZERO","type":"choice","arguments":[{"name":"NONE","followsDelimiter":"/","description":"Reference levels are suppressed. This is the default.","type":"standalone"},{"name":"MISSING","followsDelimiter":"/","description":"Reference levels are displayed and output with missing values.","type":"standalone"},{"name":"ZERO","followsDelimiter":"/","description":"Reference levels are displayed and output with zeros.","type":"standalone"}]},{"name":"REITERATE","optional":true,"followsDelimiter":"/","aliases":["REI"],"description":"Enables PROC TRANSREG to use previous transformations as starting points. The REITERATE a-option affects only variables that are iteratively transformed (specified as LINEAR, OPSCORE, MONOTONE, UNTIE, SPLINE, MSPLINE, and SSPLINE). For iterative transformations, the REITERATE a-option requests a search in the input data set for a variable that consists of the value of the TDPREFIX= or TIPREFIX= o-option followed by the original variable name. If such a variable is found, it is used to provide the initial values for the first iteration. The final transformation is a member of the transformation family defined by the original variable, not the transformation family defined by the initialization variable.","type":"standalone"},{"name":"RSQUARE","optional":true,"followsDelimiter":"/","aliases":["RSQ"],"description":"Prints a table with only the model R square.","type":"standalone"},{"name":"SEPARATORS=","optional":true,"followsDelimiter":"/","aliases":["SEP="],"description":"Specifies separators for creating CLASS expansion variable labels. By default, SEPARATORS=’ ’ ’ * ’ (\"blank\" and \"blank asterisk blank\"). The first value is used to separate variable names and values in interactions. The second value is used to separate interaction components. For example, the label for the coded variable for the A=1 and B=2 cell is, by default, ’A 1 * B 2’. If SEPARATORS=’=’ ’x’ is specified, then the label is ’A=1xB=2’. When you specify SEPARATORS= as an a-option or an o-option, it determines the default separators for all CLASS variables. When you specify SEPARATORS= as a t-option, it overrides the default only for selected variables.","type":"value"},{"name":"SHORT","optional":true,"followsDelimiter":"/","aliases":["SHO"],"description":"Suppresses the iteration histories.","type":"standalone"},{"name":"SINGULAR=","optional":true,"followsDelimiter":"/","aliases":["SIN="],"description":"Specifies the largest value within rounding error of zero. By default, SINGULAR=1E–12. PROC TRANSREG uses the value of the SINGULAR= a-option for checking 1 - R² when constructing full-rank matrices of predictor variables, checking denominators before dividing, and so on. PROC TRANSREG computes the regression coefficients by sweeping with rational pivoting.","help":"SINGULAR=*n*","type":"value"},{"name":"SOLVE","optional":true,"followsDelimiter":"/","aliases":["SOL","DUMMY","DUM"],"description":"Provides a canonical initialization. When there are no monotonicity constraints, when there is at most one canonical variable in each set, and when there is enough available memory, PROC TRANSREG (with the SOLVE a-option) can usually directly solve for the optimal solution in only one iteration. The initialization iteration is number 0, which is slower and uses more memory than other iterations. However, for some models, specifying the SOLVE a-option can greatly decrease the amount of time required to find the optimal transformations. During iteration 0, each variable is replaced by an expanded variable and the model is fit to the larger, expanded set of variables. For example, an OPSCORE variable is expanded into coded (or \"dummy\") variables, as if CLASS were specified, and a SPLINE variable is expanded into a B-spline basis, as if BSPLINE were specified. Then for each expanded variable, the results of iteration zero are constructed by multiplying the expanded basis times the β subvector to get the optimal transformation. This a-option can be useful even in models where a direct solution is not possible, because it provides good initial transformations of all the variables.","type":"standalone"},{"name":"SS2","optional":true,"followsDelimiter":"/","description":"Produces a regression table based on Type II sums of squares. Tests of the contribution of each transformation to the overall model are displayed and output to the OUTTEST= data set when you specify the OUTTEST= option. When you specify the SS2 a-option, the TEST a-option is automatically specified for you.","type":"standalone"},{"name":"TEST","optional":true,"followsDelimiter":"/","aliases":["TES"],"description":"Generates an ANOVA table. PROC TRANSREG tests the null hypothesis that the vector of scoring coefficients for all of the transformations is zero.","type":"standalone"},{"name":"TSTANDARD=","optional":true,"followsDelimiter":"/","description":"Specifies the standardization of the transformed variables for the hypothesis tests and in the OUT= data set. By default, TSTANDARD=ORIGINAL. When you specify TSTANDARD= as an a-option or an o-option, it determines the default standardization for all variables. When you specify TSTANDARD= as a t-option, it overrides the default standardization only for selected variables.","help":"TSTANDARD=CENTER | NOMISS | ORIGINAL | Z","type":"choice","arguments":[{"name":"CENTER","followsDelimiter":"/","description":"Centers the output variables to mean zero, but the variances are the same as the variances of the input variables.","type":"standalone"},{"name":"NOMISS","followsDelimiter":"/","description":"Sets the means and variances of the transformed variables in the OUT= data set, computed over all output values that correspond to nonmissing values in the input data set, to the means and variances computed from the nonmissing observations of the original variables. The TSTANDARD=NOMISS specification is useful with missing data. When a variable is linearly transformed, the final variable contains the original nonmissing values and the missing value estimates. In other words, the nonmissing values are unchanged. If your data have no missing values, TSTANDARD=NOMISS and TSTANDARD=ORIGINAL produce the same results.","type":"standalone"},{"name":"ORIGINAL","followsDelimiter":"/","description":"Sets the means and variances of the transformed variables to the means and variances of the original variables. This is the default.","type":"standalone"},{"name":"Z","followsDelimiter":"/","description":"Standardizes the variables to mean zero, variance one.","type":"standalone"}]},{"name":"TSUFFIX=","optional":true,"followsDelimiter":"/","aliases":["TSU="],"description":"Specifies the number of characters in \"Transformation\" to append to variable labels for transformed variables. By default, all characters are used.","help":"TSUFFIX=*n*","type":"value"},{"name":"TYPE=","optional":true,"followsDelimiter":"/","aliases":["TYP="],"description":"Specifies the valid value for the _TYPE_ variable in the input data set. If PROC TRANSREG finds an input _TYPE_ variable, it uses only observations with a _TYPE_ value that matches the TYPE= value. This enables a PROC TRANSREG OUT= data set containing coefficients to be used as input to PROC TRANSREG without requiring a WHERE statement to exclude the coefficients. If a _TYPE_ variable is not in the data set, all observations are used. The default is TYPE=’SCORE’, so if you do not specify the TYPE= a-option, only observations with _TYPE_=’SCORE’ are used. Do not confuse this a-option with the data set TYPE= option. The DATA= data set must be an ordinary SAS data set.","type":"value"},{"name":"UNTIE=","optional":true,"followsDelimiter":"/","aliases":["UNT="],"description":"Specifies the first and last special missing values in the list of those special missing values that are to be estimated with within-variable order constraints but no category constraints. The two-letters value must consist of two letters in alphabetical order. By default, there are category constraints but no order constraints on special missing value estimates.","help":"UNTIE=*two-letters*","type":"value"},{"name":"UTILITIES","optional":true,"followsDelimiter":"/","aliases":["UTI"],"description":"Produces a table of the part-worth utilities from a conjoint analysis. Utilities, their standard errors, and the relative importance of each factor are displayed and output to the OUTTEST= data set when you specify the OUTTEST= option. When you specify the UTILITIES a-option, the TEST a-option is automatically specified for you.","type":"standalone"}]},{"name":"OUTPUT","description":"The OUTPUT statement creates a new SAS data set that contains coefficients, marginal means, and information about the original and transformed variables. The information about original and transformed variables composes the score partition of the data set; observations have _TYPE_=’SCORE’. The coefficients and marginal means compose the coefficient partition of the data set; observations have _TYPE_=’M COEFFI’ or _TYPE_=’MEAN’.","help":"OUTPUT &lt;ADPREFIX=name&gt; &lt;AIPREFIX=name&gt; &lt;OUT=SAS-data-set&gt; ...","arguments":[{"name":"ADPREFIX=","optional":true,"aliases":["ADP="],"description":"Specifies a prefix for naming the dependent variable predicted values. The default is ADPREFIX=P when you specify the PREDICTED o-option; otherwise, it is ADPREFIX=A. When you specify the ADPREFIX= o-option, the PREDICTED o-option is automatically specified for you. The ADPREFIX= o-option is the same as the PPREFIX= o-option.","help":"ADPREFIX=*name*","type":"value"},{"name":"AIPREFIX=","optional":true,"aliases":["AIP="],"description":"Specifies a prefix for naming the independent variable approximations. The default is AIPREFIX=A. When you specify the AIPREFIX= o-option, the IAPPROXIMATIONS o-option is automatically specified for you.","help":"AIPREFIX=*name*","type":"value"},{"name":"APPROXIMATIONS","optional":true,"aliases":["APPROX","APP"],"description":"Is equivalent to specifying both the DAPPROXIMATIONS and the IAPPROXIMATIONS o-options. If you specify METHOD=UNIVARIATE, then the APPROXIMATIONS o-option specifies only the DAPPROXIMATIONS o-option.","type":"standalone"},{"name":"CANONICAL","optional":true,"aliases":["CAN"],"description":"Outputs canonical variables to the OUT= data set. When you specify METHOD=CANALS, the CANONICAL o-option is automatically specified for you. The CDPREFIX= o-option specifies a prefix for naming the dependent canonical variables (default Cand), and the CIPREFIX= o-option specifies a prefix for naming the independent canonical variables (default Cani).","type":"standalone"},{"name":"CCC","optional":true,"description":"Outputs canonical correlation coefficients to the OUT= data set.","type":"standalone"},{"name":"CDPREFIX=","optional":true,"aliases":["CDP="],"description":"Provides a prefix for naming the canonical dependent variables. The default is CDPREFIX=Cand. When you specify the CDPREFIX= o-option, the CANONICAL o-option is automatically specified for you.","help":"CDPREFIX=*name*","type":"value"},{"name":"CEC","optional":true,"description":"Outputs canonical elliptical point model coordinates to the OUT= data set.","type":"standalone"},{"name":"CILPREFIX=","optional":true,"aliases":["CIL="],"description":"Specifies a prefix for naming the conservative-individual-lower confidence limits. The default prefix is CIL. When you specify the CILPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"CILPREFIX=*name*","type":"value"},{"name":"CIPREFIX=","optional":true,"aliases":["CIP="],"description":"Provides a prefix for naming the canonical independent variables. The default is CIPREFIX=Cani. When you specify the CIPREFIX= o-option, the CANONICAL o-option is automatically specified for you.","help":"CIPREFIX=*name*","type":"value"},{"name":"CIUPREFIX=","optional":true,"aliases":["CIU="],"description":"Specifies a prefix for naming the conservative-individual-upper confidence limits. The default prefix is CIU. When you specify the CIUPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"CIUPREFIX=*name*","type":"value"},{"name":"CLI","optional":true,"description":"Outputs individual confidence limits to the OUT= data set. The names of the confidence limits variables are constructed from the original dependent variable names and the prefixes specified in the following o-options: LILPREFIX= (default LIL for liberal individual lower), CILPREFIX= (default CIL for conservative individual lower), LIUPREFIX= (default LIU for liberal individual upper), and CIUPREFIX= (default CIU for conservative individual upper). When there are no monotonicity constraints, the liberal and conservative limits are the same.","type":"standalone"},{"name":"CLM","optional":true,"description":"Outputs mean confidence limits to the OUT= data set. The names of the confidence limits variables are constructed from the original dependent variable names and the prefixes specified in the following o-options: LMLPREFIX= (default LML for liberal mean lower), CMLPREFIX= (default CML for conservative mean lower), LMUPREFIX= (default LMU for liberal mean upper), and CMUPREFIX= (default CMU for conservative mean upper). When there are no monotonicity constraints, the liberal and conservative limits are the same.","type":"standalone"},{"name":"CMLPREFIX=","optional":true,"aliases":["CML="],"description":"Specifies a prefix for naming the conservative-mean-lower confidence limits. The default prefix is CML. When you specify the CMLPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"CMLPREFIX=*name*","type":"value"},{"name":"CMUPREFIX=","optional":true,"description":"Specifies a prefix for naming the conservative-mean-upper confidence limits. The default prefix is CMU. When you specify the CMUPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"CMUPREFIX=*name*","type":"value"},{"name":"COEFFICIENTS","optional":true,"aliases":["COE"],"description":"Outputs either multiple regression coefficients or raw canonical coefficients to the OUT= data set. If you specify METHOD=CANALS (in the MODEL or PROC TRANSREG statement), then the COEFFICIENTS o-option outputs the first n canonical variables, where n is the value of the NCAN= a-option (specified in the MODEL or PROC TRANSREG statement). Otherwise, the COEFFICIENTS o-option includes multiple regression coefficients in the OUT= data set. In addition, when you specify the CLASS expansion for any independent variable, the COEFFICIENTS o-option also outputs marginal means.","type":"standalone"},{"name":"COORDINATES=","optional":true,"aliases":["COO="],"description":"Outputs either ideal point or vector model coordinates for preference mapping to the OUT= data set. When METHOD=CANALS, these coordinates are computed from canonical coefficients; otherwise, the coordinates are computed from multiple regression coefficients. For details, see the section Point Models.","type":"value"},{"name":"CPC","optional":true,"description":"Outputs canonical point model coordinates to the OUT= data set.","type":"standalone"},{"name":"CQC","optional":true,"description":"Outputs canonical quadratic point model coordinates to the OUT= data set.","type":"standalone"},{"name":"DAPPROXIMATIONS","optional":true,"aliases":["DAP"],"description":"Outputs the approximations of the transformed dependent variables to the OUT= data set. These are the target values for the optimal transformations. With METHOD=UNIVARIATE and METHOD=MORALS, the dependent variable approximations are the ordinary predicted values from the linear model. The names of the approximation variables are constructed from the ADPREFIX= o-option (default A) and the original dependent variable names. For ordinary predicted values, use the PREDICTED o-option instead of the DAPPROXIMATIONS o-option, since the PREDICTED o-option uses a more relevant prefix (\"P\" instead of \"A\") and a more relevant variable label suffix (\"Predicted Values\" instead of \"Approximations\").","type":"standalone"},{"name":"DEPENDENT=","optional":true,"aliases":["DEP="],"description":"Specifies the untransformed dependent variable for OUT= data sets with METHOD=MORALS when there is more than one dependent variable. The default is DEPENDENT=_DEPEND_.","help":"DEPENDENT=*name*","type":"value"},{"name":"DESIGN=","optional":true,"aliases":["DES="],"description":"Specifies that your primary goal is design matrix coding, not analysis. Specifying the DESIGN o-option makes the procedure run faster. The DESIGN o-option sets the default method to UNIVARIATE and the default MAXITER= value to zero. It suppresses computing the regression coefficients, unless they are needed for some other option. Furthermore, when the DESIGN o-option is specified, the MODEL statement is not required to have an equal sign. When no MODEL statement equal sign is specified, all variables are considered independent variables, all options that require dependent variables are ignored, and the IREPLACE o-option is automatically specified for you.","type":"value"},{"name":"DREPLACE","optional":true,"aliases":["DRE"],"description":"Replaces the original dependent variables with the transformed dependent variables in the OUT= data set. The names of the transformed variables in the OUT= data set correspond to the names of the original dependent variables in the input data set. By default, both the original dependent variables and the transformed dependent variables (with names constructed from the TDPREFIX= (default T) o-option and the original dependent variable names) are included in the OUT= data set.","type":"standalone"},{"name":"IAPPROXIMATIONS","optional":true,"aliases":["IAP"],"description":"Outputs the approximations of the transformed independent variables to the OUT= data set. These are the target values for the optimal transformations. The names of the approximation variables are constructed from the AIPREFIX= o-option (default A) and the original independent variable names. When you specify the AIPREFIX= o-option, the IAPPROXIMATIONS o-option is automatically specified for you. The IAPPROXIMATIONS o-option is not valid when METHOD=UNIVARIATE.","type":"standalone"},{"name":"IREPLACE","optional":true,"aliases":["IRE"],"description":"Replaces the original independent variables with the transformed independent variables in the OUT= data set. The names of the transformed variables in the OUT= data set correspond to the names of the original independent variables in the input data set. By default, both the original independent variables and the transformed independent variables (with names constructed from the TIPREFIX= o-option (default T) and the original independent variable names) are included in the OUT= data set.","type":"standalone"},{"name":"LEVERAGE=","optional":true,"aliases":["LEV="],"description":"Creates a variable with the specified name in the OUT= data set that contains leverages. Specifying the LEVERAGE o-option is equivalent to specifying LEVERAGE=Leverage.","type":"value"},{"name":"LILPREFIX=","optional":true,"aliases":["LIL="],"description":"Specifies a prefix for naming the liberal-individual-lower confidence limits. The default prefix is LIL. When you specify the LILPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"LILPREFIX=*name*","type":"value"},{"name":"LIUPREFIX=","optional":true,"aliases":["LIU="],"description":"Specifies a prefix for naming the liberal-individual-upper confidence limits. The default prefix is LIU. When you specify the LIUPREFIX= o-option, the CLI o-option is automatically specified for you.","help":"LIUPREFIX=*name*","type":"value"},{"name":"LMLPREFIX=","optional":true,"aliases":["LML="],"description":"Specifies a prefix for naming the liberal-mean-lower confidence limits. The default prefix is LML. When you specify the LMLPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"LMLPREFIX=*name*","type":"value"},{"name":"LMUPREFIX=","optional":true,"aliases":["LMU="],"description":"Specifies a prefix for naming the liberal-mean-upper confidence limits. The default prefix is LMU. When you specify the LMUPREFIX= o-option, the CLM o-option is automatically specified for you.","help":"LMUPREFIX=*name*","type":"value"},{"name":"MACRO=","optional":true,"aliases":["MAC"],"description":"Creates macro variables. Most of the options available within the MACRO o-option are rarely needed. By default, PROC TRANSREG creates a macro variable named _TrgInd with a complete list of independent variables created by the procedure. PROC TRANSREG, also by default, creates a macro variable named _TrgIndN, which contains the number of variables in the _TrgInd list. The available keywords are as follows. DN=name -- specifies the name of a macro variable that contains the number of dependent variables. By default, a macro variable named _TrgDepN is created. This is the number of variables in the DL= list and the number of macro variables created by the DV= and DE= specifications. IN=name -- specifies the name of a macro variable that contains the number of independent variables. By default, a macro variable named _TrgIndN is created. This is the number of variables in the IL= list and the number of macro variables created by the IV= and IE= specifications. DL=name -- specifies the name of a macro variable that contains the list of the dependent variables. By default, a macro variable named _TrgDep is created. These are the variable names of the final transformed variables in the OUT= data set. For example, if there are three dependent variables, y1–y3, then _TrgDep contains, by default, Ty1 Ty2 Ty3 (or y1 y2 y3 if you specify the REPLACE o-option). IL=name -- specifies the name of a macro variable that contains the list of the independent variables. By default, a macro variable named _TrgInd is created. These are the variable names of the final transformed variables in the OUT= data set. For example, if there are three independent variables, x1–x3, then _TrgInd contains, by default, Tx1 Tx2 Tx3 (or x1 x2 x3 if you specify the REPLACE o-option). DV=prefix -- specifies a prefix for creating a list of macro variables, each of which contains one dependent variable name. For example, if there are three dependent variables, y1–y3, and you specify macro(dv=Dep), then three macro variables, Dep1, Dep2, and Dep3, are created, containing Ty1, Ty2, and Ty3, respectively (or y1, y2, and y3 if you specify the REPLACE o-option). By default, no list is created. IV=prefix -- specifies a prefix for creating a list of macro variables, each of which contains one independent variable name. For example, if there are three independent variables, x1–x3, and you specify macro(iv=Ind), then three macro variables, Ind1, Ind2, and Ind3, are created, containing Tx1, Tx2, and TX3, respectively (or x1, x2, and x3 if you specify the REPLACE o-option). By default, no list is created. DE=prefix -- specifies a prefix for creating a list of macro variables, each of which contains one dependent variable effect. This list shows the origin of each model term. Each effect consists of two or more parts, and each part consists of a value in 32 columns followed by a blank. For example, if you specify macro(de=d), then a macro variable d1 is created for identity(y).","help":"MACRO=IE= | DE= | IV= | DV= | IL= | DL= | IN= | DN=","type":"choice","arguments":[{"name":"IE=","type":"value"},{"name":"DE=","type":"value"},{"name":"IV=","type":"value"},{"name":"DV=","type":"value"},{"name":"IL=","type":"value"},{"name":"DL=","type":"value"},{"name":"IN=","type":"value"},{"name":"DN=","type":"value"}]},{"name":"MEANS","optional":true,"aliases":["MEA"],"description":"Outputs marginal means for CLASS variable expansions to the OUT= data set.","type":"standalone"},{"name":"MEC","optional":true,"description":"Outputs multiple regression elliptical point model coordinates to the OUT= data set.","type":"standalone"},{"name":"MPC","optional":true,"description":"Outputs multiple regression point model coordinates to the OUT= data set.","type":"standalone"},{"name":"MQC","optional":true,"description":"Outputs multiple regression quadratic point model coordinates to the OUT= data set.","type":"standalone"},{"name":"MRC","optional":true,"description":"Outputs multiple regression coefficients to the OUT= data set.","type":"standalone"},{"name":"MREDUNDANCY","optional":true,"aliases":["MRE"],"description":"Outputs multiple redundancy analysis coefficients to the OUT= data set.","type":"standalone"},{"name":"NORESTOREMISSING","optional":true,"aliases":["NORESTORE","NOR"],"description":"Specifies that missing values should not be restored when the OUT= data set is created. By default, the coded CLASS variable contains a row of missing values for observations in which the CLASS variable is missing. When you specify the NORESTOREMISSING o-option, these observations contain a row of zeros instead. This is useful when PROC TRANSREG is used to code experimental designs for discrete choice models and there is a constant alternative indicated by a missing value.","type":"standalone"},{"name":"NOSCORES","optional":true,"aliases":["NOS"],"description":"Excludes original variables, transformed variables, predicted values, residuals, and scores from the OUT= data set. You can use the NOSCORES o-option with various other options to create an OUT= data set that contains only a coefficient partition (for example, a data set consisting entirely of coefficients and coordinates).","type":"standalone"},{"name":"OUT=","optional":true,"description":"Specifies the output data set for the data, transformed data, predicted values, residuals, scores, coefficients, and so on. When you use an OUTPUT statement but do not use the OUT= specification, PROC TRANSREG creates a data set and uses the DATA convention. If you want to create a permanent SAS data set, you must specify a two-level name.","help":"OUT=*SAS-data-set*","type":"dataSet"},{"name":"PPREFIX=","optional":true,"aliases":["PDPREFIX=","PDP="],"description":"Specifies a prefix for naming the dependent variable predicted values. The default is PPREFIX=P when you specify the PREDICTED o-option; otherwise, it is PPREFIX=A. When you specify the PPREFIX= o-option, the PREDICTED o-option is automatically specified for you. The PPREFIX= o-option is the same as the ADPREFIX= o-option.","help":"PPREFIX=*name*","type":"value"},{"name":"PREDICTED","optional":true,"aliases":["PRE"],"description":"Outputs predicted values, which for METHOD=UNIVARIATE and METHOD=MORALS are the ordinary predicted values from the linear model, to the OUT= data set. The names of the predicted values’ variables are constructed from the PPREFIX= o-option (default P) and the original dependent variable names. When you specify the PPREFIX= o-option, the PREDICTED o-option is automatically specified for you.","type":"standalone"},{"name":"RDPREFIX=","optional":true,"aliases":["RPD="],"description":"Specifies a prefix for naming the residual (dependent) variables to the OUT= data set. The default is RDPREFIX=R. When you specify the RDPREFIX= o-option, the RESIDUALS o-option is automatically specified for you.","help":"RDPREFIX=*name*","type":"value"},{"name":"REDUNDANCY=","optional":true,"aliases":["RED="],"description":"Outputs redundancy variables to the OUT= data set, either standardized or unstandardized. Specifying the REDUNDANCY o-option is the same as specifying REDUNDANCY=STANDARDIZE. The results of the REDUNDANCY o-option depends on the TSTANDARD= option. You must specify TSTANDARD=Z to get results based on standardized data. The TSTANDARD= option controls how the data that go into the redundancy analysis are scaled, and REDUNDANCY= STANDARDIZE|UNSTANDARDIZE controls how the redundancy variables are scaled. The REDUNDANCY o-option is automatically specified for you when you specify the METHOD=REDUNDANCY a-option. The RPREFIX= o-option specifies a prefix (default Red) for naming the redundancy variables.","help":"REDUNDANCY=STANDARDIZE | UNSTANDARDIZE","type":"choice","arguments":[{"name":"STANDARDIZE","description":"Outputs redundancy variables to the OUT= data set, standardized.","type":"standalone"},{"name":"UNSTANDARDIZE","description":"Outputs redundancy variables to the OUT= data set, unstandardized.","type":"standalone"}]},{"name":"REFERENCE=","optional":true,"description":"Specifies how reference levels of CLASS variables are to be treated. You can specify the REFERENCE= option in the PROC TRANSREG, MODEL, or OUTPUT statement, and you can specify it independently for the OUT= data set and the displayed output. When you specify it in only one statement, it sets the option for both the displayed output and the OUT= data set.","help":"REFERENCE=NONE | MISSING | ZERO","type":"choice","arguments":[{"name":"NONE","description":"Reference levels are suppressed. This is the default.","type":"standalone"},{"name":"MISSING","description":"Reference levels are displayed and output with missing values.","type":"standalone"},{"name":"ZERO","description":"Reference levels are displayed and output with zeros.","type":"standalone"}]},{"name":"REPLACE","optional":true,"aliases":["REP"],"description":"Is equivalent to specifying both the DREPLACE and the IREPLACE o-options.","type":"standalone"},{"name":"RESIDUALS","optional":true,"aliases":["RES"],"description":"Outputs the differences between the transformed dependent variables and their predicted values. The names of the residual variables are constructed from the RDPREFIX= o-option (default R) and the original dependent variable names.","type":"standalone"},{"name":"RPREFIX=","optional":true,"aliases":["RPR="],"description":"Provides a prefix for naming the redundancy variables. The default is RPREFIX=Red. When you specify the RPREFIX= o-option, the REDUNDANCY o-option is automatically specified for you.","help":"RPREFIX=*name*","type":"value"},{"name":"TDPREFIX=","optional":true,"aliases":["TDP="],"description":"Specifies a prefix for naming the transformed dependent variables. By default, TDPREFIX=T. The TDPREFIX= o-option is ignored when you specify the DREPLACE o-option.","help":"TDPREFIX=*name*","type":"value"},{"name":"TIPREFIX=","optional":true,"aliases":["TIP="],"description":"Specifies a prefix for naming the transformed independent variables. By default, TIPREFIX=T. The TIPREFIX= o-option is ignored when you specify the IREPLACE o-option.","help":"TIPREFIX=*name*","type":"value"}]},{"name":"WEIGHT","description":"When you use a WEIGHT statement, a weighted residual sum of squares is minimized. The WEIGHT statement has no effect on degrees of freedom or number of observations, but the weights affect most other calculations. The observation is used in the analysis only if the value of the WEIGHT statement variable is greater than 0.","help":"WEIGHT variable"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_029","docsetTargetFile":"statug_transreg_toc.htm"}}