{"name":"VARCLUS","statements":[{"name":"PROC VARCLUS","description":"The VARCLUS procedure divides a set of numeric variables into disjoint or hierarchical clusters.","help":"PROC VARCLUS <CENTROID> <CORR> <COVARIANCE> <DATA=SAS-data-set> <HIERARCHY> <INITIAL=GROUP | INPUT | RANDOM... > <MAXCLUSTERS=n> <MAXEIGEN=n> <MAXITER=n> <MAXSEARCH=n> <MINCLUSTERS=n> <MULTIPLEGROUP> <NOINT> <NOPRINT> <OUTSTAT=SAS-data-set> <OUTTREE=SAS-data-set> <PLOTS=ALL | MAXPOINTS=|MAXPTS= | DENDROGRAM... > <PROPORTION=n> <RANDOM=n> <SHORT> <SIMPLE> <SUMMARY> <TRACE> <VARDEF=DF | N | WDF... >;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tFREQ variable ;\n    \n\tPARTIAL variable ;\n    \n\tSEED variables ;\n    \n\tVAR variables ;\n    \n\tWEIGHT variables;\n","arguments":[{"name":"CENTROID","optional":true,"description":"Uses centroid components rather than principal components.","type":"standalone"},{"name":"CORR","optional":true,"description":"Displays the correlation matrix.","type":"standalone"},{"name":"COVARIANCE","optional":true,"aliases":["COV"],"description":"Analyzes the covariance matrix instead of the correlation matrix.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the SAS data set to be analyzed.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"HIERARCHY","optional":true,"aliases":["HI"],"description":"Requires the clusters at different levels to maintain a hierarchical structure. To draw a tree diagram, use the OUTTREE= option and the TREE procedure.","type":"standalone"},{"name":"INITIAL=","optional":true,"description":"Specifies the method for initializing the clusters.","help":"INITIAL=GROUP | INPUT | RANDOM | SEED","type":"choice","arguments":[{"name":"GROUP","description":"Obtains the cluster membership of each variable from an observation in the DATA= data set where the _TYPE_ variable has a value of 'GROUP'.","type":"standalone"},{"name":"INPUT","description":"Obtains scoring coefficients for the cluster components from observations in the DATA= data set where the _TYPE_ variable has a value of 'SCORE'.","type":"standalone"},{"name":"RANDOM","description":"Assigns variables randomly to clusters.","type":"standalone"},{"name":"SEED","description":"Initializes each cluster component to be one of the variables named in the SEED statement.","type":"standalone"}]},{"name":"MAXCLUSTERS=","optional":true,"aliases":["MAXC="],"description":"Specifies the largest number of clusters desired. The default value is the number of variables.","help":"MAXCLUSTERS=*n*","type":"value"},{"name":"MAXEIGEN=","optional":true,"description":"Specifies that when choosing a cluster to split, VARCLUS should choose the cluster with the largest second eigenvalue, provided that its second eigenvalue is greater than the MAXEIGEN= value.","help":"MAXEIGEN=*n*","type":"value"},{"name":"MAXITER=","optional":true,"description":"Specifies the maximum number of iterations during the NCS phase. The default value is 1 if you specify the CENTROID option; the default is 10 otherwise.","help":"MAXITER=*n*","type":"value"},{"name":"MAXSEARCH=","optional":true,"description":"Specifies the maximum number of iterations during the search phase. The default is 1000 divide by the number of variables.","help":"MAXSEARCH=*n*","type":"value"},{"name":"MINCLUSTERS=","optional":true,"aliases":["MINC="],"description":"Specifies the smallest number of clusters desired. The default value is 2 for INITIAL=RANDOM or INITIAL=SEED; otherwise, VARCLUS begins with one cluster and tries to split it in accordance with the PROPORTION= and/or MAXEIGEN= options.","help":"MINCLUSTERS=*n*","type":"value"},{"name":"MULTIPLEGROUP","optional":true,"aliases":["MG"],"description":"Performs a multiple group component analysis.","type":"standalone"},{"name":"NOINT","optional":true,"description":"Requests that no intercept be used; covariances or correlations are not corrected for the mean.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses displayed output. Note that this option temporarily disables the Output Delivery System (ODS).","type":"standalone"},{"name":"OUTSTAT=","optional":true,"description":"Creates an output data set to contain statistics including means, standard deviations, correlations, cluster scoring coefficients, and the cluster structure.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"OUTTREE=","optional":true,"description":"Creates an output data set to contain information on the tree structure that can be used by the TREE procedure to display a tree diagram.","help":"OUTTREE=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Syntax: PLOTS <(global-plot-options)> <= plot-request > PLOTS <(global-plot-options)> <= (plot-request <... plot-request >)> Controls the plots produced through ODS Graphics.","help":"PLOTS=ALL | MAXPOINTS=|MAXPTS= | DENDROGRAM | NONE","type":"choice","arguments":[{"name":"ALL","description":"Produces all plots, which for PROC VARCLUS is only a dendrogram.","type":"standalone"},{"name":"MAXPOINTS=","description":"Syntax: MAXPOINTS=n | MAXPTS=n Suppresses the dendrogram when the number of variables (clusters) exceeds the n value. This prevents an unreadable plot from being produced. The default is MAXPOINTS=200.","help":"MAXPOINTS=|MAXPTS=","type":"choice"},{"name":"DENDROGRAM","description":"Syntax: DENDROGRAM <( dendrogram-options )> Requests a dendrogram and specifies dendrogram-options. Unlike most graphs, the size of the dendrogram can vary as a function of the number of objects that appear in the dendrogram. You can specify the following dendrogram-options to control the size and appearance of the dendrogram: COMPUTEHEIGHT=a b |CH=a b specifies the constants for computing the height of the dendrogram. For n points being clustered, intercept a, and slope b, the height is based in part on a + bn. For a horizontal dendrogram, the default (given in pixels) is COMPUTEHEIGHT=100 12, the default height in pixels is max(100 + 12n, 480), the default height in inches is max(1.04167 + 0.125n, 5), and the default height in centimeters is max(2.64583 + 0.3175n, 12.7). For a vertical dendrogram, the default height is 480 pixels. The default unit is pixels, and you can use the UNIT= dendrogram-option to change the unit to inches or centimeters for this option. Inches equals pixels divided by 96, and centimeters equals inches times 2.54. COMPUTEWIDTH=a b |CW=a b specifies the constants for computing the width of the dendrogram. For n points being clustered, intercept a, and slope b, the width is based in part on . For a vertical dendrogram, the default (given in pixels) is COMPUTEWIDTH=100 12, the default width in pixels is max(100 + 12n, 640), the default width in inches is max(1.04167 + 0.125n, 6.66667), and the default width in centimeters is max(2.64583 + 0.3175n, 16.933). For a horizontal dendrogram, the default width is 640 pixels. The default unit is pixels, and you can use the UNIT= dendrogram-option to change the unit to inches or centimeters for this option. Inches equals pixels divided by 96, and centimeters equals inches times 2.54. HEIGHT=PROPORTION | NCL | VAREXP or H=P | N | V specifies the method for drawing the height of the dendrogram. HEIGHT=PROPORTION is the default. HEIGHT=PROPORTION specifies that the total proportion of variance explained by the clusters at the current level of the tree is used. HEIGHT=NCL specifies that the number of clusters is used. HEIGHT=VAREXP specifies that the total variance explained by the clusters at the current level of the tree is used. HORIZONTAL | VERTICAL specifies either a horizontal dendrogram with the objects on the vertical axis (HORIZONTAL) or a vertical dendrogram with the objects on the horizontal axis (VERTICAL). The default is HORIZONTAL. SETHEIGHT=height SH=height specifies the height of the dendrogram. By default, the height is based on the COMPUTEHEIGHT= option. The default unit is pixels, and you can use the UNIT= dendrogram-option to change the unit to inches or centimeters for this dendrogram-option. SETWIDTH=width SW=width specifies the width of the dendrogram. By default, the width is based on the COMPUTEWIDTH= option. The default unit is pixels, and you can use the UNIT= dendrogram-option to change the unit to inches or centimeters for this dendrogram-option. UNIT=PX | IN | CM specifies the unit (pixels, inches, or centimeters) for the SETHEIGHT=, SETWIDTH=, COMPUTEHEIGHT=, and COMPUTEWIDTH= dendrogram-options.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"}]},{"name":"PROPORTION=","optional":true,"aliases":["PERCENT="],"description":"Specifies that when choosing a cluster to split, VARCLUS should choose the cluster with the smallest proportion of variation explained, provided that its proportion of variation explained is less than the PROPORTION= value.","help":"PROPORTION=*n*","type":"value"},{"name":"RANDOM=","optional":true,"description":"Specifies a positive integer as a starting value for use with REPLACE=RANDOM.","help":"RANDOM=*n*","type":"value"},{"name":"SHORT","optional":true,"description":"Suppresses display of the cluster structure, scoring coefficient, and intercluster correlation matrices.","type":"standalone"},{"name":"SIMPLE","optional":true,"description":"Displays means and standard deviations.","type":"standalone"},{"name":"SUMMARY","optional":true,"description":"Suppresses all default displayed output except the final summary table.","type":"standalone"},{"name":"TRACE","optional":true,"description":"Displays the cluster to which each variable is assigned during the iterations.","type":"standalone"},{"name":"VARDEF=","optional":true,"description":"Specifies the divisor to be used in the calculation of variances and covariances. By default, VARDEF=DF.","help":"VARDEF=DF | N | WDF | WEIGHT","type":"choice","arguments":[{"name":"DF","description":"Degrees of freedom","type":"standalone"},{"name":"N","description":"Number of observations","type":"standalone"},{"name":"WDF","description":"Sum of weights minus 1","type":"standalone"},{"name":"WEIGHT","description":"Sum of weights","type":"standalone"}]}]},{"name":"BY","description":"Obtains separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"FREQ","description":"If a variable in your data set represents the frequency of occurrence for the other values in the observation, include the variable’s name in a FREQ statement. The procedure then treats the data set as if each observation appears n times, where n is the value of the FREQ variable for the observation","help":"FREQ variable "},{"name":"PARTIAL","description":"If you want to base the clustering on partial correlations, list the variables to be partialed out in the PARTIAL statement.","help":"PARTIAL variable "},{"name":"SEED","description":"The SEED statement specifies variables to be used as seeds to initialize the clusters. It is not necessary to use INITIAL=SEED if the SEED statement is present, but if any other INITIAL= option is specified, the SEED statement is ignored.","help":"SEED variables "},{"name":"VAR","description":"The VAR statement specifies the variables to be clustered. If you do not specify the VAR statement and do not specify TYPE=SSCP, all numeric variables not listed in other statements (except the SEED statement) are processed.","help":"VAR variables "},{"name":"WEIGHT","description":"If you want to specify relative weights for each observation in the input data set, place the weights in a variable in the data set and specify the name in a WEIGHT statement. This is often done when the variance associated with each observation is different and the values of the weight variable are proportional to the reciprocals of the variances.","help":"WEIGHT variables"}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_017","docsetTargetFile":"statug_varclus_toc.htm"}}