{"name":"VARIOGRAM","statements":[{"name":"PROC VARIOGRAM","description":"The VARIOGRAM procedure computes empirical measures of spatial continuity for two-dimensional spatial data. These measures are a function of the distances between the sample data pairs. When the data are free of nonrandom (or systematic) surface trends, the estimated continuity measures are the empirical semivariance and covariance. The procedure also fits permissible theoretical models to the empirical semivariograms, so that you can use them in subsequent analysis to perform spatial prediction. You can produce plots of the empirical semivariograms in addition to plots of the fitted models. Both isotropic and anisotropic continuity measures are available. † PROC VARIOGRAM also provides the Moran’s I and Geary’s c spatial autocorrelation statistics, in addition to the Moran scatter plot to visualize spatial associations within a specified neighborhood around observations. The procedure produces the OUTVAR=, OUTPAIR=, and OUTDISTANCE= data sets that contain information about the semivariogram analysis. Also, the OUTACWEIGHTS= and the OUTMORAN= output data sets contain information about the autocorrelation analysis. † The VARIOGRAM procedure now uses ODS Graphics to create graphs as part of its output.","help":"PROC VARIOGRAM <DATA=SAS-data-set> <NOPRINT> <OUTACWEIGHTS=SAS-data-set> <OUTDISTANCE=SAS-data-set> <OUTPAIR=SAS-data-set> <OUTVAR=SAS-data-set> <PLOTS=ALL | EQUATE | FITPLOT|FIT... >;     \n\tBY <DESCENDING> <NOTSORTED> ; \n   \n\tCOMPUTE <ALPHA=number> <ANGLETOLERANCE=angle tolerance> <AUTOCORRELATION <(autocorrelation-options)> Experimental> ...;     \n\tCOORDINATES <XCOORD= (variable-name)> <YCOORD= (variable-name)> ; \n   \n\tDIRECTIONS directions-list ;     \n\tID variable ;     \n\tMODEL ALPHA=number CHOOSE=AIC|SSE|STATUS  CL ...;     \n\tNLOPTIONS <ABSCONV= | ABSTOL=r> <ABSFCONV=r <n> | ABSFTOL=r<n>> <ABSGCONV= | ABSGTOL=r <n>> ...;     \n\tPARMS <HOLD=value-list> <LOWERB=value-list> <MAXSCALE=maxscale> ...; \n   \n\tSTORE <LABEL=store-label> OUT=store-name ;     \n\tVAR analysis-variables-list ; ","arguments":[{"name":"DATA=","optional":true,"description":"Specifies a SAS data set containing the x and y coordinate variables and the VAR statement variables.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"NOPRINT","optional":true,"description":"Suppresses the normal display of results.","type":"standalone"},{"name":"OUTACWEIGHTS=","optional":true,"aliases":["OUTACW=","OUTA="],"description":"Specifies a SAS data set in which to store the autocorrelation weights information for each pair of points in the DATA= data set.","help":"OUTACWEIGHTS=*SAS-data-set*","type":"dataSet"},{"name":"OUTDISTANCE=","optional":true,"aliases":["OUTDIST=","OUTD="],"description":"Specifies a SAS data set in which to store summary distance information.","help":"OUTDISTANCE=*SAS-data-set*","type":"dataSet"},{"name":"OUTPAIR=","optional":true,"aliases":["OUTP="],"description":"Specifies a SAS data set in which to store distance and angle information for each pair of points in the DATA= data set.","help":"OUTPAIR=*SAS-data-set*","type":"dataSet"},{"name":"OUTVAR=","optional":true,"aliases":["OUTVR="],"description":"Specifies a SAS data set in which to store the continuity measures.","help":"OUTVAR=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Syntax: PLOTS <(global-plot-options)> <= plot-request <(options)>> PLOTS <(global-plot-options)> <= (plot-request <(options)> <... plot-request <(options)>>)> Controls the plots produced through ODS Graphics. The global-plot-options include the following: ONLY suppresses the default plots. Only plots specifically requested are displayed.","help":"PLOTS=ALL | EQUATE | FITPLOT|FIT | MORAN | NONE | OBSERVATIONS|OBSERV|OBS | PAIRS | SEMIVARIOGRAM|SEMIVAR","type":"choice","arguments":[{"name":"ALL","description":"Produces all appropriate plots.","type":"standalone"},{"name":"EQUATE","description":"Specifies that all appropriate plots be produced in a way that the axes coordinates have equal size units.","type":"standalone"},{"name":"FITPLOT","aliases":["FIT"],"description":"[Syntax: FITPLOT <(fitplot-options)> Requests a plot that shows the model fitting results against the empirical semivariogram. By default, FITPLOT displays one plot of the fitted model (or a panel of plots for different angles in the anisotropic case). You can specify the following fitplot-options: NCLASSES=number | NCLASSES=ALL specifies the maximum number of classes to display on the fit plot, where number is a positive integer. The default is NCLASSES=5 for nonpaneled plots and NCLASSES=3 for paneled plots. The option takes effect when you specify the FORM=AUTO option in the MODEL statement, and it is ignored when you fit one single model. If you specify NCLASSES=ALL or a larger number than the available classes, then all available classes are shown on the fit plot. If you specify multiple instances of the NCLASSES= option, then only the last specified instance is honored. UNPACK suppresses paneling in paneled fit plots. By default, fit plots appear in a panel, when appropriate.","type":"standalone"},{"name":"MORAN","description":"[Syntax: MORAN <(moran-options)> Produces a Moran scatter plot of the observations with nonmissing values. In addition to the Moran scatter plot points, the plot also displays the fit line for the linear regression of the weighted average on the standardized observation values, the regression fit line slope, and a reference line with slope equal to 1. The MORAN plot has the following moran-options: LABEL < ( label-options ) > labels the observations. The label is the ID variable if the ID statement is specified; otherwise, it is the observation number. The label-options can be one or more of the following: HH -- specifies that labels show for observations in the upper right (high-high) plot quadrant of positive spatial association. HL -- specifies that labels show for observations in the lower right (high-low) plot quadrant of negative spatial association. LH -- specifies that labels show for observations in the upper left (low-high) plot quadrant of negative spatial association. LL -- specifies that labels show for observations in the lower left (low-low) plot quadrant of positive spatial association. If you specify multiple instances of the MORAN option and you specify the LABEL suboption in any of those, then the resulting Moran scatter plot displays the observations labels. By default, when you specify none of the label-options, the PLOTS=MORAN(LABEL) request puts labels in all observations. ROWAVG=rowavg-option specifies the flag value for row-averaging of weights in the computation of the weighted average. The rowavg-option can be either of the following: OFF -- specifies that autocorrelation weights not be row-averaged. ON -- specifies that row-averaged autocorrelation weights be used. The default behavior is ROWAVG=ON.","type":"standalone"},{"name":"NONE","description":"Suppresses all plots.","type":"standalone"},{"name":"OBSERVATIONS","aliases":["OBSERV","OBS"],"description":"[Syntax: OBSERVATIONS<(observations-plot-options)>] Produces the observed data plot. The OBSERVATIONS option has the following suboptions: GRADIENT specifies that observations be displayed as circles colored by the observed measurement. OUTLINE specifies that observations be displayed as circles with a border but with a completely transparent fill. OUTLINEGRADIENT is the same as OBSERVATIONS(GRADIENT) except that a border is shown around each observation. SHOWMISSING specifies that observations with missing values be displayed in addition to the observations with nonmissing values.","type":"standalone"},{"name":"PAIRS","description":"[Syntax: PAIRS<(pairs-plot-options)>] Specifies that the pairwise distances histogram be produced. The PAIRS option has the following suboptions: MIDPOINT specifies that the plot created with the PAIRS option display the lag class midpoint value on the horizontal axis, rather than the default lag class number. NOINSET specifies that the plot created with the PAIRS option be produced without the default inset that provides additional information about the pairs distribution. THRESHOLD=minimum pairs specifies that a reference line appear in the plot created with the PAIRS option to indicate the minimum pairs frequency of data pairs.","type":"standalone"},{"name":"SEMIVARIOGRAM","aliases":["SEMIVAR"],"description":"[Syntax: SEMIVARIOGRAM<(semivar-plot-options)>] Specifies that the empirical semivariogram plot be produced. You can specify the SEMIVAR option multiple times in the same PLOTS option to request instances of plots with the following semivar-plot-options: ALL | CLASSICAL | ROBUST ALL | CLA | ROB specifies a single type of empirical semivariogram (classical or robust) to plot, or specifies that all the available types be included in the same plot. The default is ALL. UNPACKPANEL | UNPACK specifies that paneled semivariogram plots be displayed separately. By default, plots appear in a panel, when appropriate.","type":"standalone"}]}]},{"name":"BY","description":"You can specify a BY statement with PROC VARIOGRAM to obtain separate analyses on observations in groups that are defined by the BY variables. When a BY statement appears, the procedure expects the input data set to be sorted in order of the BY variables. If you specify more than one BY statement, only the last one specified is used.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"COMPUTE","description":"The COMPUTE statement provides a number of options that control the computation of the semivariance, the robust semivariance, and the covariance.","help":"COMPUTE &lt;ALPHA=number&gt; &lt;ANGLETOLERANCE=angle tolerance&gt; &lt;AUTOCORRELATION &lt;(autocorrelation-options)&gt; Experimental&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Specifies a parameter to obtain the confidence level for constructing confidence limits in the classical empirical semivariance estimation. The value of number must be between 0 and 1, and the confidence level is 1-number. The default is ALPHA=0.05, which corresponds to the default confidence level of 95%.","help":"ALPHA=*number*","type":"value"},{"name":"ANGLETOLERANCE=","optional":true,"aliases":["ANGLETOL=","ATOL="],"description":"Specifies the tolerance, in degrees, around the angles determined by the NDIRECTIONS= specification.","type":"value"},{"name":"AUTOCORRELATION","optional":true,"aliases":["AUTOCORR","AUTOC"],"description":"specifies that autocorrelation statistics be calculated.","help":"AUTOCORRELATION&lt;(ASSUMPTION=NORMALITY | RANDOMIZATION&gt; &lt;STATISTICS=ALL | GEARY | MORAN&gt;&lt;WEIGHTS=BINARY&lt;(ROWAVERAGING)&gt; | DISTANCE&lt;(NORMALIZE | POWER=*number* | ROWAVERAGING | SCALE=*number*&gt;)&gt;","type":"standaloneOrValue","arguments":[{"name":"ASSUMPTION=","description":"specifies the type of autocorrelation assumption to use","help":"ASSUMPTION=NORMALITY | RANDOMIZATION","type":"choice","arguments":[{"name":"NORMALITY","aliases":["NORMAL","NOR"],"description":"specifies use of the normality assumption.","type":"standalone"},{"name":"RANDOMIZATION","aliases":["RANDOM","RAN"],"description":"specifies use of the randomization assumption.","type":"standalone"}]},{"name":"STATISTICS=","description":"specifies the autocorrelation statistics in detail.","help":"STATISTICS=ALL | GEARY | MORAN","type":"choice","arguments":[{"name":"ALL","description":"applies all available types of autoregression statistics.","type":"standalone"},{"name":"GEARY","aliases":["GEA"],"description":"specifies use of the Geary’s c statistics.","type":"standalone"},{"name":"MORAN","aliases":["MOR"],"description":"specifies use of the Moran’s I statistics.","type":"standalone"}]},{"name":"WEIGHTS=","description":"specifies the scheme used for the computation of the autocorrelation weights.","help":"WEIGHTS=BINARY&lt;(ROWAVERAGING)&gt; | DISTANCE&lt;(NORMALIZE | POWER=*number* | ROWAVERAGING | SCALE=*number*&gt;","type":"choice","arguments":[{"name":"BINARY","description":"specifies that binary weights be used.","help":"BINARY&lt;(ROWAVERAGING)&gt;","type":"standaloneOrValue","arguments":[{"name":"ROWAVERAGING","aliases":["ROWAVG","ROW"],"description":"specifies that asymmetric autocorrelation weights be assigned to data pairs.","type":"standalone"}]},{"name":"DISTANCE","description":"specifies that autocorrelation weights be assigned based on the point pair distances.","help":"DISTANCE&lt;(NORMALIZE | POWER=*number* | ROWAVERAGING | SCALE=*number*&gt;","type":"standaloneOrValue","arguments":[{"name":"NORMALIZE","aliases":["NORMAL","NOR"],"description":"specifies that normalized pair distances be used in the distance-based weights expression.","type":"standalone"},{"name":"POWER=","aliases":["POW"],"description":"specifies the power to which the pair distance is raised in the distance-based weights expression.","help":"POWER=*number*","type":"value"},{"name":"ROWAVERAGING","aliases":["ROWAVG","ROW"],"description":"specifies that asymmetric autocorrelation weights be assigned to data pairs.","type":"standalone"},{"name":"SCALE=","aliases":["SCA"],"description":"specifies the scaling factor in the distance-based weights expression.","help":"SCALE=*number*","type":"value"}]}]}]},{"name":"BANDWIDTH=","optional":true,"aliases":["BANDW="],"description":"Specifies the bandwidth, or perpendicular distance cutoff for determining the angle class for a given pair of points.","type":"value"},{"name":"CL","optional":true,"description":"Requests confidence limits for the classical semivariance estimate.","type":"standalone"},{"name":"DEPSILON=","optional":true,"aliases":["DEPS="],"description":"Specifies the distance value for declaring that two distinct points are zero distance apart. Such pairs, if they occur, cause numeric problems.","type":"value"},{"name":"LAGDISTANCE=","optional":true,"aliases":["LAGDIST=","LAGD="],"description":"Specifies the basic distance unit defining the lags. For example, a specification of LAGDISTANCE=x results in lag distance classes that are multiples of x.","type":"value"},{"name":"LAGTOLERANCE=","optional":true,"aliases":["LAGTOL=","LAGT="],"description":"Specifies the tolerance around the LAGDISTANCE= value for grouping distance pairs into lag classes.","type":"value"},{"name":"MAXLAGS=","optional":true,"aliases":["MAXLAG=","MAXL="],"description":"Specifies the maximum number of lag classes used in constructing the continuity measures.","type":"value"},{"name":"NDIRECTIONS=","optional":true,"aliases":["NDIR=","ND="],"description":"Specifies the number of angle classes to use in computing the continuity measures.","type":"value"},{"name":"NHCLASSES=","optional":true,"aliases":["NHCLASS=","NHC="],"description":"Specifies the number of distance classes to consider in the spatial domain in the exploratory stage of the empirical semivariogram computation.","type":"value"},{"name":"NOVARIOGRAM","optional":true,"description":"Prevents the computation of the continuity measures. This option is useful for preliminary analysis, or when you require only the OUTDISTANCE= or OUTPAIR= data sets.","type":"standalone"},{"name":"OUTPDISTANCE=","optional":true,"aliases":["OUTPDIST=","OUTPD="],"description":"Specifies the cutoff distance for writing observations to the OUTPAIR= data set.","type":"value"},{"name":"ROBUST","optional":true,"description":"Requests that a robust version of the semivariance be calculated in addition to the classical semivariance.","type":"standalone"}]},{"name":"COORDINATES","description":"Only one COORDINATES statement is allowed, and it is applied to all PREDICT statements. In other words, it is assumed that all the VAR= variables in all PREDICT statements have the same x and y coordinates.","help":"COORDINATES &lt;XCOORD= (variable-name)&gt; &lt;YCOORD= (variable-name)&gt; ","arguments":[{"name":"XCOORD=","optional":true,"aliases":["XC=","X="],"description":"Specifies the name of the variable containing the x coordinate of the data in the DATA= data set.","type":"value"},{"name":"YCOORD=","optional":true,"aliases":["YC=","Y="],"description":"Specifies the name of the variable containing the y coordinate of the data in the DATA= data set.","type":"value"}]},{"name":"DIRECTIONS","description":"You use the DIRECTIONS statement to define angle classes. You can specify angle classes as a list of angles, separated by commas, with optional angle tolerances and bandwidths within parentheses following the angle. You must specify at least one angle. If you do not specify the optional angle tolerance, the default value of 45° is used. If you do not specify the optional bandwidth, no bandwidth is checked. If you specify a bandwidth, you must also specify an angle tolerance.","help":"DIRECTIONS directions-list "},{"name":"ID","description":"The ID statement specifies which variable to include for identification of the observations in the OUTPAIR= and the OUTACWEIGHTS= output data sets. The ID statement variable is also used for the labels and tool tips in the OBSERVATIONS plot. In the VARIOGRAM procedure you can specify only one ID variable in the ID statement. If no ID statement is given, then PROC VARIOGRAM uses the observation number in the data sets and the OBSERVATIONS plot.","help":"ID variable "},{"name":"MODEL","description":"You specify the MODEL statement if you want to fit a theoretical semivariogram model to the empirical semivariogram data that are produced in the COMPUTE statement. You must have nonmissing empirical semivariogram estimates at a minimum of three lags to perform model fitting. You can choose to perform a fully automated fitting or to fit one model with specific forms. In the first case you simply specify a list of forms or no forms at all. All suitable combinations are tested, and the result is the model that produces the best fit according to specified criteria. In the second case you specify one theoretical semivariogram model, and you have more control over its parameters for the fitting process.","help":"MODEL ALPHA=number CHOOSE=AIC|SSE|STATUS  CL ...","arguments":[{"name":"ALPHA=","description":"Requests that a t-type confidence interval be constructed for each of the fitting parameters with confidence level 1-number. The value of number must be in ; the default is 0.05 which corresponds to the default confidence level of 95%. If the CL option of the MODEL statement is not specified, then ALPHA= is ignored.","help":"ALPHA=*number*","type":"value"},{"name":"CHOOSE=","description":"Specifies that if the fitting task has more than one model to fit, then PROC VARIOGRAM ranks the fitted models and chooses the optimally fit model according to one or more available criteria.","help":"CHOOSE=AIC | SSE | STATUS","type":"choice","arguments":[{"name":"AIC","description":"Specifies Akaike’s information criterion.","type":"standalone"},{"name":"SSE","description":"Specifies the weighted sum of squares error for each fitted model when METHOD=WLS, and the residual sum of squares error for each fitted model when METHOD=OLS.","type":"standalone"},{"name":"STATUS","description":"Classifies models based on their fitting process convergence status. CHOOSE=STATUS places on top models for which the fitting process is successful.","type":"standalone"}]},{"name":"CL","description":"Requests that t-type confidence limits be constructed for each of the fitting parametersestimates. The confidence level is 0.95 by default; this can be changed with the ALPHA= option of the MODEL statement.","type":"standalone"},{"name":"EQUIVTOL=","aliases":["ETOL="],"description":"Specifies a positive upper value tolerance to use when categorizing multiple models in classes of equivalence. For this categorization, the VARIOGRAM procedure computes the sum of absolute differences of semivariances for pairs of consecutively ranked models. If the sum is lower than the EQUIVTOL= value for any such model pair, then these two models are deemed to be equivalent. As a result, the EQUIVTOL= option can affect the number and size of classes of equivalence in the fit summary table. Smaller values of the EQUIVTOL= parameter result in a more strict model comparison and can lead to a higher number of classes of equivalence.","help":"EQUIVTOL=*etol-value*","type":"value"},{"name":"FORM=","description":"Specifies the functional form (type) of the semivariogram model. The supported structures are two-parameter models that use the sill and range as parameters. The Matérn model is an exception that makes use of a third smoothing parameter .","type":"value"},{"name":"CORRB","optional":true,"followsDelimiter":"/","description":"Requests the approximate correlation matrix for the parameter estimates of the model fitting. The CORRB option is ignored when you also specify the DETAILS=ALL option.","type":"standalone"},{"name":"COVB","optional":true,"followsDelimiter":"/","description":"Requests the approximate covariance matrix for the parameter estimates of the model fitting. The COVB option is ignored when you also specify the DETAILS=ALL option.","type":"standalone"},{"name":"DETAILS=","optional":true,"followsDelimiter":"/","description":"Requests different levels of output to be produced during the fitting process.","help":"DETAILS=MOD | ITR | ALL","type":"choice","arguments":[{"name":"MOD","followsDelimiter":"/","description":"Specifies that the default output for all candidate models be produced when the FORM=AUTO option is specified in the MODEL statement. If you fit only one explicit model, then the DETAILS=MOD option has no effect and is ignored.","type":"standalone"},{"name":"ITR","followsDelimiter":"/","description":"Requests that a complete iteration history be produced in addition to the default output. The output for DETAILS=ITR includes the current values of the parameter estimates, their gradients, and additional optimization statistics.","type":"standalone"},{"name":"ALL","followsDelimiter":"/","description":"Requests the most detailed level of output when fitting a model. Specifically, except for the default output, the DETAILS=ALL option produces optimization statistics in addition to the combined output of the DETAILS=ITR, COVB, and CORRB options.","type":"standalone"}]},{"name":"FIT=","optional":true,"followsDelimiter":"/","description":"Specifies which type of empirical semivariogram to fit.","help":"FIT=CLASSICAL | ROBUST","type":"choice","arguments":[{"name":"CLASSICAL","followsDelimiter":"/","aliases":["CLA"],"description":"Fits a model for the classical empirical semivariance.","type":"standalone"},{"name":"ROBUST","followsDelimiter":"/","aliases":["ROB"],"description":"Fits a model for the robust empirical semivariance. This option can be used only when the ROBUST option is specified in the COMPUTE statement.","type":"standalone"}]},{"name":"GRADIENT","optional":true,"followsDelimiter":"/","description":"Displays the gradient of the objective function with respect to the parameter estimates in the \"Parameter Estimates\" table.","type":"standalone"},{"name":"MTOGTOL=","optional":true,"followsDelimiter":"/","aliases":["MTOL="],"description":"Specifies the threshold value above which a Matérn form in a model switches to the Gaussian form. The number value must be positive. By default, if the fitting process progressively increases the Matérn smoothness parameter v without converging to a smoothness estimate, then the VARIOGRAM procedure converts the Matérn form into a Gaussian form when smoothness exceeds the default value 10,000.","help":"MTOGTOL=*number*","type":"value"},{"name":"NOFIT","optional":true,"followsDelimiter":"/","description":"Suppresses the model fitting process.","type":"standalone"},{"name":"NOITPRINT","optional":true,"followsDelimiter":"/","description":"Suppresses the display of the iteration history table when you have also specified the DETAILS=ITR or DETAILS=ALL option in the MODEL statement. Otherwise, the NOITPRINT option is ignored.","type":"standalone"}]},{"name":"NLOPTIONS","description":"By default, PROC VARIOGRAM uses the technique TECH=NRRIDG, which corresponds to Newton-Raphson optimization with ridging. The NLOPTIONS statement provides you with syntax to control aspects of the nonlinear optimizations.","help":"NLOPTIONS &lt;ABSCONV= | ABSTOL=r&gt; &lt;ABSFCONV=r &lt;n&gt; | ABSFTOL=r&lt;n&gt;&gt; &lt;ABSGCONV= | ABSGTOL=r &lt;n&gt;&gt; ...","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function convergence criterion.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. Termination requires the maximum absolute gradient element to be small.","type":"value"},{"name":"ABSXCONV=","optional":true,"aliases":["ABSXTOL="],"description":"Specifies the absolute parameter convergence criterion. Termination requires a small Euclidean distance between successive parameter vectors.","type":"value"},{"name":"ASINGULAR=","optional":true,"aliases":["ASING="],"description":"Specifies an absolute singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"DAMPSTEP=","optional":true,"aliases":["DS="],"description":"Specifies that the initial step-size value aⁿ (where n=0) for each line search (used by the QUANEW, CONGRA, or NEWRAP technique) cannot be larger than r times the step-size value used in the former iteration.","type":"value"},{"name":"FCONV2=","optional":true,"aliases":["FTOL2="],"description":"Specifies a second function convergence criterion.","type":"value"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies the relative function convergence criterion.","type":"value"},{"name":"FSIZE=","optional":true,"description":"Specifies the FSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"FSIZE=*r*","type":"value"},{"name":"GCONV2=","optional":true,"description":"Specifies another relative gradient convergence criterion.","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies the relative gradient convergence criterion.","type":"value"},{"name":"HESCAL=","optional":true,"aliases":["HS="],"description":"Specifies the scaling version of the Hessian or crossproduct Jacobian matrix used in NRRIDG, TRUREG, LEVMAR, NEWRAP, or DBLDOG optimization.","help":"HESCAL=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","description":"Specifies that no scaling is done.","type":"standalone"},{"name":"1","description":"Specifies the Moré (1978) scaling update","type":"standalone"},{"name":"2","description":"Specifies the Dennis, Gay, and Welsch (1981) scaling update","type":"standalone"},{"name":"3","description":"Specifies that di is reset in each iteration","type":"standalone"}]},{"name":"INHESSIAN=","optional":true,"description":"Specifies how the initial estimate of the approximate Hessian is defined for the quasi-Newton techniques QUANEW and DBLDOG.","type":"value"},{"name":"INSTEP=","optional":true,"aliases":["SALPHA=","RADIUS="],"description":"Reduces the length of the first trial step during the line search of the first iterations.","help":"INSTEP=*r*","type":"value"},{"name":"LCDEACT=","optional":true,"aliases":["LCD="],"description":"Specifies a threshold r for the Lagrange multiplier that decides whether an active inequality constraint remains active or can be deactivated.","type":"value"},{"name":"LCEPSILON=","optional":true,"aliases":["LCEPS=","LCE="],"description":"Specifies the range r, r ≥ 0, for active and violated boundary and linear constraints.","type":"value"},{"name":"LCSINGULAR=","optional":true,"aliases":["LCSING=","LCS="],"description":"Specifies a criterion r, r ≥ 0, used in the update of the QR decomposition that decides whether an active constraint is linearly dependent on a set of other active constraints.","type":"value"},{"name":"LINESEARCH=","optional":true,"aliases":["LIS=","SMETHOD=","SM="],"description":"Specifies the line-search method for the CONGRA, QUANEW, and NEWRAP optimization techniques.","help":"LINESEARCH=1 | 2 | 3 | 4 | 5 | 6 | 7 | 8","type":"choice","arguments":[{"name":"1","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is similar to one used by the Harwell subroutine library.","type":"standalone"},{"name":"2","description":"Specifies a line-search method that needs more function calls than gradient calls for quadratic and cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"3","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"4","description":"Specifies a line-search method that needs the same number of function and gradient calls for stepwise extrapolation and cubic interpolation","type":"standalone"},{"name":"5","description":"Specifies a line-search method that is a modified version of LIS=4.","type":"standalone"},{"name":"6","description":"Specifies golden section line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"7","description":"Specifies bisection line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"8","description":"Specifies Armijo line-search technique (Polak 1971), which uses only function values for linear approximation.","type":"standalone"}]},{"name":"LSPRECISION=","optional":true,"aliases":["LSP=","SPRECISION=","SP="],"description":"Specifies the degree of accuracy that should be obtained by the line-search algorithms LIS=2 and LIS=3. The default LSPRECISION= values are:","type":"value"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Requires the number of function calls to be no larger than i. The default values are:","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Requires the number of iterations to be no larger than i. The default values are: o For TECH= LEVMAR, NEWRAP, NRRIDG, TRUREG: i=50 o For TECH= DBLDOG, QUANEW: i=200 o For TECH= CONGRA: i=400","type":"value"},{"name":"MAXSTEP=","optional":true,"description":"Specifies an upper bound for the step length of the line-search algorithms during the first n iterations.","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Requires the CPU time to be no larger than r. The default value of the MAXTIME= option is the largest double floating-point number on your computer.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0.","type":"value"},{"name":"MSINGULAR=","optional":true,"aliases":["MSING="],"description":"Specifies a relative singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses output related to optimization such as the iteration history.","type":"standalone"},{"name":"PALL","optional":true,"aliases":["ALL"],"description":"[Displays information about the starting values and final values of the optimization process.","type":"standalone"},{"name":"PHISTORY","optional":true,"aliases":["PHIS"],"description":"Displays the optimization history. The PHISTORY option is set automatically if the PALL or PRINT option is set.","type":"standalone"},{"name":"RESTART=","optional":true,"aliases":["REST="],"description":"Specifies that the QUANEW or CONGRA algorithm is restarted with a steepest descent/ascent search direction after at most i iterations, i > 0.","type":"value"},{"name":"SINGULAR=","optional":true,"description":"Specifies the singularity criterion r, 0 < r < 1, used, for example, for matrix inversion.","type":"value"},{"name":"SOCKET=","optional":true,"description":"Specifies the fileref that contains the information needed for remote monitoring.","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH=","OMETHOD=","OM="],"description":"Specifies the optimization technique.","help":"TECHNIQUE=CONGRA | DBLDOG | LEVMAR | NEWRAP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Chooses one of four different conjugate-gradient optimization algorithms, which can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization, which uses the gradient to update an approximation of the Cholesky factor of the Hessian.","type":"standalone"},{"name":"LEVMAR","description":"Performs a highly stable but, for large problems, memory- and time-consuming Levenberg-Marquardt optimization technique, a slightly improved variant of the Moré (1978) implementation. This is the default optimization technique if there are fewer than 40 parameters to estimate.","type":"standalone"},{"name":"NEWRAP","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. The algorithm combines a line-search algorithm with ridging, and it can be modified with the LINESEARCH= option.","type":"standalone"},{"name":"NRRIDG","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. This algorithm does not perform a line search.","type":"standalone"},{"name":"QUANEW","description":"Chooses one of four different quasi-Newton optimization algorithms that can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"TRUREG","description":"Performs a usually very stable but, for large problems, memory- and time-consuming trust-region optimization technique. The algorithm is implemented similar to Gay (1983) and Moré and Sorensen (1983).","type":"standalone"},{"name":"NONE","description":"Does not perform any optimization. This option is similar to METHOD=NONE, but TECH=NONE also computes and displays residuals and goodness of fit statistics.","type":"standalone"}]},{"name":"UPDATE=","optional":true,"description":"Specifies the update method for the quasi-Newton, double-dogleg, or conjugate-gradient optimization technique.","help":"UPDATE=BFGS | DBFGS | DDFP | DFP | PB | FR | PR | CD","type":"choice","arguments":[{"name":"BFGS","description":"Performs the original Broyden, Fletcher, Goldfarb, and Shanno (BFGS) update of the inverse Hessian matrix.","type":"standalone"},{"name":"DBFGS","description":"Performs the dual BFGS update of the Cholesky factor of the Hessian matrix. This is the default update method.","type":"standalone"},{"name":"DDFP","description":"Performs the dual Davidon, Fletcher, and Powell (DFP) update of the Cholesky factor of the Hessian matrix.","type":"standalone"},{"name":"DFP","description":"Performs the original DFP update of the inverse Hessian matrix.","type":"standalone"},{"name":"PB","description":"Performs the automatic restart update method of Powell (1977) and Beale (1972).","type":"standalone"},{"name":"FR","description":"Performs the Fletcher-Reeves update (Fletcher 1987).","type":"standalone"},{"name":"PR","description":"Performs the Polak-Ribiere update (Fletcher 1987).","type":"standalone"},{"name":"CD","description":"Performs a conjugate-descent update of Fletcher (1987).","type":"standalone"}]},{"name":"VERSION=","optional":true,"aliases":["VS="],"description":"Specifies the version of the quasi-Newton optimization technique with nonlinear constraints.","help":"VERSION=1 | 2","type":"choice","arguments":[{"name":"1","description":"Specifies the update of the U vector as in Powell (1978a, 1978b) (update like VF02AD).","type":"standalone"},{"name":"2","description":"Specifies the update of the U vector as in Powell (1982a, 1982b) (update like VMCWD).","type":"standalone"}]},{"name":"VSINGULAR=","optional":true,"aliases":["VSING="],"description":"Specifies a relative singularity criterion r, r > 0, for the inversion of the information matrix, which is needed to compute the covariance matrix.","type":"value"},{"name":"XCONV=","optional":true,"aliases":["XTOL="],"description":"Specifies the relative parameter convergence criterion. Termination requires a small relative parameter change in subsequent iterations.","type":"value"},{"name":"XSIZE=","optional":true,"description":"Specifies the XSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"XSIZE=*r*","type":"value"}]},{"name":"PARMS","description":"The PARMS statement specifies initial values for the semivariance parameters of a single specified model in the MODEL statement. Alternatively, the PARMS statement can request a grid search over several values of these parameters. You must specify the values by starting with the nugget effect parameter. You continue in the order in which semivariogram forms are specified in the FORM= option of the MODEL statement by specifying for each structure the values for its scale, range, and any other parameters as applicable. The PARMS statement is optional and must follow the associated MODEL statement. The value-list specification can take any of several forms: m a single value m1,m2,...,mn several values m to n a sequence in which m equals the starting value, n equals the ending value, and the increment equals 1 m to n by i a sequence in which m equals the starting value, n equals the ending value, and the increment equals i m1,m2 to m3 mixed values and sequences You can use the PARMS statement to input fixed values for parameters and also initial values that you want to optimize.","help":"PARMS &lt;HOLD=value-list&gt; &lt;LOWERB=value-list&gt; &lt;MAXSCALE=maxscale&gt; ...","arguments":[{"name":"HOLD=","optional":true,"followsDelimiter":"/","aliases":["EQCONS="],"description":"Specifies which parameter values be constrained to equal the specified values.","help":"HOLD=*value-list*","type":"value"},{"name":"LOWERB=","optional":true,"followsDelimiter":"/","description":"Specifies lower boundary constraints on the semivariance parameters. The value-list specification is a list of numbers or missing values (.) separated by commas. You must list the numbers in the order that PROC VARIOGRAM uses for the semivariance parameters, and each number corresponds to the lower boundary constraint. A missing value instructs PROC VARIOGRAM to use its default constraint.","help":"LOWERB=*value-list*","type":"value"},{"name":"MAXSCALE=","optional":true,"followsDelimiter":"/","description":"Specifies a positive upper threshold for the fitted semivariogram sill. This option imposes a linear constraint on the optimization of the nonfixed semivariogram scale and nugget parameters so that the sum of all scale and nugget parameters does not exceed the specified MAXSCALE= value. The MAXSCALE= constraint is ignored if all the semivariogram scale and nugget parameters are fixed.","help":"MAXSCALE=*maxscale*","type":"value"},{"name":"NOBOUND","optional":true,"followsDelimiter":"/","description":"Requests the removal of boundary constraints on semivariance parameters. For example, semivariance parameters have a default zero lower boundary constraint since they have a physical meaning only for positive values. The NOBOUND option enables the fitting process to derive negative estimates; hence, you need to be cautious with the outcome when you specify this option.","type":"standalone"},{"name":"PARMSDATA=","optional":true,"followsDelimiter":"/","aliases":["PDATA="],"description":"Specifies that semivariance parameters values be read from a SAS data set. The data set should contain the values in the sequence required by the PARMS statement in either of the following two ways: o Specify one single column under the variable Estimate (or Est) that contains all the parameter values.","help":"PARMSDATA=*SAS-data-set*","type":"dataSet"},{"name":"UPPERB=","optional":true,"followsDelimiter":"/","description":"Specifies upper boundary constraints on the semivariance parameters. The value-list specification is a list of numbers or missing values (.) separated by commas. You must list the numbers in the order that PROC VARIOGRAM uses for the semivariance parameters, and each number corresponds to the upper boundary constraint. A missing value instructs PROC VARIOGRAM to use its default constraint.","help":"UPPERB=*value-list*","type":"value"}]},{"name":"STORE","aliases":["ITEMSTORE"],"description":"The STORE statement requests that the procedure save the context and results of the semivariogram model fitting analysis in an item store. An item store is a binary file defined by the SAS System. You cannot modify the contents of an item store. The contents of item stores produced by PROC VARIOGRAM can be processed only with the KRIGE2D or the SIM2D procedure. After you save results in an item store, you can use them at a later time without having to fit the model again.","help":"STORE &lt;LABEL=store-label&gt; OUT=store-name ","arguments":[{"name":"OUT=","description":"The store-name is a usual one- or two-level SAS name, as for SAS data sets. If you specify a one-level name, then the item store resides in the Work library and is deleted at the end of the SAS session. Since item stores are often used for postprocessing tasks, typical usage specifies a two-level name of the form","help":"OUT=*store-name*","type":"value"},{"name":"LABEL=","optional":true,"followsDelimiter":"/","description":"Specifies a custom label for the item store that is produced by PROC VARIOGRAM. When another procedure processes an item store, the label appears in the procedure’s output along with other identifying information.","help":"LABEL=*store-label*","type":"value"}]},{"name":"VAR","aliases":["VARIABLE"],"description":"Use the VAR statement to specify the analysis variables. You can specify only numeric variables. If you do not specify a VAR statement, all numeric variables in the DATA= data set that are not in the COORDINATES statement are used.","help":"VAR analysis-variables-list "}],"supportSiteInformation":{"docsetId":"statug","docsetVersion":"v_033","docsetTargetFile":"statug_variogram_toc.htm"}}