{"name":"VARIMPUTE","statements":[{"name":"PROC VARIMPUTE","description":"The VARIMPUTE procedure executes high-performance numeric variable imputation. Imputation is a common step in data preparation. The VARIMPUTE procedure takes only numeric variables. † The VARIMPUTE procedure can replace numeric missing values with a specified value. It can also replace numeric missing values with the mean, median, or some random value between the minimum value and the maximum value of the nonmissing values. † When PROC VARIMPUTE calculates the mean, median, or a random value, it ignores any observation that has a FREQ variable whose value is less than or equal to 0.","help":"PROC VARIMPUTE <DATA=CAS-libref.data-table> <NTHREADS=number-of-threads> <SEED=random-seed>;     \n\tCODE <FILE= filename> ;\n    \n\tFREQ variable ;\n    \n\tINPUT <CONTINUOUSTECH=<MEAN | MEDIAN | RANDOM>... > ;\n    \n\tOUTPUT <COPYVAR=variable |COPYVARS=(variables)> <OUT=CAS-libref.data-table> ;\n","arguments":[{"name":"DATA=","optional":true,"description":"Names the input data table for PROC VARIMPUTE to use. The default is the most recently created data table. CAS-libref.data-table is a two-level name, where","help":"DATA=*CAS-libref.data-table*","type":"dataSet"},{"name":"NTHREADS=","optional":true,"description":"specifies the number of threads to be used. The default is the CPU count on each node.","help":"NTHREADS=*number-of-threads*","type":"value"},{"name":"SEED=","optional":true,"description":"Specifies an integer that is used to start the pseudorandom number generator. If you do not specify a seed or you specify a value less than or equal to 0, the seed is generated from reading the time of day from the computer’s clock. The SEED option enables you to reproduce the same sample output.","help":"SEED=*random-seed*","type":"value"}]},{"name":"CODE","description":"The CODE statement generates SAS DATA step code that mimics the computations that are performed. Only one CODE statement is processed. If you specify multiple CODE statements, only the first one is used. You can specify the following option: FILE=filename specifies the name of the file to write the SAS score code to.","help":"CODE &lt;FILE= filename&gt; ","arguments":[{"name":"FILE=","optional":true,"description":"Specifies the filename of the file to write the SAS score code to.","type":"value"}]},{"name":"FREQ","description":"The variable in the FREQ statement identifies a numeric variable in the data set that contains the frequency of occurrence of each observation. PROC VARIMPUTE treats each observation as if it appears f times, where f is the value of the FREQ variable for the observation. If f is not an integer, it is truncated to an integer. If f is less than 1 or missing, the observation is not used in the analysis. When the FREQ statement is not specified, each observation is assigned a frequency of 1.","help":"FREQ variable "},{"name":"INPUT","description":"The INPUT statement names one or more input variables and specifies the method that is used to impute missing values.","help":"INPUT &lt;CONTINUOUSTECH=&lt;MEAN | MEDIAN | RANDOM&gt;... &gt; ","arguments":[{"name":"CONTINUOUSTECH=","optional":true,"followsDelimiter":"/","aliases":["CTECH="],"description":"Specifies the imputation method. You can choose from the following methods:","help":"CONTINUOUSTECH=MEAN | MEDIAN | RANDOM | VALUE","type":"choice","arguments":[{"name":"MEAN","followsDelimiter":"/","description":"Specifies that missing values of each variable are replaced by the algebraic mean of the nonmissing values of that variable.","type":"standalone"},{"name":"MEDIAN","followsDelimiter":"/","description":"Specifies that missing values of each variable are replaced by the algebraic median of the nonmissing values of that variable.","type":"standalone"},{"name":"RANDOM","followsDelimiter":"/","description":"Specifies that missing values of each variable are replaced by a random value that is drawn between the minimum value and the maximum values of the nonmissing values of that variable.","type":"standalone"},{"name":"VALUE","followsDelimiter":"/","description":"Syntax: VALUE CVALUES=double-list Specifies that missing values are replaced by the values in double-list, where double-list indicates a list of numbers where the data type is double.","type":"standalone"}]}]},{"name":"OUTPUT","description":"The OUTPUT statement creates an output data table to contain the results of PROC VARIMPUTE.","help":"OUTPUT &lt;COPYVAR=variable |COPYVARS=(variables)&gt; &lt;OUT=CAS-libref.data-table&gt; ","arguments":[{"name":"COPYVAR=","optional":true,"aliases":["COPYVARS="],"description":"Lists one or more variables from the input data table to be transferred to the output data table.","type":"value"},{"name":"OUT=","optional":true,"description":"Names the output data table for PROC VARIMPUTE to use. CAS-libref.data-table is a two-level name, where","help":"OUT=*CAS-libref.data-table*","type":"dataSet"}]}],"supportSiteInformation":{"docsetId":"casstat","docsetVersion":"latest","docsetTargetFile":"casstat_varimpute_toc.htm"}}