{"name":"VARMAX","statements":[{"name":"PROC VARMAX","description":"Given a multivariate time series, the VARMAX procedure estimates the model parameters and generates forecasts associated with vector autoregressive moving-average processes with exogenous regressors (VARMAX) models. Often, economic or financial variables are not only contemporaneously correlated to each other, they are also correlated to each other’s past values. The VARMAX procedure can be used to model these types of time relationships. In many economic and financial applications, the variables of interest (dependent, response, or endogenous variables) are influenced by variables external to the system under consideration (independent, input, predictor, regressor, or exogenous variables). The VARMAX procedure enables you to model the dynamic relationship both between the dependent variables and also between the dependent and independent variables.","help":"PROC VARMAX <COVOUT> <DATA=SAS-data-set> <OUTCOV> <OUTEST=SAS-data-set> <OUTSTAT=SAS-data-set> <PLOTS=ALL | FORECASTS<(forecasts-plot-options)> | IMPULSE<(impulse-plot-options)>... >;     \n\tBY <DESCENDING> <NOTSORTED> ;\n    \n\tCAUSAL <GROUP1=(variables)> <GROUP2=(variables)> ;\n    \n\tCOINTEG <EXOGENEITY> <H=(matrix)> <J=(matrix)> ...;\n    \n\tGARCH <FORM=<BEKK | CCC>> <OUTHT=SAS-data-set> <P=number | P=(number-list)> ...;\n    \n\tID <ALIGN=<BEGINNING | MIDDLE | ENDING>> <INTERVAL=<DAY | HOUR | MINUTE>... > ;\n    \n\tMODEL <CENTER> <DIF(variable (number-list) <... variable (number-list)>)> <DIFX(number-list) | DIFX=(number-list)> ...;\n    \n\tNLOPTIONS <ABSCONV= | ABSTOL=r> <ABSFCONV=r[n] | ABSFTOL=r[n> <ABSGCONV=r[n] | ABSGTOL=r[n> ...;\n    \n\tOUTPUT <ALPHA=number> <BACK=number> <LEAD=number> ...;\n    \n\tRESTRICT <AR(l,i,j)=> <CONST(i)=> <MA(l,i,j)=> ...;\n    \n\tTEST <AR(l,i,j)=> <CONST(i)=> <MA(l,i,j)=> ...;\n","arguments":[{"name":"COVOUT","optional":true,"description":"Writes the covariance matrix for the parameter estimates to the OUTEST= data set. This option is valid only if the OUTEST= option is specified.","type":"standalone"},{"name":"DATA=","optional":true,"description":"Specifies the input SAS data set. If the DATA= option is not specified, the PROC VARMAX statement uses the most recently created SAS data set.","help":"DATA=*SAS-data-set*","type":"dataSet"},{"name":"OUTCOV","optional":true,"description":"Writes the covariance matrix for the parameter estimates to the OUTEST= data set. This option is valid only if the OUTEST= option is specified.","type":"standalone"},{"name":"OUTEST=","optional":true,"description":"Writes the parameter estimates to the output data set.","help":"OUTEST=*SAS-data-set*","type":"dataSet"},{"name":"OUTSTAT=","optional":true,"description":"Writes residual diagnostic results to an output data set. If the COINTTEST=(JOHANSEN) option is specified, the results of this option are also written to the output data set.","help":"OUTSTAT=*SAS-data-set*","type":"dataSet"},{"name":"PLOTS=","optional":true,"description":"Syntax: PLOTS<(global-plot-option)> = plot-request-option <(options)> | PLOTS<(global-plot-option)> = ( plot-request-option <(options)> ... plot-request-option <(options)> ) Controls the plots produced through ODS Graphics. When you specify only one plot, you can omit the parentheses around the plot request. The global-plot-option applies to the impulse and prediction error analysis plots generated by the VARMAX procedure. The following global-plot-option is available:","help":"PLOTS=ALL | FORECASTS&lt;(forecasts-plot-options)&gt; | IMPULSE&lt;(impulse-plot-options)&gt; | MODEL | NONE | RESIDUAL&lt;(residual-plot-options)&gt;","type":"choice","arguments":[{"name":"ALL","description":"Produces all plots appropriate for the particular analysis.","type":"standalone"},{"name":"FORECASTS","description":"Produces plots of the forecasts. The forecasts-only plot that shows the multistep forecasts in the forecast region is produced by default. The following forecasts-plot-options are available: ALL produces the FORECASTSONLY and the FORECASTS plots. This is the default. FORECASTS produces a plot that shows the one-step-ahead as well as the multistep forecasts. FORECASTSONLY produces a plot that shows only the multistep forecasts.","help":"FORECASTS&lt;(forecasts-plot-options)&gt;","type":"standalone"},{"name":"IMPULSE","description":"Produces the plots of impulse response function and the impulse response of the transfer function. The following impulse-plot-options are available: ALL produces all impulse plots. This is the default. ACCUM produces the accumulated impulse plot. ORTH produces the orthogonalized impulse plot. SIMPLE produces the simple impulse plot.","help":"IMPULSE&lt;(impulse-plot-options)&gt;","type":"standalone"},{"name":"MODEL","description":"Produces plots of dependent variables listed in the MODEL statement and plots of the one-step-ahead predicted values for each dependent variables.","type":"standalone"},{"name":"NONE","description":"Produces prediction error plot.","type":"standalone"},{"name":"RESIDUAL","description":"Produces plots associated with the prediction errors obtained after modeling the data. The following residual-plot-options are available: ALL produces all plots associated with the analysis of the prediction errors. This is the default. RESIDUAL produces prediction error plot. DIAGNOSTICS produces a panel of plots useful in assessing the autocorrelations and white-noise of the prediction errors. The panel consists of the following: o the autocorrelation plot of the prediction errors o the partial autocorrelation plot of the prediction errors o the inverse autocorrelation plot of the prediction errors o the log scaled white noise plot of the prediction errors NORMAL produces a panel of plots useful in assessing normality of the prediction errors. The panel consists of the following: o distribution of the prediction errors with overlaid the normal curve o normal quantile plot of the prediction errors","help":"RESIDUAL&lt;(residual-plot-options)&gt;","type":"standalone"}]}]},{"name":"BY","description":"A BY statement can be used with PROC VARMAX to obtain separate analyses on observations in groups defined by the BY variables.","help":"BY &lt;DESCENDING&gt; &lt;NOTSORTED&gt; ","arguments":[{"name":"DESCENDING","optional":true,"description":"Specifies that the observations are sorted in descending order by the variable that immediately follows the word DESCENDING in the BY statement.","type":"standalone"},{"name":"NOTSORTED","optional":true,"description":"Specifies that observations are not necessarily sorted in alphabetic or numeric order.","type":"standalone"}]},{"name":"CAUSAL","description":"A CAUSAL statement prints the Granger causality test by fitting the VAR(p) model by using all variables defined in GROUP1 and GROUP2. Any number of CAUSAL statements can be specified. The CAUSAL statement proceeds with the MODEL statement and uses the variables and the autoregressive order, p, specified in the MODEL statement. Variables in the GROUP1= and GROUP2= options should be defined in the MODEL statement.If the P=0 option is specified in the MODEL statement, the CAUSAL statement is not applicable.","help":"CAUSAL &lt;GROUP1=(variables)&gt; &lt;GROUP2=(variables)&gt; ","arguments":[{"name":"GROUP1=","optional":true,"description":"GROUP1 variables defined in the MODEL statement.","type":"value"},{"name":"GROUP2=","optional":true,"description":"GROUP2 variables defined in the MODEL statement.","type":"value"}]},{"name":"COINTEG","description":"The COINTEG statement fits the vector error correction model to the data, tests the restrictions of the long-run parameters and the adjustment parameters, and tests for the weak exogeneity in the long-run parameters. The cointegrated system uses the maximum likelihood analysis proposed by Johansen and Juselius (1990) and Johansen (1995a, 1995b). Only one COINTEG statement is allowed.","help":"COINTEG &lt;EXOGENEITY&gt; &lt;H=(matrix)&gt; &lt;J=(matrix)&gt; ...","arguments":[{"name":"EXOGENEITY","optional":true,"description":"Formulates the likelihood ratio tests for testing weak exogeneity in the long-run parameters. The null hypothesis is that one variable is weakly exogenous for the others.","type":"standalone"},{"name":"H=","optional":true,"description":"Specifies the restrictions H on the k x r or (k+1) x r cointegrated coefficient matrix β such that β = H(Φ), where H is known and Φ is unknown.","type":"value"},{"name":"J=","optional":true,"description":"Specifies the restrictions J on the k x r adjustment matrix α such that α=J(ψ), where J is known and ψ is unknown.","type":"value"},{"name":"NORMALIZE=","optional":true,"description":"Specifies a single dependent (endogenous) variable name whose cointegrating vectors are normalized. If the variable name is different from that specified in the COINTTEST= (JOHANSEN=) or ECM= option in the MODEL statement, the variable name specified in the COINTEG statement is used. If the normalized variable is not specified, cointegrating vectors are not normalized.","help":"NORMALIZE=*variable*","type":"value"},{"name":"RANK=","optional":true,"description":"Specifies the cointegration rank of the cointegrated system. This option is required in the COINTEG statement. The rank of cointegration should be greater than zero and less than the number of dependent (endogenous) variables. If the value of the RANK= option in the COINTEG statement is different from that specified in the ECM= option, the rank specified in the COINTEG statement is used.","help":"RANK=*number*","type":"value"}]},{"name":"GARCH","description":"The GARCH statement specifies a GARCH-type multivariate conditional heteroscedasticity model.","help":"GARCH &lt;FORM=&lt;BEKK | CCC&gt;&gt; &lt;OUTHT=SAS-data-set&gt; &lt;P=number | P=(number-list)&gt; ...","arguments":[{"name":"FORM=","optional":true,"description":"Specifies the representation for a GARCH model.","help":"FORM=BEKK | CCC","type":"choice","arguments":[{"name":"BEKK","description":"Specifies a BEKK representation. This is the default.","type":"standalone"},{"name":"CCC","description":"Specifies a constant conditional correlation representation.","type":"standalone"}]},{"name":"OUTHT=","optional":true,"description":"Writes the conditional covariance matrix to an output data set.","help":"OUTHT=*SAS-data-set*","type":"dataSet"},{"name":"P=","optional":true,"description":"Specifies the order of the process or the subset of GARCH terms to be fitted. For example, you can specify the P=(1,3) option. The P=3 option is equivalent to the P=(1,2,3) option. The default is P=0.","type":"value"},{"name":"Q=","optional":true,"description":"Specifies the order of the process or the subset of ARCH terms to be fitted. This option is required in the GARCH statement.","type":"value"}]},{"name":"ID","description":"The ID statement specifies a variable that identifies observations in the input data set. The datetime variable specified in the ID statement is included in the OUT= data set if the OUTPUT statement is specified. Note that the ID variable is usually a SAS datetime variable. The values of the ID variable are extrapolated for the forecast observations based on the value of the INTERVAL= option.","help":"ID &lt;ALIGN=&lt;BEGINNING | MIDDLE | ENDING&gt;&gt; &lt;INTERVAL=&lt;DAY | HOUR | MINUTE&gt;... &gt; ","arguments":[{"name":"ALIGN=","optional":true,"description":"Controls the alignment of SAS dates used to identify output observations.","help":"ALIGN=BEGINNING | MIDDLE | ENDING","type":"choice","arguments":[{"name":"BEGINNING","description":"SAS dates aligned in the BEGINNING.","type":"standalone"},{"name":"MIDDLE","description":"SAS dates aligned in the MIDDLE.","type":"standalone"},{"name":"ENDING","description":"SAS dates aligned in the ENDING.","type":"standalone"}]},{"name":"INTERVAL=","optional":true,"description":"Specifies the time interval between observations. This option is required in the ID statement. The INTERVAL= option is used in conjunction with the ID variable to check that the input data are in order and have no missing periods. The INTERVAL= option is also used to extrapolate the ID values past the end of the input data when the OUTPUT statement is specified.","help":"INTERVAL=DAY | HOUR | MINUTE | SECOND | WEEK | MONTH | YEAR | QTR | TENDAY | SEMIMONTH | SEMIYEAR","type":"choice","arguments":[{"name":"DAY","description":"DAY interval","type":"standalone"},{"name":"HOUR","description":"HOUR interval","type":"standalone"},{"name":"MINUTE","description":"MINUTE interval","type":"standalone"},{"name":"SECOND","description":"SECOND interval","type":"standalone"},{"name":"WEEK","description":"WEEK interval","type":"standalone"},{"name":"MONTH","description":"MONTH interval","type":"standalone"},{"name":"YEAR","description":"YEAR interval","type":"standalone"},{"name":"QTR","description":"QTR interval","type":"standalone"},{"name":"TENDAY","description":"TENDAY interval","type":"standalone"},{"name":"SEMIMONTH","description":"SEMIMONTH interval","type":"standalone"},{"name":"SEMIYEAR","description":"SEMIYEAR interval","type":"standalone"}]}]},{"name":"MODEL","description":"The MODEL statement specifies dependent (endogenous) variables and independent (exogenous) variables for the VARMAX model. The multivariate model can have the same or different independent variables corresponding to the dependent variables. As a special case, the VARMAX procedure allows you to analyze one dependent variable. Only one MODEL statement is allowed.","help":"MODEL &lt;CENTER&gt; &lt;DIF(variable (number-list) &lt;... variable (number-list)&gt;)&gt; &lt;DIFX(number-list) | DIFX=(number-list)&gt; ...","arguments":[{"name":"CENTER","optional":true,"description":"Centers the dependent (endogenous) variables by subtracting their means.","type":"standalone"},{"name":"COINTTEST=","optional":true,"description":"Tests for cointegration. The following options can be used with the COINTTEST=( ) option. The options are specified within parentheses: JOHANSEN | JOHANSEN=(TYPE=value IORDER=number NORMALIZE=variable) prints the cointegration rank test for multivariate time series based on Johansen’s method. The following options can be used in the JOHANSEN=() option: IORDER=number specifies the integrated order. IORDER=1 prints the cointegration rank test for an integrated order 1 and prints the long-run parameter, β, and the adjustment coefficient, α. This is the default. IORDER=2 -- prints the cointegration rank test for integrated orders 1 and 2. NORMALIZE=variable specifies the dependent (endogenous) variable name whose cointegration vectors are to be normalized. TYPE=value specifies the type of cointegration rank test to be printed. Valid values are as follows: MAX -- prints the cointegration maximum eigenvalue test. TRACE -- prints the cointegration trace test. This is the default. SIGLEVEL=value sets the size of cointegration rank tests and common trends tests. The SIGLEVEL=value can be set to 0.1, 0.05, or 0.01. The default is SIGLEVEL=0.05. SW | SW=(TYPE=value LAG=number) prints common trends tests for a multivariate time series based on the Stock-Watson method. This test is provided when the number of dependent (endogenous) variables is less than or equal to 6. The following options can be used in the SW=( ) option. The options are listed within parentheses: LAG=number specifies the number of lags. TYPE=value specifies the type of common trends test to be printed. Valid values are as follows:","type":"value"},{"name":"DFTEST=","optional":true,"description":"Prints the Dickey-Fuller unit root tests. The DLAG=(number) ...(number) option specifies the regular or seasonal unit root test. Supported values of number are in 1, 2, 4, 12. If the number is greater than one, a seasonal Dickey-Fuller test is performed. If the TREND= option is specified, the seasonal unit root test is not available. The default is DLAG=1.","type":"value"},{"name":"DIF=","optional":true,"description":"Syntax: DIF(variable (number-list) <... variable (number-list)>) |DIF=(variable (number-list) <... variable (number-list)>)","type":"value"},{"name":"DIFX=","optional":true,"description":"Specifies the degrees of differencing to be applied to all independent variables. The number-list must contain one or more numbers, each of which should be greater than zero.","help":"DIFX=(number-list)","type":"value"},{"name":"DIFY=","optional":true,"description":"Specifies the degrees of differencing to be applied to all dependent (endogenous) variables. The number-list must contain one or more numbers, each of which should be greater than zero.","type":"value"},{"name":"ECM=","optional":true,"description":"Specifies a vector error correction model. The following options can be used in the ECM=() option: NORMALIZE=variable specifies a single dependent variable name whose cointegrating vectors are normalized. RANK=number specifies the cointegration rank. This option is required in the ECM= option. The value of the RANK= option should be greater than zero and less than or equal to the number of dependent (endogenous) variables, k.","type":"value"},{"name":"LAGMAX=","optional":true,"description":"Specifies the maximum number of lags for which results are computed and displayed by the PRINT=(CORRX CORRY COVX COVY IARR IMPULSE= IMPULSX= PARCOEF PCANCORR PCORR) options. This option is also used to limit the printed results for the cross covariances and cross- correlations of residuals. The default is LAGMAX=min(12, T-2), where T is the number of nonmissing observations.","help":"LAGMAX=*number*","type":"value"},{"name":"METHOD=","optional":true,"description":"Requests the type of estimates to be computed.","help":"METHOD=LS | ML","type":"choice","arguments":[{"name":"LS","description":"Specifies least squares estimates.","type":"standalone"},{"name":"ML","description":"Specifies maximum likelihood estimates.","type":"standalone"}]},{"name":"MINIC=","optional":true,"description":"Prints the information criterion for the appropriate AR and MA tentative order selection and for the diagnostic checks of the fitted model. The following options can be used in the MINIC=() option. The options are specified within parentheses: P=number |P=(pmin:pmax) specifies the range of AR orders to be considered in the tentative order selection. The default is P=(0:5). The P=3 option is equivalent to the P=(0:3) option. PERROR=number | PERROR=(pe,min:pe,max) specifies the range of AR orders for obtaining the error series. The default is PERROR=(pmax:pmax+qmax). Q=number Q=(qmin:qmax) specifies the range of MA orders to be considered in the tentative order selection. The default is Q=(0:5). TYPE=value specifies the criterion for the model order selection. Valid criteria are as follows:","type":"value"},{"name":"NOCURRENTX","optional":true,"description":"Suppresses the current values xt of the independent variables.","type":"standalone"},{"name":"NOINT","optional":true,"description":"Suppresses the intercept parameter, delta.","type":"standalone"},{"name":"NOPRINT","optional":true,"description":"Suppresses all printed output.","type":"standalone"},{"name":"NSEASON=","optional":true,"description":"Specifies the number of seasonal periods. When the NSEASON=number option is specified, (number –1) seasonal dummies are added to the regressors. If the NOINT option is specified, the NSEASON= option is not applicable.","help":"NSEASON=*number*","type":"value"},{"name":"P=","optional":true,"description":"Specifies the order of the vector autoregressive process. Subset models of vector autoregressive orders can be specified by listing the desired set of lags. For example, you can specify the P=(1,3,4) option. The P=3 option is equivalent to the P=(1,2,3) option. The default is P=0.","type":"value"},{"name":"PRINT=","optional":true,"description":"The following options can be used in the PRINT=( ) option. The options are listed within parentheses: CORRB prints the estimated correlations of the parameter estimates. CORRX | CORRX(number) prints the cross-correlation matrices of exogenous (independent) variables. The number should be greater than zero. CORRY | CORRY(number) prints the cross-correlation matrices of dependent (endogenous) variables. The number should be greater than zero. COVB prints the estimated covariances of the parameter estimates. COVPE | COVPE(number) prints the covariance matrices of number-ahead prediction errors for the VARMAX(p,q,s) model. The number should be greater than zero. COVX | COVX(number) prints the cross-covariance matrices of exogenous (independent) variables. The number should be greater than zero. COVY | COVY(number) prints the cross-covariance matrices of dependent (endogenous) variables. The number should be greater than zero. DECOMPOSE | DECOMPOSE(number) prints the decomposition of the prediction error covariances using up to the number of lags specified by number in parentheses for the VARMA(,) model. DIAGNOSE prints the residual diagnostics and model diagnostics. DYNAMIC prints the contemporaneous relationships among the components of the vector time series. ESTIMATES prints the coefficient estimates and a schematic representation of the significance and sign of the parameter estimates. IARR | IARR(number) prints the infinite order AR representation of a VARMA process. The number should be greater than zero. If the ECM= option and the COINTEG statement are specified, then the reparameterized AR coefficient matrices are printed. IMPULSE |IMPULSE(number) IMPULSE=(SIMPLE ACCUM ORTH STDERR ALL) IMPULSE(number)=(SIMPLE ACCUM ORTH STDERR ALL) prints the impulse response function. The number should be greater than zero. The following options can be used in the IMPULSE=( ) option. The options are specified within parentheses: ACCUM prints the accumulated impulse response function. ALL is equivalent to specifying all of SIMPLE, ACCUM, ORTH, and STDERR. ORTH prints the orthogonalized impulse response function. SIMPLE prints the impulse response function. This is the default. STDERR prints the standard errors of the impulse response function, the accumulated impulse response function, or the orthogonalized impulse response function. IMPULSX |IMPULSX(number) IMPULSX=(SIMPLE ACCUM ALL) IMPULSX(number)=(SIMPLE ACCUM ALL) prints the impulse response function related to exogenous (independent) variables. The following options can be used in the IMPULSX=( ) option. The options are specified within parentheses: ACCUM prints the accumulated impulse response matrices for the transfer function. ALL is equivalent to specifying both SIMPLE and ACCUM. SIMPLE prints the impulse response matrices for the transfer function. This is the default. PARCOEF | PARCOEF(number) prints the partial autoregression coefficient matrices. PCANCORR | PCANCORR(number) prints the partial canonical correlations. PCORR | PCORR(number) prints the partial correlation matrices. The number should be greater than zero. ROOTS prints the eigenvalues of the kp x kp companion matrix associated with the AR characteristic function Φ(β), where kp is the number of dependent (endogenous) variables.","type":"value"},{"name":"PRINTALL","optional":true,"description":"Requests all printing control options.","type":"standalone"},{"name":"PRINTFORM=","optional":true,"description":"Requests the printing format of the output generated by the PRINT= option and cross covariances and cross-correlations of residuals.","help":"PRINTFORM=MATRIX | UNIVARIATE | BOTH","type":"choice","arguments":[{"name":"MATRIX","description":"Prints output in matrix form. This is the default.","type":"standalone"},{"name":"UNIVARIATE","description":"Prints output by variables.","type":"standalone"},{"name":"BOTH","description":"Prints output in both MATRIX and UNIVARIATE forms.","type":"standalone"}]},{"name":"PRIOR=","optional":true,"description":"Specifies the prior value of parameters for the BVARX(p,s) model. The following options can be used with the PRIOR=(prior-options) option. The prior-options are listed within parentheses: IVAR | IVAR=(variables) specifies an integrated BVAR(p) model. The variables should be specified in the MODEL statement as dependent variables. LAMBDA=value specifies the prior standard deviation of the AR coefficient parameter matrices. It should be a positive number. The default is λ=1. MEAN=(vector) specifies the mean vector in the prior distribution for the AR coefficients. If the vector is not specified, the prior value is assumed to be a zero vector. NREP=number specifies the number of periods to compute the measure of forecast accuracy. The default is NREP=0.5T, where T is the number of observations.","type":"value"},{"name":"Q=","optional":true,"description":"Specifies the order of the moving-average error process. Subset models of moving-average orders can be specified by listing the desired set of lags. For example, you can specify the Q=(1,5) option. The default is Q=0.","type":"value"},{"name":"SCENTER","optional":true,"description":"Centers seasonal dummies specified by the NSEASON= option. The centered seasonal dummies are generated by c-(1/s), where c is a seasonal dummy generated by the NSEASON=s option.","type":"standalone"},{"name":"TREND=","optional":true,"description":"Specifies the degree of deterministic time trend included in the model.","help":"TREND=LINEAR | QUAD","type":"choice","arguments":[{"name":"LINEAR","description":"Includes a linear time trend as a regressor.","type":"standalone"},{"name":"QUAD","description":"Includes linear and quadratic time trends as regressors.","type":"standalone"}]},{"name":"VARDEF=","optional":true,"description":"Corrects for the degrees of freedom of the denominator for computing an error covariance matrix for the METHOD=LS option.","help":"VARDEF=DF | N","type":"choice","arguments":[{"name":"DF","description":"Specifies that the number of nonmissing observation minus the number of regressors be used.","type":"standalone"},{"name":"N","description":"Specifies that the number of nonmissing observation be used.","type":"standalone"}]},{"name":"XLAG=","optional":true,"description":"Specifies the lags of exogenous (independent) variables. Subset models of distributed lags can be specified by listing the desired set of lags. For example, XLAG=(2) selects only a lag 2 of the exogenous variables. The default is XLAG=0. To exclude the present values of exogenous variables from the model, the NOCURRENTX option must be used.","type":"value"}]},{"name":"NLOPTIONS","description":"The VARMAX procedure uses the nonlinear optimization (NLO) subsystem to perform nonlinear optimization tasks.","help":"NLOPTIONS &lt;ABSCONV= | ABSTOL=r&gt; &lt;ABSFCONV=r[n] | ABSFTOL=r[n&gt; &lt;ABSGCONV=r[n] | ABSGTOL=r[n&gt; ...","arguments":[{"name":"ABSCONV=","optional":true,"aliases":["ABSTOL="],"description":"Specifies an absolute function convergence criterion. The default value of r is the negative square root of the largest double-precision value, which serves only as a protection against overflows.","type":"value"},{"name":"ABSFCONV=","optional":true,"aliases":["ABSFTOL="],"description":"Specifies an absolute function convergence criterion. The default value is r=0. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"ABSGCONV=","optional":true,"aliases":["ABSGTOL="],"description":"Specifies an absolute gradient convergence criterion. The default value is r=1E-5. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"ABSXCONV=","optional":true,"aliases":["ABSXTOL="],"description":"Specifies the absolute parameter convergence criterion. The default is r=1E-8 for the NMSIMP technique and r=0 otherwise. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can terminate.","type":"value"},{"name":"DAMPSTEP=","optional":true,"description":"Specifies that the initial step length value a⁰ for each line search (used by the QUANEW, HYQUAN, CONGRA, or NEWRAP technique) cannot be larger than r times the step length value used in the former iteration. If the DAMPSTEP option is specified but r is not specified, the default is r=2. The DAMPSTEP=r option can prevent the line-search algorithm from repeatedly stepping into regions where some objective functions are difficult to compute or where they could lead to floating point overflows during the computation of objective functions and their derivatives. The DAMPSTEP=r option can save time-costly function calls during the line searches of objective functions that result in very small steps.","type":"value"},{"name":"FCONV2=","optional":true,"aliases":["FTOL2="],"description":"Specifies another function convergence criterion.","type":"value"},{"name":"FCONV=","optional":true,"aliases":["FTOL="],"description":"Specifies a relative function convergence criterion.","type":"value"},{"name":"FSIZE=","optional":true,"description":"Specifies the FSIZE parameter of the relative function and relative gradient termination criteria. The default value is r=0.","help":"FSIZE=*r*","type":"value"},{"name":"GCONV=","optional":true,"aliases":["GTOL="],"description":"Specifies a relative gradient convergence criterion. The default value is r=1E-8. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can terminate.","type":"value"},{"name":"HESCAL=","optional":true,"aliases":["HS="],"description":"Specifies the scaling version of the Hessian matrix used in NRRIDG, TRUREG, NEWRAP, or DBLDOG optimization.","help":"HESCAL=0 | 1 | 2 | 3","type":"choice","arguments":[{"name":"0","description":"Specifies that no scaling is done.","type":"standalone"},{"name":"1","description":"Specifies the Moré (1978) scaling update","type":"standalone"},{"name":"2","description":"Specifies the Dennis, Gay, and Welsch (1981) scaling update","type":"standalone"},{"name":"3","description":"Specifies that di is reset in each iteration","type":"standalone"}]},{"name":"INHESSIAN=","optional":true,"aliases":["INHESS="],"description":"Specifies how the initial estimate of the approximate Hessian is defined for the quasi-Newton techniques QUANEW and DBLDOG.","type":"value"},{"name":"INSTEP=","optional":true,"description":"Reduces the length of the first trial step during the line search of the first iterations.","help":"INSTEP=*r*","type":"value"},{"name":"LINESEARCH=","optional":true,"aliases":["LIS="],"description":"Specifies the line-search method for the CONGRA, QUANEW, and NEWRAP optimization techniques.","help":"LINESEARCH=1 | 2 | 3 | 4 | 5 | 6 | 7 | 8","type":"choice","arguments":[{"name":"1","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is similar to one used by the Harwell subroutine library.","type":"standalone"},{"name":"2","description":"Specifies a line-search method that needs more function calls than gradient calls for quadratic and cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"3","description":"Specifies a line-search method that needs the same number of function and gradient calls for cubic interpolation and cubic extrapolation; this method is implemented as shown in Fletcher (1987) and can be modified to an exact line search by using the LSPRECISION= option.","type":"standalone"},{"name":"4","description":"Specifies a line-search method that needs the same number of function and gradient calls for stepwise extrapolation and cubic interpolation","type":"standalone"},{"name":"5","description":"Specifies a line-search method that is a modified version of LIS=4.","type":"standalone"},{"name":"6","description":"Specifies golden section line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"7","description":"Specifies bisection line search (Polak 1971), which uses only function values for linear approximation.","type":"standalone"},{"name":"8","description":"Specifies Armijo line-search technique (Polak 1971), which uses only function values for linear approximation.","type":"standalone"}]},{"name":"LSPRECISION=","optional":true,"aliases":["LSP="],"description":"Specifies the degree of accuracy that should be obtained by the line-search algorithms LIS=2 and LIS=3. The default LSPRECISION= values are:","type":"value"},{"name":"MAXFUNC=","optional":true,"aliases":["MAXFU="],"description":"Requires the number of function calls to be no larger than i. The default values are:","type":"value"},{"name":"MAXITER=","optional":true,"aliases":["MAXIT="],"description":"Requires the number of iterations to be no larger than i. The default values are: o For TECH= TRUREG, NRRIDG, NEWRAP: i=50 o For TECH= QUANEW, DBLDOG: i=200 o For TECH= CONGRA: i=400 o For TECH= NMSIMP: i=1000 These default values are also valid when i is specified as a missing value.","type":"value"},{"name":"MAXSTEP=","optional":true,"description":"Specifies an upper bound for the step length of the line-search algorithms during the first n iterations.","help":"MAXSTEP=*r[n*","type":"value"},{"name":"MAXTIME=","optional":true,"description":"Requires the CPU time to be no larger than r. The default value of the MAXTIME= option is the largest double floating-point number on your computer. Note that the time specified by the MAXTIME= option is checked only once at the end of each iteration. Therefore, the actual running time can be much longer than that specified by the MAXTIME= option. The actual running time includes the rest of the time needed to finish the iteration and the time needed to generate the output of the results.","help":"MAXTIME=*r*","type":"value"},{"name":"MINITER=","optional":true,"aliases":["MINIT="],"description":"Specifies the minimum number of iterations. The default value is 0. If you request more iterations than are actually needed for convergence to a stationary point, the optimization algorithms can behave strangely. For example, the effect of rounding errors can prevent the algorithm from continuing for the required number of iterations.","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the output.","type":"standalone"},{"name":"PALL","optional":true,"description":"[Displays all optional output for optimization.","type":"standalone"},{"name":"PHISTORY","optional":true,"description":"Displays the optimization history.","type":"standalone"},{"name":"PHISTPARMS","optional":true,"description":"Display parameter estimates in each iteration.","type":"standalone"},{"name":"PINIT","optional":true,"description":"Displays the initial values and derivatives (if available).","type":"standalone"},{"name":"PSHORT","optional":true,"description":"Restricts the amount of default output.","type":"standalone"},{"name":"PSUMMARY","optional":true,"description":"Restricts the amount of default displayed output to a short form of iteration history and notes, warnings, and errors.","type":"standalone"},{"name":"RESTART=","optional":true,"aliases":["REST="],"description":"Specifies that the QUANEW or CONGRA algorithm is restarted with a steepest descent/ascent search direction after, at most, i iterations, i > 0.","type":"value"},{"name":"SOCKET=","optional":true,"description":"Specifies the fileref that contains the information needed for remote monitoring.","type":"value"},{"name":"TECHNIQUE=","optional":true,"aliases":["TECH="],"description":"Specifies the optimization technique.","help":"TECHNIQUE=CONGRA | DBLDOG | NMSIMP | NEWRAP | NRRIDG | QUANEW | TRUREG | NONE","type":"choice","arguments":[{"name":"CONGRA","description":"Chooses one of four different conjugate-gradient optimization algorithms, which can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"DBLDOG","description":"Performs a version of double-dogleg optimization, which uses the gradient to update an approximation of the Cholesky factor of the Hessian.","type":"standalone"},{"name":"NMSIMP","description":"Performs a Nelder-Mead simplex optimization.","type":"standalone"},{"name":"NEWRAP","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. The algorithm combines a line-search algorithm with ridging, and it can be modified with the LINESEARCH= option.","type":"standalone"},{"name":"NRRIDG","description":"Performs a usually stable but, for large problems, memory- and time-consuming Newton-Raphson optimization technique. This algorithm does not perform a line search.","type":"standalone"},{"name":"QUANEW","description":"Chooses one of four different quasi-Newton optimization algorithms that can be more precisely defined with the UPDATE= option and modified with the LINESEARCH= option.","type":"standalone"},{"name":"TRUREG","description":"Performs a usually very stable but, for large problems, memory- and time-consuming trust-region optimization technique. The algorithm is implemented similar to Gay (1983) and Moré and Sorensen (1983).","type":"standalone"},{"name":"NONE","description":"Does not perform any optimization. This option is similar to METHOD=NONE, but TECH=NONE also computes and displays residuals and goodness of fit statistics.","type":"standalone"}]},{"name":"UPDATE=","optional":true,"aliases":["UPD="],"description":"Specifies the update method for the quasi-Newton, double-dogleg, or conjugate-gradient optimization technique.","help":"UPDATE=BFGS | DBFGS | DDFP | DFP | PB | FR | PR | CD","type":"choice","arguments":[{"name":"BFGS","description":"Performs the original Broyden, Fletcher, Goldfarb, and Shanno (BFGS) update of the inverse Hessian matrix.","type":"standalone"},{"name":"DBFGS","description":"Performs the dual BFGS update of the Cholesky factor of the Hessian matrix. This is the default update method.","type":"standalone"},{"name":"DDFP","description":"Performs the dual Davidon, Fletcher, and Powell (DFP) update of the Cholesky factor of the Hessian matrix.","type":"standalone"},{"name":"DFP","description":"Performs the original DFP update of the inverse Hessian matrix.","type":"standalone"},{"name":"PB","description":"Performs the automatic restart update method of Powell (1977) and Beale (1972).","type":"standalone"},{"name":"FR","description":"Performs the Fletcher-Reeves update (Fletcher 1987).","type":"standalone"},{"name":"PR","description":"Performs the Polak-Ribiere update (Fletcher 1987).","type":"standalone"},{"name":"CD","description":"Performs a conjugate-descent update of Fletcher (1987).","type":"standalone"}]},{"name":"XCONV=","optional":true,"aliases":["XTOL="],"description":"Specifies the relative parameter convergence criterion. For all techniques except NMSIMP, termination requires a small relative parameter change in subsequent iterations. The default value is r=1E-8 for the NMSIMP technique and r=0 otherwise. The optional integer value n specifies the number of successive iterations for which the criterion must be satisfied before the process can be terminated.","type":"value"},{"name":"XSIZE=","optional":true,"description":"Specifies the XSIZE parameter of the relative parameter termination criterion. The default value is r=0.","type":"value"}]},{"name":"OUTPUT","description":"The OUTPUT statement generates and prints forecasts based on the model estimated in the previous MODEL statement and, optionally, creates an output SAS data set that contains these forecasts.","help":"OUTPUT &lt;ALPHA=number&gt; &lt;BACK=number&gt; &lt;LEAD=number&gt; ...","arguments":[{"name":"ALPHA=","optional":true,"description":"Sets the forecast confidence limit size, where number is between 0 and 1. When you specify the ALPHA=number option, the upper and lower confidence limits define the 100(1-α)% confidence interval. The default is ALPHA=0.05, which produces 95% confidence intervals.","help":"ALPHA=*number*","type":"value"},{"name":"BACK=","optional":true,"description":"Specifies the number of observations before the end of the data at which the multistep forecasts begin. The BACK= option value must be less than or equal to the number of observations minus the number of lagged regressors in the model. The default is BACK=0, which means that the forecasts start at the end of the available data.","help":"BACK=*number*","type":"value"},{"name":"LEAD=","optional":true,"description":"Specifies the number of multistep forecast values to compute. The default is LEAD=12.","help":"LEAD=*number*","type":"value"},{"name":"NOPRINT","optional":true,"description":"Suppresses the printed forecast values of each dependent (endogenous) variable.","type":"standalone"},{"name":"OUT=","optional":true,"description":"Writes the forecast values to an output data set.","help":"OUT=*SAS-data-set*","type":"dataSet"}]},{"name":"RESTRICT","description":"The RESTRICT statement restricts the specified parameters to the specified values. Only one RESTRICT statement is allowed, but multiple restrictions can be specified in one RESTRICT statement.","help":"RESTRICT &lt;AR(l,i,j)=&gt; &lt;CONST(i)=&gt; &lt;MA(l,i,j)=&gt; ...","arguments":[{"name":"ACH","optional":true,"description":"Is the ARCH parameter of the lag l value of (ε)t(ε')t, where i,j=1,...,k for BEKK representation and i=j=1,...,k for CCC representation.","type":"standalone"},{"name":"AR","optional":true,"description":"Is the autoregressive parameter of the lag l value of the (j)th dependent (endogenous) variable, (y)j,t-l, to the (i)th dependent variable at time t, (y)it.","type":"standalone"},{"name":"CCC","optional":true,"description":"Is the constant conditional correlation parameter for only the CCC representation; (i,j) is 1 ≤ i ≤ j ≤ k.","type":"standalone"},{"name":"CONST","optional":true,"description":"Is the intercept parameter of the (i)th time series, (y)it","type":"standalone"},{"name":"GCH","optional":true,"description":"Is the GARCH parameter of the lag l value of covariance matrix, Ht, where i,j=1,...,k for BEKK representation and i=j=1,...,k for CCC representation.","type":"standalone"},{"name":"GCHC","optional":true,"description":"Is the constant parameter of the covariance matrix, Ht, and (i,j) is 1 ≤ i=j ≤ k for CCC representation and 1 ≤ i ≤ j ≤ k for BEKK representations, where k is the number of dependent variables.","type":"standalone"},{"name":"LTREND","optional":true,"description":"Is the linear trend parameter of the current value (i)th time series, (y)it.","type":"standalone"},{"name":"MA","optional":true,"description":"Is the moving-average parameter of the lag l value of the (j)th error process, єj,t-l, to the (i)th dependent variable at time t, (y)it.","type":"standalone"},{"name":"QTREND","optional":true,"description":"Is the quadratic trend parameter of the current value (i)th time series, (y)it.","type":"standalone"},{"name":"SDUMMY","optional":true,"description":"Is the (j)th seasonal dummy of the (i)th time series at time t, (y)it, where j=1,...,(nseason-1), where nseason is based on the NSEASON= option in the MODEL statement.","type":"standalone"},{"name":"XL","optional":true,"description":"Is the exogenous parameter of the lag l value of the (j)th exogenous (independent) variable, (x)j,t-l, to the (i)th dependent variable at time t, (y)it.","type":"standalone"}]},{"name":"TEST","description":"The TEST statement performs the Wald test for the joint hypothesis specified in the statement. The restriction’s form is parameter=value, and each restriction is separated by commas. The restrictions are specified in the same manner as in the RESTRICT statement. Any number of TEST statements can be specified. To use the TEST statement, you need to know the form of the model. If the P=, Q=, and XLAG= options are not specified, then the TEST statement is not applicable. The following is an example of the TEST statement. In the case of a bivariate (=2) VAR(2) model, proc varmax data=one; model y1 y2 / p=2; test AR(1,1,2)=0, AR(2,1,2)=0; run;","help":"TEST &lt;AR(l,i,j)=&gt; &lt;CONST(i)=&gt; &lt;MA(l,i,j)=&gt; ...","arguments":[{"name":"ACH","optional":true,"description":"Is the ARCH parameter of the lag l value of (ε)t(ε)'t, where i,j=1,...,k for BEKK representation and i=j=1,...,k for CCC representation.","type":"standalone"},{"name":"AR","optional":true,"description":"Is the autoregressive parameter of the lag l value of the (j)th dependent (endogenous) variable, (y)j,t-l, to the (i)th dependent variable at time t, (y)it.","type":"standalone"},{"name":"CCC","optional":true,"description":"Is the constant conditional correlation parameter for only the CCC representation; (i,j) is 1 ≤ i ≤ j ≤ k.","type":"standalone"},{"name":"CONST","optional":true,"description":"Is the intercept parameter of the (i)th time series, (y)it","type":"standalone"},{"name":"GCH","optional":true,"description":"Is the GARCH parameter of the lag l value of covariance matrix, Ht, where i,j=1,...,k for BEKK representation and i=j=1,...,k for CCC representation.","type":"standalone"},{"name":"GCHC","optional":true,"description":"Is the constant parameter of the covariance matrix, Ht, and (i,j) is 1 ≤ i=j ≤ k for CCC representation and 1 ≤ i ≤ j ≤ k for BEKK representations, where k is the number of dependent variables.","type":"standalone"},{"name":"LTREND","optional":true,"description":"Is the linear trend parameter of the current value (i)th time series, (y)it.","type":"standalone"},{"name":"MA","optional":true,"description":"Is the moving-average parameter of the lag l value of the (j)th error process, (ε)j,t-l, to the (i)th dependent variable at time t, (y)it.","type":"standalone"},{"name":"QTREND","optional":true,"description":"Is the quadratic trend parameter of the current value (i)th time series, (y)it.","type":"standalone"},{"name":"SDUMMY","optional":true,"description":"Is the (j)th seasonal dummy of the (i)th time series at time t, (y)it, where , where j=1,...,(nseason-1), where nseason is based on the NSEASON= option in the MODEL statement.","type":"standalone"},{"name":"XL","optional":true,"description":"Is the exogenous parameter of the lag l value of the (j)th exogenous (independent) variable, (x)j,t-l, to the (i)th dependent variable at time t, (y)it.","type":"standalone"}]}],"supportSiteInformation":{"docsetId":"etsug","docsetVersion":"v_010","docsetTargetFile":"etsug_varmax_toc.htm"}}