{"Keywords":{"Keyword":[{"Name":"CMD","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"Specifies that the macro can accept either a name-style invocation or a command-style \ninvocation."}},{"Name":"DES=","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"[Syntax: DES='text'] \n    \nSpecifies a description (up to 40 characters) for the macro entry in the macro catalog."}},{"Name":"PARMBUFF|PBUFF","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"Assigns the entire list of parameter values in a macro call, including the parentheses in \na name-style invocation, as the value of the automatic macro variable SYSPBUFF."}},{"Name":"STMT","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"Specifies that the macro can accept either a name-style invocation or a statement-style \ninvocation."}},{"Name":"SECURE","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"Causes the contents of a macro to be encrypted when stored in a stored compiled macro \nlibrary."}},{"Name":"NOSECURE","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"Specifies the contents of a macro not to be encrypted when stored in a stored compiled \nmacro library."}},{"Name":"SOURCE","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"Combines and stores the source of the compiled macro with the compiled macro code as \nan entry in a SAS catalog in a permanent SAS data library."}},{"Name":"STORE","Type":"MACRO_DEFINITION_OPTION","Help":{"#cdata":"Stores the compiled macro as an entry in a SAS catalog in a permanent SAS data library."}},{"Name":"MINDELIMITER=","Help":{"#cdata":"[Syntax: MINDELIMITER='single character';] \n    \nSpecifies a value that will override the value of the MINDELIMITER= global option. \nThe value must be a single character enclosed in single quotation marks and can \nappear only once in a %MACRO statement."},"Type":"MACRO_DEFINITION_OPTION"},{"Name":"MINOPERATOR","Help":{"#cdata":"Specifies that the macro processor recognizes and evaluates the mnemonic IN and the \nspecial character # as logical operators when evaluating arithmetic or logical \nexpressions during the execution of the macro."},"Type":"MACRO_DEFINITION_OPTION"},{"Name":"NOMINOPERATOR","Help":{"#cdata":"Specifies that the macro processor does not recognize the mnemonic IN and the special \ncharacter # as logical operators when evaluating arithmetic or logical expressions \nduring the execution of the macro. The setting of this argument overrides the setting \nof the MINOPERATOR global system option."},"Type":"MACRO_DEFINITION_OPTION"}]}}