{"Keywords":{"Keyword":[{"Name":"CHTML","Type":"S","Help":{"#cdata":"Produces a compact, minimal HTML that does not use style information."}},{"Name":"CORE","Type":"S","Help":{"#cdata":"Contains a table of Unicode values and mnemonics."}},{"Name":"CSV","Type":"S","Help":{"#cdata":"Produces tabular output that contains columns of data values that are separated by commas."}},{"Name":"CSVALL","Type":"S","Help":{"#cdata":"Produces output that contains columns of data values that are separated by commas. ODS CSVALL \nproduces tabular output with titles, notes, and bylines."}},{"Name":"CVSBYLINE","Type":"S","Help":{"#cdata":"Produces output with comma-separated values and columns of data that are separated by commas."}},{"Name":"DEFAULT","Type":"S","Help":{"#cdata":"Produces XML output."}},{"Name":"DOCBOOK","Type":"S","Help":{"#cdata":"Produces XML output that conforms to the DocBook DTD by OASIS."}},{"Name":"ExcelXP","Type":"S","Help":{"#cdata":"Produces Microsoft's spreadsheetML XML. This tagset is used to import data into XML."}},{"Name":"HTML4","Type":"S","Help":{"#cdata":"Produces HTML 4.0 embedded style sheets."}},{"Name":"HTMLCSS","Type":"S","Help":{"#cdata":"Produces HTML output with cascading style sheets that is similar to ODS HTML output."}},{"Name":"HTMLPANEL","Type":"S","Help":{"#cdata":"Creates panels for By-grouped graphs."}},{"Name":"HTMLSCROLL","Type":"S","Help":{"#cdata":"Enables tables to be scrollable. The scrolling is actually done with JavaScript. This tagset adds \nthe JavaScript and necessary infrastructure to the standard HTML4 tagset."}},{"Name":"IMODE","Type":"S","Help":{"#cdata":"Produces HTML output as a column of output that is separated by lines."}},{"Name":"MSOFFICE2K","Type":"S","Help":{"#cdata":"Produces HTML code for output generated by ODS for Microsoft Office products."}},{"Name":"MVSHTML","Type":"S","Help":{"#cdata":"Produces URLs within HTML files that are used in the z/OS operating environment."}},{"Name":"PHTML","Type":"S","Help":{"#cdata":"Produces simple HTML output that uses twelve style elements and no class attributes."}},{"Name":"PYX","Type":"S","Help":{"#cdata":"Produces PYX, which is a simple, line-oriented notation used by Pyxie to describe the information \ncommunicated by an XML parser to an XML application."}},{"Name":"RTF","Type":"S","Help":{"#cdata":"Opens, manages, or closes the RTF destination, which produces measured output that is written in\nRich Text Format for use with Microsoft Word 2002.\n    \nSyntax:\n(1) ODS TAGSETS.RTF <(<ID=> identifier)> action;  \n(2) ODS TAGSETS.RTF <(<ID=> identifier)> <option(s)>;"}},{"Name":"SASREPORT","Type":"S","Help":{"#cdata":"Causes imbedded data to be produced in CSV format."}},{"Name":"SQL","Type":"S","Help":{"#cdata":"Generates SQL statements for creation of tables in an SQL database. It's a brute-force way of getting \na data set into your database (SAS/CONNECT or SAS/SHARE being the best way, if you have access to \none of those products)."}},{"Name":"SUPERMAP","Type":"S","Help":{"#cdata":"This new mapping tagset does almost everything you would want from a mapping tagset. It is all the \nother mapping tagsets in one. Control the events to be displayed, the attributes shown, and display \nevents only if their values match a regular expression."}},{"Name":"TABLEEDITOR","Type":"S","Help":{"#cdata":"Creates HTML output with the same kind of functionality that you would get from Visual Basic .Net (VB.NET). \nYou can easily export the output to Excel or other filetypes."}},{"Name":"WML","Type":"S","Help":{"#cdata":"Uses the Wireless Application Protocol (WAP) to produce a Wireless Markup Language (WML) DTD with \na list of URLs as a table of contents."}},{"Name":"WMLOLIST","Type":"S","Help":{"#cdata":"Uses the Wireless Application Protocol (WAP) to produce a Wireless Markup Language (WML) DTD with \nan option list for the table of contents."}},{"Name":"XBRL","Type":"S","Help":{"#cdata":"Generates XBRL XML."}},{"Name":"XHTML","Type":"S","Help":{"#cdata":"Produces output in HTML format."}},{"Name":"EVENT_HTML","Type":"S","Help":{"#cdata":"Creates XML output that shows which events are being triggered and which variables are used by an \nevent to send output from a SAS process to an output file.\""}},{"Name":"NAMEDHTML","Type":"S","Help":{"#cdata":"Creates HTML output similar to STYLE_POPUP, but with all the objects labeled as they are when \nusing ODS TRACE."}},{"Name":"SHORT_MAP","Type":"S","Help":{"#cdata":"Creates a subset of the XML output that is created by the EVENT_MAP tagset."}},{"Name":"STYLE_DISPLAY","Type":"S","Help":{"#cdata":"Creates a sample page of HTML output that is similar to STYLE_POPUP output."}},{"Name":"STYLE_POPUP","Type":"S","Help":{"#cdata":"Creates HTML like HTMLCSS, but if you're using Internet Explorer, STYLE_POPUP displays a window \nthat shows the resolved ODS style definition for any item that you select."}},{"Name":"TEXT_MAP","Type":"S","Help":{"#cdata":"Creates text output that shows which events are being triggered as ODS handles the output objects."}},{"Name":"TPL_STYLE_LIST","Type":"S","Help":{"#cdata":"Creates HTML output in a bulleted list similar to EVENT_MAP but lists only a subset of the \npossible attributes."}},{"Name":"TPL_STYLE_MAP","Type":"S","Help":{"#cdata":"Creates XML output similar to EVENT_MAP but lists only a subset of the possible attributes."}}]}}