{"Keywords":{"#comment":[{},{},{},{}],"Keyword":[{"Name":"ALTER=","Type":"DATAPASSWORD_OPTION_V","Help":{"#cdata":"Assigns an alter password to a SAS data file. The password allows you to protect \nor replace a stored compiled DATA step program or a DATA step view."}},{"Name":"READ=","Type":"DATAPASSWORD_OPTION_V","Help":{"#cdata":"Assigns a read password to a SAS data file. The password allows you to read or \nexecute a stored compiled DATA step program or a DATA step view."}},{"Name":"PW=","Type":"DATAPASSWORD_OPTION_V","Help":{"#cdata":"Assigns a READ and ALTER password, both having the same value."}},{"Name":"SOURCE=","Type":"DATAPASSWORD_OPTION_V","Help":{"#cdata":"Specifies one of the following source options: SAVE (saves source code), ENCRYPT \n(encrypts and saves source code), or NOSAVE (does not save the source code)."},"Values":{"@Value1":"SAVE","@Value2":"ENCRYPT","@Value3":"NOSAVE"},"ToolTips":{"@ToolTip1":"Specifies to save the source code.","@ToolTip2":"Specifies to encrypt and save the source code.","@ToolTip3":"Specifies not to save the source code."}},{"Name":"NOLIST","Type":"DATAVIEWPGM_OPTION_S","Help":{"#cdata":"Suppresses the output of all variables to the SAS log when the value of _ERROR_ is 1."}},{"Name":"_NULL_","Type":"DATASTEP_DEFINITION","Help":{"#cdata":"Specifies that SAS does not create a data set when it executes the DATA step."}},{"Name":"VIEW=","Type":"DATASTEP_DEFINITION","Help":{"#cdata":"Names a view that the DATA step uses to store the input DATA step view."}},{"Name":"PGM=","Type":"DATASTEP_DEFINITION","Help":{"#cdata":"Names the stored compiled program that SAS creates or executes in the DATA step. \nTo create a stored compiled program, specify a slash (/) before the PGM= option. \nTo execute a stored compiled program, specify the PGM= option without a slash (/)."}},{"Name":"UNIQUE","Type":"DATASETINDEX_OPTION_S","Help":{"#cdata":"Specifies that the values of the key variables must be unique."}},{"Name":"NOMISS","Type":"DATASETINDEX_OPTION_S","Help":{"#cdata":"Excludes all observations with missing values from the index."}}]}}