{"Keywords":{"Keyword":[{"Name":"DEBUG","Type":"DATASTEP_OPTION","Help":{"#cdata":"Enables you to debug your program interactively by helping to identify logic errors, \nand sometimes data errors."}},{"Name":"NESTING","Type":"DATASTEP_OPTION","Help":{"#cdata":"Specifies that a note will be printed to the SAS log for the beginning and end \nof each DO-END and SELECT-END nesting level. This option enables you to debug \nmismatched DO-END and SELECT-END statements and is particularly useful in large \nprograms where the nesting level is not obvious."}},{"Name":"STACK=","Type":"DATASTEP_OPTION","Help":{"#cdata":"Specifies the maximum number of nested LINK statements."}},{"Name":"VIEW=","Type":"DATASTEP_OPTION","Help":{"#cdata":"Names a view that the DATA step uses to store the input DATA step view."}},{"Name":"SOURCE=","Type":"DATASTEP_OPTION_V","Values":{"@Value1":"SAVE","@Value2":"ENCRYPT","@Value3":"NOSAVE"},"ToolTips":{"@ToolTip1":"Saves the source code that created a stored compiled DATA step program or a DATA step view.","@ToolTip2":"Encrypts and saves the source code that created a stored compiled DATA step program  or a DATA step view.","@ToolTip3":"Does not save the source code."},"Help":{"#cdata":"Specifies one of the following source options: SAVE | ENCRYPT | NOSAVE."}},{"Name":"NOLIST","Type":"DATASTEP_OPTION","Help":{"#cdata":"Suppresses the output of all variables to the SAS log when the value of _ERROR_ is 1. \n    \nRestriction: NOLIST must be the last option in the DATA statement.]"}},{"Name":"PGM=","Type":"DATASTEP_OPTION_V","Help":{"#cdata":"Names the stored compiled program that SAS creates or executes in the DATA step."}},{"Name":"UNIQUE","Type":"SETKEY_OPTION_S","Help":{"#cdata":"Causes a KEY= search always to begin at the top of the index for the data set that \nis being read."}},{"Name":"END=","Type":"SETSTATEMENT_OPTION_V","Help":{"#cdata":"Creates and names a temporary variable that contains an end-of-file indicator."}},{"Name":"KEY=","Type":"SETSTATEMENT_OPTION_V","Help":{"#cdata":"Provides nonsequential access to observations in a SAS data set, which are based \non the value of an index variable or a key."}},{"Name":"INDSNAME=","Type":"SETSTATEMENT_OPTION_V","Help":{"#cdata":"Creates and names a variable that stores the name of the SAS data set from which \nthe current observation is read."}},{"Name":"NOBS=","Type":"SETSTATEMENT_OPTION_V","Help":{"#cdata":"Creates and names a temporary variable whose value is usually the total number of \nobservations in the input data set or data sets."}},{"Name":"OPEN=","Type":"SETSTATEMENT_OPTION_V","Values":{"@Value1":"IMMEDIATE","@Value2":"DEFER"},"ToolTips":{"@ToolTip1":"Specifies to open any concatenated SAS data sets immidiately.","@ToolTip2":"Specifies to open any concatenated SAS data sets until they are ready to be processed."},"Help":{"#cdata":"[Syntax: OPEN=(IMMEDIATE | DEFER)] \n    \nAllows you to delay the opening of any concatenated SAS data sets until they are ready to be processed."}},{"Name":"POINT=","Type":"SETSTATEMENT_OPTION_V","Help":{"#cdata":"Specifies a temporary variable whose numeric value determines which observation is read. POINT= \ncauses the SET statement to use random (direct) access to read a SAS data set."}},{"Name":"_NUMERIC_","Type":"SPECIAL_SASKEYWORD","Help":{"#cdata":"Specifies all numeric variables that are already defined in the current DATA step."}},{"Name":"_CHARACTER_","Type":"SPECIAL_SASKEYWORD","Help":{"#cdata":"Specifies all character variables that are currently defined in the current DATA step."}},{"Name":"_ALL_","Type":"SPECIAL_SASKEYWORD","Help":{"#cdata":"In a DATA step, _ALL_ specifies all variables that are currently defined in the current DATA step. \nIn an ODS statement, it specifies all open ODS output destinations."}},{"Name":"FIRST.","Type":"SPECIAL_SASKEYWORD","Help":{"#cdata":"If you use a BY statement along with a set statement in a data step then SAS creates \ntwo automatic variables, FIRST.variable and LAST.variable, where variable is the \nname of the BY variable. The FIRST.variable has a value 1 for the first observation \nin the BY group and 0 for all other observations in the group."}},{"Name":"LAST.","Type":"SPECIAL_SASKEYWORD","Help":{"#cdata":"If you use a BY statement along with a set statement in a data step then SAS creates \ntwo automatic variables, FIRST.variable and LAST.variable, where variable is the name \nof the BY variable. The FIRST.variable has a value 1 for the first observation in the \nBY group and 0 for all other observations in the group. The LAST.variable has a value \nof 1 for the last observation in the BY group and 0 for all other observations in the \nBY group."}},{"Name":"ALTER=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Assigns an alter password to a SAS file and enables access to a password-protected \nSAS file."}},{"Name":"BUFNO=","Type":"DATASET_OPTION_V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"hexX","@Value4":"MIN","@Value5":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of buffers in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number of buffers in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number of buffers as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip4":"Sets the minimum number of buffers to 0, which causes SAS to use the minimum optimal value  for the operating environment. This is the default.","@ToolTip5":"Sets the number of buffers to the maximum possible number in your operating environment,  up to the largest four-byte, signed integer, which is 2³¹-1, or approximately 2 billion."},"Help":{"#cdata":"Specifies the number of buffers for processing a SAS data set."}},{"Name":"BUFSIZE=","Type":"DATASET_OPTION_V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"hexX","@Value6":"MIN","@Value7":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the page size in multiples of 1 (bytes). Replace n with an integer value.","@ToolTip2":"Specifies the number of buffers in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the page size in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the page size in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the page size as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip6":"Sets the page size of buffers to 0, which causes SAS to use the minimum  optimal value for the operating environment.  This is the default.","@ToolTip7":"Sets the page size to the maximum possible number in your operating environment,  up to the largest four-byte, signed integer, which is 2³¹-1, or approximately 2 billion."},"Help":{"#cdata":"Specifies a permanent buffer size for output SAS data sets."}},{"Name":"CNTLLEV=","Type":"DATASET_OPTION_V","Values":{"@Value1":"LIB","@Value2":"MEM","@Value3":"REC"},"ToolTips":{"@ToolTip1":"Specifies that concurrent access is controlled at the library level.  Library-level control restricts concurrent access to only one update process to the library.","@ToolTip2":"Specifies that concurrent access is controlled at the SAS data set (member) level.","@ToolTip3":"Specifies that concurrent access is controlled at the observation (record) level."},"Help":{"#cdata":"Specifies the level of shared access to SAS data sets."}},{"Name":"COMPRESS=","Type":"DATASET_OPTION_V","Values":{"@Value1":"NO","@Value2":"YES","@Value3":"CHAR","@Value4":"BINARY"},"ToolTips":{"@ToolTip1":"Specifies that the observations in a newly created SAS data set are uncompressed  (fixed-length records).","@ToolTip2":"Specifies that the observations in a newly created SAS data set are compressed  (variable-length records) by SAS using RLE (Run Length Encoding).","@ToolTip3":"Same as YES,  but COMPRESS=CHAR is only accepted by Version 7 and later versions.","@ToolTip4":"Specifies that the observations in a newly created SAS data set are compressed  (variable-length records) by SAS using RDC (Ross Data Compression)."},"Help":{"#cdata":"Compresses observations in an output SAS data set."}},{"Name":"DLDMGACTION=","Type":"DATASET_OPTION_V","Values":{"@Value1":"FAIL","@Value2":"ABORT","@Value3":"REPAIR","@Value4":"NOINDEX","@Value5":"PROMPT"},"ToolTips":{"@ToolTip1":"Stops the step, issues an error message to the log immediately. This is the default  for batch mode.","@ToolTip2":"Terminates the step, issues an error message to the log, and terminates the SAS session.","@ToolTip3":"Automatically repairs and rebuilds indexes and integrity constraints, unless the  data file is truncated. You use the REPAIR statement in PROC DATASETS to restore  a truncated data set. It issues a warning message to the log. This is the default  for interactive mode.","@ToolTip4":"Automatically repairs the data file without the indexes and integrity constraints,  deletes the index file, updates the data file to reflect the disabled indexes and  integrity constraints, and limits the data file to be opened only in INPUT mode.","@ToolTip5":"Displays a dialog box that asks you to select the FAIL, ABORT, REPAIR, or NOINDEX action."},"Help":{"#cdata":"Specifies what type of action to take when a SAS data set in a SAS data library is detected as damaged."}},{"Name":"ENCRYPT=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Encrypts the file using SAS Proprietary encryption. At a minimum, you must specify  the READ= or the PW= data set option at the same time that you specify ENCRYPT=YES.","@ToolTip2":"Does not encrypt the file."},"Help":{"#cdata":"Encrypts SAS data files."}},{"Name":"GENMAX=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Requests generations for a data set and specifies the maximum number of versions."}},{"Name":"GENNUM=","Type":"DATASET_OPTION_V","Help":{"#cdata":"References a specific generation of a data set."}},{"Name":"INDEX=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Defines indexes when a SAS data set is created."}},{"Name":"LABEL=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Specifies a label for the data set."}},{"Name":"OUTREP=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Specifies an operating environment's requirements vector for an output file."}},{"Name":"PW=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Assigns a read, write, or alter password to a SAS file and enables access to a \npassword-protected SAS file."}},{"Name":"PWREQ=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Specifies to display a dialog box.","@ToolTip2":"Prevents a dialog box from displaying.  If a missing or invalid password is entered, the data set is not opened and an error  message is written to the SAS log."},"Help":{"#cdata":"Controls the pop up of a requestor window for a data set password."}},{"Name":"READ=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Assigns a read password to a SAS file and enables access to a read-protected SAS file."}},{"Name":"REPEMPTY=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Specifies that a new empty data set with a given name replaces an existing data set  with the same name. This is the default.","@ToolTip2":"Specifies that a new empty data set with a given name does not replace an existing  data set with the same name."},"Help":{"#cdata":"Specifies whether a new, empty data set can overwrite an existing SAS data set that has the same name."}},{"Name":"REPLACE=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Specifies that a new data set with a given name replaces an existing data set with  the same name.","@ToolTip2":"Specifies that a new data set with a given name does not replace an existing data  set with the same name."},"Help":{"#cdata":"Specifies whether a new SAS data set that contains data can overwrite an existing \ndata set that has the same name."}},{"Name":"REUSE=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Tracks and reuses space in compressed SAS data sets.  New observations are inserted in the space that is freed when other observations are updated or deleted.","@ToolTip2":"Does not track and reuse space in compressed data sets.  New observations are appended to the existing data set."},"Help":{"#cdata":"Specifies whether new observations are written to free space in compressed SAS data sets."}},{"Name":"SPILL=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Creates a spill file for non-sequential processing of a DATA step view. This is the default.","@ToolTip2":"Does not create a spill file or reduces the size of a spill file."},"Help":{"#cdata":"Specifies whether to create a spill file for non-sequential processing of a DATA step view."}},{"Name":"SORTEDBY=","Type":"DATASET_OPTION_V","Values":{"@Value1":"by-clause < / collate-name>","@Value2":"_NULL_"},"ToolTips":{"@ToolTip1":"By-clause names the variables and options that you use in a BY statement in a PROC  SORT step. collate-name names the collating sequence that is used for the sort.","@ToolTip2":"Removes any existing sort indicator."},"Help":{"#cdata":"Specifies how the data set is currently sorted."}},{"Name":"TOBSNO=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Specifies the number of observations to be transmitted in each multi-observation \nexchange with a SAS server."}},{"Name":"TRANTAB=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Specifies a translation table for character conversions."}},{"Name":"TYPE=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Specifies the data set type for a specially structured SAS data set."}},{"Name":"WRITE=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Assigns a write password to a SAS file and enables access to a write-protected SAS file."}},{"Name":"FILECLOSE=","Type":"DATASET_OPTION_V","Values":{"@Value1":"DISP","@Value2":"LEAVE","@Value3":"REREAD","@Value4":"REWIND"},"ToolTips":{"@ToolTip1":"Positions the tape volume according to the disposition specified in the operating  environment's control language.","@ToolTip2":"Positions the tape at the end of the file that was just processed.  Use FILECLOSE=LEAVE if you are not repeatedly accessing the same files in a SAS program  but you are accessing one or more subsequent SAS files on the same tape.","@ToolTip3":"Positions the tape volume at the beginning of the file that was just processed.  Use FILECLOSE=REREAD if you are accessing the same SAS data set on tape several times in a SAS program.","@ToolTip4":"Rewinds the tape volume to the beginning.  Use FILECLOSE=REWIND if you are accessing one or more previous SAS files on the same tape,  but you are not repeatedly accessing the same files in a SAS program."},"Help":{"#cdata":"Specifies how a tape is positioned when a SAS file on the tape is closed."}},{"Name":"FIRSTOBS=","Type":"DATASET_OPTION_V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"hexX","@Value6":"MIN","@Value7":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of the first observation to process in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number of the first observation to process in multiples of 1,024  (kilobytes). Replace n with an integer value.","@ToolTip3":"Specifies the number of the first observation to process in multiples of 1,048,576  (megabytes). Replace n with an integer value.","@ToolTip4":"Specifies the number of the first observation to process in multiples of 1,073,741,824  (gigabytes). Replace n with an integer value.","@ToolTip5":"Specifies the number of the first observation to process as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip6":"Sets the number of the first observation to process to 1. This is the default.","@ToolTip7":"Sets the number of the first observation to process to the maximum number of  observations in the data set, up to the largest eight-byte, signed integer, which  is 2⁶³-1, or or approximately 9.2 quintillion observations."},"Help":{"#cdata":"Causes processing to begin at a specified observation."}},{"Name":"IN=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Creates a variable that indicates whether the data set contributed data to the current observation."}},{"Name":"OBS=","Type":"DATASET_OPTION_V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies a number to indicate when to stop processing observations in multiples  of 1 (bytes). Replace n with an integer value.","@ToolTip2":"Specifies the number of buffers in multiples of 1,024 (kilobytes). Replace n with  an integer value.","@ToolTip3":"Specifies a number to indicate when to stop processing observations in multiples  of 1,048,576 (megabytes). Replace n with an integer value.","@ToolTip4":"Specifies a number to indicate when to stop processing observations in multiples  of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies a number to indicate when to stop processing observations in multiples  of 1,099,511,627,776 (terabytes). Replace n with an integer value.","@ToolTip6":"Specifies the number to indicate when to stop processing observations as a hexadecimal  value. Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the number to indicate when to stop processing observations to 0. Use OBS=0  in order to create an empty data set that has the structure, but not the  observations, of another data set.","@ToolTip8":"Sets the number to indicate when to stop processing observations to the maximum  number of observations in the data set, up to the largest eight-byte, signed  integer, which is 2⁶³-1, or or approximately 9.2 quintillion observations.  This is the default."},"Help":{"#cdata":"Causes processing to end with the nth observation."}},{"Name":"POINTOBS=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Causes SAS software to produce a compressed data set that might be randomly accessed  by observation number. This is the default.","@ToolTip2":"Suppresses the ability to randomly access observations in a compressed data set by  observation number."},"Help":{"#cdata":"Controls whether a compressed data set may be processed with random access (by \nobservation number) rather than sequential access only."}},{"Name":"WHERE=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Selects observations that meet the specified condition."}},{"Name":"WHEREUP=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Evaluates added observations and modified observations against a WHERE expression. Specify WHEREUP=YES when you want any added observations or modified observations  to match a specified WHERE expression.","@ToolTip2":"Does not evaluate added observations and modified observations against a  WHERE expression."},"Help":{"#cdata":"Specifies whether to evaluate added observations and modified observations against \na WHERE expression."}},{"Name":"SGIO=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Specifies that SAS activate the scatter-read / gather-write feature for a SAS data set. The scatter-read / gather-write feature remains active until your SAS session ends.","@ToolTip2":"Specifies that SAS not activate the scatter-read/gather-write feature for the SAS data set."},"Help":{"#cdata":"Activates the Scatter/Gather I/O feature for a data set."}},{"Name":"IDXNAME=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Directs SAS to use a specific index to satisfy the conditions of a WHERE expression."}},{"Name":"IDXWHERE=","Type":"DATASET_OPTION_V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Tells SAS to choose the best index to optimize a WHERE expression, and to disregard  the possibility that a sequential search of the data set might be more resource- efficient.","@ToolTip2":"Tells SAS to ignore all indexes and satisfy the conditions of a WHERE expression with   a sequential search of the data set."},"Help":{"#cdata":"Overrides the SAS System decision about whether to use an index to satisfy the conditions \nof a WHERE expression."}},{"Name":"DROP=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Excludes variables from processing or from output SAS data sets."}},{"Name":"KEEP=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Specifies variables for processing or for writing to output SAS data sets."}},{"Name":"RENAME=","Type":"DATASET_OPTION_V","Help":{"#cdata":"Changes the name of a variable."}}],"#comment":[{},{},{},{},{}]}}