{"Keywords":{"Keyword":[{"Name":"ABEND","Type":"S","Help":{"#cdata":"Causes abnormal termination of the current SAS job or session. Results depend on \nthe method of operation: \n\no batch mode and noninteractive mode \n\n  o stops processing immediately\n  o sends an error message to the SAS log that states that execution was terminated by \n    the ABEND option of the ABORT statement\n  o does not execute any subsequent statements or check syntax\n  o returns control to the operating environment; further action is based on how your \n    operating environment and your site treat jobs that end abnormally.\n\no windowing environment and interactive line mode \n\n  o causes your windowing environment and interactive line mode to stop processing \n    immediately and return you to your operating environment."}},{"Name":"CANCEL","Type":"S","Help":{"#cdata":"Causes the execution of the submitted statements to be canceled. Results depend \non the method of operation: \n\no batch mode and noninteractive mode\n\n  o the entire SAS program and SAS system are terminated\n  o an error message is written to the SAS log\n\no windowing environment and interactive line mode \n\n  o clears only the current submitted program\n  o other subsequent submitted programs are not affected\n  o an error message is written to the SAS log\n\no workspace server and stored process server \n\n  o clears only the currently submitted program\n  o other subsequent submit calls are not affected\n  o an error message is written to the SAS log\n\no SAS IntrNet application server \n\n  o creates a separate execution for each request and submits the request code. \n    A CANCEL argument in the request code clears the current submitted code but \n    does not terminate the execution or the SAS session."}},{"Name":"CANCEL FILE","Type":"S","Help":{"#cdata":"Causes only the contents of the autoexec file or %INCLUDE file to be cleared by \nthe ABORT statement. Other submitted source statements will be executed after \nthe autoexec or %INCLUDE file."}},{"Name":"RETURN","Type":"S","Help":{"#cdata":"Causes the immediate normal termination of the current SAS job or session. Results \ndepend on the method of operation:\n\no batch mode and noninteractive mode \n\n  o stops processing immediately\n  o sends an error message to the SAS log stating that execution was terminated by the \n    RETURN option in the ABORT statement\n  o does not execute any subsequent statements or check syntax\n  o returns control to your operating environment with a condition code indicating an error \n\no windowing environment \n\n  o causes your windowing environment and interactive line mode to stop processing immediately\n    and return you to your operating environment."}},{"Name":"n","Type":"S","Help":{"#cdata":"Is an integer value that enables you to specify a condition code: \n    \n  o when used with the CANCEL argument, the value is placed in the SYSINFO automatic macro variable \n  o when not used with the CANCEL argument, the error code that is returned by SAS is ERROR. The value \n    of ERROR depends on the operating system. The condition code n is returned to the operating system \n    as the final SAS system exit code."}},{"Name":"NOLIST","Type":"S","Help":{"#cdata":"Suppresses the output of all variables to the SAS log. \n    \nRequirement: NOLIST must be the last option in the ABORT statement."}}]}}