{"Keywords":{"Keyword":[{"Name":"COLOR=","Type":"C","Help":{"#cdata":"[Syntax: COLOR=axis-color] \n    \nSpecifies the color for all axis components (the axis line, all tick marks, and all text) unless \nyou include a more explicit AXIS statement color specification."}},{"Name":"CTEXT=","Type":"C","Help":{"#cdata":"[Syntax: CTEXT=color] \n    \nSpecifies the color for all axis text (AXIS label and major tick mark value descriptions)."}},{"Name":"CAXIS=","Type":"C","Help":{"#cdata":"[Syntax: CAXIS=color] \n    \nSpecifies the color for axis line and major and minor tick marks."}},{"Name":"INTERVAL=","Type":"V","Values":{"@Value1":"EVEN","@Value2":"UNEVEN","@Value3":"PARTIAL"},"ToolTips":{"@ToolTip1":"Specifying the option INTERVAL=EVEN and LOGBASE=10 permits only base10 values to  be specified for the ORDER option.","@ToolTip2":"Specifying the option INTERVAL=UNEVEN and LOGBASE=10, permits non-base10 values  to be specified for the ORDER option, while retaining a logarithmic scale for  the axis.","@ToolTip3":"Alias for UNEVEN. They have the same effect."},"Help":{"#cdata":"The INTERVAL option affects the LOGBASE option in the AXIS statement."}},{"Name":"LABEL=","Type":"V","Help":{"#cdata":"[Syntax: LABEL=(text-argument(s)) | NONE] \n    \nModifies an axis label. Text-argument(s) defines the appearance or the text of an \naxis label, or both. NONE suppresses the axis label. Text-argument(s) can be one \nor more of these: \n\n\"text-string\" \nprovides up to 256 characters of label text. By default, the text of the axis label \nis either the variable name or a previously assigned variable label. Enclose each \nstring in quotes. Separate multiple strings with blanks.\n\ntext-description-suboption \nmodifies a characteristic such as the font, color, or size of the text string(s) \nthat follows it. Text-description-suboption can be:\n\n ANGLE=degrees \n \n COLOR=text-color \n \n FONT=font | NONE \n \n HEIGHT=text-height <units > \n \n JUSTIFY=LEFT | CENTER | RIGHT\n \n ROTATE=degrees"},"SubOptionsKeywords":"NONE|ANGLE=|COLOR=|HEIGHT=|JUSTIFY=|ROTATE="},{"Name":"LABEL=NONE","Type":"V","Help":{"#cdata":"Suppresses the axis label."}},{"Name":"LENGTH=","Type":"V","Help":{"#cdata":"[Syntax: LENGTH=axis length <units >] \n    \nSpecifies the length of the axis in number of units. If you request a length that \ncannot fit the display, a warning message is written to the log and your graph may \nproduce unexpected results."}},{"Name":"LOGBASE=","Type":"V","Values":{"@Value1":"<base>","@Value2":"E","@Value3":"PI"},"ToolTips":{"@ToolTip1":"Base must be greater than 1.","@ToolTip2":"Logbase=e (Logbase=2.718281828)","@ToolTip3":"Logbase=π (Logbase=3.141592653)"},"Help":{"#cdata":"Scales the axis values logarithmically according to the value specified. Base must \nbe greater than 1. The number of minor tick marks is a function of the logbase, \nand is calculated as the logbase minus 2."}},{"Name":"LOGSTYLE=","Type":"V","Values":{"@Value1":"EXPAND","@Value2":"POWER"},"ToolTips":{"@ToolTip1":"Specifies that the values displayed are the values of the base raised to successive  powers and that the minor tick marks are logarithmically placed.","@ToolTip2":"Specifies that the values displayed are the powers to which the base is raised (for  example, 1, 2, 3, 4, 5, and so on)."},"Help":{"#cdata":"Specifies whether the values displayed on the logarithmic axis are the values of the \nbase or the values of the power. LOGSTYLE= is meaningful only when you use LOGBASE=."}},{"Name":"MAJOR=NONE","Type":"V","Help":{"#cdata":"Suppresses all major tick marks, although the values represented by those tick marks \nare still displayed."}},{"Name":"MAJOR=","Type":"V","Help":{"#cdata":"[Syntax: MAJOR=(tick-mark-suboption(s) ) | NONE] \n    \nModifies the major tick marks. Tick-mark-suboption(s) defines the color, size, and \nnumber of the major tick marks."},"SubOptionsKeywords":"COLOR=|HEIGHT=|NUMBER=|WIDTH="},{"Name":"MINOR=","Type":"V","Help":{"#cdata":"[Syntax: MINOR=(tick-mark-suboption(s) ) | NONE] \n    \nModifies the minor tick marks that appear between major tick marks. Tick-mark-suboption(s) \ndefines the color, number, or size of the minor tick marks."},"SubOptionsKeywords":"COLOR=|HEIGHT=|NUMBER=|WIDTH="},{"Name":"MINOR=NONE","Type":"V","Help":{"#cdata":"Suppresses all minor tick marks."}},{"Name":"NOBRACKETS","Type":"S","Help":{"#cdata":"Suppresses the printing of group brackets drawn around the values on the group axis \nin a bar chart. NOBRACKETS applies only to the group axis of bar charts."}},{"Name":"NOPLANE","Type":"S","Help":{"#cdata":"Removes either the horizontal or vertical three-dimensional axis plane in bar charts \nproduced by the HBAR3D and VBAR3D statements. NOPLANE affects only the axis to which \nthe AXIS statement applies."}},{"Name":"OFFSET=","Type":"V","Help":{"#cdata":"[Syntax: OFFSET=(<n1><,n2>)<units > | (<n1<units>><,n2<units>>)] \n    \nSpecifies the distance from the first and last major tick marks or bars to the ends \nof the axis line.\n\nThe value of (n1) is the distance from the beginning (origin) of the axis line to the \nfirst tick mark or middle of the first bar. The value of (n2) is the distance from the \nend of the axis line to the last tick mark or middle of the last bar."}},{"Name":"ORDER=","Type":"V","Help":{"#cdata":"[Syntax: ORDER=(value-list)] \n    \nSpecifies the order in which data values appear on the axis. The values specified by \nthe ORDER= option are the major tick mark values. You can modify the appearance of \nthese values with the VALUE= option."}},{"Name":"ORIGIN=","Type":"V","Help":{"#cdata":"[Syntax: ORIGIN=(<x><,y>)<units> | (<x<units>><,y<units>>)] \n    \nSpecifies the x coordinate and the y coordinate of the origin of the axis. The origin \nof the horizontal axis is the left end of the axis, and the origin of the vertical axis \nis the bottom of the axis. The ORIGIN= option explicitly positions the axis anywhere on \nthe graphics output area."}},{"Name":"REFLABEL=","Type":"V","Help":{"#cdata":"[Syntax: REFLABEL=(text-argument(s)) | NONE] \n    \nCreates and defines the appearance of a reference-line label. Text-argument(s) \ndefines the appearance or the text of the label, or both."}},{"Name":"REFLABEL=NONE","Type":"V","Help":{"#cdata":"Suppresses the reference-line label."}},{"Name":"STAGGER","Type":"S","Help":{"#cdata":"Offsets the axis values on a horizontal axis. This option is useful when values \noverlap on an axis. When specifying the Java and ActiveX devices, the STAGGER \noption must sometimes be used in conjunction with the ORDER statement."}},{"Name":"SPLIT=","Type":"V","Help":{"#cdata":"[Syntax: SPLIT=\"split-char\"] \n    \nSpecifies the split character that the AXIS statement uses to break axis values \ninto multiple lines. Split-char can be any character value that can be specified \nin a SAS character variable. The split character must be embedded in the variable \nvalues in the data set or in an associated format."}},{"Name":"STYLE=","Type":"V","Help":{"#cdata":"[Syntax: STYLE=line-type] \n    \nSpecifies a line type for the axis line. Valid values for line-type are 0 through 46.\nIf you specify STYLE=0, the axis line is not drawn. The default is 1, a solid line."}},{"Name":"VALUE=","Type":"V","Help":{"#cdata":"[Syntax: VALUE=(text-argument(s) ) | NONE] \n    \nModifies the major tick mark values. That is, this option modifies the text that \nlabels the major tick marks on the axis. Text-argument(s) defines the appearance \nor the text of a major tick mark value, or both."}},{"Name":"VALUE=NONE","Type":"V","Help":{"#cdata":"Suppresses the major tick mark values, although the major tick marks are still displayed."}},{"Name":"WIDTH=","Type":"V","Help":{"#cdata":"[Syntax: WIDTH=thickness-factor] \n    \nSpecifies the thickness of the axis line. Thickness increases directly with the value \nof thickness-factor. By default, WIDTH=1."}}]}}