{"Keywords":{"#comment":[{},{},{},{},{},{},{}],"Keyword":[{"Name":"AUTHDOMAIN=","Type":"V","Help":{"#cdata":"Syntax: AUTHDOMAIN=authentication-domain | \"authentication-domain\"\n    \nSpecifies the name of an authentication domain object registered on the SAS Metadata Server \nthat associates user credentials with an identity."}},{"Name":"AUTHINFO=","Type":"V","Help":{"#cdata":"Syntax: AUTHINFO=authentication-info-file\n    \nSpecifies an authinfo or netrc file that includes authentication information.\n\nDefault: File $HOME/.authinfo on Linux hosts. \nNote: An authinfo file is required only when running batch jobs."}},{"Name":"DISCONNECT","Type":"S","Help":{"#cdata":"Disconnects SAS from the session.\n\nNote: The session name is preserved for use with the RECONNECT option.  \n\nTip: The TIMEOUT= value determines the lifetime of a disconnected session. The session time-out starts \nwhen the number of connections becomes zero and no actions are executing. After the time-out value expires, \nthe session is terminated."}},{"Name":"HOST=","Type":"V","Help":{"#cdata":"Syntax: HOST=\"host-name\"\n    \nSpecifies the machine for the control node of the server. \n\nDefault: Macro variable _CASHOST_, if set. Otherwise, SAS system option CASHOST.  \n\nInteraction: This option overrides macro variable _CASHOST_ and SAS system option CASHOST."}},{"Name":"PORT=","Type":"V","Help":{"#cdata":"Syntax: PORT=number\n    \nSpecifies the port on which the control node of the SAS Cloud Analytic Services server listens \nfor client connections. \n\nDefault: Macro variable _CASPORT_, if set. Otherwise, SAS system option CASPORT.  \n\nRange: 1-65535 \n\nInteraction: This option overrides macro variable _CASPORT_ and SAS system option CASPORT."}},{"Name":"RECONNECT","Type":"S","Help":{"#cdata":"Reconnects to a session using a session name.\n    \nTip:\nIf the session is not known to SAS, connect using the session UUID. Do not specify the RECONNECT keyword \nin that case. See UUID=\"session-uuid\"."}},{"Name":"TERMINATE|CLEAR","Type":"S","Help":{"#cdata":"Syntax: TERMINATE|CLEAR\n    \nTerminates the SAS Cloud Analytic Services session.\n\nNote When you terminate the last session that was created, SAS system option CASNAME (alias SESSREF) \n  and macro variable _SESSREF_ are not updated. They continue to reference the terminated session until \n  a new session is created or they are manually set. See CASNAME= System Option. \n\nTip: Use _ALL_ instead of session-name to terminate all of the sessions in your SAS client."}},{"Name":"USER=|CASUSER=","Type":"V","Help":{"#cdata":"Syntax: USER=user-ID | CASUSER=user-ID\n\nSpecifies the user ID to use for connecting to the SAS Cloud Analytic Services server.\n\nDefault: SAS system option CASUSER=, if set. \n\nRequirement: User-ID must match a user ID in your authinfo file. \n\nInteraction: This option overrides SAS system option CASUSER=.\n\nNote:\nWhen you use SAS Studio, the user credentials that you used to sign on are used to authenticate \nyour connection to CAS. The USER= option is not needed in that case. The USER= option or SAS \nsystem option CASUSER= is used when submitting code to CAS from the command line, in batch mode."}},{"Name":"UUID=","Type":"V","Help":{"#cdata":"Syntax: UUID=\"session-uuid\"\n    \nSpecifies the UUID of an existing session to which you want to connect.\n\nRequirements: session-uuid must be 36 characters in length and must be enclosed in quotation marks.  \n  You must also specify the HOST= and PORT= options to connect to a session.  \n  \nTip: You can view the UUID for a session with the LIST command option."}},{"Name":"UUIDMAC=","Type":"V","Help":{"#cdata":"Syntax: UUIDMAC=macro-variable-name\n    \nSpecifies a SAS macro variable name into which the UUID of the session is stored.\n\nTip: The UUIDMAC= option is useful if you want subsequent SAS steps to connect to the session by specifying the UUID."}},{"Name":"LIST","Type":"S","Help":{"#cdata":"Writes to the SAS log information about a session in your SAS client. The information includes the session \nname, the session state, the host and port of the SAS Cloud Analytic Services server to which it is \nconnected, and the session UUID.\n\nNote: The server is not accessed for the information. \nTips: Use _ALL_ instead of session-name to list information about all of the sessions in your SAS client.  \n\n      To list information about all of the sessions in all of your SAS clients, use LISTSESSIONS."}},{"Name":"LISTHISTORY","Type":"S","Help":{"#cdata":"Syntax: LISTHISTORY <history_count | _ALL_> \n    \nPrints to the SAS log the action history for the current session.\n\nhistory_count\n  specifies the number of the most recent actions that are to be listed. \nRange: 0–1999999999\nNote: 0 is equivalent to _ALL_\n\n_ALL_\n  lists all of the actions that have been executed in the current session. \n  \nDefault:\nLists the last 10 actions that were executed in the current session. "},"SubOptionsKeywords":"_ALL_"},{"Name":"LISTSESSIONS","Type":"S","Help":{"#cdata":"Writes to the SAS log information about all of the current user's sessions that are known to the SAS Cloud Analytic \nServices server. The information includes the session name, the session UUID, the session state, \nthe method that was used for user authentication, and the user ID.\n\nRequirement: A connection to a session is required to use the LISTSESSIONS option.  \n\nExample:  Use session Casauto to list all of your sessions.\n\n          cas casauto listsessions;\n\n          For each session that is found, a note containing information about that session is written to \n          the SAS log."}},{"Name":"LISTSESSOPTS","Type":"S","Help":{"#cdata":"Lists the session options. \n    \nExample: List the session option settings for session Casauto:\n\n  cas casauto LISTSESSOPTS;"}},{"Name":"SESSOPTS=","Type":"V","Help":{"#cdata":"Syntax: SESSOPTS=(session-option(s)) \n\nSpecifies one or more session options as option=value pairs separated by a space and enclosed in \nparentheses. You can specify the following session options:\n\n  APPTAG= specifies the string to prefix to log messages.\n  AUTOCORRECT= automatically corrects misspelled procedure names and keywords, and global statement names.\n  CASLIB= specifies the caslib name to set as the active caslib.\n  COMPOPT= specifies the type of code generation optimizations to use in the SAS language compiler.\n  COLLATE= specifies the collating sequence for sorting.\n  DATASTEPFMTERR= specifies how the DATA step reacts when SAS cannot find a specified variable format.\n  DATASTEPMSGSUMLEVEL= specifies the DATA step message summary level.\n  DATASTEPREPLACETABLE= specifies whether a DATA step can replace an existing table.   \n  DATASTMTCHK= specifies which SAS statement keywords are prohibited from being specified as a one-level \n    DATA step name to protect against overwriting an input data set. \n  DKRICOND= specifies the error level to report when a variable is missing from an input data set during \n    the processing of a DROP=, KEEP=, or RENAME= data set option.\n  DKROCOND= specifies the error level to report when a variable is missing from an output data set during \n    the processing of a DROP=, KEEP=, or RENAME= data set option. \n  DQLOCALE specifies the default 5-letter SAS Quality Knowledge Base (QKB) ISO locale code to use as the \n    default locale for data quality (DQ) operations. \n  DQSETUPLOC specifies the name of the default SAS Quality Knowledge Base (QKB) to use for data quality operations.\n  ERRORS= specifies the maximum number of observations for which SAS issues complete error messages. \n  EVENTDS specifies one or more data sets that define events.\n  FMTCASLIB specifies the caslib where persisted format libraries are retained. \n  INVALIDDATA= specifies the value that SAS assigns to a variable when invalid numeric data is encountered.\n  INTERVALDS specifies one or more interval-name=value pairs, where the value is the name of a data set that \n    contains user-defined intervals.\n  LOCALE= specifies the locale to use for sorting and formatting.\n  LOGFLUSHTIME= specifies the log flush time, in milliseconds. \n  MAXTABLEMEM= specifies the maximum amount of physical memory, in bytes, to allocate for a table.\n  MESSAGELEVEL= specifies the log message level.\n  METRICS= specifies whether to include detailed performance metrics reports in the SAS log. \n  NWORKERS= specifies the number of worker nodes for a new session.\n  TIMEOUT= specifies the SAS Cloud Analytic Services session time-out in seconds for a new or existing session.\n  TIMEZONE= specifies the time zone offset, in hours, from UTC."},"SubOptionsKeywords":"\n      |APPTAG=|AUTOCORRECT=|CASLIB=|COLLATE=|DATASTEPREPLACETABLE=|DATASTMTCHK=|DKRICOND=|DKROCOND=|ERRORS=|FMTCASLIB|\n      |INVALIDDATA=|LOCALE=|LOGFLUSHTIME=|MAXTABLEMEM=|MESSAGELEVEL=|METRICS=|NWORKERS=|TIMEOUT=|TIMEZONE=|VARINITCHK=|\n      |DATASTEPMSGSUMLEVEL=|DATASTEPFMTERR=|DQLOCALE|DQSETUPLOC|EVENTDS|INTERVALDS|\n    "},{"Name":"ADDFMTLIB","Type":"S","Help":{"#cdata":"Syntax: ADDFMTLIB FMTLIBNAME=format-library-name TABLE=table-name <CASLIB=caslib> \n    <POSITION=APPEND | INSERT | REPLACE | NONE> <PROMOTE> <REPLACEFMTLIB>\nSyntax: ADDFMTLIB FMTLIBNAME=format-library-name PATH=path <POSITION=APPEND | INSERT | REPLACE | NONE> \n    <PROMOTE> <REPLACEFMTLIB>\n    \nAdds a session format library. By default, the format library is appended to the format library search list.\n    \nExample: cas mysess ADDFMTLIB fmtlibname=myfmtlib caslib=name table=name ; \n\n  o FMTLIBNAME= specifies the name of the format library to save. This option is required. \n  o CASLIB= specifies the name of the caslib where the table is saved. \n  o TABLE= specifies the name of the table where the format library is saved. \n  o POSITION=APPEND | INSERT | REPLACE | NONE\n      specifies the position of this format library in the format-library search list.\n  o PATH= specifies the name of the file where the format information is saved.  \n  o PROMOTE promotes the format library to global scope so that it is available to all sessions.\n  o REPLACEFMTLIB replaces the format library if it already exists."}},{"Name":"DROPFMTLIB","Type":"S","Help":{"#cdata":"Syntax: DROPFMTLIB FMTLIBNAME=format-library-name <FMTSEARCHREMOVE>\n    \nDrops a session-local or a global format library.     \n\nFMTLIBNAME=format-library-name\n  specifies the name of the format library to drop. This option is required. \n\nFMTSEARCHREMOVE\n  removes the format library from the format search order. \n\nTip: If a session-local and a global format library exist, the local format library is dropped first. \nTo drop the global format library in that case, execute the drop command again. "}},{"Name":"FMTSEARCH=","Type":"V","Help":{"#cdata":"Syntax: FMTSEARCH=(name1 <name2 ... nameN>) <POSITION=APPEND | INSERT | REPLACE>\n\nModifies the format library search order for the session.\n\n(name1 <name2 ... nameN>) \n  specifies a list of one or more format-library names enclosed in parentheses. Each name is separated by a space. \n\nPOSITION=APPEND | INSERT | REPLACE\n  specifies the position of the format libraries in the format-library search list. \n\n  APPEND appends the format libraries to the end of the format-library search list.  \n  INSERT inserts the format libraries at the beginning of the format-library search list.  \n  REPLACE replaces the current format-library search list with the specified format libraries.  \n\n  Default: APPEND"}},{"Name":"FMTSEARCH CLEAR","Type":"S","Help":{"#cdata":"Clears the format library search list for the session.\n    \nExample: Clear the format search list for session Casauto:\n\n  cas casauto fmtsearch clear;"}},{"Name":"LISTFMTRANGES","Type":"S","Help":{"#cdata":"Syntax: LISTFMTRANGES FMTNAME=format-name\n\nLists the ranges and labels for a format.\n\n  FMTNAME=format-name\n    specifies the name of the format to list. This option is required. The format libraries are searched \n    in the format-library search order. The ranges are listed for the first instance of format-name that \n    is found. \n\n  Example:  List the ranges in format MYFORMAT:\n  \n            cas casauto listfmtranges fmtname=myformat;"}},{"Name":"LISTFMTSEARCH","Type":"S","Help":{"#cdata":"Displays the format library search list for the session.\n\nExample:  List the format library search order for session Casauto:\n\n          cas casauto listfmtsearch;"}},{"Name":"LISTFORMATS","Type":"S","Help":{"#cdata":"Syntax: LISTFORMATS <FMTLIBNAME=format-library-name> <SCOPE=BOTH | SESSION | GLOBAL> <MEMBERS>\n\nLists the user-defined format libraries that are known to SAS.\n\n  FMTLIBNAME=format-library-name\n    specifies the name of the format library. If FMTLIBNAME= is not specified, all of the format libraries \n    that are known to SAS are listed. \n\n  SCOPE=BOTH | SESSION | GLOBAL\n    specifies the scope.\n\n    BOTH lists both SESSION and GLOBAL format libraries that are known to SAS.  \n    SESSION lists the format libraries that are known to SAS. \n    GLOBAL lists the format libraries that are known globally to all SAS sessions.  \n\n    Default: SESSION \n  \n  MEMBERS\n    lists the names of the members in each format library. \n\n  Example:  List the global and session-local formats and their members for session Casauto:\n          \n            cas casauto listformats scope=both members;"}},{"Name":"LOADFORMATS","Type":"S","Help":{"#cdata":"Syntax: LOADFORMATS <FMTLIBNAME=format-library-name> <PATH=\"path-to-item-store-file\"> <PROMOTE> <REPLACE> <FMTSEARCH=APPEND | INSERT | REPLACE | NONE>\n\nLoads user-defined formats from a format item store that was created with the FMTC2ITM procedure.\n\n  FMTLIBNAME=format-library-name\n    specifies the name of the format library that is being added to the session.\n  PATH=\"path-to-item-store-file\" \n    specifies the name of the file where the item store is saved. \n  PROMOTE\n    promotes the format library to global scope.\n  REPLACE \n    if format-library-name already exists in the active session, replaces it with the new format-library-name.\n  FMTSEARCH=APPEND | INSERT | REPLACE | NONE\n    specifies how the new format library impacts the format library search order. "}},{"Name":"PROMOTEFMTLIB","Type":"S","Help":{"#cdata":"Syntax: PROMOTEFMTLIB FMTLIBNAME=format-library-name <REPLACE>\n\nPromotes a session-local format library to a global format library.\n\n  FMTLIBNAME=format-library-name\n    specifies the name of the format library. This option is required. \n\n  REPLACE \n    replaces the format library if it is already promoted. \n\nExample: Promote session-local format library MYFMTLIB in session Casauto:\n\n    cas casauto promote fmtlibname=myfmtlib;"}},{"Name":"SAVEFMTLIB","Type":"S","Help":{"#cdata":"Syntax: SAVEFMTLIB FMTLIBNAME=format-library-name <<<TABLE=table-name> <CASLIB=caslib> <REPLACE>> | <PATH=path>> <PROMOTE> \n\nSaves a session format library to a CAS table or to a file.    \n\n  FMTLIBNAME=format-library-name\n    specifies the name of the format library to save. This option is required. \n  TABLE=table-name\n    specifies the name of the table in which the format library is saved. \n    Note: Do not specify this option with PATH=. \n  CASLIB=caslib\n    specifies the caslib in which the table is stored. \n    Note:This option is ignored when PATH= is specified. \n  REPLACE\n    replaces the table if it already exists. \n    Note: This option is ignored when PATH= is specified. \n  PATH=path\n    specifies the name of the file to which the format library is to be saved.\n  PROMOTE\n    promotes the format library to global scope so that it is available to all sessions."}},{"Name":"CASSERVERMD=","Type":"V","Help":{"#cdata":"Syntax: CASSERVERMD=server-name | \"server-name\" \n    \nSpecifies the name of a server object registered on the SAS Metadata Server that associates \nSAS Cloud Analytic Services connection parameters with a server name.\n\nValid in SAS 9.4M5 and in later releases.\n\nRequirements:\nThe metadata system options must specify the connection parameters for the metadata server \n  on which server-name is registered, and the metadata server must be running. \nThe server-name registration on the SAS Metadata Server must define the CAS server port,\n  host name, and authentication domain. \n\nInteraction:\nCAS statement options HOST=, PORT=, and USER=, and system options CASHOST=, CASPORT=, \nand CASUSER= are ignored when this option is specified. "}},{"Name":"LISTABOUT","Type":"S","Help":{"#cdata":"Writes information about SAS Cloud Analytic Services to the SAS log."}},{"Name":"LISTSERVERSTARTOPTS|LISTSSO","Type":"S","Help":{"#cdata":"Syntax: LISTSERVERSTARTOPTS | LISTSSO\n    \nLists the SAS Cloud Analytic Services server options and their current values. For each option, a note containing information about the option is written to the SAS log. The information includes the option name, option value type, current option value, value range (when applicable), and value source, as shown in the following example.\n\n  NOTE: Name = errors\n         Type = INT RANGE\n         Value = 20\n         Minimum = 0\n         Maximum = 2147483647\n         Source = default\n\nRestriction You must have administration privileges to use this option."}},{"Name":"POSITION=","Type":"V","Values":{"@Value1":"APPEND","@Value2":"INSERT","@Value3":"REPLACE","@Value4":"NONE"},"ToolTips":{"@ToolTip1":"Appends this format library to the end of the format-library search list.","@ToolTip2":"Inserts this format library at the beginning of the format-library search list.","@ToolTip3":"Replaces the current format-library search list with this format library.","@ToolTip4":"Does not add this format library to the format-library search list."},"Help":{"#cdata":"[Sub-option for ADDFMTLIB, FMTSEARCH= options] \n    \nSpecifies how the format library search result for the session is presented."}},{"Name":"FMTLIBNAME=","Type":"V","Help":{"#cdata":"[Sub-option for ADDFMTLIB, DROPFMTLIB, LISTFORMATS, PROMOTEFMTLIB, SAVEFMTLIB options]\n    \nName of format library to drop, list, promote, or save."}},{"Name":"FMTSEARCHREMOVE","Type":"S","Help":{"#cdata":"[Sub-option for DROPFMTLIB option]\n    \nRemoves the format library from the format search."}},{"Name":"SCOPE=","Type":"V","Values":{"@Value1":"SESSION","@Value2":"GLOBAL","@Value3":"BOTH"},"ToolTips":{"@ToolTip1":"Lists the format libraries that are known to SAS.","@ToolTip2":"Lists the format libraries that are known globally to all SAS sessions.","@ToolTip3":"Lists both SESSION and GLOBAL format libraries that are known to SAS."},"Help":{"#cdata":"[Sub-option for LISTFORMATS option]\n    \nSpecifies the scope.\n\n  BOTH lists both SESSION and GLOBAL format libraries that are known to SAS.  \n  SESSION lists the format libraries that are known to SAS. \n  GLOBAL lists the format libraries that are known globally to all SAS sessions.  \n\nDefault: SESSION"}},{"Name":"MEMBERS","Type":"S","Help":{"#cdata":"[Sub-option for LISTFORMATS option]\n    \nLists the names of the members in each format library."}},{"Name":"REPLACE","Type":"S","Help":{"#cdata":"[Sub-option for PROMOTEFMTLIB and SAVEFMTLIB options]\n    \nIf the format library is already promoted, replace."}},{"Name":"CASLIB=","Type":"V","Help":{"#cdata":"Syntax: CASLIB=caslib\n    \n[Sub-option for ADDFMTLIB, SAVEFMTLIB options]\n    \nName of the CAS library where a table is saved."}},{"Name":"TABLE=","Type":"V","Help":{"#cdata":"Syntax: TABLE=table-name\n    \n[Sub-option for ADDFMTLIB, SAVEFMTLIB options]\n    \nSpecifies the name of the table where the format library is saved. \n\nNote: Do not specify this option with PATH=."}},{"Name":"PATH=","Type":"V","Help":{"#cdata":"[Sub-option for ADDFMTLIB option]\n    \nName of xml file where format information is saved."}},{"Name":"PROMOTE","Type":"S","Help":{"#cdata":"[Sub-option for ADDFMTLIB and SAVEFMT options] \n    \nPromotes the format library to global scope so that it is available to all sessions."}},{"Name":"REPLACEFMTLIB","Type":"S","Help":{"#cdata":"[Sub-option for ADDFMTLIB option] \n    \nIf the format library already exists, replace it."}},{"Name":"FMTNAME=","Type":"V","Help":{"#cdata":"[Sub-option for LISTFMTRANGES option]\n    \nName of the format."}},{"Name":"_ALL_","Type":"S","Help":{"#cdata":"[Valid only with the LIST, LISTHISTORY, TERMINATE, or CLEAR options]\n    \nSpecifies that the LIST, LISTHISTORY, TERMINATE or CLEAR argument applies to all sessions in the SAS client."}}]}}