{"Keywords":{"Keyword":[{"Name":"DATASOURCE=","Type":"RV","Help":{"#cdata":"Syntax: DATASOURCE= (SRCTYPE=\"type\", <data-source-options>, <ENCRYPTIONPASSWORD=\"string\">) \n\nSpecifies data source options to use when connecting to a data source. The SRCTYPE=\"type\" option specifies \nthe data source type. Data sources can be either databases or path-based. The data-source-options syntax \ndepends on the data source. \n\n  ENCRYPTIONPASSWORD=\"string\" \n    specifies a password for encrypting or decrypting stored data. \n\n    Restriction: The ENCRYPTIONPASSWORD= option can be specified only with the DATASOURCE= option. \n\n  SRCTYPE= PATH | DNFS | HDFS"},"SubOptionsKeywords":"ENCRYPTIONPASSWORD=|SRCTYPE="},{"Name":"ASSIGN","Type":"S","Help":{"#cdata":"Used with the _ALL_ option to create SAS librefs for existing caslibs so that they are visible in the \nSAS Studio Libraries tree. \n\nRequirement: The ASSIGN option must be used with the _ALL_ option."}},{"Name":"_ALL_","Type":"S","Help":{"#cdata":"[Valid only with the ASSIGN, DROP or LIST options]\n    \nSpecifies that the ASSIGN, or LIST argument applies to all currently added caslibs."}},{"Name":"CREATEDIRECTORY|CREATEDIR","Type":"S","Help":{"#cdata":"Creates a subdirectory in the caslib's data source. The path, up to the last directory, must already exist.  \n    \nRestriction:\nDirectory creation is available only for global caslibs.\n\nExample:\nThe following CASLIB statement creates a new directory named Programs in the /examples/caslibs/ directory:\n\n  caslib TestDir path=\"/examples/caslibs/programs\" \n                          datasource=(srctype=\"path\") createdir global;"}},{"Name":"DESCRIPTION=|DESC=","Type":"V","Help":{"#cdata":"Syntax: DESCRIPTION=\"description\" | DESC=\"description\" \n    \nSpecifies a description of the data source."}},{"Name":"GLOBAL","Type":"S","Help":{"#cdata":"Adds the caslib so that it has global scope. A global-scope caslib can have access controls set so \nthat it is accessible from all sessions and can be a way to share data. Other connections to the \nserver that get their own sessions have access to the caslib, subject to access controls. If you \ndo not specify GLOBAL, the caslib is created with session scope. You must also grant access to the \ncaslib in the CAS Server Monitor."}},{"Name":"LIBREF=","Type":"V","Help":{"#cdata":"Creates a libref and associates it with a caslib. The libref can then be used to access data in \nSAS Cloud Analytic Services. \n\nExample:\nThe following CASLIB statement creates the caslib Casdata and binds it to the libref Mycas.\n\n  caslib casdata path='/cas/mycasdata/' libref=mycas;"}},{"Name":"LIST","Type":"S","Help":{"#cdata":"Displays caslib names and their specifications. To display all caslibs, specify _ALL_ for the caslib-reference-name. \n    \nTip:\nSpecify caslib-reference-name to list the settings for a single caslib. Specify _ALL_ to list all caslibs \nand their caslib settings. The specifications displayed by the LIST _ALL_ option are a subset. For full \nspecification information, use the LIST option with a specific caslib specified."}},{"Name":"NOTACTIVE","Type":"S","Help":{"#cdata":"Specifies that the caslib being added does not become the active caslib for the session. "}},{"Name":"PATH=","Type":"V","Help":{"#cdata":"Syntax: PATH=\"directory-path\"\n    \nSpecifies the fully qualified path to a directory to use as a data source. \n\nExample The following CASLIB statement adds a caslib that accesses a path-based directory:\n\n    caslib mylib path=\"/local/data\" description=\"Local data\";"}},{"Name":"SESSION|LOCAL","Type":"S","Help":{"#cdata":"Syntax: SESSION | LOCAL\n    \nAdds the caslib so that it is session-scope. Other connections to the server that get their own \nsessions do not have access to the caslib. The lifetime of the caslib is the lifetime of the session. \nWhen you add caslibs, SESSION is the default."}},{"Name":"SESSREF=","Type":"V","Help":{"#cdata":"Syntax: SESSREF=session-reference\n    \nSpecifies the name of the session to associate the caslib with. By default, the most recently started \nsession is used."}},{"Name":"SUBDIRS","Type":"S","Help":{"#cdata":"Specifies that subdirectories of the specified PATH= directory can be accessed with the caslib. \n\nTip: You do not need to use the SUBDIRS option if the full path to the subdirectory is specified."}}],"#comment":{}}}