{"Keywords":{"Keyword":[{"Name":"LOG","Type":"S","Help":{"#cdata":"Is a reserved fileref that directs the output that is produced by any PUT statements \nto the SAS log."}},{"Name":"DISK","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies that the device is a disk drive."}},{"Name":"DUMMY","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies that the output to the file is discarded. \n\nTip: Specifying DUMMY can be useful for testing."}},{"Name":"GTERM","Type":"S","Help":{"#cdata":"[device-type] \n    \nIndicates that the output device type is a graphics device that will receive \ngraphics data."}},{"Name":"PIPE","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies an unnamed pipe. Note: Some operating environments do not support pipes."}},{"Name":"PLOTTER","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies an unbuffered graphics output device."}},{"Name":"PRINTER","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies a printer or printer spool file."}},{"Name":"TAPE","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies a tape drive."}},{"Name":"TEMP","Type":"S","Help":{"#cdata":"[device-type] \n    \nCreates a temporary file that exists only as long as the filename is assigned. \n    \nRestriction: Do not specify a physical pathname. If you do, SAS returns an error."}},{"Name":"TERMINAL","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies the user's terminal."}},{"Name":"UPRINTER","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies a Universal Printing printer definition name."}},{"Name":"COLUMN=|COL=","Type":"V","Help":{"#cdata":"Specifies a variable that SAS automatically sets to the current column location \nof the pointer."}},{"Name":"DELIMITER=|DLM=","Type":"V","Help":{"#cdata":"Specifies an alternate delimiter (other than a blank) to be used for LIST output."}},{"Name":"DLMSTR=","Type":"V","Help":{"#cdata":"Specifies a character string as an alternate delimiter (other than a blank) to be \nused for LIST output"}},{"Name":"DLMSOPT='T'","Type":"V","Help":{"#cdata":"Specifies a parsing option for the DLMSTR= T option that removes trailing blanks of the \nstring delimiter."},"Values":{"@Value1":"'T'"},"ToolTips":{"@ToolTip1":"Removes trailing blanks of the string delimiter."}},{"Name":"DROPOVER","Type":"S","Help":{"#cdata":"Discards data items that exceed the output line length (as specified by the LINESIZE= \nor LRECL= options in the FILE statement)."}},{"Name":"DSD","Type":"S","Help":{"#cdata":"Specifies that data values that contain embedded delimiters, such as tabs or commas, \nbe enclosed in quotation marks."}},{"Name":"ENCODING=","Type":"V","Values":{"@Value1":"'warabic'","@Value2":"'wbaltic'","@Value3":"'wlatin2'","@Value4":"'wcyrillic'","@Value5":"'wgreek'","@Value6":"'whebrew'","@Value7":"'wturkish'","@Value8":"'wvietnamese'","@Value9":"'wlatin1'","@Value10":"'utf-8'","@Value11":"'ms-950'","@Value12":"'ms-936'","@Value13":"'ms-932'","@Value14":"'ms-949'"},"ToolTips":{"@ToolTip1":"Arabic","@ToolTip2":"Baltic","@ToolTip3":"Central Europe","@ToolTip4":"Cyrillic","@ToolTip5":"Greek","@ToolTip6":"Hebrew","@ToolTip7":"Turkish","@ToolTip8":"Vietnamese","@ToolTip9":"Western","@ToolTip10":"Unicode encoding","@ToolTip11":"Traditional Chinese","@ToolTip12":"Simplified Chinese","@ToolTip13":"Japanese","@ToolTip14":"Korean"},"Help":{"#cdata":"Specifies the encoding to use when writing to the output file."}},{"Name":"FILENAME=","Type":"V","Help":{"#cdata":"Defines a character variable, whose name you supply, that SAS sets to the value of the \nphysical name of the file currently open for PUT statement output."}},{"Name":"FILEVAR=","Type":"V","Help":{"#cdata":"Defines a variable whose change in value causes the FILE statement to close the current \noutput file and open a new one the next time the FILE statement executes."}},{"Name":"FLOWOVER","Type":"S","Help":{"#cdata":"Causes data that exceeds the current line length to be written on a new line."}},{"Name":"FOOTNOTES|FOOTNOTE","Type":"S","Help":{"#cdata":"Specifies that the currently defined footnotes are printed."}},{"Name":"NOFOOTNOTES|NOFOOTNOTES","Type":"S","Help":{"#cdata":"Specifies that the currently defined footnotes are not printed."}},{"Name":"HEADER=","Type":"V","Help":{"#cdata":"Defines a statement label that identifies a group of SAS statements that you want \nto execute each time SAS begins a new output page"}},{"Name":"LINE=","Type":"V","Help":{"#cdata":"Defines a variable whose value is the current relative line number within the group \nof lines available to the output pointer."}},{"Name":"LINESIZE=|LS=","Type":"V","Help":{"#cdata":"Sets the maximum number of columns per line for reports and the maximum record length \nfor data files."}},{"Name":"LINESLEFT=|LL=","Type":"V","Help":{"#cdata":"Defines a variable whose value is the number of lines left on the current page."}},{"Name":"LRECL=","Type":"V","Help":{"#cdata":"Specifies the logical record length of the output file."}},{"Name":"MOD","Type":"S","Help":{"#cdata":"Writes the output lines after any existing lines in the file."}},{"Name":"N=","Type":"V","Help":{"#cdata":"Specifies the number of lines that you want available to the output pointer in the \ncurrent iteration of the DATA step."},"Values":{"@Value1":"<n>","@Value2":"PAGESIZE|PS"},"ToolTips":{"@ToolTip1":"Specifies the number of lines that are available to the output pointer. Replace n  with an integer.","@ToolTip2":"Specifies that the entire page is available to the output pointer."}},{"Name":"ODS=","Type":"S|V","Help":{"#cdata":"[Syntax: ODS < = (ODS-suboptions) >] \n    \nSpecifies to use the Output Delivery System to format the output from a DATA step."}},{"Name":"OLD","Type":"S","Help":{"#cdata":"Replaces the previous contents of the file."}},{"Name":"PAD","Type":"S","Help":{"#cdata":"Specifies that records written to an external file are padded with blanks to the \nlength that is specified in the LRECL= option."}},{"Name":"NOPAD","Type":"S","Help":{"#cdata":"Specifies that records written to an external file are not padded with blanks to the \nlength that is specified in the LRECL= option."}},{"Name":"PAGESIZE=|PS=","Type":"V","Help":{"#cdata":"[Syntax: PAGESIZE=value] \n    \nSets the number of lines per page for your reports."}},{"Name":"PRINT","Type":"S","Help":{"#cdata":"Either a reserved fileref that directs the output that is produced by any PUT statements \nto the same file as the output that is produced by SAS procedures, or an option that \nspecifies that carriage-control characters are placed in the output lines."}},{"Name":"NOPRINT","Type":"S","Help":{"#cdata":"Specifies that carriage-control characters are placed in the output lines."}},{"Name":"STOPOVER","Type":"S","Help":{"#cdata":"Stops processing the DATA step immediately if a PUT statement attempts to write a \ndata item that exceeds the current line length."}},{"Name":"TITLES|TITLE","Type":"S","Help":{"#cdata":"Specifies that the current title lines are printed on the pages of files."}},{"Name":"NOTITLES|NOTITLE","Type":"S","Help":{"#cdata":"Specifies that the current title lines are not printed on the pages of files."}},{"Name":"_FILE_=","Type":"V","Help":{"#cdata":"[Syntax: _FILE_=variable] \n    \nNames a character variable that references the current output buffer of this FILE statement."}},{"Name":"BLKSIZE=|BLK=","Type":"V","Help":{"#cdata":"[Syntax: BLKSIZE=block-size] \n    \n[Windows Host Option]\n\nSpecifies the number of bytes that are physically read or written in an I/O operation. \nThe default is 8K. The maximum is 1M (Windows) or 1G-1(UNIX). \n\nIn UNIX, if you specify RECFM=S370VBS, then you should specify BLKSIZE=32760 in order \nto avoid errors with records longer than 255 characters."}},{"Name":"BLOCK","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates whether the client \nis to wait if no data is currently available. BLOCK is the default value."}},{"Name":"NOBLOCK","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates whether the client \nis to wait if no data is currently available. BLOCK is the default value."}},{"Name":"BYTE","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates the type of pipe. \nBYTE is the default value."}},{"Name":"MESSAGE","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates the type of pipe. \nBYTE is the default value."}},{"Name":"COMMAND","Type":"S","Help":{"#cdata":"[Windows Host Option]\n    \nAllows remote commands to be issued to DDE server applications that not use the \nSYSTEM topic name."}},{"Name":"EOFCONNECT","Type":"S","Help":{"#cdata":"[Windows Host Option] \n    \nIs used only in the context of named pipes and is valid only when you are defining \nthe server. This option indicates that if an end-of-file (EOF) character is \nreceived from a client, the server should try to connect to the next client."}},{"Name":"HOTLINK","Type":"S","Help":{"#cdata":"[Windows Host Option] \n    \nInstructs SAS to use the DDE HOTLINK."}},{"Name":"NOTAB","Type":"S","Help":{"#cdata":"[Windows Host Option] \n    \nInstructs SAS to ignore tab characters between variables."}},{"Name":"IGNOREDOSEOF","Type":"S","Help":{"#cdata":"[Windows Host Option] \n    \nIs used in the context of I/O operations on variable record format files. When this \noption is specified, any occurrence of ^Z is interpreted as character data and \nnot as an end-of-file marker."}},{"Name":"RECFM=","Type":"V","Values":{"@Value1":"F","@Value2":"P","@Value3":"S","@Value4":"V|D","@Value5":"N","@Value6":"s370V","@Value7":"S370VB","@Value8":"S370VBS","@Value9":"STREAMLF","@Value10":"FB","@Value11":"VB","@Value12":"U"},"ToolTips":{"@ToolTip1":"Fixed-record format","@ToolTip2":"Print format.","@ToolTip3":"Stream-record format.","@ToolTip4":"Variable-record format (the default)","@ToolTip5":"Indicates binary format and causes the file to be treated as a byte stream. If LRECL is not specified,  by default SAS reads 256 bytes at a time from the file.","@ToolTip6":"Indicates the variable S370 record format (V).","@ToolTip7":"Indicates the variable block S370 record format (VB).","@ToolTip8":"Indicates the variable block with spanned records S370 record format (VBS).","@ToolTip9":"[For OpenVMS] Specifies StreamLF record format. Records are delimited by LF.","@ToolTip10":"Specifies fixed-length records, blocked.","@ToolTip11":"Specifies variable-length records, blocked.","@ToolTip12":"Specifies undefined-length records, unblocked."},"Help":{"#cdata":"[Windows Host Option] \n    \nSpecifies the record format of the external file."}},{"Name":"RETRY=","Type":"V","Help":{"#cdata":"[Syntax: RETRY=seconds] \n    \n[Windows Host Option]\n\nIs used only in the context of named pipes. This option specifies how long a named \npipe client should wait for a busy pipe. The minimum (and default) value for seconds \nis 10."}},{"Name":"SERVER","Type":"S","Help":{"#cdata":"[Windows Host Option] \n    \nIs used only in the context of named pipes. This option specifies the mode of a \nnamed pipe. The default value is SERVER."}},{"Name":"CLIENT","Type":"S","Help":{"#cdata":"[Windows Host Option] \n    \nIs used only in the context of named pipes. This option specifies the mode of a \nnamed pipe. The default value is SERVER."}},{"Name":"TERMSTR=","Type":"V","Values":{"@Value1":"CRLF","@Value2":"LF","@Value3":"NL"},"ToolTips":{"@ToolTip1":"Carriage return line feed. Use TERMSTR=CRLF to write Windows formatted files. CRLF is the default.","@ToolTip2":"Line feed. Use TERMSTR=LF to write UNIX formatted files.","@ToolTip3":"New line. Use TERMSTR=NL to write UNIX formatted files."},"Help":{"#cdata":"[Windows Host Option] \n    \nSpecifies the end-of-line character for the file. Use this option to share files \nbetween the UNIX and Windows operating environments."}},{"Name":"ALQ=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the number of blocks initially allocated to an external file when it is created. \nThe value can range from 0 to 2,147,483,647. If the value is 0 (the default), the minimum \nnumber of blocks required for the given file format is used.\n\nThe ALQ= option (allocation quantity) is used for output and corresponds to the FAB$L_ALQ \nfield in OpenVMS Record Management Services (RMS)."}},{"Name":"CC=","Type":"V","Values":{"@Value1":"FORTRAN","@Value2":"PRINT","@Value3":"CR"},"ToolTips":{"@ToolTip1":"Indicates FORTRAN carriage-control format. This is the default for print files.","@ToolTip2":"Indicates OpenVMS print format.","@ToolTip3":"Indicates OpenVMS carriage-return, carriage-control format. This is the default  for nonprinting files."},"Help":{"#cdata":"[OpenVMS Host Option] \n    \nSpecifies the carriage-control format of the SAS log and the procedure output file."}},{"Name":"DEQ=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the number of blocks added when OpenVMS RMS automatically extends an external \nfile during a write operation. The value can range from 0 to 65,535. The default value \nis 0, telling OpenVMS RMS to use the process's default value. A large value results in \nfewer file extensions over the life of the file; a small value results in numerous file \nextensions over the life of the file. A file with numerous file extensions might be \nnoncontiguous, thereby slowing record access.\n\nThe DEQ= option (default file extension quantity) is used for output and corresponds to \nthe FAB$W_DEQ field in OpenVMS RMS."}},{"Name":"FAC=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nOverrides the default file access attributes used for external files. Use this option \nto indicate the level of access you want to allow for an external file. You can allow \nREAD, WRITE, UPDATE, and DELETE access (as well as no access). By default with external \nfiles, files opened for input allow read access, files opened for output allow WRITE \naccess, and files opened for update allow READ and WRITE access. The form of the FAC= \noption is \n\n  FAC=access-option-list\n  \nwhere access-option-list can be one of the following: \n\n  DEL specifies DELETE access.\n   \n  GET specifies READ access.\n   \n  PUT specifies WRITE access.\n   \n  UPD specifies UPDATE access. \n\nYou can combine these values in any order. For example, specifying the following indicates \nthat you want DELETE, READ, and WRITE access: \n\n  fac=(del,get,put)\n  "}},{"Name":"GSFCC=","Type":"V","Values":{"@Value1":"PRINT","@Value2":"CR","@Value3":"NONE"},"ToolTips":{"@ToolTip1":"Creates a GSF file. It is a VFC format file with carriage control set to null. These  files can be used with most utilities with the exception of some file transfer  protocols, such as Kermit. This is the default value for this option.","@ToolTip2":"Creates a carriage return carriage control file.","@ToolTip3":"Creates a file with no carriage control. This format is useful if you plan to download  the file to a personal computer."},"Help":{"#cdata":"[OpenVMS Host Option] \n    \nSpecifies the file format of graphic stream files (GSF files). When specified in \nthe FILENAME statement, it affects only the GSF files that are created using that \nfileref."}},{"Name":"KEY=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies which key SAS uses to read the records in an RMS file with indexed organization. \nThe KEY= option is always used with the KEYVALUE= option. "}},{"Name":"KEYVALUE=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the key value with which to begin reading an indexed file. "}},{"Name":"MBC=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the size of the I/O buffers that OpenVMS RMS allocates for a particular file. \nThe value can range from 0 to 127 and represents the number of blocks used for each buffer. \nBy default, this option is set to 0 and the default values for the process are used.\n\nThe MBC= option (multiblock count) is used for both input and output to control the \nallocation for a particular file. If you want to control the allocation size for all \nthe external files used during the current SAS session, you can use the MBC= option in \nevery FILE, FILENAME, or INFILE statement. You can also use the DCL SET RMS_DEFAULT \ncommand to specify a process default, and let the SAS values default to the process's \ndefault values.\n\nThe MBC= option corresponds to the RAB$B_MBC field in OpenVMS RMS or the CONNECT \nMULTIBLOCK_COUNT attribute when using FDL. This option is not supported for DECnet \noperations."}},{"Name":"MBF=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the number of I/O buffers you want OpenVMS RMS to allocate for a particular file. \nThe value can range from 0 to 127 and represents the number of buffers used. By default, \nthis option is set to a value of 2. If a value of 0 is specified, the default value for the \nprocess is used.\n\nThe MBF= option (multibuffer count) is used for both input and output to control the number \nof buffers allocated for a particular file. If you want to control the number of buffers \nallocated for all the external files used during the SAS session, you can use the MBF= \noption in every FILE, FILENAME, or INFILE statement. The DCL SET RMS_DEFAULT command can \nbe used to specify a process default. Then, you can let the SAS values default to the \nprocess's default values.\n\nThe MBF= option corresponds to the RAB$B_MBF field in OpenVMS RMS or the CONNECT MULTIBUFFER_COUNT \nattribute when using FDL. This option is not supported for DECnet operations."}},{"Name":"SHR=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nOverrides the default file-sharing attributes used for external files. With this option, \nyou can indicate the access level you want to give other users. You can allow READ, WRITE, \nUPDATE, and DELETE access (as well as no access). By default with external files, files \nopened for input allow shared read access, and files opened for output or UPDATE do not \nallow shared access.\n\nHowever, you can allow other users to have READ and WRITE access to a file that you are \nopening for input only. To accomplish this, use the SHR= option. The syntax of the SHR= \noption is \n\n  SHR=share-option-list\n\nwhere share-option-list can be one of the following: DEL specifies DELETE access.\n \n  GET specifies shared READ access.\n   \n  NONE specifies no shared access.\n   \n  PUT specifies shared WRITE access.\n   \n  UPD specifies UPDATE access.  \n\nYou can combine these values in any order. For example, specifying the following indicates \nthat you want shared DELETE, READ, and WRITE access: \n\n  shr=(del,get,put)"}}],"#comment":[{},{}]}}