{"Keywords":{"Keyword":[{"Name":"CLEAR","Type":"S","Help":{"#cdata":"Disassociates one or more currently assigned filerefs."}},{"Name":"_ALL_","Type":"S","Help":{"#cdata":"Specifies that the CLEAR or LIST argument applies to all currently assigned filerefs."}},{"Name":"LIST","Type":"S","Help":{"#cdata":"Writes the attributes of one or more files to the SAS log, or issues the LIST \ncommand to the FTP server."}},{"Name":"DISK","Type":"S","Help":{"#cdata":"Specifies that the device is a disk drive."}},{"Name":"DUMMY","Type":"S","Help":{"#cdata":"Specifies that the output to the file is discarded."}},{"Name":"GTERM","Type":"S","Help":{"#cdata":"Indicates that the output device type is a graphics device that will receive \ngraphics data."}},{"Name":"PIPE","Type":"S","Help":{"#cdata":"Specifies an unnamed pipe."}},{"Name":"PLOTTER","Type":"S","Help":{"#cdata":"Specifies an unbuffered graphics output device."}},{"Name":"PRINTER","Type":"S","Help":{"#cdata":"Specifies a printer or printer spool file."}},{"Name":"TAPE","Type":"S","Help":{"#cdata":"Specifies a tape drive."}},{"Name":"TEMP","Type":"S","Help":{"#cdata":"Creates a temporary file that exists only as long as the filename is assigned."}},{"Name":"TERMINAL","Type":"S","Help":{"#cdata":"Specifies the user's terminal."}},{"Name":"UPRINTER","Type":"S","Help":{"#cdata":"Specifies a Universal Printing printer definition name."}},{"Name":"COMMPORT","Type":"S","Help":{"#cdata":"[Device Type for Windows] \n    \nReads data from and writes data to a communications port."}},{"Name":"DRIVEMAP","Type":"S","Help":{"#cdata":"[Device Type for Windows] \n    \nDisplays information about the available hard drives (local and networked)."}},{"Name":"NAMEPIPE","Type":"S","Help":{"#cdata":"[Device Type for Windows] \n    \nWrites data to a named pipe."}},{"Name":"NOTESDB","Type":"S","Help":{"#cdata":"[Device Type for Windows] \n    \nWrites data to a Lotus Notes database."}},{"Name":"HFS","Type":"S","Help":{"#cdata":"[Device Type for z/OS] \n    \nSpecifies a UNIX System Services file."}},{"Name":"MVS","Type":"S","Help":{"#cdata":"[Device Type for z/OS] \n    \nSpecifies an MVS data set."}},{"Name":"NOMVSTRANS","Type":"S","Help":{"#cdata":"[Device Type for z/OS] \n    \nSuppresses the EBCDIC to ASCII translation that is internal to the Socket access method.\n\nRestriction: The NOMVSTRANS option is supported only for the SBCS (Single-Byte Character Set) \nversion of SAS."}},{"Name":"ENCODING=","Type":"V","Values":{"@Value1":"'warabic'","@Value2":"'wbaltic'","@Value3":"'wlatin2'","@Value4":"'wcyrillic'","@Value5":"'wgreek'","@Value6":"'whebrew'","@Value7":"'wturkish'","@Value8":"'wvietnamese'","@Value9":"'wlatin1'","@Value10":"'utf-8'","@Value11":"'ms-950'","@Value12":"'ms-936'","@Value13":"'ms-932'","@Value14":"'ms-949'"},"ToolTips":{"@ToolTip1":"Arabic","@ToolTip2":"Baltic","@ToolTip3":"Central Europe","@ToolTip4":"Cyrillic","@ToolTip5":"Greek","@ToolTip6":"Hebrew","@ToolTip7":"Turkish","@ToolTip8":"Vietnamese","@ToolTip9":"Western","@ToolTip10":"Unicode encoding","@ToolTip11":"Traditional Chinese","@ToolTip12":"Simplified Chinese","@ToolTip13":"Japanese","@ToolTip14":"Korean"},"Help":{"#cdata":"Specifies the encoding to use when SAS is reading from or writing to an external file."}},{"Name":"RECFM=","Type":"V","Values":{"@Value1":"F","@Value2":"P","@Value3":"S","@Value4":"V|D","@Value5":"N","@Value6":"s370V","@Value7":"S370VB","@Value8":"S370VBS","@Value9":"STREAMLF"},"ToolTips":{"@ToolTip1":"Fixed-record format","@ToolTip2":"Print format. [Not applicable to DATURL and ZIP Access Methods.]","@ToolTip3":"Stream-record format. Data is transferred in image (binary) mode.","@ToolTip4":"Variable-record format (the default). In this format, records have varying lengths, and they are transferred in text (stream) mode.","@ToolTip5":"Indicates binary format and causes the file to be treated as a byte stream. If LRECL  is not specified, by default SAS reads 256 bytes at a time from the file.   [Not applicable to DATURL and ZIP Access Methods.]","@ToolTip6":"Indicates the variable S370 record format (V).                 [Not applicable to DATURL and ZIP Access Methods.]","@ToolTip7":"Indicates the variable block S370 record format (VB).                 [Not applicable to DATURL and ZIP Access Methods.]","@ToolTip8":"Indicates the variable block with spanned records S370 record format (VBS).                 [Not applicable to DATURL and ZIP Access Methods.]","@ToolTip9":"[For OpenVMS] Specifies StreamLF record format. Records are delimited by LF.                 [Not applicable to DATURL and ZIP Access Methods.]"},"Help":{"#cdata":"Specifies the record format of the external file. \n    \nInteraction:\nIn SAS 9.4, the default value for the global LRECL system option is 32767. If you are \nusing fixed-length records (RECFM=F), the default value for LRECL is 256.\n    \nUnder z/OS, the following values can be appended to the RECFM= values: \n\n  A specifies that the first byte of each record is an ANSI printer-control character.\n   \n  M specifies that the file is a machine control character file. SAS does not interpret \n    machine-code control characters, nor does it create them in output files.     \n   \n  S specifies that the file contains spanned records (when appended to V), or that the \n    file contains standard blocks (when appended to F)."}},{"Name":"CATALOG|LIBRARY","Type":"S","Help":{"#cdata":"[Syntax: FILENAME fileref CATALOG 'catalog' <catalog-options>; ] \n   \nSpecifies the access method that enables you to reference a SAS catalog as an external file. \n\n'catalog' \nis a valid two-, three-, or four-part SAS catalog name, where the parts represent \nlibrary.catalog.entry.entrytype.\n\nDefault: The default entry type is CATAMS."}},{"Name":"LRECL=","Type":"V","Help":{"#cdata":"Is the logical record length for the data in bytes. Under Windows, the default is 256. \nThe value of record-length can range from 1 to 1,073,741,823 (1 gigabyte).\n\nAlternatively, you can specify a logical record length value by using the LRECL= system \noption. \n\nInteraction\nIn SAS 9.4, the default value for the global LRECL system option is 32767. If you are using fixed-length \nrecords (RECFM=F), the default value for LRECL is 256."}},{"Name":"DESC=","Type":"V","Help":{"#cdata":"Alias: DESCRIPTION=\n    \nSpecifies a description for a file or catalog."}},{"Name":"MOD","Type":"S","Help":{"#cdata":"Places the file in update mode and appends updates to the bottom of the file.\n    \nMOD indicates that data written to the file should be appended to the file instead of overwriting \nthe file."}},{"Name":"CLIPBRD","Type":"S","Help":{"#cdata":"[Syntax: FILENAME fileref CLIPBRD <BUFFER=paste-buffer-name>; ] \n    \nSpecifies the access method that enables you to read data from or write data to the clipboard on \nthe host machine."}},{"Name":"BUFFER=","Type":"V","Help":{"#cdata":"[For the FILENAME, CLIPBOARD Access Method only] \n    \n[Syntax: FILENAME fileref CLIPBRD <BUFFER=paste-buffer-name>;] \n    \nCreates and names the paste buffer. You can create any number of paste buffers by naming them with \nthe BUFFER= argument in the STORE command."}},{"Name":"EMAIL","Type":"S","Help":{"#cdata":"Specifies the EMAIL device type, which provides the access method that enables you \nto send electronic mail programmatically from SAS."}},{"Name":"CONTENT_TYPE=|TYPE=","Type":"V","Help":{"#cdata":"[Syntax: CONTENT_TYPE='content/type'] \n    \nSpecifies the content type for the message body."}},{"Name":"DELIVERRECEIPT","Type":"S","Help":{"#cdata":"Specifies that a notification be sent when the e-mail message is delivered to the recipient. \n    \nNote:If the recipient’s e-mail client does not support or if the recipient does not allow \n“delivery receipt” requests, the sender will not get a “delivery receipt” notification when \nthe e-mail is delivered."}},{"Name":"TO=","Type":"V","Help":{"#cdata":"[Syntax: TO='to-address'] \n   \nSpecifies the primary recipient(s) of the e-mail message. You must enclose the address in \nquotation marks. \n\nTo specify more than one address, enclose the group of addresses in parentheses, enclose \neach address in quotation marks, and separate each address with a space."}},{"Name":"CC=","Type":"V","Help":{"#cdata":"[Syntax: CC='cc-address' | CC=FORTRAN | PRINT | CR] \n    \n(1) Specifies the recipient(s) to receive a copy of the e-mail message. \nYou must enclose an address in quotation marks. \n\nTo specify more than one address, enclose the group of addresses in parentheses, enclose \neach address in quotation marks, and separate each address with a space.\n\n(2) As an OpenVMS Host Option, CR= specifies the carriage-control format of the SAS log \nand the procedure output file. \n\n  FORTRAN\n  Indicates FORTRAN carriage-control format. This is the default for print files.\n\n  PRINT\n  Indicates OpenVMS print format.\n\n  CR\n  Indicates OpenVMS carriage-return, carriage-control format. This is the default "}},{"Name":"BCC=","Type":"V","Help":{"#cdata":"[Syntax: BCC='bcc-address'] \n    \nSpecifies the recipient(s) that you want to receive a blind copy of the electronic mail. \nIndividuals that are listed in the bcc field will receive a copy of the e-mail."}},{"Name":"FROM=","Type":"V","Help":{"#cdata":"[Syntax: FROM='from-address'] \n    \nSpecifies the e-mail address of the author of the message that is being sent. \nThe default value for FROM= is the e-mail address of the user who is running SAS."}},{"Name":"EXPIRES=","Type":"V","Help":{"#cdata":"[Syntax: EXPIRES='dd mon yyyy hh:mm'] \n    \nSpecifies the expiration date for the e-mail message. \n\nThe format dd mon hh:mm parameters are defined as follows: \ndd \n  is an integer from 01 to 31 that represents the day of the month. \nmon \n  are the first three letters of the month name in English. \nyyyy \n  is a four-digit integer that represents the year. \nhh \n  is the number of hours that range from 00 through 23. \nmm \n  is the number of minutes that range from 00 through 59. \n  \nTip:If the date and time have passed the current date and time, an error message \noccurs and no e-mail is sent."}},{"Name":"READRECEIPT","Type":"S","Help":{"#cdata":"Specifies that a notification be sent when the e-mail message is read by the recipient. \n    \nNote:If the recipient’s e-mail client does not support or if the recipient does not \nallow return “read receipt” requests, the sender will not get a “read receipt” \nnotification when the recipient reads the e-mail."}},{"Name":"IMPORTANCE=","Type":"V","Values":{"@Value1":"'LOW'","@Value2":"'NORMAL'","@Value3":"'HIGH'"},"ToolTips":{"@ToolTip1":"Low priority message","@ToolTip2":"Normal priority message","@ToolTip3":"High priority message"},"Help":{"#cdata":"Specifies the priority of the e-mail message. You must enclose the value in quotation \nmarks. You can specify the priority in the language that matches your session encoding. \nHowever, SAS will translate the priority into English because the actual message header \nmust contain English in accordance with the RFC-2076 specification (Common Internet \nMessage Headers)."}},{"Name":"REPLYTO=","Type":"V","Help":{"#cdata":"[Syntax: REPLYTO='replyto-address'] \n    \nSpecifies the e-mail address(es) for who will receive replies. \nYou must enclose an address in quotation marks. \n\nTo specify more than one address, enclose the group of addresses in parentheses, \nenclose each address in quotation marks, and separate each address with a space."}},{"Name":"SUBJECT=","Type":"V","Help":{"#cdata":"[Syntax: SUBJECT=subject] \n    \nSpecifies the subject of the message."}},{"Name":"ATTACH=","Type":"V","Help":{"#cdata":"[Syntax: ATTACH='filename.ext' | ATTACH= ('filename.ext' attachment-options)]\n    \nSpecifies the physical name of the file(s) to be attached to the message and any \noptions to modify attachment specifications."}},{"Name":"EXTENSION=|EXT=","Type":"V","Help":{"#cdata":"Specifies a different file extension to be used for the specified attachment."}},{"Name":"NAME=","Type":"V","Help":{"#cdata":"Specifies a different name to be used for the specified attachment.\n    \nNAME= can also be an alias for FILENAME=, and specifies the name of a file."}},{"Name":"OUTENCODING=","Type":"V","Help":{"#cdata":"Specifies the resulting text encoding for the attachment to be sent."}},{"Name":"FTP","Type":"S","Help":{"#cdata":"Specifies the access method that enables you to use File Transfer Protocol (FTP) \nto read from or write to a file from any host machine that you can connect to on \na network with an FTP server running."}},{"Name":"SFTP","Type":"S","Help":{"#cdata":"Specifies the access method that enables you to use Secure File Transfer Protocol \n(SFTP) to read from or write to a file from any host computer that you can connect \nto on a network with an OpenSSH SSHD server running."}},{"Name":"BINARY","Type":"S","Help":{"#cdata":"Is fixed-record format. Thus, all records are of size LRECL with no line delimiters. \nData is transferred in image (binary) mode. \n\nAlias: RECFM=F"}},{"Name":"CD=","Type":"V","Help":{"#cdata":"[Syntax: CD='directory'] \n    \nIssues a command that changes the working directory for the file transfer to the directory \nthat you specify.\n\nCD= can also be an alias for CONTENTDISP=, CDISP=, which specifies how to deliver the file."}},{"Name":"DEBUG","Type":"S","Help":{"#cdata":"Writes debugging information to the SAS log."}},{"Name":"FILEEXT","Type":"S","Help":{"#cdata":"This option may be used to specify that:\n\n(1) a file extension is automatically appended to the filename member if the extension \ndoes not exist; or\n\n(2) the member type of DATA is automatically appended to the member name on the FILE \nor INFILE statement when you use the DIR option. \n\nInteraction:\nThe autocall macro facility always passes the extension .SAS to the file access method as \nthe extension to use when opening files in the autocall library. The DATA step always passes \nthe extension .DATA. If you define a fileref for an autocall macro library and the files in \nthat library have a file extension of .SAS, use the FILEEXT option. If the files in that \nlibrary do not have an extension, do not use the FILEEXT option. For example, if you define \na fileref for an input file in the DATA step and the file X has an extension of .DATA, you \nwould use the FILEEXT option to read the file X.DATA. If you use the INFILE or FILE statement, \nenclose the member name and extension in quotation marks to preserve the casing.\n\nTip: The FILEEXT option is ignored if you specify a file extension on the FILE or INFILE statement."}},{"Name":"DIR","Type":"S","Help":{"#cdata":"Enables you to access directory files or PDS/PDSE members."}},{"Name":"MGET","Type":"S","Help":{"#cdata":"Transfers multiple files, similar to the FTP/SFTP command MGET."}},{"Name":"MPROMPT","Type":"S","Help":{"#cdata":"Specifies whether to prompt for confirmation that a file is to be read, if \nnecessary, when the user executes the MGET option."}},{"Name":"NEW","Type":"S","Help":{"#cdata":"Specifies that you want FTP/SFTP to create the directory when you use the DIR option.\n    \nUnder UNIX, NEW indicates that a new file is to be opened for output. If the file \nalready exists, then it is deleted and re-created. "}},{"Name":"PASSIVE","Type":"S","Help":{"#cdata":"Specifies that an attempt is made for passive mode FTP. \n    \nIn passive mode FTP, the client initiates the control and data connections to the server. \nThis action solves the problem of firewalls filtering the incoming data port connection \nto the client from the server. \n\nNote:Not all FTP servers support the passive mode. If an attempt is made by the FILENAME \nstatement FTP access method to issue the PASV command and the command fails or the server \ndoes not accept the command, then active mode FTP is used for the connection."}},{"Name":"OLD","Type":"S","Help":{"#cdata":"[UNIX Host Option]\n    \nIf you specify OLD, then the previous contents of the file are replaced. NEW is the default."}},{"Name":"PROMPT","Type":"S","Help":{"#cdata":"Specifies to prompt for the user login password, if necessary.\n    \nInteraction: TheUSER= and PASS= options override the PROMPT option if all three options \nare specified. If you specify the PROMPT option and do not specify the USER= or PASS= \noption, you will be prompted for a user ID and password."}},{"Name":"BLOCKSIZE=","Type":"V","Help":{"#cdata":"Specifies the size of the data buffer in bytes."}},{"Name":"HOST=","Type":"V","Help":{"#cdata":"Network name of the remote host with the FTP or OpenSSH SSHD  server running."}},{"Name":"HOSTRESPONSELEN=","Type":"V","Help":{"#cdata":"[Syntax: HOSTRESPONSELEN='size'] \n    \nwhere size is the length of the FTP server response message.\n\nDefault: 2048 bytes \n\nRange: 2048 to 16384 bytes \n\nRestriction: If you specify a size that is less than 2048 or is greater than 16384, the size will \nbe set to 2048."}},{"Name":"LOWCASE_MEMNAME","Type":"S","Help":{"#cdata":"Enables autocall macro retrieval of lowercase directory or member names from FTP servers or ZIP files. \n    \nRestriction:\nSAS autocall macro retrieval always searches for uppercase directory member names. Mixed-case directory \nor member names are not supported."}},{"Name":"OPTIONS=","Type":"V","Help":{"#cdata":"Specifies SFTP configuration options such as port numbers."}},{"Name":"LS","Type":"S","Help":{"#cdata":"Issues the LS command to the FTP/SFTP server. LS returns the contents of the \nworking directory as records with no file attributes."}},{"Name":"LSA","Type":"S","Help":{"#cdata":"Issues the LS command to the SFTP server. LSA returns all the contents of the \nworking directory as records with no file attributes."}},{"Name":"LSFILE=","Type":"V","Help":{"#cdata":"[Syntax: LSFILE='character-string'] \n    \nIn combination with the LS option, specifies a character string that enables you \nto request a listing of a subset of files from the working directory. Enclose the \ncharacter string in quotation marks."}},{"Name":"PATH","Type":"S","Help":{"#cdata":"Specifies the location of the SFTP executable if it is not installed in the PATH \nor $PATH search path."}},{"Name":"PASS=|PASSWORD=|PW=|PWD=","Type":"V","Help":{"#cdata":"[Syntax: PASS='password'] \n   \nIs the password to use with the user name specified in the USER= option."}},{"Name":"PPASS=","Type":"V","Help":{"#cdata":"[Syntax: PPASS='password'] \n   \nwhere password is the password to use with the user name that is specified in the \nPUSER option. The PPASS option is used to access the proxy server.\n\nTip: You can specify the PROMPT option instead of the PPASS option, which tells the \nsystem to prompt you for the password."}},{"Name":"WAIT_MILLISECONDS=","Type":"V","Help":{"#cdata":"[Syntax: WAIT_MILLISECONDS=milliseconds] \n   \nSpecifies the FTP or SFTP response time in milliseconds.\n\nDefault: FTP(1,000 milliseconds); SFTP (1,500 milliseconds)\n\nTip: If you receive a timeout message in the log, use the WAIT_MILLISECONDS option \nto increase the response time."}},{"Name":"PORT=","Type":"V","Help":{"#cdata":"Specifies the port that the FTP daemon monitors on the respective host."}},{"Name":"RCMD=","Type":"V","Help":{"#cdata":"[Syntax: RCMD= 'command '] \n    \nSpecifies the FTP 'SITE' or 'service' command to send to the FTP server."}},{"Name":"USER=|UID=","Type":"V","Help":{"#cdata":"[Syntax: USER='username'] \n   \nThe username used to log in to the server."}},{"Name":"PUSER=","Type":"V","Help":{"#cdata":"[Syntax: PUSER='username'] \n   \nwhere username is used to log on to the URL proxy server.\n\nTip: If you specify puser='*' , then the user is prompted for an ID.  \n\nInteraction: If you specify the PUSER option, the USER option goes to the Web server \nregardless of whether you specify a proxy server. \n\nInteraction: If PROMPT is specified, but PUSER is not, the user is prompted for an ID \nas well as a password."}},{"Name":"RECONN=","Type":"V","Help":{"#cdata":"Specifies the maximum number of connections that the server will accept."}},{"Name":"TERMSTR=","Type":"V","Values":{"@Value1":"CR","@Value2":"CRLF","@Value3":"LF","@Value4":"NULL","@Value5":"NONE","@Value6":"NL","@Value7":"LFCR","@Value8":"CRNL"},"ToolTips":{"@ToolTip1":"Carriage return (CR).","@ToolTip2":"Carriage return (CR) followed by line feed (LF).","@ToolTip3":"Line feed only (the default).","@ToolTip4":"NULL character (0x00).","@ToolTip5":"Record terminators are not used. This parameter provides the same function  as FILEDATA=BINARY.","@ToolTip6":"The newline character (x'15') is used as the record terminator. This parameter  provides the same function as FILEDATA=TEXT.","@ToolTip7":"The sequence LF followed by CR is used as the record terminator.","@ToolTip8":"The sequence CR followed by NL is used as the record terminator."},"Help":{"#cdata":"Controls the end of line/record delimiters in PC and UNIX formatted files. This \noption enables the sharing of UNIX and PC formatted files between the two hosts. \n\nSyntax: TERMSTR='eol-termination-character'\n\nwhere the terminating character is the line character for Read operations and is the terminating \ncharacter for a record Write operation.\n\nDefault: CRLF for Windows. LF for all other operating environments.\n\nOperating environment:\nUsing the FILENAME statement requires information that is specific to your operating environment. \nFor more information about how to specify filenames, see the SAS documentation for your operating environment."}},{"Name":"RHELP","Type":"S","Help":{"#cdata":"Issues the HELP command to the FTP server."}},{"Name":"RSTAT","Type":"S","Help":{"#cdata":"Issues the RSTAT command to the FTP server. The results of this command are \nreturned as records."}},{"Name":"SAVEUSER","Type":"S","Help":{"#cdata":"Saves the user ID and password after the user ID and password prompt are successfully \nexecuted.\n\nInteraction: The user ID and password are saved only for the duration of the SAS \nsession or until you change the association between the fileref and the external \nfile, or discontinue it with another FILENAME statement."}},{"Name":"S370V","Type":"S","Help":{"#cdata":"Indicates that the file being read is in IBM 370 variable format."}},{"Name":"S370VS","Type":"S","Help":{"#cdata":"Indicates that the file that is being read is in IBM 370 variable-spanned format."}},{"Name":"SOCKET","Type":"S","Help":{"#cdata":"Specifies the access method that enables you to read from or write to a Transmission \nControl Protocol/Internet Protocol (TCP/IP) socket."}},{"Name":"SERVER","Type":"S","Help":{"#cdata":"Sets the TCP/IP socket to be a listening socket, thereby enabling the system to \nact as a server that is waiting for a connection. \n\nIs used only in the context of named pipes. This option specifies the mode of a \nnamed pipe. The default value is SERVER."}},{"Name":"URL|HTTP","Type":"S","Help":{"#cdata":"[Syntax: FILENAME fileref URL 'external-file' <url-options>; ]\n    \nSpecifies the access method that enables you to read a file from any host machine that you can \nconnect to on a network with a URL server running. \n\n'external-file' \nspecifies the name of the file that you want to read from on a URL server. The Secure Socket Layer (SSL) \nprotocol, https, can also be used to access the files. The file must be specified in one of these formats: \n\n  http://hostname/file\n  https://hostname/file\n  http://hostname:portno/file\n  https://hostname:portno/file \n  \nurl-options can be any of the following:\n\n  AUTHDOMAIN=\"auth-domain\" -- specifies the name of an authentication domain metadata object in order to \n    connect to the proxy or Web server. \n  BLOCKSIZE=blocksize -- where blocksize is the size of the URL data buffer in bytes. Default: 8K \n  DEBUG -- writes debugging information to the SAS log.\n  HEADERS=fileref -- specifies the fileref to which the header information is written when a file is opened \n    by using the URL access method. \n  LRECL=lrecl -- where lrecl is the logical record length of the data. Default: 256.\n  PASS='password' -- where password is the password to use with the user name that is specified in the USER \n    option. Used to access the proxy server.\n  PROMPT -- specifies to prompt for the user login password if necessary.\n  PROXY=url -- specifies the Uniform Resource Locator (URL) for the proxy server in one of these forms: \n     http://hostname/ or http://hostname:portno/\n  PUSER='username' -- where username is used to log on to the URL proxy server.\n  RECFM=recfm -- where recfm is one of three record formats:\n    F is fixed-record format. Thus, all records are of size LRECL with no line delimiters. Data is transferred \n      in image (binary) mode.    \n    S is stream-record format. Data is transferred in image (binary) mode.\n    V is variable-record format (the default). In this format, records have varying lengths, and they are \n      transferred in text (stream) mode.\n  TERMSTR='eol-char' -- where eol-char is the line delimiter to use when RECFM=V. There are four valid values:\n    CR carriage return (CR). \n    CRLF carriage return (CR) followed by line feed (LF). \n    LF line feed only (the default). \n    NULL NULL character (0x00).\n  USER='username' -- where username is used to log on to the URL server."}},{"Name":"PROXY=","Type":"V","Help":{"#cdata":"[Syntax: PROXY=url] \n    \nSpecifies the Uniform Resource Locator (URL) for the proxy server in one of these forms: \n\n http://hostname/\n \n http://hostname:portno/"}},{"Name":"SASXBAMW","Type":"S","Help":{"#cdata":"Specifies the access method that enables you to use WebDAV (Web-Based Distributed \nAuthoring and Versioning) to read from or write to a file from any host machine \nthat you can connect to on a network with a WebDAV server running."}},{"Name":"LOCALCACHE=","Type":"V","Help":{"#cdata":"[Syntax: LOCALCACHE=\"directory name\"] \n    \nSpecifies a directory where a temporary subdirectory is created to hold local \ncopies of the server files."}},{"Name":"LOCKDURATION=","Type":"V","Help":{"#cdata":"Specifies the number of minutes that the files that are written through the WebDAV \nlibref are locked."}},{"Name":"WEBDAV","Type":"S","Help":{"#cdata":"[FILENAME filref WEBDAV 'external-file' <webdav-options>; ]\n    \nEnables you to access remote files by using the WebDAV protocol."}},{"Name":"BATCHFILE=","Type":"V","Help":{"#cdata":"[Syntax: BATCHFILE='path'] \n    \nSpecifies the fully qualified pathname and the filename of the batch file that \ncontains the SFTP commands. These commands are submitted when the SFTP access \nmethod is executed. After the batch file processing ends, the SFTP connection \nis closed."}},{"Name":"DDE","Type":"S","Help":{"#cdata":"To use DDE in SAS, issue a FILENAME statement with the following syntax: \n\nFILENAME fileref DDE 'DDE-triplet' <DDE-options>; "}},{"Name":"COMMAND","Type":"S","Help":{"#cdata":"Allows remote commands to be issued to DDE server applications that not use the \nSYSTEM topic name."}},{"Name":"HOTLINK","Type":"S","Help":{"#cdata":"Instructs SAS to use the DDE HOTLINK."}},{"Name":"NOTAB","Type":"S","Help":{"#cdata":"Instructs SAS to ignore tab characters between variables."}},{"Name":"ALTDEST=","Type":"V","Help":{"#cdata":"[Syntax: ALTDEST=filename] \n    \nIs for use only with the PRINTER device type. Filename specifies a file destination \nto write to when you direct output to the fileref. Although the output is written to \ndisk and not to the printer, the output is still formatted by using the printer driver \nthat is associated with the printer that you specified with the external-file argument."}},{"Name":"BAUD=","Type":"V","Help":{"#cdata":"Sets the baud rate. The value for baud-rate depends on your communications hardware. \nIt must be an integer. This host option is valid only if you specify the COMMPORT \ndevice-type keyword."}},{"Name":"BITS=","Type":"V","Help":{"#cdata":"Sets the transmission bits. Values are 5 through 8. This host option is valid only \nwhen you specify the COMMPORT device-type keyword.\n\nNote: For the 8250 serial port, invalid combinations are 5 data bits with 2 stop \nbits and 6, 7, or 8 data bits with 1.5 stop bits."}},{"Name":"BLKSIZE=|BLK=","Type":"V","Help":{"#cdata":"[Syntax: BLKSIZE=block-size] \n    \nSpecifies the number of bytes that are physically read or written in an I/O operation. \nThe default is 8K. The maximum is 1M (Windows) or 1G-1(UNIX). \n\nIn UNIX, if you specify RECFM=S370VBS, then you should specify BLKSIZE=32760 in order \nto avoid errors with records longer than 255 characters."}},{"Name":"BLOCK","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates whether the client \nis to wait if no data is currently available. BLOCK is the default value."}},{"Name":"NOBLOCK","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates whether the client \nis to wait if no data is currently available. BLOCK is the default value."}},{"Name":"BYTE","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates the type of pipe. \nBYTE is the default value."}},{"Name":"MESSAGE","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option indicates the type of pipe. \nBYTE is the default value."}},{"Name":"COMTIMEOUT=","Type":"V","Values":{"@Value1":"EOF","@Value2":"WAIT","@Value3":"ZERO"},"ToolTips":{"@ToolTip1":"Returns an end-of-file (EOF) character when a timeout occurs. This behavior is the  default. The EOF character causes the current DATA step to terminate.","@ToolTip2":"Instructs the communications port to wait forever for data. This value overrides   the timeout. In this case, no record is returned to the DATA step until data are  available. This action can cause your program to go into an infinite loop, so use  this value with caution.","@ToolTip3":"Returns a record length of 0 bytes when a timeout occurs. However, the DATA step  does not terminate; it simply tries to read data again."},"Help":{"#cdata":"Controls how a communications port timeout is handled. A timeout occurs when no data \nis available at the communications port for a period of time, usually 60 seconds."}},{"Name":"CONSOLE=","Type":"V","Values":{"@Value1":"MAX","@Value2":"MIN","@Value3":"NORMAL"},"ToolTips":{"@ToolTip1":"Opens the DOS window maximized.","@ToolTip2":"Opens the DOS window minimized.","@ToolTip3":"Opens the DOS window using the default for the machine."},"Help":{"#cdata":"Specifies the state of the DOS window when an application is opened using pipes."}},{"Name":"DROPNULL=","Type":"V","Values":{"@Value1":"ON","@Value2":"OFF"},"ToolTips":{"@ToolTip1":"Specifies to discard null bytes when they are received.","@ToolTip2":"Specifies not to discard null bytes when they are received. OFF is the default value."},"Help":{"#cdata":"Is used to discard null bytes when they are received. \n    \nThis host option is valid only if you specify the COMMPORT device-type keyword.\nFor example: \n\n  filename portin commport 'com1:' dropnull=off;"}},{"Name":"EOFCONNECT","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes and is valid only when you are defining \nthe server. This option indicates that if an end-of-file (EOF) character is \nreceived from a client, the server should try to connect to the next client."}},{"Name":"FLOW=","Type":"V","Values":{"@Value1":"XONXOFF","@Value2":"DTRDSR","@Value3":"RTSCTS"},"ToolTips":{"@ToolTip1":"XONXOFF","@ToolTip2":"DTRDSR","@ToolTip3":"RTSCTS"},"Help":{"#cdata":"Controls the transmission control flow. \n    \nThis host option is valid only if you specify the COMMPORT device-type keyword."}},{"Name":"IGNOREDOSEOF","Type":"S","Help":{"#cdata":"Is used in the context of I/O operations on variable record format files. When this \noption is specified, any occurrence of ^Z is interpreted as character data and \nnot as an end-of-file marker."}},{"Name":"PARITY=","Type":"V","Values":{"@Value1":"NONE","@Value2":"ODD","@Value3":"EVEN","@Value4":"MARK","@Value5":"SPACE"},"ToolTips":{"@ToolTip1":"Sets no parity check bit.","@ToolTip2":"Sets odd parity check bit.","@ToolTip3":"Sets mark parity check bit.","@ToolTip4":"Sets space parity check bit."},"Help":{"#cdata":"Sets the parity check bit."}},{"Name":"RETRY=","Type":"V","Help":{"#cdata":"[Syntax: RETRY=seconds] \n    \nIs used only in the context of named pipes. This option specifies how long a named \npipe client should wait for a busy pipe. The minimum (and default) value for seconds \nis 10."}},{"Name":"RCONST=","Type":"V","Help":{"#cdata":"[Syntax: RCONST=seconds] \n    \nSpecifies the initial read time-out value in 0.001 of a second (1000 = 1 second). \nThe default is 8 seconds. This host-option is valid only if you specify the COMMPORT \ndevice-type keyword."}},{"Name":"RMULTI=","Type":"V","Help":{"#cdata":"[Syntax: RMULTI= seconds] \n    \nSpecifies the subsequent read time-out value in 0.001 of a second (1000 = 1 second). \nThis host-option is valid only if you specify the COMMPORT device-type keyword."}},{"Name":"CLIENT","Type":"S","Help":{"#cdata":"Is used only in the context of named pipes. This option specifies the mode of a \nnamed pipe. The default value is SERVER."}},{"Name":"STOP=","Type":"V","Values":{"@Value1":"ONE","@Value2":"TWO","@Value3":"ONEHALF"},"ToolTips":{"@ToolTip1":"Sets 1 stop bit.","@ToolTip2":"Sets 2 stop bits.","@ToolTip3":"Sets 1.5 stop bits."},"Help":{"#cdata":"Sets the stop bit. \n    \nThis host option is valid only if you specify the COMMPORT device-type keyword.\n\nNote: For the 8250 serial port, invalid combinations are 5 data bits with 2 stop \nbits and 6, 7, or 8 data bits with 1.5 stop bits."}},{"Name":"WCONST=","Type":"V","Help":{"#cdata":"[Syntax: WCONST=seconds] \n    \nSpecifies the initial time-out value in 0.001 of a second (1000 = 1 second). This host \noption is valid only if you specify the COMMPORT device-type keyword."}},{"Name":"WMULTI=","Type":"V","Help":{"#cdata":"[Syntax: WMULTI=seconds] \n    \nSpecifies the subsequent time-out value in 0.001 of a second (1000 = 1 second). \nThis host option is valid only if you specify the COMMPORT device-type keyword."}},{"Name":"UNBUF","Type":"S","Help":{"#cdata":"[UNIX Host Option] \n    \nTells SAS not to perform buffered writes to the file on any subsequent FILE statement. \nThis option applies especially when you are reading from or writing to a data collection \ndevice. As explained in SAS Language Reference: Dictionary, it also prevents buffered \nreads on INFILE statements."}},{"Name":"ALQ=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the number of blocks initially allocated to an external file when it is created. \nThe value can range from 0 to 2,147,483,647. If the value is 0 (the default), the minimum \nnumber of blocks required for the given file format is used.\n\nThe ALQ= option (allocation quantity) is used for output and corresponds to the FAB$L_ALQ \nfield in OpenVMS Record Management Services (RMS)."}},{"Name":"DEQ=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the number of blocks added when OpenVMS RMS automatically extends an external \nfile during a write operation. The value can range from 0 to 65,535. The default value \nis 0, telling OpenVMS RMS to use the process's default value. A large value results in \nfewer file extensions over the life of the file; a small value results in numerous file \nextensions over the life of the file. A file with numerous file extensions might be \nnoncontiguous, thereby slowing record access.\n\nThe DEQ= option (default file extension quantity) is used for output and corresponds to \nthe FAB$W_DEQ field in OpenVMS RMS."}},{"Name":"FAC=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nOverrides the default file access attributes used for external files. Use this option \nto indicate the level of access you want to allow for an external file. You can allow \nREAD, WRITE, UPDATE, and DELETE access (as well as no access). By default with external \nfiles, files opened for input allow read access, files opened for output allow WRITE \naccess, and files opened for update allow READ and WRITE access. The form of the FAC= \noption is \n\n  FAC=access-option-list\n  \nwhere access-option-list can be one of the following: \n\n  DEL specifies DELETE access.\n   \n  GET specifies READ access.\n   \n  PUT specifies WRITE access.\n   \n  UPD specifies UPDATE access. \n\nYou can combine these values in any order. For example, specifying the following indicates \nthat you want DELETE, READ, and WRITE access: \n\n  fac=(del,get,put)\n  "}},{"Name":"GSFCC=","Type":"V","Values":{"@Value1":"PRINT","@Value2":"CR","@Value3":"NONE"},"ToolTips":{"@ToolTip1":"Creates a GSF file. It is a VFC format file with carriage control set to null. These  files can be used with most utilities with the exception of some file transfer  protocols, such as Kermit. This is the default value for this option.","@ToolTip2":"Creates a carriage return carriage control file.","@ToolTip3":"Creates a file with no carriage control. This format is useful if you plan to download  the file to a personal computer."},"Help":{"#cdata":"[OpenVMS Host Option] \n    \nSpecifies the file format of graphic stream files (GSF files). When specified in \nthe FILENAME statement, it affects only the GSF files that are created using that \nfileref."}},{"Name":"KEY=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies which key SAS uses to read the records in an RMS file with indexed organization. \nThe KEY= option is always used with the KEYVALUE= option. "}},{"Name":"KEYVALUE=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the key value with which to begin reading an indexed file. "}},{"Name":"MBC=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the size of the I/O buffers that OpenVMS RMS allocates for a particular file. \nThe value can range from 0 to 127 and represents the number of blocks used for each buffer. \nBy default, this option is set to 0 and the default values for the process are used.\n\nThe MBC= option (multiblock count) is used for both input and output to control the \nallocation for a particular file. If you want to control the allocation size for all \nthe external files used during the current SAS session, you can use the MBC= option in \nevery FILE, FILENAME, or INFILE statement. You can also use the DCL SET RMS_DEFAULT \ncommand to specify a process default, and let the SAS values default to the process's \ndefault values.\n\nThe MBC= option corresponds to the RAB$B_MBC field in OpenVMS RMS or the CONNECT \nMULTIBLOCK_COUNT attribute when using FDL. This option is not supported for DECnet \noperations."}},{"Name":"MBF=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nSpecifies the number of I/O buffers you want OpenVMS RMS to allocate for a particular file. \nThe value can range from 0 to 127 and represents the number of buffers used. By default, \nthis option is set to a value of 2. If a value of 0 is specified, the default value for the \nprocess is used.\n\nThe MBF= option (multibuffer count) is used for both input and output to control the number \nof buffers allocated for a particular file. If you want to control the number of buffers \nallocated for all the external files used during the SAS session, you can use the MBF= \noption in every FILE, FILENAME, or INFILE statement. The DCL SET RMS_DEFAULT command can \nbe used to specify a process default. Then, you can let the SAS values default to the \nprocess's default values.\n\nThe MBF= option corresponds to the RAB$B_MBF field in OpenVMS RMS or the CONNECT MULTIBUFFER_COUNT \nattribute when using FDL. This option is not supported for DECnet operations."}},{"Name":"SHR=","Type":"V","Help":{"#cdata":"[OpenVMS Host Option]\n    \nOverrides the default file-sharing attributes used for external files. With this option, \nyou can indicate the access level you want to give other users. You can allow READ, WRITE, \nUPDATE, and DELETE access (as well as no access). By default with external files, files \nopened for input allow shared read access, and files opened for output or UPDATE do not \nallow shared access.\n\nHowever, you can allow other users to have READ and WRITE access to a file that you are \nopening for input only. To accomplish this, use the SHR= option. The syntax of the SHR= \noption is \n\n  SHR=share-option-list\n\nwhere share-option-list can be one of the following: DEL specifies DELETE access.\n \n  GET specifies shared READ access.\n   \n  NONE specifies no shared access.\n   \n  PUT specifies shared WRITE access.\n   \n  UPD specifies UPDATE access.  \n\nYou can combine these values in any order. For example, specifying the following indicates \nthat you want shared DELETE, READ, and WRITE access: \n\n  shr=(del,get,put)"}},{"Name":"DISP=","Type":"V","Values":{"@Value1":"NEW","@Value2":"OLD","@Value3":"SHR","@Value4":"MOD","@Value5":"REP"},"ToolTips":{"@ToolTip1":"A new data set is to be created.","@ToolTip2":"The data set exists and is not to be shared.","@ToolTip3":"The data set exists and can be shared.","@ToolTip4":"If the data set exists, adds new records to the end; if the data set does not exist,  it creates a new data set. MOD cannot be specified for a partitioned data set.","@ToolTip5":"For non-PDS members, implies DISP=OLD if the data set exists and is cataloged;  otherwise, it implies DISP=NEW. For PDS members, it implies DISP=SHR if the PDS  is cataloged; otherwise, it implies DISP=NEW."},"Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: DISP=status | (status,<normal-termination-disp>,<abnormal-termination-disp>) \n\nSpecifies the status of the physical file at the beginning and ending of a job, \nas well as what to do if the job step terminates abnormally. If you specify only \nstatus, you can omit the parentheses. \n\nstatus \nspecifies the status of the data set at the beginning of a job. Valid values are:\n\n  NEW -- creates a new data set.    \n  OLD -- does not share the existing data set.   \n  SHR -- shares the existing data set.   \n  MOD -- if the data set exists, adds new records to the end; if the data set does not exist, \n    it creates a new data set. MOD cannot be specified for a partitioned data set.    \n  REP for non-PDS members, implies DISP=OLD if the data set exists and is cataloged; \n  otherwise, it implies DISP=NEW. For PDS members, it implies DISP=SHR if the PDS is \n  cataloged; otherwise, it implies DISP=NEW. The default is SHR.\n\nnormal-termination-disp \nspecifies what to do with the data set when the fileref is cleared or when the job step \nthat was using the data set terminates normally. Valid values are:\n\n  DELETE -- deletes the data set at the end of the step.    \n  KEEP -- keeps the data set.    \n  CATLG -- places the entry in the system catalog or user catalog.    \n  UNCATLG -- deletes the entry from the system catalog or user catalog.\n \nFor a new data set, the default is CATLG. For an existing data set, the default is KEEP.\n\nabnormal-termination-disp \nspecifies what to do if the job step terminates abnormally. The default is to take the action \nthat is specified or implied by normal-termination-disp. Valid values are the same as the \nnormal-termination-disp values."}},{"Name":"SPACE=","Type":"V","Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: SPACE=(unit,(primary,secondary,directory), RLSE,type,ROUND) \n\nIs the amount of disk space to be provided for a data set that is being created. \n\nunit \ncan be any of the following: \n\n  TRK -- allocates the space in tracks.    \n  CYL -- allocates the space in cylinders.    \n  blklen -- allocates space in blocks whose block length is blklen bytes. The system computes \n    how many tracks are allocated.  \n\nprimary \nspecifies how many tracks, cylinders, or blocks to allocate.\n\nsecondary \nspecifies how many additional tracks, cylinders, or blocks to allocate if more space is \nneeded. The system does not allocate additional space until it is needed.\n\ndirectory \nspecifies how many 256-byte directory blocks are needed for the directory of a partitioned data set.\n\nRLSE \ncauses unused space that was allocated to an output data set to be released when the data set \nis closed. Unused space is released only if the data set is opened for output and if the last \noperation was a write operation.\n\ntype \ncan be any of the following: \n\n  CONTIG -- specifies to use contiguous space.    \n  MXIG -- specifies to use the maximum contiguous space.    \n  ALX -- specifies to use different areas of contiguous space.   \n\n  Note: You can also specify MXIG or ALX as a separate, individual keyword in the FILENAME \n  statement rather than as a subparameter of the SPACE= option.  \n\nROUND \nspecifies that the allocated space must be equal to an integral number of cylinders when the \nspecified unit was a block length. If unit was specified as TRK or CYL, the system ignores ROUND."}},{"Name":"VOLSER=","Type":"V","Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: VOLSER=value | VOL=value | VOL=(value-1, ..., value-n) \n\nSpecifies the disk or tape volume serial number or numbers. Up to 30 volume serial \nnumbers can be specified.\n\nIf you do not specify VOLSER=, its value is taken from the SAS system option FILEVOL=."}},{"Name":"VOLCOUNT=","Type":"V","Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: VOLCOUNT=nnn \n\nwhere nnn is the maximum number of volumes that an output data set requires. The volume \ncount is a decimal number from 1 through 255."}},{"Name":"VOLSEQ=","Type":"V","Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: VOLSEQ=nnn \n\nwhere nnn identifies which volume of an existing multivolume data set is to be used \nto begin processing the data set. The volume sequence number is a decimal number from \n1 to 255."}},{"Name":"UNIT=","Type":"V","Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: UNIT=value | UNIT=(value,n) \n\nSpecifies one of several devices. The value parameter must be enclosed in quotation marks \nif the unit name contains characters other than alphanumeric characters. The n parameter \nis a number from 1 to 59 that specifies the number of devices to be allocated for the data \nset. If n is the letter \"p\" or \"P\", then all volumes for the data set are mounted in parallel."}},{"Name":"LABEL=","Type":"V","Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: LABEL=(subparameter-list) \n\nSpecifies the type and contents of the label of either a tape data set or a disk data set, \nas well as other information such as the retention period or expiration date for the data \nset. It is identical to the JCL LABEL= parameter. Here is a simple example: \n\n  label=(3,SL,,,EXPDT=2005/123)\n  \nThis label specification indicates that the data set sequence number is 3, that it uses \nstandard labels, and that it expires on the 123rd day of 2005."}},{"Name":"LOCKINTERNAL=","Type":"V","Values":{"@Value1":"AUTO","@Value2":"SHARED"},"ToolTips":{"@ToolTip1":"Specifies the SAS system locking that is to be used for the file or files that are  identified by a FILENAME statement. AUTO does not allow two applications within  the same SAS session to have simultaneous read and write access to a file. If an  application has write access to a file, no other applications can have read or  write access to it. If an application has read access to a file, no other application  can have write access to it. Multiple applications can have simultaneous read access  to a file.","@ToolTip2":"Specifies the SAS system locking that is to be used for the file or files that are  identified by a FILENAME statement. SHARED does not allow two applications within  the same SAS session to have simultaneous write access to a file. SHARED allows one  writer and multiple readers to have simultaneous access to a file."},"Help":{"#cdata":"Specifies the SAS system locking that is to be used for the file or files that are \nidentified by a FILENAME statement."}},{"Name":"NOMOUNT","Type":"S","Help":{"#cdata":"[z/OS Host Option]\n    \nSpecifies that the mount message is not issued for a volume that is not already \nonline. The default action is to issue the mount message."}},{"Name":"NOPROMPT","Type":"S","Help":{"#cdata":"[z/OS Host Option]\n    \nSpecifies that if the file that you reference in the FILENAME statement is unavailable, \na dialog box is not displayed and an error message is written to the SAS log."}},{"Name":"REUSE","Type":"S","Help":{"#cdata":"[z/OS Host Option]\n    \nSpecifies that dynamic allocation reuse an existing allocation, if possible, to fulfill \na new allocation request. By default, SAS requests that dynamic allocation create a unique \nallocation for this request."}},{"Name":"WAIT=","Type":"V","Help":{"#cdata":"[z/OS Host Option]\n    \nSyntax: WAIT=n \n\nControls how many minutes SAS waits if the file that you reference in the FILENAME \nstatement is unavailable. SAS tries to reacquire the reserved data set every 15 seconds. \nThe value n specifies a length of time in minutes."}},{"Name":"BOM|BOMFILE","Type":"S","Help":{"#cdata":"[UNIX/z/OS Host Option]\n    \nIncludes a Byte Order Mark when a UNICODE-encoded file is created."}},{"Name":"NOBOM|NOBOMFILE","Type":"S","Help":{"#cdata":"[UNIX/z/OS Host Option]\n    \nSpecifies that a Byte Order Mark is not included when a UNICODE-encoded file is created."}},{"Name":"FILEDATA=","Type":"V","Values":{"@Value1":"BINARY","@Value2":"TEXT"},"ToolTips":{"@ToolTip1":"The FILEDATA= option specifies that the file being processed is expected to contain  binary data.","@ToolTip2":"The FILEDATA= option specifies that the file being processed is expected to contain  text data."},"Help":{"#cdata":"[UNIX/z/OS Host Option] \n    \nThe FILEDATA= option specifies that the file being processed is expected to contain \neither binary or text data."}},{"Name":"OPTCD=","Type":"V","Help":{"#cdata":"[DCB Option under z/OS]\n    \nSyntax: OPTCD=value \n\nSpecifies the optional services to be performed by the operating environment. For example, \nspecifying W requests a validity check for write operations on direct-access devices. For \nmore information, see the appropriate IBM MVS JCL manual for your system.\n\nValid values are R, J, T, Z, A, Q, F, H, O, C, E, B, U, and W. You can specify more than \none code by listing them with no blanks or commas between them (as with RECFM). A maximum \nof four characters is allowed."}},{"Name":"DSORG=","Type":"V","Values":{"@Value1":"DA","@Value2":"PO","@Value3":"PS"},"ToolTips":{"@ToolTip1":"Specifies direct access.","@ToolTip2":"Specifies PDS, PDSE.","@ToolTip3":"Specifies sequential."},"Help":{"#cdata":"[DCB Option under z/OS] \n    \nThe following values for organization refer to physical files that contain location-dependent \ninformation: DAU, POU, PSU.\n\nYou do not need to include the DSORG= value when you create an external file of type PS or \nPO because the operating environment identifies a partitioned data set by the presence of a \ndirectory allocation in the SPACE= parameter. When you use a FILE statement to write data, \nSAS identifies a PDS or PDSE by the presence of a member name in the FILE statement. If no \nmember name is present, SAS assumes that the data set is sequential."}},{"Name":"DATACLAS=","Type":"V","Help":{"#cdata":"[SMS]\n    \nSyntax: DATACLAS=data-class-name  \n\nSpecifies the data class for an SMS-managed data set. The name can have up to eight \ncharacters. This option applies only to new data sets; it is ignored for existing data \nsets. The data class is predefined and controls the DCB attributes for a data set.\n\nThe implementation of the DATACLAS= option is compatible with the SMS DATACLAS= JCL parameter."}},{"Name":"DSNTYPE=","Type":"V","Values":{"@Value1":"BASIC","@Value2":"LARGE","@Value3":"EXTREQ","@Value4":"EXTPREF","@Value5":"LIBRARY","@Value6":"PDS","@Value7":"NONE"},"ToolTips":{"@ToolTip1":"Specifies that the system selects the BASIC format if the data set is sequential  (DSORG=PS or PSU), or if DSORG is omitted from all sources and the data set is  not VSAM. The data set cannot exceed 65535 tracks per volume.","@ToolTip2":"Specifies that the system selects the LARGE format if the data set is sequential  (DSORG=PS or PSU), or if DSORG is omitted from all sources and the data set is  not VSAM. The data set can exceed 65535 tracks per volume.","@ToolTip3":"Specifies that the data set is in the EXTENDED format if the data set is VSAM,  sequential, or if DSORG is omitted from all sources. The assignment fails if  the system cannot allocate an extended format data set.","@ToolTip4":"Specifies that you prefer that the data set is in the EXTENDED format if the data  set is VSAM, sequential, or if DSORG is omitted from all sources. If extended  format is not possible, the system will select the BASIC format.","@ToolTip5":"Specifies that the data set is a PDSE (DSORG=PO).","@ToolTip6":"Specifies that the data set is a PDS (DSORG=PO).","@ToolTip7":"Specifies that the default DSNTYPE of the system should be used when a new sequential  file is allocated."},"Help":{"#cdata":"[SMS] \n    \nSpecifies the type of name for the data set."}},{"Name":"LIKE=","Type":"V","Help":{"#cdata":"[SMS]\n    \nSyntax: LIKE=data-set-name  \n\nAllocates an external file that has the same attributes as an existing file."}},{"Name":"MGMTCLAS=","Type":"V","Help":{"#cdata":"[SMS]\n    \nSyntax: MGMTCLAS=management-class-name \n\nSpecifies a management class for an SMS data set. The name can have up to eight \ncharacters. This option applies only to new data sets; it is ignored for existing \ndata sets. The management class is predefined and controls how your data set is \nmanaged, such as how often it is backed up and how it is migrated.\n\nThe implementation of the MGMTCLAS= option is compatible with the SMS MGMTCLAS= \nJCL parameter."}},{"Name":"RECORG=","Type":"V","Values":{"@Value1":"KS","@Value2":"ES","@Value3":"RR","@Value4":"LS"},"ToolTips":{"@ToolTip1":"Specifies a VSAM key-sequenced data set.","@ToolTip2":"Specifies a VSAM entry-sequenced data set.","@ToolTip3":"Specifies a VSAM relative-record data set.","@ToolTip4":"Specifies a VSAM linear-space data set."},"Help":{"#cdata":"[SMS] \n    \nSpecifies the organization of records in a new VSAM data set. Use this option \nonly if SMS is active."}},{"Name":"STORCLAS=","Type":"V","Help":{"#cdata":"[SMS]\n    \nSyntax: STORCLAS=storage-class-name \n\nSpecifies a storage class for an SMS data set. The name can have up to eight characters. \nThis option applies only to new data sets; it is ignored for existing data sets. The \nstorage class is predefined and controls which device your SMS data set is stored on, \nsuch as disk or tape.\n\nThe implementation of the STORCLAS= option is compatible with the SMS STORCLAS= JCL \nparameter."}},{"Name":"SUBSYS=","Type":"V","Help":{"#cdata":"[Subsystem Options]\n    \nSpecifies the name of the subsystem (up to four characters)."}},{"Name":"PARM1=","Type":"V","Help":{"#cdata":"[Subsystem Options]\n\nSpecifies a subsystem parameter (up to 67 characters)."}},{"Name":"PARM2=","Type":"V","Help":{"#cdata":"[Subsystem Options]\n\nSpecifies a subsystem parameter (up to 67 characters)."}},{"Name":"PARM3=","Type":"V","Help":{"#cdata":"[Subsystem Options]\n\nSpecifies a subsystem parameter (up to 67 characters)."}},{"Name":"PARM4=","Type":"V","Help":{"#cdata":"[Subsystem Options]\n\nSpecifies a subsystem parameter (up to 67 characters)."}},{"Name":"PARM5=","Type":"V","Help":{"#cdata":"[Subsystem Options]\n\nSpecifies a subsystem parameter (up to 67 characters)."}},{"Name":"ALIGN","Type":"S","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nTells the operator to check the alignment of the printer forms before printing \nthe data set."}},{"Name":"BURST","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nTells the operator that the printed output goes to a burster-trimmer-stacker machine, \nto be burst into separate sheets."}},{"Name":"CHAR1=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies a one- to four-character name for character-arrangement table #1 (used \nin conjunction with the 3800 Printing Subsystem)."}},{"Name":"CHAR2=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies a one- to four-character name for character-arrangement table #2 (used \nin conjunction with the 3800 Printing Subsystem)."}},{"Name":"CHAR3=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies a one- to four-character name for character-arrangement table #3 (used \nin conjunction with the 3800 Printing Subsystem)."}},{"Name":"CHAR4=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies a one- to four-character name for character-arrangement table #4 (used \nin conjunction with the 3800 Printing Subsystem)."}},{"Name":"CLOSE","Type":"S","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nTells the operating environment to deallocate the data set when the DCB is closed."}},{"Name":"COPIES=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies how many copies of the SYSOUT data set to print. The default is COPIES=1."}},{"Name":"DEST=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies a destination for the SYSOUT data set. If DEST= is not defined, its value \nis taken from the SAS system option FILEDEST=."}},{"Name":"FCB=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the forms control buffer image that JES uses to control the printing \nof the SYSOUT data set."}},{"Name":"FLASH=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies which forms-overlay frame to use when printing on a 3800 Printing Subsystem."}},{"Name":"FLASHC=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the number of copies on which to print the forms overlay frame."}},{"Name":"FOLD","Type":"S","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies that the print chain or print train for the universal character set \nis loaded in fold mode."}},{"Name":"FORMDEF=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nIdentifies a member that contains statements that tell the Print Services Facility \nfrom IBM how to print the SYSOUT data set on a page-mode printer. This option has no \neffect on SAS forms."}},{"Name":"FORMS=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the IBM form number. If FORMS= is not defined, its value is taken from \nthe FILEFORMS= system option. This option has no effect on SAS forms."}},{"Name":"HOLD","Type":"S","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nTells the system to hold the SYSOUT data set when it is deallocated until it \nis released by the system operator."}},{"Name":"ID=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the user ID for the SYSOUT destination."}},{"Name":"MODIFY=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies a copy-modification module that tells JES how to print the SYSOUT data \nset on a 3800 Printing Subsystem."}},{"Name":"MODIFYT=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSyntax: MODIFYT=n\n\nSpecifies which of the CHARn tables to use. For example, if n is 1, then the \ncharacter-arrangement table that is identified by the CHAR1= option is used."}},{"Name":"OUTDES=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the output descriptor."}},{"Name":"OUTLIM=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies a limit for the number of logical records in the SYSOUT data set."}},{"Name":"PAGEDEF=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nIdentifies a member that contains statements that tell the Print Services Facility \nhow to format the page on a page-mode printer."}},{"Name":"PGM=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the SYSOUT program name."}},{"Name":"PRMODE=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies which process mode is required for printing the SYSOUT data set."}},{"Name":"SYSOUT=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the output class for the SYSOUT data set. If SYSOUT is not defined, its value \nis taken from the SAS system option FILESYSOUT=."}},{"Name":"UCS=","Type":"V","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nSpecifies the Universal Character Set."}},{"Name":"UCSVER","Type":"S","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nTells the operator to visually verify that the character set image is for the \ncorrect print chain or print train. The character set image is displayed on the \nprinter before the data set is printed."}},{"Name":"VERIFY","Type":"S","Help":{"#cdata":"[SYSOUT Data Set Option]\n\nTells the operator to verify that the image displayed on the printer is for \nthe correct FCB image."}},{"Name":"DATAURL","Type":"S","Help":{"#cdata":"Enables you to read data from user-specified text. \n    \nSyntax: FILENAME fileref DATAURL 'data-url-specification' <data-url-options>;\n\nValid in: Anywhere\n\nArguments:\nfileref is a valid fileref.\n\nDATAURL\n  specifies the access method that enables you to read data from data-url-specification.\n\n'data-url-specification' specifies the data.\n\n  Requirement:\n    The data must be in one of the following formats:\n    •data:, file-data, where data can consist of characters and URL-encoded characters. Examples are %20 and %00. data must be lowercase.\n    •data: ;base64, base64-data, where data consists of base64-encoded data. data must be lowercase.\n      \ndata-url-options\n  can be any of the following:\n    LRECL=record-length\n      where lrecl is the logical record length of the data.  \n  \n    RECFM=recfm\n      where recfm is one of three record formats:"}},{"Name":"ZIP","Type":"S","Help":{"#cdata":"Enables you to access ZIP files. \n    \nSyntax: FILENAME fileref ZIP 'external-file' <zip-options>;\n\nArguments: \nfileref is a valid fileref.\n\nZIP\n  specifies the access method that enables you to use ZIP files.\n\n'external-file'\n  specifies the name of the ZIP file that you want to read from or write to.\n   \nZIP Options (autocomplete loads them automatically)"}},{"Name":"COMMENT=","Type":"V","Help":{"#cdata":"Writes an informative comment in a ZIP file. \n      \nSyntax: COMMENT=\"comment-string\""}},{"Name":"COMPRESSION=","Type":"V","Help":{"#cdata":"Specifies the compression level that is used to write to the ZIP file member.  \n\nSyntax: COMPRESSION='compression-level'\n\n\nValid values for the compression level are 0 through 9. A value of 0 stores the file with \nno compression. A value of 9 indicates maximum compression.\n\nDefault: 6\nRestriction: COMPRESSION= is used only when opening a file for writing."}},{"Name":"OPTIONSX=","Type":"V","Help":{"#cdata":"Syntax: OPTIONSX='option-string' \n    \nSpecifies SFTP configuration options such as private keys and passphrases. All information in the \noption-string is blotted when written to the SAS log. \n\nRequirements:\nWhen you submit code that contains a FILENAME SFTP statement from SAS Enterprise Guide that runs on \na Windows workspace server, you must specify authentication by using the OPTIONS or OPTIONSX option.\nIf the passphrase in the OPTIONSX string contains one or more spaces, then the passphrase must be \nenclosed in double quotation marks and the OPTIONSX string must be enclosed in single quotation marks.\n\nTip:\nThe passphrase is passed using the -pw parameter."}},{"Name":"ACCEPT=","Type":"V","Help":{"#cdata":"Syntax: ACCEPT='header-type' \n    \nSpecifies the Accept: header. The Accept: header can be used to specify certain media types, \nwhich are acceptable for the response. \n\nDefault: */*\n\nRequirement: header-type must be enclosed in either single or double quotation marks."}},{"Name":"CONNECT","Type":"S","Help":{"#cdata":"Creates a connection between the client and the proxy and between the proxy and the server \nwhen accessing a URL through a proxy. \n\nRequirement:\nYou must use the PROXY= option with the CONNECT option. No connection is made if the CONNECT option is used \nwithout the PROXY= option. \n\nInteraction:\nIf you use \"http\" in the external-file argument, a connection is made, but the TLS protocol is not used."}},{"Name":"AUTHDOMAIN=","Type":"V","Help":{"#cdata":"Syntax: AUTHDOMAIN=\"auth-domain\"\n\nSpecifies the name of an authentication domain metadata object in order to connect to the WebDAV server. \nThe authentication domain references credentials (user ID and password) without your explicitly specifying \nthe credentials. \n\nRequirements:\nThe authentication domain and the associated login definition must be stored in a metadata repository, \nand the metadata server must be running in order to resolve the metadata object specification.\nThe auth-domain name is case sensitive, and it must be enclosed in double quotation marks.\n\nInteraction: If you specify AUTHDOMAIN=, you do not need to specify USER= and PASS=."}},{"Name":"DEL_ALL","Type":"S","Help":{"#cdata":"Enables you to delete a directory and all its members.\n\nRequirement: The DIR option is required when you use the DEL_ALL option.\n\nNote:\nThe default behavior of the WebDAV access method is that only empty directories can be deleted. \nUse the DEL_ALL option to delete directories that are not empty."}},{"Name":"MKDIR=","Type":"V","Help":{"#cdata":"Syntax: MKDIR=\"new-directory-name\" \n    \nSpecifies a new directory that is created from the parent directory that was specified in the \nexternal-file option. \n\nRequirements:\nYou must use valid directory syntax for the specified host.\nYou must use the DIR option with the MKDIR option.\n\nExample:\nfilename bankname webdav \"http://webserver.com/parentdir/\"\ndir mkdir=\"testdir1\" user=\"myid\" pass=\"xxxx\";"}},{"Name":"FILESRVC","Type":"S","Help":{"#cdata":"Syntax: Form 1:\nUse this form to access SAS Viya files using a file Uniform Resource Identifier (URI).\nFILENAME fileref FILESRVC 'file-uri' <filesrvc-options>;\n\nForm 2:\nUse this form to access a SAS Viya file using a collection option.\nFILENAME fileref FILESRVC collection-option <filesrvc-options>;\n\nwhere:\nfile-uri\n  is a valid file Uniform Resource Identifier (URI) of the file in the Files service. Here is an example: /files/files/<UUID>\n    \nEnables you to store and retrieve user content using the SAS Viya Files service."}},{"Name":"FOLDERPATH=","Type":"V","Help":{"#cdata":"Syntax: FOLDERPATH='path'\n    \nSpecifies a path to a SAS Viya folder for directory access.\n\nThe fileref is used to access files that are members of the folder.\n\nHere is an example:\nfilename jobout filesrvc folderpath='/output/user6/log';\n\nRestrictionThis option cannot be used with the FOLDERURI or PARENTURI options."}},{"Name":"FOLDERURI=","Type":"V","Help":{"#cdata":"Syntax: FOLDERURI='uri'\n    \nSpecifies a path to a SAS Viya folder by Uniform Resource Identifier (URI).\n\nThe fileref is used to access files that are members of the folder. Here is an example:\nfilename jobout filesrvc folderuri='/jobExecution/jobs/5a308aa7-1c3a-4465-a14c-fd69a9091926';\n   \nRestrictionThis option cannot be used with the FOLDERPATH or PARENTURI options."}},{"Name":"PARENTURI=","Type":"V","Help":{"#cdata":"Syntax: PARENTURI='uri'\n    \nSpecifies a SAS Viya object by Uniform Resource Identifier (URI).\n\nThe fileref is used to access files that are attachments to the parent object. Here is an example:\n\nfilename jobout filesrvc parenturi='/jobExecution/jobs/5a308aa7-1c3a-4465-a14c-fd69a9091926';\n\nRestrictionThis option cannot be used with the FOLDERPATH or FOLDERURI options."}},{"Name":"CONTENTTYPE=|CT=|CTYPE=","Type":"V","Help":{"#cdata":"Syntax: CONTENTTYPE='content-type'\n    \nSpecifies a default HTTP Content-Type header to be returned with the file when the file’s content \nis fetched from the Files service.\n\nDefaultThe provided file extension is mapped to a default content type. If a mapping is not found \nfor a provided file extension, the default content-type is set to application/octet-stream."}},{"Name":"CONTENTDISP=|CDISP=","Type":"V","Help":{"#cdata":"Syntax: CONTENTDISP='string'\n    \nSpecifies how to deliver the file."}},{"Name":"DEBUG=","Type":"V","Values":{"@Value1":"ERROR","@Value2":" HTTP"},"ToolTips":{"@ToolTip1":"Indicates to write debugging information when HTTP calls fail.","@ToolTip2":"Indicates to write debugging information for all HTTP calls."},"Help":{"#cdata":"Syntax: DEBUG=ERROR | HTTP\n    \nWrites debugging information to the SAS log."}},{"Name":"DESCRIPTION=","Type":"V","Help":{"#cdata":"Syntax: DESCRIPTION='string'\n    \nSpecifies a description for the file."}},{"Name":"DOCUMENTTYPE=|DT=","Type":"V","Help":{"#cdata":"Syntax: DOCUMENTTYPE='document-type'\n    \nSets the document type attribute of the file."}},{"Name":"FILENAME=|NAME=","Type":"V","Help":{"#cdata":"Syntax: FILENAME='name'\n    \nSpecifies the name of a file."}}],"#comment":[{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]}}