{"Keywords":{"Keyword":[{"Name":"DATALINES|CARDS","Type":"S","Help":{"#cdata":"Specifies that the input data immediately follows the DATALINES\\CARDS statement \nin the DATA step. Using DATALINES|CARDS allows you to use the INFILE statement \noptions to control how the INPUT statement reads instream data lines."}},{"Name":"DATALINES4|CARDS4","Type":"S","Help":{"#cdata":"Specifies that the input data immediately follows the DATALINES4|CARDS4 statement \nin the DATA step. Using DATALINES4|CARDS4 allows you to use the INFILE statement \noptions to control how the INPUT statement reads instream data lines."}},{"Name":"DISK","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies that the device is a disk drive."}},{"Name":"DUMMY","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies that the output to the file is discarded. \n    \nTip: Specifying DUMMY can be useful for testing."}},{"Name":"GTERM","Type":"S","Help":{"#cdata":"[device-type] \n    \nIndicates that the output device type is a graphics device that will receive \ngraphics data."}},{"Name":"PIPE","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies an unnamed pipe. Note: Some operating environments do not \nsupport pipes."}},{"Name":"PLOTTER","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies an unbuffered graphics output device."}},{"Name":"PRINTER","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies a printer or printer spool file."}},{"Name":"TAPE","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies a tape drive."}},{"Name":"TEMP","Type":"S","Help":{"#cdata":"[device-type] \n    \nCreates a temporary file that exists only as long as the filename is assigned. \n\nRestriction: Do not specify a physical pathname. If you do, SAS returns an error."}},{"Name":"TERMINAL","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies the user's terminal."}},{"Name":"UPRINTER","Type":"S","Help":{"#cdata":"[device-type] \n    \nSpecifies a Universal Printing printer definition name."}},{"Name":"BLKSIZE=","Type":"V","Help":{"#cdata":"Specifies the block size of the input file."}},{"Name":"COLUMN=|COL=","Type":"V","Help":{"#cdata":"Names a variable that SAS uses to assign the current column location of the input pointer. \nLike automatic variables, the COLUMN= variable is not written to the data set."}},{"Name":"DELIMITER=|DLM=","Type":"V","Help":{"#cdata":"Specifies an alternate delimiter (other than a blank) to be used for LIST input."}},{"Name":"DLMSTR=","Type":"V","Help":{"#cdata":"Specifies a character string as an alternate delimiter (other than a blank) to be used for \nLIST input"}},{"Name":"DLMSOPT=","Type":"V","Values":{"@Value1":"'I'","@Value2":"'T'"},"ToolTips":{"@ToolTip1":"Specifies that case-insensitive comparisons will be done.","@ToolTip2":"Specifies that trailing blanks of the string delimiter will be removed."},"Help":{"#cdata":"Specifies whether case-insensitive comparisons will be done, or trailing blanks of the string \ndelimiter will be removed."}},{"Name":"DSD","Type":"S","Help":{"#cdata":"Specifies that when data values are enclosed in quotation marks, delimiters within the value are \ntreated as character data. The DSD option changes how SAS treats delimiters when you use LIST \ninput and sets the default delimiter to a comma. When you specify DSD, SAS treats two consecutive \ndelimiters as a missing value and removes quotation marks from character values."}},{"Name":"ENCODING=","Type":"V","Values":{"@Value1":"'warabic'","@Value2":"'wbaltic'","@Value3":"'wlatin2'","@Value4":"'wcyrillic'","@Value5":"'wgreek'","@Value6":"'whebrew'","@Value7":"'wturkish'","@Value8":"'wvietnamese'","@Value9":"'wlatin1'","@Value10":"'utf-8'","@Value11":"'ms-950'","@Value12":"'ms-936'","@Value13":"'ms-932'","@Value14":"'ms-949'"},"ToolTips":{"@ToolTip1":"Arabic","@ToolTip2":"Baltic","@ToolTip3":"Central Europe","@ToolTip4":"Cyrillic","@ToolTip5":"Greek","@ToolTip6":"Hebrew","@ToolTip7":"Turkish","@ToolTip8":"Vietnamese","@ToolTip9":"Western","@ToolTip10":"Unicode encoding","@ToolTip11":"Traditional Chinese","@ToolTip12":"Simplified Chinese","@ToolTip13":"Japanese","@ToolTip14":"Korean"},"Help":{"#cdata":"Specifies the encoding to use when reading from the external file."}},{"Name":"END=","Type":"V","Help":{"#cdata":"Specifies a variable that SAS sets to 1 when the current input data record is the last in the \ninput file. Until SAS processes the last data record, the END= variable is set to 0. Like \nautomatic variables, this variable is not written to the data set. \n\nRestriction: You cannot use the END= option with UNBUFFERED option, DATALINES or DATALINES4 \nstatement, and an INPUT statement that reads multiple input data records."}},{"Name":"EOF=","Type":"V","Help":{"#cdata":"Specifies a statement label that is the object of an implicit GO TO when the INFILE statement \nreaches end of file."}},{"Name":"EOV=","Type":"V","Help":{"#cdata":"Specifies a variable that SAS sets to 1 when the first record in a file in a series of \nconcatenated files is read."}},{"Name":"EXPANDTABS","Type":"S","Help":{"#cdata":"Specifies to expand tab characters to the standard tab setting, which is set at 8-column \nintervals that start at column 9."}},{"Name":"NOEXPANDTABS","Type":"S","Help":{"#cdata":"Specifies not to expand tab characters to the standard tab setting, which is set at 8-column i\nntervals that start at column 9."}},{"Name":"FILENAME=","Type":"V","Help":{"#cdata":"Specifies a variable that SAS sets to the physical name of the currently opened input file. Like \nautomatic variables, the FILENAME= variable is not written to the data set."}},{"Name":"FILEVAR=","Type":"V","Help":{"#cdata":"Specifies a variable whose change in value causes the INFILE statement to close the current input \nfile and open a new one."}},{"Name":"FIRSTOBS=","Type":"V","Help":{"#cdata":"Specifies a record number that SAS uses to begin reading input data records in the input file. \nDefault: 1"}},{"Name":"FLOWOVER","Type":"S","Help":{"#cdata":"Causes an INPUT statement to continue to read the next input data record if it does not find \nvalues in the current input line for all the variables in the statement."}},{"Name":"LENGTH=","Type":"V","Help":{"#cdata":"Specifies a variable that SAS sets to the length of the current input line."}},{"Name":"LINE=","Type":"V","Help":{"#cdata":"Specifies a variable that SAS sets to the line location of the input pointer in the input buffer. \nLike automatic variables, the LINE= variable is not written to the data set."}},{"Name":"LINESIZE=|LS=","Type":"V","Help":{"#cdata":"Specifies the record length that is available to the INPUT statement."}},{"Name":"LRECL=","Type":"V","Help":{"#cdata":"Specifies the logical record length."}},{"Name":"N=","Type":"V","Help":{"#cdata":"Specifies the number of lines that are available to the input pointer at one time."}},{"Name":"MISSOVER","Type":"S","Help":{"#cdata":"Prevents an INPUT statement from reading a new input data record if it does not find values in \nthe current input line for all the variables in the statement."}},{"Name":"NBYTE=","Type":"V","Help":{"#cdata":"Specifies the name of a variable that contains the number of bytes to read from a file when \nyou are reading data in stream record format (RECFM=S in the FILENAME statement)."}},{"Name":"OBS=","Type":"V","Values":{"@Value1":"<record-number>","@Value2":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the record number of the last record to read in an input file that is read sequentially.","@ToolTip2":"Specifies the maximum number of observations to process, which will be at least as large as the  largest signed, 32-bit integer."},"Help":{"#cdata":"Use OBS= with FIRSTOBS= to read a range of records from the middle of a file."}},{"Name":"PAD","Type":"S","Help":{"#cdata":"SAS pads the records that are read from an external file with blanks to the length that is \nspecified in the LRECL= option."}},{"Name":"MOD","Type":"S","Help":{"#cdata":"Indicates that data written to the file should be appended to the file."}},{"Name":"NOPAD","Type":"S","Help":{"#cdata":"SAS does not pad the records that are read from an external file with blanks to the length that \nis specified in the LRECL= option."}},{"Name":"NEW","Type":"S","Help":{"#cdata":"Indicates that a new file is to be opened for output. If the file already exists, then it \nis deleted and re-created."}},{"Name":"OLD","Type":"S","Help":{"#cdata":"Indicates that a new file is to be opened for output. If the file already exists, then the \nprevious contents of the file are replaced."}},{"Name":"PRINT","Type":"S","Help":{"#cdata":"Specifies that the input file contains carriage-control characters."}},{"Name":"NOPRINT","Type":"S","Help":{"#cdata":"Specifies that the input file does not contain carriage-control characters."}},{"Name":"RECFM=","Type":"V","Help":{"#cdata":"Specifies the record format of the input file."}},{"Name":"SCANOVER","Type":"S","Help":{"#cdata":"Causes the INPUT statement to scan the input data records until the character string that is \nspecified in the @'character-string' expression is found."}},{"Name":"SHAREBUFFERS|SHAREBUFS","Type":"S","Help":{"#cdata":"Specifies that the FILE statement and the INFILE statement share the same buffer."}},{"Name":"START=","Type":"V","Help":{"#cdata":"Specifies a variable whose value SAS uses as the first column number of the record that the \nPUT _INFILE_ statement writes. Like automatic variables, the START variable is not written \nto the data set."}},{"Name":"STOPOVER","Type":"S","Help":{"#cdata":"Causes the DATA step to stop processing if an INPUT statement reaches the end of the current record \nwithout finding values for all variables in the statement."}},{"Name":"TRUNCOVER","Type":"S","Help":{"#cdata":"Overrides the default behavior of the INPUT statement when an input data record is shorter than the \nINPUT statement expects. By default, the INPUT statement automatically reads the next input data \nrecord. TRUNCOVER enables you to read variable-length records when some records are shorter than the \nINPUT statement expects. Variables without any values assigned are set to missing."}},{"Name":"UNBUFFERED|UNBUF","Type":"S","Help":{"#cdata":"Tells SAS not to perform a buffered (\"look ahead\") read."}},{"Name":"_INFILE_=","Type":"V","Help":{"#cdata":"Specifies a character variable that references the contents of the current input buffer for this \nINFILE statement."}},{"Name":"TERMSTR=","Type":"V","Help":{"#cdata":"Controls the end-of-line or record delimiters in PC- and UNIX-formatted files. This option \nenables the sharing of UNIX- and PC-formatted files between the two hosts."},"Values":{"@Value1":"CRLF","@Value2":"NL"},"ToolTips":{"@ToolTip1":"Carriage Return Line Feed. This parameter is used to create PC format files.","@ToolTip2":"Newline. This parameter is used to create UNIX format files. NL is the default format."}}]}}