{"Keywords":{"Keyword":[{"Name":"ACROSS=","Type":"V","Help":{"#cdata":"[Syntax: ACROSS=number-of-columns] \n    \nSpecifies the number of columns to use for legend entries. If there are multiple \nrows and columns in a legend, use the ROWMAJOR and COLMAJOR options to specify the \narrangement of legend entries. Specify the ROWMAJOR option to arrange entries (from \nlowest to highest) starting from left to right, and then top to bottom. Specify the \nCOLMAJOR option to arrange entries starting from top to bottom, and then left to right."}},{"Name":"CBLOCK=","Type":"C","Help":{"#cdata":"[Syntax: CBLOCK=block-color] \n    \nGenerates and colors a three-dimensional block effect behind the legend. The size \nand position of the block are controlled by the graphics option OFFSHADOW=(x,y)."}},{"Name":"CBORDER=","Type":"C","Help":{"#cdata":"[Syntax: CBORDER=frame-color] \n    \nDraws a colored frame around the legend. This option overrides the FRAME option. \nCBORDER= can be used in conjunction with the CFRAME= option."}},{"Name":"CFRAME=","Type":"C","Help":{"#cdata":"[Syntax: CFRAME=background-color] \n    \nSpecifies the background color of the legend. This option overrides the FRAME option. \nIf both the CFRAME= and FRAME= options are specified, only the solid background produced \nby the CFRAME= option is displayed. The CFRAME= option can be used in conjunction with the \nCBORDER= option."}},{"Name":"CSHADOW=","Type":"C","Help":{"#cdata":"[Syntax: CSHADOW=shadow-color] \n    \nGenerates and colors a drop shadow behind the legend. The size and position of the \nshadow is controlled by the graphics option OFFSHADOW=(x,y)."}},{"Name":"DOWN=","Type":"V","Help":{"#cdata":"[Syntax: DOWN=number-of-rows] \n    \nSpecifies the number of rows to use for legend entries. If there are multiple rows and  \ncolumns in a legend, use the ROWMAJOR and COLMAJOR options to specify the arrangement \nof legend entries. Specify the ROWMAJOR option to arrange entries (from lowest to highest) \nstarting from left to right, and then top to bottom. Specify the COLMAJOR option to arrange \nentries starting from top to bottom, and then left to right. The ROWMAJOR option is the \ndefault."}},{"Name":"FRAME","Type":"S","Help":{"#cdata":"Draws a frame around the legend. The color of the frame is the first color in \nthe color list."}},{"Name":"FWIDTH=","Type":"V","Help":{"#cdata":"[Syntax: FWIDTH=thickness-factor] \n    \nSpecifies the thickness of the frame, where thickness-factor is a number. The \nthickness of the line increases directly with thickness-factor. By default, \nFWIDTH=1."}},{"Name":"LABEL=","Type":"V","Help":{"#cdata":"[Syntax: LABEL=(text-argument(s)) | NONE] \n    \nModifies a legend label. Text-argument(s) defines the appearance or the text of a \nlegend label, or both. NONE suppresses the legend label. \n\nText-argument(s) can be one or more of these: \n\n  \"text-string\" \n  provides up to 256 characters of label text. Enclose each string in quotes. Separate \n  multiple strings with blanks.\n\n  text-description-suboption \n  modifies a characteristic such as the font, color, or size of the text strings that \n  follows it.\n\n  Text-description-suboption can be as follows: \n\n     COLOR=text-color\n     \n     FONT=font | NONE\n     \n     HEIGHT=text-height <units>\n     \n     JUSTIFY=LEFT | CENTER | RIGHT\n     \n     POSITION=(<BOTTOM | MIDDLE | TOP> <LEFT | CENTER | RIGHT>)"},"SubOptionsKeywords":"COLOR=|C=|FONT=|F=|HEIGHT=|H=|JUSTIFY=|J=|POSITION="},{"Name":"LABEL=NONE","Type":"V","Help":{"#cdata":"Suppresses the legend label."}},{"Name":"MODE=","Type":"V","Values":{"@Value1":"PROTECT","@Value2":"RESERVE","@Value3":"SHARE"},"ToolTips":{"@ToolTip1":"Draws the legend in the procedure output area, but a blanking area surrounds the legend, preventing other graphics elements from being displayed in the legend.","@ToolTip2":"Takes space for the legend from the procedure output area, thereby reducing the amount  of space available for the graph.","@ToolTip3":"Draws the legend in the procedure output area. If the legend is positioned over elements of the graph itself, both graphics elements and legend elements are displayed."},"Help":{"#cdata":"Specifies whether the legend is drawn in the procedure output area or whether legend elements can \noverlay other graphics elements."}},{"Name":"OFFSET=","Type":"V","Help":{"#cdata":"[Syntax: OFFSET=(<x><,y>)<units> | (<x <units>><,y <units>>)] \n    \nSpecifies the distance to move the entire legend;\n\nx is the number of units to move the legend right (positive numbers) or left (negative numbers), \nand y is the number of units to move the legend up (positive numbers) or down (negative numbers)."}},{"Name":"ORDER=","Type":"V","Values":{"@Value1":"<(value-list)>","@Value2":"DESCENDING"},"ToolTips":{"@ToolTip1":"Replace <(value-list)> with an actual value. Use value-list to select only those legend  values that you want to display and by their placement in the list, order where they appear  in the legend.","@ToolTip2":"Specifies that the legend values appear in the legend in reverse of the default order,  sorted from maximum to minimum value."},"Help":{"#cdata":"[Syntax: ORDER=(value-list)|DESCENDING] \n    \nSelects or orders the legend values that appear in the legend. The way you specify\n\nvalue-list depends on the type of variable that generates the legend: \n\nFor numeric variables, value-list is either an explicit list of values, or a starting \nand an ending value with an interval increment, or a combination of both forms: \n\n   n <...n>\n   \n   n TO n <BY increment>\n   \n   n <...n> TO n <BY increment> <n <...n>>\n   \n\nIf a numeric variable has an associated format, the specified values must be the \nunformatted values.\n\nFor character variables, value-list is a list of unique character values enclosed \nin quotes and separated by blanks: \n\n  \"value-1\" <...\"value-n\"> \n\nIf a character variable has an associated format, the specified values must be the \nformatted values."}},{"Name":"ORIGIN=","Type":"V","Help":{"#cdata":"[Syntax: ORIGIN=(<x><,y>)<units> | (<x <units >><,y <units>>)] \n    \nSpecifies the x coordinate and the y coordinate of the lower-left corner of the legend box. \nThe ORIGIN= option explicitly positions the legend anywhere on the graphics output area. \nIt is possible to run a legend off the page or overlay the graph.\n\nTo set only the x coordinate, specify one value, with or without a following comma: \n\n    origin=(4 cm,)\n    \nTo set both the x and y coordinates, specify two values, with or without a comma separating them: \n\n    origin=(2 pct, 4 pct)\n    \nTo set only the y coordinate, specify one value preceded by a comma: \n\n    origin=(,3 pct)"}},{"Name":"POSITION=","Type":"V","Help":{"#cdata":"[Syntax: POSITION=(<BOTTOM | MIDDLE | TOP> <LEFT | CENTER | RIGHT> <OUTSIDE | INSIDE>)] \n    \nPositions the legend on the graph. Values for POSITION= are:\n\n  OUTSIDE or INSIDE \n  specifies the location of the legend in relation to the axis area.\n   \n  BOTTOM or MIDDLE or TOP\n  specifies the vertical position.\n   \n  LEFT or CENTER or RIGHT\n  specifies the horizontal position."}},{"Name":"REPEAT=","Type":"V","Values":{"@Value1":"1","@Value2":"2","@Value3":"3"},"ToolTips":{"@ToolTip1":"Plot symbol is repeated once in the legend.","@ToolTip2":"Plot symbol is repeated twice in the legend.","@ToolTip3":"Plot symbol is repeated 3 times in the legend."},"Help":{"#cdata":"Use the REPEAT= option to specify how many times the plot symbol is repeated in the legend."}},{"Name":"ROWMAJOR","Type":"S","Help":{"#cdata":"Arranges entries (from lowest to highest) starting from left to right, and then top to bottom."}},{"Name":"COLMAJOR","Type":"S","Help":{"#cdata":"Arrange the entries starting from top to bottom, and then left to right."}},{"Name":"SHAPE=","Type":"V","Values":{"@Value1":"BAR","@Value2":"LINE","@Value3":"SYMBOL"},"ToolTips":{"@ToolTip1":"Syntax: BAR(width,height)<units>         Is used with the GCHART and GMAP procedures, with the GPLOT procedure if you use the  AREAS= option, and with the GCONTOUR procedure if you use the PATTERN option. Each  legend value is a bar of the specified width and height. By default, width is 5,  height is 0.8, and units are CELLS. You can specify units for the width,height pair  or for the individual coordinates.","@ToolTip2":"Syntax: LINE(length) <units>                 Is used with the GPLOT and GCONTOUR procedures. Each legend value is a line of the  length you specify. Plotting symbols are omitted from the legend values. By default,  length is 5 and units are CELLS. You can specify units for length.","@ToolTip3":"Syntax: SYMBOL(width<units>,height<units>) <units>                 Is used with the GPLOT procedure. Each legend value (not each symbol) is the width  and height you specify."},"Help":{"#cdata":"Specifies the size and shape of the legend values displayed in each legend entry."}},{"Name":"SPLIT=","Type":"V","Help":{"#cdata":"[Syntax: SPLIT=“split-char(s)”] \n    \nSpecifies one or more characters that the LEGEND statement uses to break a text description \nstring into multiple lines. Split-char(s) can be any character value that can be specified \nin a SAS character variable. Do not delimit when specifying multiple split characters. When \nthe LEGEND statement encounters the split character, it automatically breaks the value at \nthat point and continues on the next line. For example, suppose the legend text description \ncontains the string Berlin, Germany/Europe, and you specify SPLIT=“,/”. The legend will break \nthe text string into top-aligned lines as follows: \n\n  Berlin\n  Germany\n  Europe\n  \nIf the LEGEND statement does not encounter a specified split character, no break in the \ntext occurs, and no warning or error is issued.\n\nRestrictions:Not supported by Java and ActiveX \n\nNot supported by the GRADAR procedure\n\nUp to 31 split characters are supported. If you specify more than 31 characters, only the \nfirst 31 will be honored. \n\nNote: The split characters themselves are not displayed."}},{"Name":"VALUE=","Type":"V","Help":{"#cdata":"[Syntax: VALUE=(text-argument(s) ) | NONE] \n    \nModifies the legend value descriptions. Text-argument(s) defines the appearance \nor the text of the value descriptions. By default, value descriptions are the \nvalues of the variable that generates the legend or an associated format value. \nNumeric values are right-justified and character values are left-justified. NONE \nsuppresses the value descriptions although the legend values (bars, lines, and \nso on) are still displayed.\n\nText-argument(s) can be one or more of these: \n\n\"text-string\" \nprovides up to 256 characters of text for the value description. Enclose each string \nin quotes. Separate multiple strings with blanks.\n\ntext-description-suboption \nmodifies a characteristic such as the font, color, or size of the text string(s) that \nfollows it. Text-description-suboption can be as follows: \n\n   COLOR=text-color\n   \n   FONT=font | NONE\n   \n   HEIGHT=text-height <units >\n   \n   JUSTIFY=LEFT | CENTER | RIGHT\n   \n   TICK=n\n   "},"SubOptionsKeywords":"COLOR=|C=|FONT=|F=|HEIGHT=|H=|JUSTIFY=|J=|TICK=|T="}]}}