{"Keywords":{"Keyword":[{"Name":"ANIMATION=|ANIMATE=","Type":"V","Values":{"@Value1":"START","@Value2":"STOP"},"ToolTips":{"@ToolTip1":"Specifies to begin creating animation frames.","@ToolTip2":"Specifies to stop creating animation frames."},"Help":{"#cdata":"[Syntax: ANIMATION=START | STOP \n    \nSpecifies whether to start or stop creating animation frames.\n\nSyntax Description:\nSTART\n  specifies to begin creating animation frames.\nSTOP\n  specifies to stop creating animation frames.\n\nTip: Specify ANIMATION=STOP after you have created the frames for your animation file. \nIf ANIMATION=START remains specified, you might unintentionally create an animation file \nfor subsequent procedure statements."}},{"Name":"ANIMDURATION=","Type":"V","Values":{"@Value1":"<duration>","@Value2":"MIN"},"ToolTips":{"@ToolTip1":"Specifies to begin creating animation frames.","@ToolTip2":"Specifies to stop creating animation frames."},"Help":{"#cdata":"[Syntax: ANIMDURATION=duration | MIN \n    \nSpecifies the amount of time that each frame in the animation is held in view. \n\nSyntax Description:\nduration\n  specifies the number of seconds to hold an animation frame in view. The number can be any \n  numeric representation (for example, .01, 5, 6.5).\n\n  Defaults:\n    0 for GIF frames\n    0.1 for SVG pages\n  \nMIN\n  specifies to set the minimum amount of time that a frame is held in view.\n  Default: 0.1"}},{"Name":"ANIMLOOP=","Type":"V","Values":{"@Value1":"YES","@Value2":"NO","@Value3":"<n>"},"ToolTips":{"@ToolTip1":"Specifies that animation loops continuously repeat.","@ToolTip2":"Specifies that animation loops complete one loop.","@ToolTip3":"Specifies the number of times that an animation loop is continuously repeated. The number must be an integer.     Range: 1–2147483647"},"Help":{"#cdata":"[Syntax: ANIMLOOP=YES | NO | n\n    \nSpecifies whether the animation loop is played continuously or is played once, or specifies \na specific number of times that the animation loop is repeated. \n\nSyntax Description:\n  YES\n    specifies that animation loops continuously repeat.\n  NO\n    specifies that animation loops complete one loop. \n  n\n    specifies the number of times that an animation loop is continuously repeated. The number must be an integer.\n    Range: 1–2147483647"}},{"Name":"ANIMOVERLAY","Type":"S","Help":{"#cdata":"Specifies that each frame in an animation overlays the previous frame. All frames remain in view for \nthe duration of the animation."}},{"Name":"NOANIMOVERLAY","Type":"S","Help":{"#cdata":"Specifies that each frame is played sequentially. When a frame is played, it replaces the \nprevious frame."}},{"Name":"EMAILAUTHPROTOCOL=","Type":"V","Values":{"@Value1":"LOGIN","@Value2":"NONE","@Value3":"PLAIN"},"ToolTips":{"@ToolTip1":"Specifies that the LOGIN authentication protocol is used.","@ToolTip2":"Specifies that no authentication protocol is used.","@ToolTip3":"Specifies that the PLAIN authentication protocol is used. The PLAIN authentication protocol encodes  the user ID and password in BASE64 and encodes them as one string.  Note: When you specify PLAIN, you might also need to specify EMAILID and EMAILPW. If you omit  EMAILID, SAS looks up your user ID and uses it. If you omit EMAILPW, no password is used."},"Help":{"#cdata":"[Syntax: EMAILAUTHPROTOCOL=LOGIN | NONE | PLAIN] \n    \nSpecifies the authentication protocol for SMTP E-mail."}},{"Name":"EMAILHOST=","Type":"V","Help":{"#cdata":"[Syntax: EMAILHOST=server | (server) | \"server\" \n    EMAILHOST=('server-1' <options> <'server-2'> <options > …)] \n    \nSpecifies the Simple Mail Transfer Protocol (SMTP) server that supports e-mail \naccess. \n\nSyntax Description: \nserver\n  specifies one or more Simple Mail Transfer Protocol (SMTP) server domain names for your site.\n  Range: The maximum number of characters that can be specified for SMTP servers is 1,024.\n\n  Requirement: When more than one server name is specified, the list must be enclosed in parentheses \n  and each server name must be enclosed in single or double quotation marks.\n  Note: The system administrator for your site provides this information. \n  \noptions\n  specifies options that are available when you use secure SMTP servers. The following are valid \n  values for options.\n    AUTH=|AUTHPROTOCOL=authentication\n      specifies the authentication protocol. The following are valid values for auth.\n      LOGIN\n        specifies that the LOGIN authentication protocol is used. \n      PLAIN \n        specifies that the PLAIN authentication protocol is used.\n    PWD=|PASSWORD=|PW=password\n      specifies an e-mail logon password. \n    PORT=port-number\n      specifies a port number for the SMTP server. \n    SSL | STARTTLS\n      specifies either the Secure Sockets Layer (SSL) or Transport Layer Security \n    USERID=|ID=username\n      specifies the user name that is used to log on to the server."}},{"Name":"EMAILID=","Type":"V","Help":{"#cdata":"Syntax: EMAILID=loginid | profile | emailaddress \n\nSpecifies the identity of the individual sending e-mail from within SAS."}},{"Name":"EMAILFROM","Type":"S","Help":{"#cdata":"Specifies that the FROM e-mail option is required when sending e-mail by using \neither the FILE or FILENAME statements."}},{"Name":"NOEMAILFROM","Type":"S","Help":{"#cdata":"Specifies that the FROM e-mail option is not required when sending e-mail by using \neither the FILE or FILENAME statements."}},{"Name":"EMAILPORT","Type":"S","Help":{"#cdata":"Syntax: EMAILPORT <portnumber>\n\nSpecifies the port to which the Simple Mail Transfer Protocol (SMTP) server is attached."}},{"Name":"EMAILPW=","Type":"V","Help":{"#cdata":"[Syntax: EMAILPW=\"password\"] \n    \nSpecifies your e-mail login password."}},{"Name":"EMAILSYS=","Type":"V","Values":{"@Value1":"MAPI","@Value2":"VIM","@Value3":"SMTP"},"ToolTips":{"@ToolTip1":"Specifies to use the Messaging Application Programming Interface (MAPI) electronic mail interface. This value is the default.","@ToolTip2":"Specifies to use the Vendor Independent Mail (VIM) electronic mail interface.","@ToolTip3":"Specifies to use the Simple Mail Transfer Protocol email interface. "},"Help":{"#cdata":"[Syntax: EMAILSYS= MAPI | VIM | SMTP] \n    \nSpecifies the email protocol to use for sending electronic mail."}},{"Name":"METACONNECT=","Type":"V","Help":{"#cdata":"Identifies the named connection from the metadata user profiles to use as the default \nvalues for logging in to the SAS Metadata Server.\n    \nSyntax: METACONNECT=\"named-connection\"\n    \nwhere:\n\n\"named-connection\" is a named connection that is contained in the metadata user profiles."}},{"Name":"METAPASS=","Type":"V","Help":{"#cdata":"[Syntax: METAPASS=password] \n    \nSets the default password for the SAS Metadata Server."}},{"Name":"METAPORT=","Type":"V","Help":{"#cdata":"[Syntax: METAPORT=number] \n    \nSets the TCP port for the SAS Metadata Server."}},{"Name":"METAPROTOCOL=","Type":"V","Help":{"#cdata":"[Syntax: METAPROTOCOL=BRIDGE | COM]\n\nSets the network protocol for communicating with the SAS Metadata Server."}},{"Name":"METAREPOSITORY=","Type":"V","Help":{"#cdata":"[Syntax: METAREPOSITORY=name] \n    \nSets the name of the default SAS Metadata Repository to use on the SAS Metadata Server."}},{"Name":"METASERVER=","Type":"V","Help":{"#cdata":"[Syntax: METASERVER=IP-address] \n    \nSets the internet protocol (IP) address of the SAS Metadata Server."}},{"Name":"METASPN=","Type":"V","Help":{"#cdata":"[Syntax: METASPN=SPN-name]\n   \nSpecifies the service principal name (SPN) for the SAS Metadata Server.\n\nSyntax Description:\nSPN-name \n  is the SPN for the principal that runs the metadata server. The maximum length is 256 characters. \n  The following formats are supported for SPN-name: \n  \n    SAS/machine-name or SAS/machine-name.company.com. \n    “SAS” is the name of the service and represents the service type."}},{"Name":"METAUSER=","Type":"V","Help":{"#cdata":"[Syntax: METAUSER=id] \n   \nSets the default user identification for logging onto the SAS Metadata Server."}},{"Name":"AUTOSAVELOC=","Type":"V","Help":{"#cdata":"Syntax: AUTOSAVELOC=\"destination\"\n\nSpecifies the location (pathname) of the Program Editor autosave file. If destination \ncontains spaces or is specified in an OPTIONS statement, then enclose destination in \nquotation marks."}},{"Name":"CHARCODE","Type":"S","Help":{"#cdata":"Allows certain character combinations to be substituted for special characters that \nmay not be on your keyboard."}},{"Name":"NOCHARCODE","Type":"S","Help":{"#cdata":"Does not allow substitutions for certain keyboard characters."}},{"Name":"FONTSLOC=","Type":"V","Help":{"#cdata":"Syntax: FONTSLOC=\"location\"\n\nSpecifies the location that contains the SAS fonts that are loaded by some Universal \nPrinter drivers."}},{"Name":"FORMS=","Type":"V","Help":{"#cdata":"[Syntax: FORMS=form-name]\n\nSpecifies the default form that is used for windowing output."}},{"Name":"BYERR","Type":"S","Help":{"#cdata":"Specifies that SAS generates an error message and sets the error flag when a _NULL_ \ndata set is used in the SORT procedure, or if no BY statement or BY variable is \nspecified."}},{"Name":"NOBYERR","Type":"S","Help":{"#cdata":"Specifies that SAS ignore the error message and continue processing if the SORT \nprocedure attempts to sort a _NULL_ data set or if no BY statement or BY variable \nis specified."}},{"Name":"CLEANUP","Type":"S","Help":{"#cdata":"Specifies that during the entire session, SAS attempts to perform automatic, continuous \nclean-up of resources that are not essential for execution."}},{"Name":"NOCLEANUP","Type":"S","Help":{"#cdata":"Specifies that SAS allow the user to choose how to handle an out-of-resource condition."}},{"Name":"DMSSYNCHK","Type":"S","Help":{"#cdata":"Enables syntax check mode for multiple steps in the SAS windowing and Explorer environments."}},{"Name":"NODMSSYNCHK","Type":"S","Help":{"#cdata":"Does not enable syntax check mode for statements that are submitted within the windowing and \nExplorer environments."}},{"Name":"DSNFERR","Type":"S","Help":{"#cdata":"Specifies that SAS issue an error message and stop processing if a reference is made to a SAS data \nset that does not exist."}},{"Name":"NODSNFERR","Type":"S","Help":{"#cdata":"Specifies that SAS ignore the error message LINESIZE=and continue processing if a reference is made to a \nSAS data set that does not exist. The data set reference is treated as if _NULL_ had been specified."}},{"Name":"ERRORABEND|ERRABEND","Type":"S","Help":{"#cdata":"Specifies that SAS abend for most errors (including syntax errors) that would normally cause it to issue\nan error message, set OBS=0, and go into syntax-check mode (in batch mode only)."}},{"Name":"NOERRORABEND|NOERRABEND","Type":"S","Help":{"#cdata":"Specifies that SAS handle errors normally, that is, issue an error message, set OBS=0,\nand go into syntax-check mode (in batch mode only)."}},{"Name":"ERRORBYABEND","Type":"S","Help":{"#cdata":"Specifies that SAS terminate BY-group error conditions that would normally cause it to issue an error message."}},{"Name":"NOERRORBYABEND","Type":"S","Help":{"#cdata":"Specifies that SAS handle BY-group errors normally, that is, by issuing an error message and continuing processing."}},{"Name":"ERRORCHECK=","Type":"V","Values":{"@Value1":"NORMAL","@Value2":"STRICT"},"ToolTips":{"@ToolTip1":"Specifies not to place the SAS program into syntax-check mode when an error occurs in a LIBNAME  or FILENAME statement, or in a LOCK statement in SAS/SHARE software. In addition, the program  or session does not terminate when a %INCLUDE statement fails due to a non-existent file.","@ToolTip2":"Specifies to place the SAS program into syntax-check mode when an error occurs in a LIBNAME or  FILENAME statement, or in a LOCK statement in SAS/SHARE software. If the ERRORABEND system  option is set and an error occurs in either a LIBNAME or FILENAME statement, SAS terminates.  In addition, SAS terminates when a %INCLUDE statement fails due to a non-existent file."},"Help":{"#cdata":"[Syntax: ERRORCHECK=NORMAL | STRICT] \n    \nControls error handling."}},{"Name":"ERRORS=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of observations for which SAS issues error messages in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number of observations for which SAS issues error messages in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number of observations for which SAS issues error messages in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the number of observations for which SAS issues error messages in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the number of observations for which SAS issues error messages in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the number of observations for which SAS issues error messages as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the minimum number of observations for which SAS issues error messages to 0.","@ToolTip8":"Sets the maximum number of observations for which SAS issues error messages to the largest signed,  4-byte integer representable in your operating environment."},"Help":{"#cdata":"[Syntax: ERRORS=n| nK | nM | nG | nT | hexX | MIN| MAX]\n\nSpecifies the maximum number of observations for which complete error messages are printed."}},{"Name":"FMTERR","Type":"S","Help":{"#cdata":"Specifies that when SAS cannot find a specified variable format, it generates\nan error message and does not allow default substitution to occur."}},{"Name":"NOFMTERR","Type":"S","Help":{"#cdata":"Replaces missing formats with the w. or $w. default format, issues a note, and continues processing."}},{"Name":"QUOTELENMAX","Type":"S","Help":{"#cdata":"Specifies that SAS write to the SAS log a warning for the maximum length for strings in quotation \nmarks to the SAS log."}},{"Name":"NOQUOTELENMAX","Type":"S","Help":{"#cdata":"Specifies that SAS does not write a warning for the maximum length for strings in quotation marks \nto the SAS log."}},{"Name":"VNFERR","Type":"S","Help":{"#cdata":"Specifies that SAS either issue a warning and error message, or set _ERROR_=1 and stop processing, \nor both if the error is severe enough to interrupt processing."}},{"Name":"NOVNFERR","Type":"S","Help":{"#cdata":"Specifies that SAS issue a warning for a variable that is not found, but not set _ERROR_=1 or \nstop processing."}},{"Name":"APPLETLOC=","Type":"V","Help":{"#cdata":"Syntax: APPLETLOC=\"base-URL\" \n\nSpecifies the location of Java applets. The maximum address length is 256 characters."}},{"Name":"FMTSEARCH=","Type":"V","Help":{"#cdata":"Syntax: FMTSEARCH=(catalog-specification-1... catalog-specification-n) \n\nControls the order in which format catalogs are searched ."}},{"Name":"PARM=","Type":"V","Help":{"#cdata":"[Syntax: PARM=<'>string<'>] \n    \nSpecifies a parameter string that is passed to an external program."}},{"Name":"PARMCARDS=","Type":"V","Help":{"#cdata":"[Syntax: PARMCARDS=file-ref] \n    \nSpecifies the file reference to use as the PARMCARDS= file."}},{"Name":"SASAUTOS=","Type":"V","Help":{"#cdata":"Syntax: SASAUTOS=library-specification | (library-specification-1 ... , library-specification-n) \n\nSpecifies one or more locations that contain library members containing SAS macro \ndefinitions. A location can be a SAS fileref or a host-specific location name \nenclosed in quotation marks."}},{"Name":"SYSPARM=","Type":"V","Help":{"#cdata":"[Syntax: SYSPARM='character-string'] \n    \nSpecifies a character string (up to 200 characters) enclosed in quotation marks that \ncan be passed to SAS programs."}},{"Name":"USER=","Type":"V","Help":{"#cdata":"[Syntax: USER=library-specification]\n\nSpecifies the libref or physical name of the default permanent SAS data library."}},{"Name":"UUIDCOUNT=","Type":"V","Values":{"@Value1":"n","@Value2":"MIN","@Value3":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of UUIDs to acquire (Range: 0-1000). Zero indicates that the  UUID Generator Daemon is not required.","@ToolTip2":"Specifies that the number of UUIDs to acquire is zero, indicating that the  UUID Generator Daemon is not required.","@ToolTip3":"Specifies that 1000 UUIDs at a time should be acquired from the UUID Generator Daemon."},"Help":{"#cdata":"[Syntax: UUIDCOUNT=n | MIN | MAX]\n\nSpecifies the number of UUIDs to acquire each time the UUID Generator Daemon is used."}},{"Name":"CGOPTIMIZE=|CGOPT=","Type":"V","Values":{"@Value1":"0","@Value2":"1","@Value3":"2","@Value4":"3"},"ToolTips":{"@ToolTip1":"Specifies not to perform optimization.","@ToolTip2":"Specifies to perform stage 1 optimization. Stage 1 optimization removes redundant instructions, missing  value checks, and repetitive computations for array subscriptions; detects patterns of instructions and  replaces them with more efficient sequences.","@ToolTip3":"Specifies to perform stage 2 optimization. Stage 2 performs optimizations that pertain to the SAS register.","@ToolTip4":"Specifies to perform full optimization, which is a combination of stages 1 and 2. This is the default value."},"Help":{"#cdata":"[Syntax: CGOPTIMIZE=0 | 1 | 2 | 3] \n\nSpecifies the level of optimization to perform during code compilation."}},{"Name":"WORKTERM","Type":"S","Help":{"#cdata":"Erases the WORK files at the termination of a SAS session."}},{"Name":"NOWORKTERM","Type":"S","Help":{"#cdata":"Does not erase the WORK files."}},{"Name":"AUTHPROVIDERDOMAIN|AUTHPD","Type":"S","Help":{"#cdata":"Associates a domain suffix with an authentication provider."}},{"Name":"BATCH","Type":"S","Help":{"#cdata":"Specifies whether batch settings for LINESIZE, OVP, PAGESIZE, and SOURCE are in effect \nwhen SAS executes."}},{"Name":"NOBATCH","Type":"S","Help":{"#cdata":"Specifies that SAS not use the batch settings for LINESIZE=, OVP, PAGESIZE=, and SOURCE."}},{"Name":"MULTENVAPPL","Type":"S","Help":{"#cdata":"Specifies that the Select Font window is displayed in the Frame region manager when \nyou set the font for a region title. Use the Select Font window to select different \nfont families, styles, weights, and point sizes."}},{"Name":"NOMULTENVAPPL","Type":"S","Help":{"#cdata":"Specifies that SAS/AF and SAS/FSP software display a Font Selector window that is \nspecific to the operating environment in which the application is executing."}},{"Name":"DFLANG=","Type":"V","Values":{"@Value1":"'Afrikaans'","@Value2":"'Catalan'","@Value3":"'Croatian'","@Value4":"'Czech'","@Value5":"'Danish'","@Value6":"'Dutch'","@Value7":"'English'","@Value8":"'Finnish'","@Value9":"'French'","@Value10":"'German'","@Value11":"'Hungarian'","@Value12":"'Italian'","@Value13":"'Japanese'","@Value14":"'Macedonian'","@Value15":"'Norwegian'","@Value16":"'Polish'","@Value17":"'Portuguese'","@Value18":"'Russian'","@Value19":"'Slovenian'","@Value20":"'Spanish'","@Value21":"'Swedish'","@Value22":"'Swiss_French'","@Value23":"'Swiss_German'"},"ToolTips":{"@ToolTip1":"Afrikaans","@ToolTip2":"Catalan","@ToolTip3":"Croatian","@ToolTip4":"Czech","@ToolTip5":"Danish","@ToolTip6":"Dutch","@ToolTip7":"English","@ToolTip8":"Finnish","@ToolTip9":"French","@ToolTip10":"German","@ToolTip11":"Hungarian","@ToolTip12":"Italian","@ToolTip13":"Japanese","@ToolTip14":"Macedonian","@ToolTip15":"Norwegian","@ToolTip16":"Polish","@ToolTip17":"Portuguese","@ToolTip18":"Russian","@ToolTip19":"Slovenian","@ToolTip20":"Spanish","@ToolTip21":"Swedish","@ToolTip22":"Swiss_French","@ToolTip23":"Swiss_German"},"Help":{"#cdata":"Syntax: DFLANG='language', locale\n    \nSpecifies language for international date informats and formats. \n\n'language' \nspecifies the language that is used for international date informats and formats. \nThese languages are valid values for language: \n    Afrikaans \n    Catalan \n    Croatian \n    Czech \n    Danish \n    Dutch \n    English \n    Finnish \n    French \n    German \n    Hungarian \n    Italian \n    Japanese \n    Macedonian \n    Norwegian \n    Polish \n    Portuguese \n    Russian \n    Slovenian \n    Spanish \n    Swedish \n    Swiss_French \n    Swiss_German \n\nlocale \nthe locale that is specified with the locale system option becomes the active locale."}},{"Name":"TRANTAB=","Type":"V","Help":{"#cdata":"[Syntax: TRANTAB=(catalog-entries)] \n   \nSpecifies the translation tables that are used by various parts of SAS. \n\nSyntax Description:\ncatalog-entries \n  specifies SAS catalog entries that contain translation tables. If you specify entry-name.type, \n  SAS searches SASUSER.PROFILE first and then SASUSER.HOST."}},{"Name":"NOASYNCHIO","Type":"S","Help":{"#cdata":"Causes data set I/O to wait for completion. This is the default."}},{"Name":"BUFNO=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of buffers in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number of buffers in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number of buffers in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the number of buffers in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the number of buffers in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the number of buffers as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the minimum number of buffers to 0, which causes SAS to use the minimum optimal value  for the operating environment. This is the default.","@ToolTip8":"Sets the number of buffers to the maximum possible number in your operating environment,  up to the largest four-byte, signed integer, which is (2³¹)-1, or approximately 2 billion."},"Help":{"#cdata":"Specifies the number of buffers to be allocated for processing SAS data sets."}},{"Name":"LRECL=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"hexX","@Value4":"MIN","@Value5":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the logical record length in multiples of 1 (bytes).  Replace n with an integer value. Default is 256.","@ToolTip2":"Specifies the logical record length in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the logical record length as a hexadecimal value.  You must specify the value beginning with a number (0–9), followed by an X.  For example, the value 2dx sets the logical record length to 45 characters.","@ToolTip4":"Specifies a logical record length of 1.","@ToolTip5":"Specifies a logical record length of 32,767."},"Help":{"#cdata":"Syntax: LRECL=n | nK | hexX | MIN | MAX\n\nSpecifies the default logical record length to use for reading and writing external files. \n\nDefault:\nThe shipped default is 32767."}},{"Name":"IBUFNO=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of extra index buffers to be allocated in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number of extra index buffers to be allocated in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number of extra index buffers to be allocated in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the number of extra index buffers to be allocated in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the number of extra index buffers to be allocated in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the number of extra index buffers to be allocated as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the minimum number of extra index buffers to be allocated to 0. This is the default.","@ToolTip8":"Sets the number of extra index buffers to be allocated to 10,000."},"Help":{"#cdata":"Syntax: IBUFNO=n| nK | nM | nG | nT | hexX  | MIN | MAX\n\nSpecifies an optional number of extra buffers to be allocated for navigating an index file."}},{"Name":"BUFSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the page size in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the page size in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the page size in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the page size in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the page size in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the page size as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the page size to the maximum possible number in your operating environment,  up to the largest four-byte, signed integer, which is (2³¹)-1, or approximately 2 billion."},"Help":{"#cdata":"[Syntax: BUFSIZE=n| nK | nM | nG | nT |hexX | MIN | MAX]\n\nSpecifies the permanent buffer page size for output SAS data sets."}},{"Name":"CBUFNO=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of extra page buffers in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number of extra page buffers in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number of extra page buffers in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the number of extra page buffers in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the number of extra page buffers in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the number of extra page buffers as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the minimum number of extra page buffers to 0.","@ToolTip8":"Sets the number of extra page buffers to 20."},"Help":{"#cdata":"[Syntax: CBUFNO=n | nK | nM | nG | nT | hexX |MIN | MAX]\n\nControls the number of extra page buffers to allocate for each open SAS catalog."}},{"Name":"CMPLIB=","Type":"V","Help":{"#cdata":"[Syntax: CMPLIB=libref.catalog | (libref.catalog-1 ... libref.catalog-n) | (libref.catalogN - libref.catalogM)]\n\nSpecifies one or more SAS catalogs containing compiler subroutines to include during program compilation."}},{"Name":"CMPMODEL=","Type":"V","Values":{"@Value1":"BOTH","@Value2":"CATALOG","@Value3":"XML"},"ToolTips":{"@ToolTip1":"Specifies that the MODEL procedure create two output types for a model, one as a SAS catalog entry  and the other as an XML file. This is the default.","@ToolTip2":"Specifies that the output model type is an entry in a SAS catalog.","@ToolTip3":"Specifies that the output model type is an XML file."},"Help":{"#cdata":"[Syntax: CMPLIB=BOTH|CATALOG|XML]\n\nSpecifies the output model type for the MODEL procedure."}},{"Name":"COMPRESS=","Type":"V","Values":{"@Value1":"NO","@Value2":"YES","@Value3":"CHAR","@Value4":"BINARY"},"ToolTips":{"@ToolTip1":"Specifies that the observations in a newly created SAS data set are uncompressed (fixed-length records).","@ToolTip2":"Specifies that the observations in a newly created SAS data set are compressed (variable-length records)  by SAS using RLE (Run Length Encoding).","@ToolTip3":"Same as YES,  but COMPRESS=CHAR is only accepted by Version 7 and later versions.","@ToolTip4":"Specifies that the observations in a newly created SAS data set are compressed (variable-length records)  by SAS using RDC (Ross Data Compression)."},"Help":{"#cdata":"[Syntax: COMPRESS=NO|YES|CHAR|BINARY]\n\nSpecifies the type of compression of observations to use for output SAS data sets."}},{"Name":"DATASTMTCHK=","Type":"V","Values":{"@Value1":"COREKEYWORDS","@Value2":"ALLKEYWORDS","@Value3":"NONE"},"ToolTips":{"@ToolTip1":"Prohibits certain words as one-level SAS data set names in the DATA statement. They can appear as  two-level names. The following keywords cannot appear as one-level SAS data set names: MERGE,  RETAIN, SET, UPDATE.","@ToolTip2":"Prohibits any keyword that can begin a statement in the DATA step (for example, ABORT, ARRAY, INFILE)  as a one-level data set name in the DATA statement.","@ToolTip3":"Provides no protection against overwriting SAS data sets."},"Help":{"#cdata":"Prevents certain errors by controlling the SAS keywords that are allowed in the DATA statement."}},{"Name":"DKRICOND=","Type":"V","Values":{"@Value1":"ERROR","@Value2":"WARNING","@Value3":"NOWARNING"},"ToolTips":{"@ToolTip1":"Sets the error flag and writes an error message to the SAS log when a variable is missing from an  input data set during the processing of a DROP=, KEEP=, or RENAME= data set option.","@ToolTip2":"Writes a warning message to the SAS log when a variable is missing from an input data set  during the processing of a DROP=, KEEP=, or RENAME= data set option.","@ToolTip3":"does not write a warning message to the SAS log when a variable is missing from an input data set  during the processing of a DROP=, KEEP=, or RENAME= data set option."},"Help":{"#cdata":"[Syntax: DKRICOND=ERROR | WARN|WARNING | NOWARN|NOWARNING]\n\nSpecifies the level of error detection to report when a variable is missing from an input data set \nduring the processing of a DROP=, KEEP=, or RENAME= data set option."}},{"Name":"DKROCOND=","Type":"V","Values":{"@Value1":"ERROR","@Value2":"WARNING","@Value3":"NOWARNING"},"ToolTips":{"@ToolTip1":"Sets the error flag and writes an error message to the SAS log when a variable is missing from an  output data set during the processing of a DROP=, KEEP=, or RENAME= data set option.","@ToolTip2":"Writes a warning message to the SAS log when a variable is missing from an output data set  during the processing of a DROP=, KEEP=, or RENAME= data set option.","@ToolTip3":"does not write a warning message to the SAS log when a variable is missing from an output data set  during the processing of a DROP=, KEEP=, or RENAME= data set option."},"Help":{"#cdata":"[Syntax: DKROCOND=ERROR | WARN|WARNING | NOWARN|NOWARNING]\n\nSpecifies the level of error detection to report when a variable is missing for an \noutput data set during the processing of a DROP=, KEEP=, or RENAME= data set option."}},{"Name":"DLDMGACTION=","Type":"V","Values":{"@Value1":"FAIL","@Value2":"ABORT","@Value3":"REPAIR","@Value4":"NOINDEX","@Value5":"PROMPT"},"ToolTips":{"@ToolTip1":"Stops the step and issues an error message to the log immediately. This is the default for batch mode.","@ToolTip2":"Terminates the step, issues an error message to the log, and terminates the SAS session.","@ToolTip3":"For data files, automatically repairs and rebuilds indexes and integrity constraints, unless the data  file is truncated. You use the REPAIR statement to restore a truncated data set. It issues a warning  message to the log. This is the default for interactive mode. For catalogs, automatically deletes catalog  entries for which an error occurs during the repair process.","@ToolTip4":"For data files, automatically repairs the data file without the indexes and integrity constraints,  deletes the index file, updates the data file to reflect the disabled indexes and integrity  constraints, and limits the data file to be opened only in INPUT mode.   Restriction: NOINDEX does not apply to damaged catalogs or libraries, only data files.","@ToolTip5":"For data sets, displays a dialog box that asks you to select the FAIL, ABORT, REPAIR, or NOINDEX  action. For a damaged catalog or library, PROMPT displays a dialog box where you can specify  either FAIL, ABORT, or REPAIR."},"Help":{"#cdata":"Specifies the type of action to take when a SAS data set or a SAS catalog is detected as damaged."}},{"Name":"FIRSTOBS=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"hexX","@Value6":"MIN","@Value7":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of the first observation or external file record to process in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number of the first observation or external file record to process in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number of the first observation or external file record to process in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the number of the first observation or external file record to process in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the number of the first observation or external file record to process as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip6":"Sets the number of the first observation or external file record to process to 1. This is the default.","@ToolTip7":"Sets the number of the first observation or external file record to process to the maximum number of  observations in the data set, up to the largest eight-byte, signed integer, which is 2⁶³-1, or  approximately 9.2 quintillion observations."},"Help":{"#cdata":"Specifies which observation or record SAS processes first."}},{"Name":"FONTRENDERING=","Type":"V","Values":{"@Value1":"HOST_PIXELS","@Value2":"FREETYPE_POINTS"},"ToolTips":{"@ToolTip1":"Specifies that fonts are displayed or printed by the operating system and that fonts  are requested in pixels.","@ToolTip2":"Specifies that fonts are displayed or printed by the FreeType engine and that fonts  are requested in points. This is the default."},"Help":{"#cdata":"Specifies whether SAS/GRAPH display drivers and image format drivers display or print fonts \nby using the operating system or by using the FreeType engine."}},{"Name":"IBUFSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the page size for an index file in multiples of 1 (bytes).  Replace n with an integer value. The default is 0.","@ToolTip2":"Specifies the page size for an index file in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the page size for an index file in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the page size for an index file in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the page size for an index file in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the page size for an index file as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the page size for an index file to the maximum possible number. For IBUFSIZE=,  the value is 32,767 bytes."},"Help":{"#cdata":"Syntax: IBUFSIZE=n | nK | nM | nG | nT |hexX | MAX\n\nSpecifies the buffer page size for an index file."}},{"Name":"_LAST_=","Type":"V","Help":{"#cdata":"Specifies the most recently created data set."}},{"Name":"JPEGQUALITY=","Type":"V","Values":{"@Value1":"n","@Value2":"MIN","@Value3":"MAX"},"ToolTips":{"@ToolTip1":"Specifies an integer ranging from 0 to 100 that indicates the JPEG quality factor.  Default is 75.","@ToolTip2":"Specifies to set the JPEG quality factor to 0, which has the lowest image quality  and the greatest file compression.","@ToolTip3":"Specifies to set the JPEG quality factor to 100, which has the highest image quality  with no file compression."},"Help":{"#cdata":"Specifies the JPEG quality factor that determines the ratio of image quality to the level of \ncompression for JPEG files produced by the SAS/GRAPH JPEG device driver."}},{"Name":"MERGENOBY=","Type":"V","Values":{"@Value1":"NOWARN","@Value2":"WARN","@Value3":"ERROR"},"ToolTips":{"@ToolTip1":"Specifies that no warning message is issued. This is the default.","@ToolTip2":"Specifies that a warning message is issued.","@ToolTip3":"Specifies that an error message is issued."},"Help":{"#cdata":"[Syntax: MERGENOBY=NOWARN |WARN | ERROR]\n\nSpecifies the type of message that is issued when MERGE processing occurs without \nan associated BY statement."}},{"Name":"OBS=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number to indicate when to stop processing in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the number to indicate when to stop processing in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number to indicate when to stop processing in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the number to indicate when to stop processing in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the number to indicate when to stop processing in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the number to indicate when to stop processing as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the minimum number to indicate when to stop processing to 0.","@ToolTip8":"Sets the number to indicate when to stop processing to the maximum number of observations or records,  up to the largest eight-byte, signed integer, which is 263-1, or approximately 9.2 quintillion. This is the default."},"Help":{"#cdata":"Specifies the observation that is used to determine the last observation to process, \nor specifies the last record to process."}},{"Name":"REPLACE","Type":"S","Help":{"#cdata":"Specifies that a permanently stored SAS data set can be replaced with another SAS data \nset of the same name."}},{"Name":"NOREPLACE","Type":"S","Help":{"#cdata":"Specifies that a permanently stored SAS data set cannot be replaced with another SAS \ndata set of the same name. This prevents the accidental replacement of existing SAS \ndata sets."}},{"Name":"REUSE=","Type":"V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Specifies to track free space and reuses it whenever observations are added to an  existing compressed data set.","@ToolTip2":"Specifies not to track free space. This is the default."},"Help":{"#cdata":"Specifies whether SAS reuses space when observations are added to a compressed SAS data set."}},{"Name":"VALIDFMTNAME=","Type":"V","Values":{"@Value1":"LONG","@Value2":"FAIL","@Value3":"WARN"},"ToolTips":{"@ToolTip1":"Specifies that format and informat names can be up to 32 alphanumeric characters.  This is the default.","@ToolTip2":"Specifies that creating a format or informat name that is longer than eight characters  results in an error message.","@ToolTip3":"Specifies that creating a format or informat name that is longer than eight characters  results in a warning message to remind you that the format or informat cannot be used  with releases before to SAS 9."},"Help":{"#cdata":"Specifies the maximum size (32 characters or 8 characters) that user-created format \nand informat names can be before an error or warning is issued."}},{"Name":"VALIDVARNAME=","Type":"V","Values":{"@Value1":"V7","@Value2":"UPCASE","@Value3":"ANY"},"ToolTips":{"@ToolTip1":"Specifies that variable names can be up to 32 characters in length, must begin with  a letter of the Latin alphabet (A - Z, a - z) or the underscore character, cannot  contain blanks, cannot contain special characters except for the underscore, can  contain mixed-case letters, and cannot be assigned the names of special SAS automatic  variables (such as _N_ and _ERROR_) or variable list names (such as _NUMERIC_,  _CHARACTER_, and _ALL_).","@ToolTip2":"Specifies that the variable name follows the same rules as V7, except that the  variable name is uppercase,  as in earlier versions of SAS.","@ToolTip3":"Enables compatibility with other DBMS variable (column) naming conventions, such  as allowing embedded/leading blanks and special/multi-byte characters (not exceeding  32 bytes)."},"Help":{"#cdata":"Specifies the rules for valid SAS variable names that can be created and processed \nduring a SAS session."}},{"Name":"DEVICE=|DEV=","Type":"V","Help":{"#cdata":"[Syntax: DEVICE=device-driver-specification] \n    \nSpecifies a terminal device driver for SAS/GRAPH software."}},{"Name":"GISMAPS=","Type":"V","Help":{"#cdata":"[Syntax: GISMAPS=library-specification| path-to-library]\n\nSpecifies the location of the SAS data library that contains SAS/GIS-supplied US \nCensus Tract maps."}},{"Name":"GWINDOW","Type":"S","Help":{"#cdata":"Displays SAS/GRAPH software output in the GRAPH window."}},{"Name":"NOGWINDOW","Type":"S","Help":{"#cdata":"Displays graphics outside of the windowing environment."}},{"Name":"GSTYLE","Type":"S","Help":{"#cdata":"Specifies that ODS styles can be used in the generation of graphs that are stored \nas GRSEG catalog entries. If no style is specified, the default style for the \ngiven output destination is used. This is the default."}},{"Name":"NOGSTYLE","Type":"S","Help":{"#cdata":"Specifies to not use ODS styles in the generation of graphs that are stored as GRSEG \ncatalog entries. Tip: Use NOGSTYLE for compatibility of graphs generated before \nSAS 9.2."}},{"Name":"MAPS=","Type":"V","Help":{"#cdata":"[Syntax: MAPS=location-of-maps] \n    \nSpecifies the locations (either a libref or a physical path) to search for maps."}},{"Name":"BYSORTED","Type":"S","Help":{"#cdata":"Specifies that observations in a data set or data sets are sorted in alphabetic \nor numeric order."}},{"Name":"NOBYSORTED","Type":"S","Help":{"#cdata":"Specifies that observations with the same BY value are grouped together but are \nnot necessarily sorted in alphabetic or numeric order."}},{"Name":"CAPS","Type":"S","Help":{"#cdata":"Specifies that SAS translate lowercase characters to uppercase."}},{"Name":"NOCAPS","Type":"S","Help":{"#cdata":"Specifies that SAS does translate lowercase characters to uppercase."}},{"Name":"CARDIMAGE","Type":"S","Help":{"#cdata":"Specifies that SAS source and data lines be processed as if they were punched card \nimages--all exactly 80 bytes long and padded with blanks."}},{"Name":"NOCARDIMAGE","Type":"S","Help":{"#cdata":"Specifies that SAS source and data lines not be treated as if they were 80-byte card images."}},{"Name":"DATESTYLE=","Type":"V","Values":{"@Value1":"MDY","@Value2":"MYD","@Value3":"YMD","@Value4":"YDM","@Value5":"DMY","@Value6":"DYM","@Value7":"LOCALE"},"ToolTips":{"@ToolTip1":"Specifies that SAS set the order as month, day, year.","@ToolTip2":"Specifies that SAS set the order as month, year, day.","@ToolTip3":"Specifies that SAS set the order as year, month, day.","@ToolTip4":"Specifies that SAS set the order as year, day, month.","@ToolTip5":"Specifies that SAS set the order as day, month, year.","@ToolTip6":"Specifies that SAS set the order as day, year, month.","@ToolTip7":"Specifies that SAS set the order based on the value that corresponds to the LOCALE= system option  value and is one of the following: MDY | MYD | YMD | YDM | DMY | DYM."},"Help":{"#cdata":"Specifies the sequence of month, day, and year when ANYDTDTE, ANYDTDTM, or ANYDTTME informat \ndata is ambiguous."}},{"Name":"DEFLATION=|DEFLATE=","Type":"V","Values":{"@Value1":"n","@Value2":"MIN","@Value3":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the level of compression. The larger the number, the greater the compression.  Default: 6. Range: 0-9","@ToolTip2":"Specifies the minimum compression level of 0.","@ToolTip3":"Specifies the maximum compression level of 9."},"Help":{"#cdata":"[Syntax: DEFLATION=n | MIN | MAX]\n\nSpecifies the level of compression for device drivers that support the Deflate compression algorithm."}},{"Name":"INVALIDDATA=","Type":"V","Help":{"#cdata":"[Syntax: INVALIDDATA='character']\n\nSpecifies a character value SAS is to assign to a variable when invalid numeric data are encountered.\nIt can be a letter (A through Z, a through z), a period (.), or an underscore (_). The default value \nis a period."}},{"Name":"S=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the length of statements and data in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the length of statements and data in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the length of statements and data in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the length of statements and data in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the length of statements and data in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the length of statements and data as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the length of statements and data to 0","@ToolTip8":"Sets the length of statements and data to 2,147,483,647."},"Help":{"#cdata":"Specifies the length of statements on each line of a source statement and the length of data on \nlines that follow a DATALINES statement."}},{"Name":"S2=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX","@Value9":"S"},"ToolTips":{"@ToolTip1":"Specifies the length of statements in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the length of statements in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the length of statements in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the length of statements in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the length of statements in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the length of statements as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the length of statements to 0","@ToolTip8":"Sets the length of statements to 2,147,483,647.","@ToolTip9":"Uses the current value of the S= system option to compute the record length of text  that comes from a %INCLUDE statement, an autoexec file, or an autocall macro file."},"Help":{"#cdata":"Specifies the length of statements on each line of a source statement from a %INCLUDE statement, \nan autoexec file, or an autocall macro file."}},{"Name":"S2V=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX","@Value9":"S","@Value10":"S2"},"ToolTips":{"@ToolTip1":"Specifies the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file in multiples of 1 (bytes). Replace n with  an integer value.","@ToolTip2":"Specifies the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file in multiples of 1,024 (kilobytes). Replace n  with an integer value.","@ToolTip3":"Specifies the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file in multiples of 1,048,576 (megabytes). Replace  n with an integer value.","@ToolTip4":"Specifies the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file as a hexadecimal value. Replace hex with an  actual hexadecimal value.","@ToolTip7":"Sets the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file to 0.","@ToolTip8":"Sets the starting position of the variable-length record to read that comes from a %INCLUDE  statement, an autoexec file, or an autocall macro file to 2,147,483,647.","@ToolTip9":"Specifies to use the current value of the S= system option to compute the starting position of the  variable-sized record to read from a %INCLUDE statement, an autoexec file, or an autocall macro file.","@ToolTip10":"Specifies to use the current value of the S2= system option to compute the starting position of  the variable-sized record to read from a %INCLUDE statement, an autoexec file, or an autocall macro  file. This is the default."},"Help":{"#cdata":"Specifies the length of statements on each line of a source statement from a %INCLUDE statement, \nan autoexec file, or an autocall macro file."}},{"Name":"SEQ=","Type":"V","Values":{"@Value1":"n","@Value2":"hexX","@Value3":"MIN","@Value4":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the length in terms of bytes. Replace n with an integer value. Range: 1-8","@ToolTip2":"Specifies the length as a hexadecimal. Replace hex with a hexadecimal number.","@ToolTip3":"Sets the minimum length to 1.","@ToolTip4":"Sets the maximum length to 8."},"Help":{"#cdata":"Specifies the length of the numeric portion of the sequence field in input source lines or data lines."}},{"Name":"SQLREDUCTPUT=","Type":"V","Values":{"@Value1":"ALL","@Value2":"NONE","@Value3":"DBMS","@Value4":"BASE"},"ToolTips":{"@ToolTip1":"Specifies that optimization is performed on all PUT functions regardless of any engine that is used  by the query to access the data.","@ToolTip2":"Specifies that no optimization is to be performed.","@ToolTip3":"Specifies that optimization is performed on all PUT functions whose query is performed by a  SAS/ACCESS engine. This is the default.","@ToolTip4":"Specifies that optimization is performed on all PUT functions whose query is performed by a  SAS/ACCESS engine or a Base SAS engine."},"Help":{"#cdata":"For the SQL procedure, specifies the engine type that a query uses for which optimization is performed \nby replacing a PUT function in a query with a logically equivalent expression."}},{"Name":"SQLCONSTDATETIME","Type":"S","Help":{"#cdata":"Specifies that the SQL procedure is to replace references to the DATE, TIME, DATETIME, and TODAY \nfunctions with their equivalent numeric constant values."}},{"Name":"NOSQLCONSTDATETIME","Type":"S","Help":{"#cdata":"Specifies that the SQL procedure is not to replace references to the DATE, TIME, DATETIME, and TODAY \nfunctions with their equivalent numeric constant values."}},{"Name":"SQLREDUCEPUTOBS=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of observations that must be in a table before the SQL procedure considers to  optimize the PUT function in multiples of 1 (bytes). Replace n with an integer value.","@ToolTip2":"Specifies the number of observations that must be in a table before the SQL procedure considers to  optimize the PUT function in multiples of 1,024 (kilobytes). Replace n with an integer value.","@ToolTip3":"Specifies the number of observations that must be in a table before the SQL procedure considers to  optimize the PUT function in multiples of 1,048,576 (megabytes). Replace n with an integer value.","@ToolTip4":"Specifies the number of observations that must be in a table before the SQL procedure considers to  optimize the PUT function in multiples of 1,073,741,824 (gigabytes). Replace n with an integer value.","@ToolTip5":"Specifies the number of observations that must be in a table before the SQL procedure considers to  optimize the PUT function in multiples of 1,099,511,627,776 (terabytes). Replace n with an integer value.","@ToolTip6":"Specifies the number of observations that must be in a table before the SQL procedure considers to  optimize the PUT function as a hexadecimal value. Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the minimum number of observations that must be in a table before the SQL procedure considers  to optimize the PUT function to 0. A value of 0 indicates that there is no minimum number of  observations required. This is the default.","@ToolTip8":"Sets the maximum number of observations that must be in a table before the SQL procedure considers  to optimize the PUT function to 2⁶³-1, or approximately 9.2 quintillion."},"Help":{"#cdata":"For the SQL procedure when the SQLREDUCEPUT= system option is set to NONE, \nspecifies the minimum number of observations that must be in a table in order for PROC SQL \nto consider optimizing the PUT function in a query."}},{"Name":"SQLREDUCEPUTVALUES=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of SAS format values that can exist in a PUT function expression in multiples  of 1 (bytes). Replace n with an integer value.","@ToolTip2":"Specifies the number of SAS format values that can exist in a PUT function expression in multiples  of 1,024 (kilobytes). Replace n with an integer value.","@ToolTip3":"Specifies the number of SAS format values that can exist in a PUT function expression in multiples  of 1,048,576 (megabytes). Replace n with an integer value.","@ToolTip4":"Specifies the number of SAS format values that can exist in a PUT function expression in multiples  of 1,073,741,824 (gigabytes). Replace n with an integer value.","@ToolTip5":"Specifies the number of SAS format values that can exist in a PUT function expression in multiples  of 1,099,511,627,776 (terabytes). Replace n with an integer value.","@ToolTip6":"Specifies the number of SAS format values that can exist in a PUT function expression as a hexadecimal  value. Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the minimum number of SAS format values that can exist in a PUT function expression to 0.  A value of 0 indicates that there is no minimum number of SAS format values that are required.  This is the default.","@ToolTip8":"Sets the maximum number of SAS format values that can exist in a PUT function expression to 5,000."},"Help":{"#cdata":"For the SQL procedure when the SQLREDUCEPUT= system option is set to NONE, specifies the maximum \nnumber of SAS format values that can exist in a PUT function expression in order for PROC SQL to \nconsider optimizing the PUT function in a query."}},{"Name":"SQLREMERGE","Type":"S","Help":{"#cdata":"Specifies that the SQL procedure can process queries that use remerging of data."}},{"Name":"NOSQLREMERGE","Type":"S","Help":{"#cdata":"Specifies that the SQL procedure cannot process queries that use remerging of data."}},{"Name":"SQLUNDOPOLICY=","Type":"V","Values":{"@Value1":"NONE","@Value2":"OPTIONAL","@Value3":"REQUIRED"},"ToolTips":{"@ToolTip1":"Specifies to keep changes that are made by the INSERT and UPDATE statements.","@ToolTip2":"Specifies to reverse changes that are made by the INSERT and UPDATE statements as long as reversing  the changes is reliable.","@ToolTip3":"Specifies to undo all changes that are made by the INSERT and UPDATE statements, up to the point of  the error. This is the default."},"Help":{"#cdata":"Specifies whether the SQL procedure keeps or discards updated data if errors occur while \nthe data is being updated."}},{"Name":"SPOOL","Type":"S","Help":{"#cdata":"Specifies that SAS writes SAS statements to a utility data set in the WORK data library."}},{"Name":"NOSPOOL","Type":"S","Help":{"#cdata":"Specifies that SAS not write SAS statements to a utility data set in the WORK data library."}},{"Name":"YEARCUTOFF=","Type":"V","Help":{"#cdata":"[Syntax: YEARCUTOFF=nnnn | YEARCUTOFF=nnnnn]\n\nSpecifies the first year of a 100-year span that will be used by date informats and functions to \nread a two-digit year.\n\nRange: 1582-19900 \n\nDefault: The shipped default is 1926."}},{"Name":"BINDING=","Type":"V","Values":{"@Value1":"DEFAULT|DEFAULTEDGE","@Value2":"LONG|LONGEDGE","@Value3":"SHORT|SHORTEDGE"},"ToolTips":{"@ToolTip1":"Specifies that duplexing is done using the default binding edge.","@ToolTip2":"Specifies the long edge as the binding edge for duplexed output.","@ToolTip3":"Specifies the short edge as the binding edge for duplexed output."},"Help":{"#cdata":"Specifies the binding edge to a printer."}},{"Name":"BOTTOMMARGIN=","Type":"V","Help":{"#cdata":"[Syntax: BOTTOMMARGIN=margin-size | \"margin-size [margin-unit]\"]\n\nSpecifies to a printer the size of the margin at the bottom of the page."}},{"Name":"COLLATE","Type":"S","Help":{"#cdata":"Specifies to collate multiple copies for output to a printer."}},{"Name":"NOCOLLATE","Type":"S","Help":{"#cdata":"Specifies not to collate multiple copies for output to a printer. This is the default."}},{"Name":"COLORPRINTING","Type":"S","Help":{"#cdata":"Specifies color printing to a printer, if color printing is supported."}},{"Name":"NOCOLORPRINTING","Type":"S","Help":{"#cdata":"Specifies not to print in color."}},{"Name":"COPIES=","Type":"V","Help":{"#cdata":"[Syntax: COPIES=n] Specifies the number of copies to make when printing to a printer."}},{"Name":"DUPLEX","Type":"S","Help":{"#cdata":"Specifies duplexing controls to a printer."}},{"Name":"NODUPLEX","Type":"S","Help":{"#cdata":"Specifies that duplexing is not performed. This is the default."}},{"Name":"LEFTMARGIN=","Type":"V","Help":{"#cdata":"[Syntax: LEFTMARGIN=margin-size | \"margin-size [margin-unit]\"]\n\nSpecifies to a printer the size of the margin on the left side of the page."}},{"Name":"PAPERDEST=","Type":"V","Help":{"#cdata":"[Syntax: PAPERDEST=printer-bin-name] \n    \nSpecifies to a printer the printer bin to receive printed output."}},{"Name":"PAPERSIZE=","Type":"V","Help":{"#cdata":"[Syntax: PAPERSIZE=LOCALE | paper_size_name \n    | (width_value<,>height_value) \n    | ('width_value'<,> 'height_value') \n    | (\"width_value\"<,>\"height_value\")]\n\nSpecifies the paper size to use for printing. \n\nSyntax Description: \nLOCALE\n  specifies to use the value of the LOCALE= system option to determine the value of the PAPERSIZE= \n  option. Depending on the locale, the PAPERSIZE= option is set to either LETTER or A4.\npaper_size_name \n  specifies a predefined paper size. \n  Default:Letter or A4, depending on the locale \n  Restriction:The maximum length is 200 characters. \n  Requirements:When the name of a predefined paper size contains spaces, enclose the name \n    in single or double quotation marks. \n  A space is required between the width and the height values if you do not use either single \n    or double quotation marks for values. \n\n  Tip:Refer to the Registry Editor, or use PROC REGISTRY to obtain a listing of supported \n  paper sizes. Additional values can be added. \n\n(“width_value”, “height_value”) \n  specifies paper width and height as positive floating-point values. \n  Default:inches \n  Range:in or cm for width_value, height_value"}},{"Name":"PAPERSOURCE=","Type":"V","Help":{"#cdata":"[Syntax: PAPERSOURCE=printer-bin-name] \n    \nSpecifies to a printer the paper bin to use for printing."}},{"Name":"PAPERTYPE=","Type":"V","Values":{"@Value1":"PLAIN","@Value2":"STANDARD","@Value3":"GLOSSY","@Value4":"TRANSPARENCY","@Value5":"printer-defined-value"},"ToolTips":{"@ToolTip1":"Specifies to use plain paper.","@ToolTip2":"Specifies to use the standard paper for the printer.","@ToolTip3":"Specifies to use glossy paper.","@ToolTip4":"Specifies to use transparent paper.","@ToolTip5":"Specifies a paper type that is defined by the printer."},"Help":{"#cdata":"[Syntax: PAPERTYPE= PLAIN | STANDARD | GLOSSY | TRANSPARENCY | printer-defined-value] \n    \nSpecifies to a printer the type of paper to use for printing. Maximum length is 200"}},{"Name":"PRINTERPATH=","Type":"V","Help":{"#cdata":"[Syntax: PRINTERPATH=('printer-name' <fileref>)] \n    \nControls which Universal Printing printer will be used for printing. If a fileref (optional) is \nspecified, it must be defined with a FILENAME statement or external allocation."}},{"Name":"PRTABORTDLGS=","Type":"V","Values":{"@Value1":"BOTH","@Value2":"NEITHER","@Value3":"FILE","@Value4":"PRINTER"},"ToolTips":{"@ToolTip1":"Specifies to display the Print Abort dialog box when you are printing either to  a file or to the printer.","@ToolTip2":"Specifies not to display the Print Abort dialog box when you are printing either  to a file or to the printer.","@ToolTip3":"Specifies to display the Print Abort dialog box only when you are printing to a file.","@ToolTip4":"Specifies to display the Print Abort dialog box only when you are printing to the printer."},"Help":{"#cdata":"[Syntax: PRTABORTDLGS = BOTH | NEITHER | FILE | PRINTER] \n    \nSpecifies when to display the Print Abort dialog box."}},{"Name":"PRTSETFORMS","Type":"S","Help":{"#cdata":"Specifies to include the Use Forms check box in the Print Setup dialog box."}},{"Name":"NOPRTSETFORMS","Type":"S","Help":{"#cdata":"Specifies to exclude the Use Forms check box from the Print Setup dialog box."}},{"Name":"RIGHTMARGIN=","Type":"V","Help":{"#cdata":"[Syntax: RIGHTMARGIN=margin-size | \"margin-size [margin-unit]\"]\n\nSpecifies the size of the margin at the right side of the page for printed output directed to \nthe ODS printer destination."}},{"Name":"SASCONTROL=","Type":"V","Values":{"@Value1":"SYSTEMMENU","@Value2":"NOSYSTEMMENU","@Value3":"MINMAX","@Value4":"NOMINMAX"},"ToolTips":{"@ToolTip1":"Specifies to display the system/control menu in the windows that are contained  in the main SAS window.","@ToolTip2":"Specifies to omit the system/control menu and the minimize, maximize, and close  buttons from the title bar in the windows that are contained in the main SAS window.","@ToolTip3":"Specifies to display the minimize and maximize buttons in the windows that are  contained in the main SAS window.","@ToolTip4":"Specifies to omit the minimize and maximize buttons from the windows that are  contained in the main SAS window."},"Help":{"#cdata":"[Syntax: SASCONTROL=SYSTEMMENU | NOSYSTEMMENU <MINMAX | NOMINMAX>] \n    \nSpecifies whether the SAS application windows include system/control menus and \nminimize/maximize buttons."}},{"Name":"TEXTURELOC=","Type":"V","Help":{"#cdata":"[Syntax: TEXTURELOC=location] \n    \nSpecifies the location of textures and images that are used by ODS styles. Location can refer \neither to the physical name of the directory or to a URL reference to the directory."}},{"Name":"TOPMARGIN=","Type":"V","Help":{"#cdata":"[Syntax: TOPMARGIN=margin-size | \"margin-size [margin-unit]\"]\n\nSpecifies the size of the margin at the top of the page for the ODS printer destination."}},{"Name":"UPRINTCOMPRESSION|UPC","Type":"S","Help":{"#cdata":"Specifies to enable compression of files created by using SAS Universal Printing and \nsome SAS/GRAPH files. This is the default."}},{"Name":"NOUPRINTCOMPRESSION|NOUPC","Type":"S","Help":{"#cdata":"Specifies to disable compression of files created by using SAS Universal Printing \nand some SAS/GRAPH files."}},{"Name":"BYLINE","Type":"S","Help":{"#cdata":"Specifies that BY lines are printed above each BY group.."}},{"Name":"NOBYLINE","Type":"S","Help":{"#cdata":"Suppresses the automatic printing of BY lines."}},{"Name":"CENTER","Type":"S","Help":{"#cdata":"Centers SAS procedure output."}},{"Name":"NOCENTER","Type":"S","Help":{"#cdata":"Left aligns SAS procedure output."}},{"Name":"FORMCHAR=","Type":"V","Help":{"#cdata":"FORMCHAR='formatting-characters'\n\nSpecifies the default output formatting characters. 'formatting-characters' is any \nstring or list of strings of characters up to 64 bytes long. If fewer than 64 bytes \nare specified, the string is padded with blanks on the right."}},{"Name":"FORMDLIM=","Type":"V","Help":{"#cdata":"[Syntax: FORMDLIM='delimiting-character'] \n    \nSpecifies a character to delimit page breaks in SAS output."}},{"Name":"LABEL","Type":"S","Help":{"#cdata":"Permits SAS procedures to use labels with variables. The LABEL system option must \nbe in effect before the LABEL option of any procedure can be used.."}},{"Name":"NOLABEL","Type":"S","Help":{"#cdata":"Does not allow SAS procedures to use labels with variables. If NOLABEL is specified,\nthe LABEL option of a procedure is ignored."}},{"Name":"PAGENO=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"hexX","@Value4":"MIN","@Value5":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the page number in multiples of 1 (n).","@ToolTip2":"Specifies the page number in multiples of 1,024 (nK).","@ToolTip3":"Specifies the page number as a hexadecimal number.","@ToolTip4":"Specifies the page number to the minimum number, 1.","@ToolTip5":"Specifies the maximum page number as the largest signed,  four-byte integer that is representable in your operating environment."},"Help":{"#cdata":"[Resets the SAS output page number."}},{"Name":"PAGESIZE=|PS=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"hexX","@Value4":"MIN","@Value5":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of lines that compose a page in multiples of 1 (n).","@ToolTip2":"Specifies the number of lines that compose a page in multiples of 1,024 (nK).","@ToolTip3":"Specifies the number of lines that compose a page as a hexadecimal number.","@ToolTip4":"Specifies the number of lines that compose a page to the minimum setting, 15.","@ToolTip5":"Specifies the maximum number of lines that compose a page to the maximum setting, 32,767."},"Help":{"#cdata":"[Specifies the number of lines that compose a page of SAS output."}},{"Name":"SKIP=","Type":"V","Values":{"@Value1":"n","@Value2":"hexX","@Value3":"MIN","@Value4":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of lines to skip. Replace n with an integer value (0 to 20).","@ToolTip2":"Specifies the number of lines to skip as a hexadecimal number. Replace hex with a hexadecimal number.","@ToolTip3":"Sets the number of lines to skip to 0, so no lines are skipped.","@ToolTip4":"Sets the number of lines to skip to 20."},"Help":{"#cdata":"Specifies the number of lines to skip at the top of each page of SAS output."}},{"Name":"SYSPRINTFONT=","Type":"V","Help":{"#cdata":"[Syntax: SYSPRINTFONT=(\"face-name\" <weight> <style> <character-set> <point-size> <NAMED \"printer-name\" | DEFAULT | ALL>)]\n\nSets the font for the current default printer."}},{"Name":"DATE","Type":"S","Help":{"#cdata":"Specifies that the date and the time that the SAS job began are printed at the top of \neach page of the SAS log and any output that is created by SAS."}},{"Name":"PDFSECURITY=","Type":"V","Values":{"@Value1":"HIGH","@Value2":"LOW","@Value3":"NONE"},"ToolTips":{"@ToolTip1":"Specifies that SAS encrypts PDF documents using a 128-bit encryption algorithm.","@ToolTip2":"Specifies that SAS encrypts PDF documents using a 40-bit encryption algorithm.","@ToolTip3":"Specifies that no encryption is performed on PDF documents. This is the default."},"Help":{"#cdata":"Specifies the printing permissions for PDF documents."}},{"Name":"PDFPRINT=","Type":"V","Values":{"@Value1":"HRES","@Value2":"LRES","@Value3":"NONE"},"ToolTips":{"@ToolTip1":"Specifies to print PDF documents at the highest resolution available on the printer.","@ToolTip2":"Specifies to print PDF documents at a lower resolution for draft-quality documents.","@ToolTip3":"Specifies the PDF documents have no print resolution."},"Help":{"#cdata":"Specifies the resolution to print PDF documents."}},{"Name":"PDFPASSWORD=|PDFPW=","Type":"V","Values":{"@Value1":"OPEN=(\"\")","@Value2":"OPEN=(\"password\")","@Value3":"(OWNER=\"\")","@Value4":"(OWNER=\"password\")","@Value5":"(OWNER=\"password\", OPEN=\"password\")","@Valu6":"(OWNER=\"password\", OPEN=\"\")","@Value7":"(OWNER=\"\", OPEN=\"\")","@Value8":"(OWNER=\"\", OPEN=\"password\")","@Value9":"(OPEN=\"password\", OWNER=\"password\")","@Value10":"(OPEN=\"password\", OWNER=\"\")","@Value11":"(OPEN=\"\", OWNER=\"password\")","@Value12":"(OPEN=\"\", OWNER=\"\")"},"ToolTips":{"@ToolTip1":"Specifies to reset the password to open a PDF document to null.","@ToolTip2":"Specifies the password to open a PDF document. The quotation marks are optional.","@ToolTip3":"Specifies to reset the password used by a PDF document owner to null.","@ToolTip4":"Specifies the password for the PDF document owner. The quotation marks are optional.","@ToolTip5":"Specifies the password for the PDF document owner and the password to open a PDF document","@ToolTip6":"Specifies the password for the PDF document owner and resets the password to open a PDF document to null.","@ToolTip7":"Specifies to reset both the password used by a PDF document owner and the password to open a PDF document to null.","@ToolTip8":"Specifies to reset the password used by a PDF document owner to null, and specifies a password to open a PDF document.","@ToolTip9":"Specifies the password to open a PDF document and the password for the PDF document owner.","@ToolTip10":"Specifies the password to open a PDF document and resets the password for the PDF document owner to null.","@ToolTip11":"Specifies to reset the password to open a PDF document to null and specifies the password for the PDF document owner.","@ToolTip12":"Specifies to reset both the password to open a PDF document and the password for the PDF document owner to null."},"Help":{"#cdata":"Specifies the password to use to open a PDF document and the password used by a PDF document owner. \n    \nSyntax:\n(1) PDFPASSWORD=(OPEN=<\">password<\"> | OPEN=\"\" < <,> OWNER=<\">password<\"> | OWNER=\"\">)  \n(2) PDFPASSWORD=(OWNER=<\">password<\"> | OWNER=\"\" <<,> OPEN=<\">password<\"> | OPEN=\"\">)  \n(3) PDFPASSWORD=(OPEN=<\">password<\"> | OPEN=\"\")  \n(4) PDFPASSWORD=(OWNER=<\">password<\"> | OWNER=\"\" ) "}},{"Name":"PDFPAGELAYOUT=","Type":"V","Values":{"@Value1":"DEFAULT","@Value2":"SINGLEPAGE","@Value3":"CONTINUOUS","@Value4":"FACING","@Value5":"CONTINUOUSFACING"},"ToolTips":{"@ToolTip1":"Specifies to use the current page layout for Acrobat Reader. This is the default.","@ToolTip2":"Specifies to display one page at a time in the viewing area.","@ToolTip3":"Specifies to display all document pages in the viewing area in a single column.","@ToolTip4":"Specifies to display only two pages in the viewing area, with the even pages on the left and  the odd pages on the right.","@ToolTip5":"Specifies to display all pages in the viewing area, two pages side by side. The even pages display  on the left, and the odd pages display on the right."},"Help":{"#cdata":"Specifies the page layout for PDF documents."}},{"Name":"PDFPAGEVIEW=","Type":"V","Values":{"@Value1":"DEFAULT","@Value2":"ACTUAL","@Value3":"FITPAGE","@Value4":"FITWIDTH","@Value5":"FULLSCREEN"},"ToolTips":{"@ToolTip1":"Specifies to use the current page view setting for Acrobat Reader. This is the default.","@ToolTip2":"Specifies to set the page view setting to 100%.","@ToolTip3":"Specifies to view a page using the full extent of the viewing window, maintaining the height  and width aspect ratio.","@ToolTip4":"Specifies to view a page using the full width of the viewing window. The height of the document  is not scaled to fit the page.","@ToolTip5":"Specifies to view a page using the full screen. This option disables the table of contents,  bookmarks, and all other document access aids, such as accessing a specific page."},"Help":{"#cdata":"Specifies the page viewing mode for PDF documents."}},{"Name":"PDFACCESS","Type":"S","Help":{"#cdata":"Specifies that text and graphics from an ODS PDF document can be read by screen readers \nfor the visually impaired."}},{"Name":"NOPDFACCESS","Type":"S","Help":{"#cdata":"Specifies that text and graphics from an ODS PDF document cannot be read by screen \nreaders for the visually impaired."}},{"Name":"PDFASSEMBLY","Type":"S","Help":{"#cdata":"Specifies that PDF documents can be assembled."}},{"Name":"NOPDFASSEMBLY","Type":"S","Help":{"#cdata":"Specifies that PDF documents cannot be assembled. This is the default."}},{"Name":"NOPDFCOMMENT","Type":"S","Help":{"#cdata":"Specifies that PDF document comments cannot be modified. This is the default."}},{"Name":"PDFCOMMENT","Type":"S","Help":{"#cdata":"Specifies that PDF document comments can be modified."}},{"Name":"NOPDFCOPY","Type":"S","Help":{"#cdata":"Specifies that text and graphics from a PDF document cannot be copied."}},{"Name":"PDFCOPY","Type":"S","Help":{"#cdata":"Specifies that text and graphics from a PDF document can be copied. This is the default."}},{"Name":"NOPDFFILLIN","Type":"S","Help":{"#cdata":"Specifies that PDF forms cannot be filled in."}},{"Name":"PDFFILLIN","Type":"S","Help":{"#cdata":"Specifies that PDF forms can be filled in."}},{"Name":"NOPDFCONTENT","Type":"S","Help":{"#cdata":"Specifies that the contents of a PDF document cannot be changed."}},{"Name":"PDFCONTENT","Type":"S","Help":{"#cdata":"Specifies that the contents of a PDF document can be changed."}},{"Name":"NODATE","Type":"S","Help":{"#cdata":"Specifies that the date and the time are not printed."}},{"Name":"DETAILS","Type":"S","Help":{"#cdata":"Specifies to include additional information when some SAS procedures\nand windows display a listing of files in a SAS data library."}},{"Name":"NODETAILS","Type":"S","Help":{"#cdata":"Specifies not to include additional information when files are listed in a SAS data library."}},{"Name":"DTRESET","Type":"S","Help":{"#cdata":"Specifies that SAS updates the date and time in the titles of the SAS log and the listing file.."}},{"Name":"NODTRESET","Type":"S","Help":{"#cdata":"Specifies that SAS not update the date and time in the titles of the SAS log and the listing file."}},{"Name":"LINESIZE=|LS=","Type":"V","Values":{"@Value1":"n","@Value2":"hexX","@Value3":"MIN","@Value4":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of characters in a line.","@ToolTip2":"Specifies the number of characters in a line as a hexadecimal number.","@ToolTip3":"Sets the number of characters in a line to 64.","@ToolTip4":"Sets the number of characters in a line to 256."},"Help":{"#cdata":"Syntax: LINESIZE=n | hexX | MIN | MAX\n\nSpecifies the line size for the SAS log and for SAS procedure output."}},{"Name":"MISSING=","Type":"V","Help":{"#cdata":"Syntax: MISSING=<'>character<'>\n\nSpecifies the character to print for missing numeric values. \n\nSyntax Description: \ncharacter\n  specifies the value to be printed. The value can be any character. Single or double quotation marks are optional.\n\n  Restriction: '00'x is not a valid value for character.\n\nDefault: The shipped default is a period (.).\n\nThe MISSING= system option does not apply to special missing values such as .A and .Z."}},{"Name":"NUMBER","Type":"S","Help":{"#cdata":"Specifies that SAS print the page number on the first title line of each page of SAS output."}},{"Name":"NONUMBER","Type":"S","Help":{"#cdata":"Specifies that SAS not print the page number on the first title line of each page of SAS output."}},{"Name":"NOCPUID","Type":"S","Help":{"#cdata":"Specifies that the note that contains the CPU identification number is not written to the SAS log."}},{"Name":"MSGLEVEL=","Type":"V","Values":{"@Value1":"N","@Value2":"I"},"ToolTips":{"@ToolTip1":"Specifies to print notes, warnings, CEDA message, and error messages only. N is the default.","@ToolTip2":"Specifies to print additional notes pertaining to index usage, merge processing, and sort utilities,  along with standard notes, warnings, CEDA message, and error messages."},"Help":{"#cdata":"Specifies the level of detail in messages that are written to the SAS log."}},{"Name":"NOTES","Type":"S","Help":{"#cdata":"Specifies that SAS writes notes to the SAS log."}},{"Name":"NONOTES","Type":"S","Help":{"#cdata":"Specifies that SAS does not write notes to the SAS log. NONOTES does not suppress error and \nwarning messages."}},{"Name":"OVP","Type":"S","Help":{"#cdata":"Prints underscores beneath the word in error when SAS encounters an error in a SAS statement.\nThis option may enable overprinting in some procedures."}},{"Name":"NOOVP","Type":"S","Help":{"#cdata":"Prints dashes on the next line below the word in error when SAS encounters an error \nin a SAS statement."}},{"Name":"PRINTMSGLIST","Type":"S","Help":{"#cdata":"Prints the entire list of messages to the SAS log."}},{"Name":"NOPRINTMSGLIST","Type":"S","Help":{"#cdata":"Prints only the top-level message to the SAS log."}},{"Name":"SOURCE","Type":"S","Help":{"#cdata":"Specifies that SAS writes source statements to the SAS log."}},{"Name":"NOSOURCE","Type":"S","Help":{"#cdata":"Specifies that SAS not write source statements to the SAS log."}},{"Name":"SOURCE2","Type":"S","Help":{"#cdata":"Specifies that SAS writes secondary source statements from included files to the SAS log."}},{"Name":"NOSOURCE2","Type":"S","Help":{"#cdata":"Specifies that SAS not write secondary source statements from included files to the SAS log."}},{"Name":"CMDMAC","Type":"S","Help":{"#cdata":"Specifies that the macro processor examine the first word of every windowing environment\ncommand to see whether it is a command-style macro invocation."}},{"Name":"NOCMDMAC","Type":"S","Help":{"#cdata":"Specifies that no check be made for command-style macro invocations."}},{"Name":"IMPLMAC","Type":"S","Help":{"#cdata":"Specifies that the macro processor examine the first word of every submitted statement\nto see whether it is a statement-style macro invocation."}},{"Name":"NOIMPLMAC","Type":"S","Help":{"#cdata":"Specifies that no check be made for statement-style macro invocations. This is the default."}},{"Name":"MAUTOLOCDISPLAY","Type":"S","Help":{"#cdata":"Displays the source location of the autocall macros in the log when the autocall macro is invoked."}},{"Name":"NOMAUTOLOCDISPLAY","Type":"S","Help":{"#cdata":"Prevents the autocall macro source location from being displayed in the log when the autocall macro \nis invoked. NOMAUTOLOCDISPLAY is the default."}},{"Name":"MAUTOSOURCE","Type":"S","Help":{"#cdata":"Causes the macro processor to search the autocall libraries for a member with the requested name\nwhen a macro name is not found in the WORK library."}},{"Name":"NOMAUTOSOURCE","Type":"S","Help":{"#cdata":"Prevents the macro processor from searching the autocall libraries when a macro name is not found \nin the WORK library."}},{"Name":"MCOMPILENOTE=","Type":"V","Help":{"#cdata":"Syntax: MCOMPILENOTE=<NONE | NOAUTOCALL | ALL>\n\nIssues a NOTE to the log upon successful compilation of a macro."}},{"Name":"MERROR","Type":"S","Help":{"#cdata":"Specifies that SAS issues a warning message when a macro-like name does not match \na macro keyword."}},{"Name":"NOMERROR","Type":"S","Help":{"#cdata":"Issues no warning messages when the macro processor cannot match a macro reference \nto a compiled macro."}},{"Name":"MFILE","Type":"S","Help":{"#cdata":"Routes output produced by the MPRINT option to an external file. This is useful \nfor debugging."}},{"Name":"NOMFILE","Type":"S","Help":{"#cdata":"Does not route MPRINT output to an external file."}},{"Name":"MCOMPILE","Type":"S","Help":{"#cdata":"Allows new definitions of macros."}},{"Name":"NOMCOMPILE","Type":"S","Help":{"#cdata":"Disallows new definitions of macros."}},{"Name":"MEXECNOTE","Type":"S","Help":{"#cdata":"Displays the macro execution information in the log when the macro is invoked."}},{"Name":"NOMEXECNOTE","Type":"S","Help":{"#cdata":"Does not display the macro execution information in the log when the macro is invoked."}},{"Name":"MEXECSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the maximum size macro to be executed in memory available in bytes.","@ToolTip2":"Specifies the maximum size macro to be executed in memory available in kilobytes.","@ToolTip3":"Specifies the maximum size macro to be executed in memory available in megabytes.","@ToolTip4":"Specifies the maximum size macro to be executed in memory available in gigabytes.","@ToolTip5":"Specifies the maximum size macro to be executed in memory available in terabytes.","@ToolTip6":"Specifies the maximum size macro to be executed in memory by a hexadecimal number followed by an X.","@ToolTip7":"Specifies the minimum size macro to be executed in memory. Minimum value is 0.","@ToolTip8":"Specifies the maximum size macro to be executed in memory. Maximum value is 2,147,483,647."},"Help":{"#cdata":"Specifies the maximum macro size that can be executed in memory."}},{"Name":"SORTVALIDATE","Type":"S","Help":{"#cdata":"Specifies that the SORT procedure verifies if the observations in the data set are \nsorted by the variables specified in the BY statement."}},{"Name":"NOSORTVALIDATE","Type":"S","Help":{"#cdata":"Specifies that the SORT procedure is not to verify if the observations in the data \nset are sorted. This is the default."}},{"Name":"MINOPERATOR","Type":"S","Help":{"#cdata":"Causes the macro processor to recognize and evaluate both the mnemonic operator IN \nor the special character # as a logical operator in expressions."}},{"Name":"NOMINOPERATOR","Type":"S","Help":{"#cdata":"Causes the macro processor to recognize both the mnemonic operator IN and the special \ncharacter # as regular characters."}},{"Name":"MREPLACE","Type":"S","Help":{"#cdata":"Enables you to redefine existing macro definitions that are stored in a catalog in the \nWORK library."}},{"Name":"NOMREPLACE","Type":"S","Help":{"#cdata":"Prevents you from redefining existing macro definitions that are stored in a catalog in \nthe WORK library."}},{"Name":"MINDELIMITER=","Type":"V","Help":{"#cdata":"Specifies the character to be used as the delimiter for the macro IN operator."}},{"Name":"MLOGIC","Type":"S","Help":{"#cdata":"Causes the macro processor to trace its execution and to write the trace information \nto the SAS log. This option is a useful debugging tool."}},{"Name":"NOMLOGIC","Type":"S","Help":{"#cdata":"Does not trace execution. Use this option unless you are debugging macros."}},{"Name":"MLOGICNEST","Type":"S","Help":{"#cdata":"Allows the macro nesting information to be displayed in the MLOGIC output in the SAS log."}},{"Name":"NOMLOGICNEST","Type":"S","Help":{"#cdata":"Prevents the macro nesting information from being displayed in the MLOGIC output in the SAS log."}},{"Name":"MPRINT","Type":"S","Help":{"#cdata":"Displays the SAS statements that are generated by macro execution. This is useful \nfor debugging macros."}},{"Name":"NOMPRINT","Type":"S","Help":{"#cdata":"Does not display SAS statements that are generated by macro execution."}},{"Name":"MPRINTNEST","Type":"S","Help":{"#cdata":"Allows the macro nesting information to be displayed in the MPRINT output in the \nSAS log."}},{"Name":"NOMPRINTNEST","Type":"S","Help":{"#cdata":"Prevents the macro nesting information from being displayed in the MPRINT output \nin the SAS log."}},{"Name":"MRECALL","Type":"S","Help":{"#cdata":"Searches the autocall libraries for an undefined macro name each time an attempt \nis made to invoke the macro."}},{"Name":"NOMRECALL","Type":"S","Help":{"#cdata":"Searches the autocall libraries only once for a requested macro name."}},{"Name":"MSTORED","Type":"S","Help":{"#cdata":"Searches for stored compiled macros in a catalog in the SAS data library referenced \nby the SASMSTORE= option."}},{"Name":"NOMSTORED","Type":"S","Help":{"#cdata":"Does not search for compiled macros."}},{"Name":"MSYMTABMAX=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the amount of memory in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the amount of memory in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the amount of memory in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the amount of memory in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the amount of memory in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the amount of memory as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Sets the amount of memory that is available to the minimum setting, which is 0.  This value causes all macro variables to be written to disk.","@ToolTip8":"Sets the amount of memory that is available to the maximum setting."},"Help":{"#cdata":"[Syntax: MSYMTABMAX= n | nK | nM | nG | nT |hexX | MIN | MAX] \n\nSpecifies the maximum amount of memory that is available to macro variable \nsymbol tables."}},{"Name":"MVARSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"hexX","@Value4":"MIN","@Value5":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the maximum macro variable size in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the maximum macro variable size in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the maximum macro variable size as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip4":"Sets the macro variable size to the minimum setting, which is 0 bytes. This value  causes all macro variables to be written to disk.","@ToolTip5":"Sets the macro variable size to the maximum setting, which is 65,534 bytes."},"Help":{"#cdata":"[Syntax: MVARSIZE= n | nK | nM | nG | MAX] \n    \nSpecifies the maximum size for macro variables that are stored in memory."}},{"Name":"SASMSTORE=","Type":"V","Help":{"#cdata":"[Syntax: SASMSTORE=libref] \n    \nSpecifies the libref of a SAS data library that contains a catalog of stored, \ncompiled SAS macros."}},{"Name":"SERROR","Type":"S","Help":{"#cdata":"Controls whether SAS issues a warning message when a defined macro variable reference \ndoes not match a macro variable."}},{"Name":"NOSERROR","Type":"S","Help":{"#cdata":"Issues no warning messages when the macro processor cannot match a macro variable \nreference to an existing macro variable."}},{"Name":"STIMER","Type":"S","Help":{"#cdata":"Specifies to write real-time and CPU time to the SAS log."}},{"Name":"NOSTIMER","Type":"S","Help":{"#cdata":"Specifies not to write real-time and CPU time to the SAS log."}},{"Name":"SYMBOLGEN","Type":"S","Help":{"#cdata":"Displays the results of resolving macro variable references. This option is useful \nfor debugging."}},{"Name":"NOSYMBOLGEN","Type":"S","Help":{"#cdata":"Does not display results of resolving macro variable references."}},{"Name":"SORTDUP=","Type":"V","Values":{"@Value1":"PHYSICAL","@Value2":"LOGICAL"},"ToolTips":{"@ToolTip1":"Removes duplicates based on all the variables that are present in the data set.  This is the default.","@ToolTip2":"Removes duplicates based on only the variables remaining after the DROP= and  KEEP= data set options are processed."},"Help":{"#cdata":"Specifies whether the SORT procedure removes duplicate variables based on all variables in a data set \nor the variables that remain after the DROP or KEEP data set options have been applied."}},{"Name":"SORTEQUALS","Type":"S","Help":{"#cdata":"Specifies that observations with identical BY variable values are to retain the same \nrelative positions in the output data set as in the input data set."}},{"Name":"NOSORTEQUALS","Type":"S","Help":{"#cdata":"Specifies that no resources be used to control the order of observations with identical \nBY variable values in the output data set."}},{"Name":"SORTSEQ=","Type":"V","Values":{"@Value1":"ASCII","@Value2":"DANISH|NORWEGIAN","@Value3":"EBCDIC","@Value4":"FINNISH","@Value5":"ITALIAN","@Value6":"NATIONAL","@Value7":"POLISH","@Value8":"REVERSE","@Value9":"SPANISH","@Value10":"SWEDISH"},"ToolTips":{"@ToolTip1":"ASCII collating sequence","@ToolTip2":"DANISH|NORWEGIAN collating sequence","@ToolTip3":"EBCDIC collating sequence","@ToolTip4":"FINNISH collating sequence","@ToolTip5":"ITALIAN collating sequence","@ToolTip6":"NATIONAL collating sequence","@ToolTip7":"POLISH collating sequence","@ToolTip8":"REVERSE collating sequence","@ToolTip9":"SPANISH collating sequence","@ToolTip10":"SWEDISH collating sequence"},"Help":{"#cdata":"[SORTSEQ=collation-sequence] \n   \nSpecifies a language-specific collation sequence for the SORT procedure to use in the \ncurrent SAS session. \n\nSyntax Description: \ncollating-sequence \n  specifies the collating sequence that the SORT procedure is to use in the current \n  SAS session. Valid values can be user-supplied, or they can be one of the following: \n  \n    ASCII \n    DANISH (alias NORWEGIAN) \n    EBCDIC \n    FINNISH \n    ITALIAN \n    NATIONAL \n    POLISH \n    REVERSE \n    SPANISH \n    SWEDISH"}},{"Name":"SORTSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the amount of memory in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the amount of memory in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the amount of memory in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the amount of memory in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the amount of memory in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the amount of memory as a hexadecimal value.  Replace hex with an actual hexadecimal value.","@ToolTip7":"Specifies the minimum amount of memory available.","@ToolTip8":"Specifies the maximum amount of memory available."},"Help":{"#cdata":"Specifies the amount of memory that is available to the SORT procedure."}},{"Name":"SUMSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the amount of memory in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the amount of memory in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the amount of memory in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the amount of memory in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the amount of memory in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the amount of memory as a hexadecimal number. Replace hex with a hexadecimal value.","@ToolTip7":"Specifies the minimum amount of memory available.","@ToolTip8":"Specifies the maximum amount of memory available."},"Help":{"#cdata":"Specifies a limit on the amount of memory that is available for data summarization procedures when \nclass variables are active."}},{"Name":"ARMAGENT=","Type":"V","Help":{"#cdata":"[Syntax: ARMAGENT=module]\n\nSpecifies another vendor's ARM agent, which is an executable module that contains \na vendor's implementation of the ARM API."}},{"Name":"ARMLOC=","Type":"V","Help":{"#cdata":"[Syntax: ARMLOC=fileref | filename]\n\nSpecifies the location of the ARM log, where 'fileref' is a SAS name that is associated \nwith the physical location of the ARM log, and 'filename' is the physical location of the \nlog."}},{"Name":"ARMSUBSYS=","Type":"V","Values":{"@Value1":"ARM_NONE","@Value2":"ARM_ALL","@Value3":"ARM_DSIO","@Value4":"ARM_IOM","@Value5":"ARM_PROC","@Value6":"ARM_OLAP_SESSION"},"ToolTips":{"@ToolTip1":"Specifies that no internal SAS processing transactions are written to the ARM log.  This is the default setting.","@ToolTip2":"Specifies that all available internal SAS processing transactions are written to the ARM log.","@ToolTip3":"Collects SAS data set I/O processing information.","@ToolTip4":"Collects IOM Server processing information.","@ToolTip5":"Collects SAS procedure and DATA step processing information.","@ToolTip6":"Collects SAS OLAP Server session information."},"Help":{"#cdata":"[Syntax: ARMSUBSYS=(ARM_NONE | ARM_ALL | subsystem1 <item1 <item2 <...> > > <, subsystem2 <item1 <item2 <...> > >><OFF>)]\n\nEnables and disables the ARM subsystems that determine the internal SAS processing transactions \nto be logged.\n\nARM_NONE specifies that no internal SAS processing transactions are written to the ARM log. This \nis the default setting.\n\nARM_ALL specifies that all available internal SAS processing transactions are written to the ARM log.\n\nsubsystem specifies an ARM subsystem, which is a group of internal SAS processing transactions that '\nare to be written to the ARM log."}},{"Name":"CMPOPT=","Type":"V","Values":{"@Value1":"EXTRAMATH","@Value2":"NOEXTRAMATH","@Value3":"FUNCDIFFERENCING","@Value4":"NOFUNCDIFFERENCING","@Value5":"GUARDCHECK","@Value6":"NOGUARDCHECK","@Value7":"MISSCHECK","@Value8":"NOMISSCHECK","@Value9":"PRECISE","@Value10":"NOPRECISE","@Value11":"ALL","@Value12":"NONE"},"ToolTips":{"@ToolTip1":"Specifies to keep mathematical operations that do not affect the outcome  of a statement.","@ToolTip2":"Specifies to remove mathematical operations that do not affect the outcome  of a statement.","@ToolTip3":"Specifies that analytic derivatives are computed for user defined functions.","@ToolTip4":"Specifies that no analytic derivatives are computed for user defined functions.","@ToolTip5":"Specifies to check for array boundary problems.","@ToolTip6":"Specifies not to check for array boundary problems.","@ToolTip7":"Specifies to check for missing values in the data.","@ToolTip8":"Specifies not to check for missing values in the data.","@ToolTip9":"Specifies to handle exceptions at an operation boundary.","@ToolTip10":"Specifies to handle exceptions at a statement boundary.","@ToolTip11":"Specifies that the compiler is to optimize the machine language code  by using the (NOEXTRAMATH NOMISSCHECK NOPRECISE NOGUARDCHECK NOFUNCDIFFERENCING)  optimization values. This is the default.","@ToolTip12":"Specifies that the compiler is not set to optimize the machine language code by using the  (EXTRAMATH MISSCHECK PRECISE NOGUARDCHECK FUNCDIFFERENCING) optimization values."},"Help":{"#cdata":"[Syntax: CMPOPT=optimization-value | (optimization-value-1 ... optimization-value-n) \n  | \"optimization-value-1 ... optimization-value-n\"| ALL | NONE]\n\nSpecifies the type of code generation optimizations to use in the SAS language compiler."}},{"Name":"NOCMPOPT","Type":"S","Help":{"#cdata":"Specifies to set the value of CMPOPT to ALL."}},{"Name":"CPUCOUNT=","Type":"V","Values":{"@Value1":"<1-1024>","@Value2":"ACTUAL"},"ToolTips":{"@ToolTip1":"Is the number of CPUs that SAS will assume are available for use by thread-enabled applications.","@ToolTip2":"Returns the number of physical processors that are associated with the operating system where  SAS is executing."},"Help":{"#cdata":"[Syntax: CPUCOUNT = 1-1024|ACTUAL]\n\nSpecifies the number of processors that the thread-enabled applications should assume\nwill be available for concurrent processing. \n\nDefaults:\nUnder UNIX and Windows, if a system has four or more processors, the default value is 4. \nIf a system has fewer than four processors, the default is ACTUAL.\n\nUnder z/OS, the default is ACTUAL."}},{"Name":"THREADS","Type":"S","Help":{"#cdata":"Specifies to use threaded processing for SAS applications that support it."}},{"Name":"NOTHREADS","Type":"S","Help":{"#cdata":"Specifies not to use threaded processing for running SAS applications that support it."}},{"Name":"NETENCRYPT","Type":"S","Help":{"#cdata":"Specifies that encryption is required."}},{"Name":"NONETENCRYPT","Type":"S","Help":{"#cdata":"Specifies that encryption is not required, but is optional."}},{"Name":"NETENCRYPTALGORITHM=","Type":"V","Help":{"#cdata":"[Syntax: NETENCRYPTALGORITHM=algorithm | (\"algorithm-1\"... \"algorithm-n\")] \n   \nSpecifies the algorithm(s) that can be used for encrypting data that is transferred between \na client and a server across a network."}},{"Name":"NETENCRYPTKEYLEN=","Type":"V","Help":{"#cdata":"[Syntax: NETENCRYPTKEYLEN=0 | 40 | 128] \n    \nSpecifies the key length to use for encrypted client/server data transfers."}},{"Name":"SSLCALISTLOC=","Type":"V","Help":{"#cdata":"[Syntax: SSLCALISTLOC=\"file-path\"] \n    \nSpecifies the location of digital certificates for trusted certification authorities (CA)."}},{"Name":"SSLCERTISS=","Type":"V","Help":{"#cdata":"[Syntax: SSLCERTISS=\"issuer-of-digital-certificate\"] \n\nSpecifies the name of the issuer of the digital certificate that SSL should use."}},{"Name":"SSLCERTLOC=","Type":"V","Help":{"#cdata":"[Syntax: SSLCERTLOC=\"file-path\"] \n    \nSpecifies the location of the digital certificate that is used for authentication."}},{"Name":"SSLCERTSERIAL=","Type":"V","Help":{"#cdata":"[Syntax: SSLCERTSERIAL=\"serial-number\"] \n    \nSpecifies the serial number of the digital certificate that SSL should use."}},{"Name":"SSLCERTSUBJ=","Type":"V","Help":{"#cdata":"[Syntax: SSLCERTSUBJ=\"subject-name\"] \n    \nSpecifies the subject name of the digital certificate that SSL should use."}},{"Name":"SSLCLIENTAUTH","Type":"S","Help":{"#cdata":"Specifies that the server should perform client authentication."}},{"Name":"NOSSLCLIENTAUTH","Type":"S","Help":{"#cdata":"Specifies that the server should not perform client authentication."}},{"Name":"SSLCRLCHECK","Type":"S","Help":{"#cdata":"Specifies that CRLs are checked when digital certificates are validated."}},{"Name":"NOSSLCRLCHECK","Type":"S","Help":{"#cdata":"Specifies that CRLs are not checked when digital certificates are validated."}},{"Name":"SSLCRLLOC=","Type":"V","Help":{"#cdata":"[Syntax: SSLCRLLOC=\"file-path\"] \n   \nSpecifies the location of a Certificate Revocation List (CRL)."}},{"Name":"SSLPVTKEYLOC=","Type":"V","Help":{"#cdata":"[Syntax: SSLPVTKEYLOC=\"file-path\"] \n   \nSpecifies the location of the private key that corresponds to the digital certificate."}},{"Name":"SSLPVTKEYPASS=","Type":"V","Help":{"#cdata":"[Syntax: SSLPVTKEYPASS=\"password\"] \n    \nSpecifies the password that SSL requires for decrypting the private key."}},{"Name":"SVGHEIGHT=","Type":"V","Help":{"#cdata":"Specifies the height of the viewport unless the SVG output is embedded in another \nSVG output; specifies the value of the height attribute of the outermost <svg> \nelement in the XML file."}},{"Name":"SVGCONTROLBUTTONS","Type":"S","Help":{"#cdata":"Specifies to display the paging control buttons in the SVG document."}},{"Name":"NOSVGCONTROLBUTTONS","Type":"S","Help":{"#cdata":"Specifies not to display the paging control buttons in the SVG document. \nThis is the default."}},{"Name":"SVGTITLE=","Type":"V","Help":{"#cdata":"[Syntax: SVGTITLE=\"title\" | \"\" | \"] \n    \nSpecifies the title in the title bar of the SVG output; specifies the value of the \n<title> element in the XML file.\n\n\"\" | \" specifies to reset the title to empty."}},{"Name":"SVGVIEWBOX=","Type":"V","Help":{"#cdata":"[Syntax: SVGVIEWBOX=\"min-x min-y width height\" | none | \"\" | \"] \n    \nSpecifies the coordinates, width, and height that are used to set the viewBox attribute \non the outermost <svg> element, which enables SVG output to scale to the viewport. \n\n\"\" | \" specifies to reset the width and height of the viewBox to the width and height \nof the paper size for the SVG printer."}},{"Name":"SVGWIDTH=","Type":"V","Help":{"#cdata":"[Syntax: SVGWIDTH=\"number-of-units<unit-of-measure>\" | \"\" | \" ] \n    \nSpecifies the width of the viewport unless the SVG output is embedded in another SVG output; \nspecifies the value of the width attribute of the outermost <svg> element in the XML file. \n\n\"\" | \" specifies to reset the width to the default value of 800 pixels."}},{"Name":"SVGX=","Type":"V","Help":{"#cdata":"[Syntax: SVGX=\"number-of-units<unit-of-measure>\" | \"\" | \" ] \n    \nSpecifies the x-axis coordinate of one corner of the rectangular region into which an \nembedded <svg> element is placed; specifies the x attribute on the outermost <svg> \nelement in an XML file. \n\n\"\" | \" specifies to reset the x attribute to 0 on the <svg> element and the x-axis \ncoordinate for embedded SVG to 0."}},{"Name":"SVGY=","Type":"V","Help":{"#cdata":"[Syntax: SVGY=\"number-of-units<unit-of-measure>\" | \"\" | \" ] \n    \nSpecifies the y-axis coordinate of one corner of the rectangular region into which an \nembedded <svg> element is placed; specifies the y attribute on the outermost <svg> \nelement in an XML file. \n\n\"\" | \" specifies to reset the y attribute to 0 on the <svg> element and the y-axis \ncoordinate for embedded SVG to 0."}},{"Name":"SYNTAXCHECK","Type":"S","Help":{"#cdata":"Enables syntax check mode for statements that are submitted within a non-interactive \nor batch SAS session."}},{"Name":"NOSYNTAXCHECK","Type":"S","Help":{"#cdata":"Does not enable syntax check mode for statements that are submitted within a non-interactive \nor batch SAS session."}},{"Name":"DQLOCALE=","Type":"V","Help":{"#cdata":"[Syntax: DQLOCALE=(locale1 <locale2 ...localeN>)]\n    \nSpecifies an ordered list of locales. You must specify at least one locale."}},{"Name":"DQOPTIONS=","Type":"V","Help":{"#cdata":"[Syntax: DQOPTIONS=(label1=value1<, label2=value2..., labelN=valueN>)] \n    \nSpecifies SAS session parameters for data quality programs.\n    \n  labelN=valueN \n  specifies a data quality option keyword and a value for the option. The following \n  keywords are available:\n\n  DQSRVPROTOCOL=WIRELINE \n  specifies the Wireline protocol, which is required in the z/OS operating environment \n  for DataFlux Integration Servers version 8.1.1 or newer.\n\n  TRANSCODE=IGNORE | WARN \n  specifies that transcoding errors will not end SAS processing. IGNORE prevents the \n  appearance of transcoding warning messages in the SAS log."}},{"Name":"DQSETUPLOC=","Type":"V","Help":{"#cdata":"[Syntax: DQSETUPLOC=`file-specification' | `path-specification'] \n    \nSpecifies the location of the SAS Data Quality Server setup file or the root directory \nof the Quality Knowledge Base."}},{"Name":"FULLSTIMER","Type":"S","Help":{"#cdata":"Specifies that SAS write to the SAS log a complete list of computer resources that \nwere used for each step and for the entire SAS session."}},{"Name":"NOFULLSTIMER","Type":"S","Help":{"#cdata":"Specifies that SAS not write a complete list of computer resources to the SAS log. \n    \nNOFULLSTIMER is the default."}},{"Name":"ICON","Type":"S","Help":{"#cdata":"Specifies to minimize the main SAS window immediately."}},{"Name":"NOICON","Type":"S","Help":{"#cdata":"Restores the main SAS window immediately."}},{"Name":"MEMCACHE=","Type":"V","Values":{"@Value1":"0","@Value2":"1","@Value3":"4"},"ToolTips":{"@ToolTip1":"Specifies memory cache is off.","@ToolTip2":"Specifies not to add any new files to the cache. Reads and writes to files already  in the cache continue as if MEMCACHE is on.","@ToolTip3":"Specifies memory cache is on. Memory is used as a SAS file cache."},"Help":{"#cdata":"[Syntax: MEMCACHE= 0 | 1 | 4]\n\nSpecifies to use the memory-based libraries as a SAS file cache. \n\nWhen the MEMCACHE system option is 4 or 1, SAS file cache places data in memory \nas it is processed. This data is then available for future references by SAS. Files \nin the cache are kept until SAS is shut down, caching is terminated, or more space \nis required for new files. Memory is reclaimed on a least recently used basis. Cached \ndata is written to permanent storage. You can control which SAS libraries use the \ncache by using the MEMCACHE system option in the OPTIONS statement. Memory usage can \nbe monitored using the performance tools."}},{"Name":"NOXWAIT","Type":"S","Help":{"#cdata":"Specifies to close the command prompt window automatically. \n    \nWhen executed on a workstation using the DI-Atlantis\nbuild module, a command window opens to execute the\nbuild module followed by a second command window to launch\nDI-Diver to view the model just created. DI-Diver should be\nlaunched only after the model has been created. All this should\nhappen automatically without your intervention."}},{"Name":"XSYNC","Type":"S","Help":{"#cdata":"Specifies that the SAS System will wait for the application\nto finish.\n    \nWhen executed on a workstation using the DI-Atlantis\nbuild module, a command window opens to execute the\nbuild module followed by a second command window to launch\nDI-Diver to view the model just created. DI-Diver should be\nlaunched only after the model has been created. All this should\nhappen automatically without your intervention."}},{"Name":"VALIDMEMNAME=","Type":"V","Values":{"@Value1":"COMPATIBLE|COMPAT","@Value2":"EXTEND"},"ToolTips":{"@ToolTip1":"Specifies that member name must be compatible with the current rules:    o can be up to 32 bytes in length.    o must begin with a letter of the Latin alphabet (A - Z, a - z) or the underscore character.      Subsequent characters can be letters of the Latin alphabet, numerals, or underscores.    o cannot contain blanks.    o cannot contain special characters except for the underscore.    o can contain mixed-case letters; however, SAS normalizes the member name based on the host platform.    This is the default.","@ToolTip2":"Specifies that SAS member names must follow these rules:    o can be up to 32 bytes in length (even if multi-byte characters are included)    o can include special characters, except the characters /\\*?\"<>|:-    o cannot contain any null bytes    o can begin with or contain any supported characters, excluding blanks    o must contain at least one character. An all-blank name is not permitted.    o trailing blanks will be trimmed    o can contain mixed-case letters; however, SAS normalizes the member name based on the host platform."},"Help":{"#cdata":"[Syntax: VALIDMEMNAME=COMPATIBLE | COMPAT | EXTEND] \n    \nExtends the characters that can be used in member names for SAS data sets, views, \nand item stores. This option extends the valid characters to: \n\n  o international characters \n  o characters supported by third-party databases \n  o characters commonly used in file names \n  \nThe VALIDMEMNAME= option allows users to control the characters allowed in member names."}},{"Name":"ODSDEST=","Type":"V","Values":{"@Value1":"HTML","@Value2":"LISTING","@Value3":"AUTO"},"ToolTips":{"@ToolTip1":"Specifies that HTML (TAGSET.HTML4) is the default output destination in the SAS Windowing  environment on the Microsoft Windows and UNIX operating systems.","@ToolTip2":"Specifies that the LISTING destination is the default output destination.","@ToolTip3":"Specifies the SAS registry settings determine the default destination setting. This  setting is HTML by default in SAS 9.3 in the SAS Windowing environment for the UNIX  and Microsoft Windows operating systems. HTML 4.0 is the HTML version supported by  default.   Note: In SAS 9.3, HTML output in the SAS Windowing environment is the default for  Microsoft Windows and UNIX, but not for other operating systems and not in batch mode.  When you run SAS in batch mode or on other operating systems, the LISTING destination  is open and is the default, ODS Graphics is not enabled by default, and the default  style for HTML output is Styles.Default."},"Help":{"#cdata":"[Syntax: ODSDEST= HTML | LISTING | AUTO \n\nChanges the default ODS destination. In SAS 9.3, HTML is the default output destination \nfor the SAS Windowing environment in the Microsoft Windows and UNIX operating systems. \nFor all other platforms, LISTING is the default destination."}},{"Name":"ODSGRAPHICS=","Type":"V","Values":{"@Value1":"ON","@Value2":"OFF","@Value3":"AUTO"},"ToolTips":{"@ToolTip1":"Enables ODS Graphics processing by default.","@ToolTip2":"Disables ODS graphics processing.","@ToolTip3":"Specifies that the SAS registry setting determines the default destination setting.                 Note: In SAS 9.3, ODS Graphics is enabled in the SAS Windowing environment for Microsoft  Windows and UNIX, but not for other operating systems and not in batch mode. When you run  SAS in batch mode or on other operating systems, ODS Graphics is not enabled by default,  the LISTING destination is open and is the default, and the default style for HTML output  is Styles.Default."},"Help":{"#cdata":"[Syntax: ODSGRAPHICS= ON | OFF | AUTO \n\nControls ODS Graphics processing.\n\nIn SAS 9.3, ODS Graphics is enabled by default in the SAS Windowing environment for UNIX and \nMicrosoft Windows. When ODS graphics processing is enabled, the graphs are integrated with \ntables and all output is displayed in the same HTML file using the HTMLBlue style. This new \nstyle is an all-color style, which is designed to integrate tables and modern statistical \ngraphics. \n\nIn SAS 9.3, when you run large computational programs, you might not want to create graphs. \nIn those cases, you should disable ODS Graphics to improve the performance of your program. \nYou can enable and disable ODS Graphics in your SAS programs with the ODS GRAPHICS OFF and \nODS GRAPHICS ON statements. You can also change the ODS Graphics default in the Results tab. \n\nPrior to SAS 9.3, ODS Graphics was disabled by default."}},{"Name":"ODSSTYLE=","Type":"V","Values":{"@Value1":"<style-name>","@Value2":"AUTO"},"ToolTips":{"@ToolTip1":"Specifies the default style for ODS HTML destinations. For SAS 9.3, HTMLBlue is the  default style used for HTML output in the SAS Windowing environment for UNIX and  Microsoft Windows.   Note: By default, ODS displays the procedure or DATA step results in a style. The  TEMPLATE procedure creates and modifies styles. The Output Delivery System uses  these styles to produce customized formatted output.","@ToolTip2":"Specifies that the SAS registry setting determine the default style setting. In  SAS 9.3, HTMLBlue is the default style for the SAS Windowing environment on UNIX  and Microsoft Windows.   In HTML, the style impacts TABULAR and GRAPHICS output."},"Help":{"#cdata":"Syntax: ODSSTYLE= style-name | AUTO \n    \nSpecifies the default style to use."}},{"Name":"APPEND=","Type":"V","Help":{"#cdata":"Appends a value to the existing value of the specified system option.\n    \nSyntax: APPEND=(system-option-1 =argument-1 <system-option-n =argument-n>) \n\nSyntax Description:\nsystem-option \n  can be AUTOEXEC, CMPLIB, FMTSEARCH, HELPLOC, MAPS, MSG, SASAUTOS, SASHELP, SASSCRIPT, or SET. \n  \n  Note:Some of these options are available only when SAS starts. These options can be specified \n  in the APPEND= option only when the APPEND= option is specified in a configuration file or a \n  SAS command. \n  \nargument \n  specifies a new value that you want to append to the current value of system-option. \n  argument can be any value that could be specified for system-option if system-option is set \n  using the OPTIONS statement."}},{"Name":"ORIENTATION=","Type":"V","Values":{"@Value1":"PORTRAIT","@Value2":"LANDSCAPE","@Value3":"REVERSEPORTRAIT","@Value4":"REVERSELANDSCAPE"},"ToolTips":{"@ToolTip1":"Specifies the paper orientation as portrait. This is the default.","@ToolTip2":"Specifies the paper orientation as landscape.","@ToolTip3":"Specifies the paper orientation as reverse portrait. Use this value to control the top  of the page relative to how the paper is inserted into the input paper tray.   REVERSEPORTRAIT can be used when you print preprinted or punched forms.","@ToolTip4":"Specifies the paper orientation as reverse landscape. Use this value to control the top  of the page relative to how the paper is inserted into the input paper tray.   REVERSELANDSCAPE can be used when you print preprinted or punched forms."},"Help":{"#cdata":"Syntax: ORIENTATION=PORTRAIT | LANDSCAPE | REVERSEPORTRAIT | REVERSELANDSCAPE \n\nSpecifies the paper orientation to use when printing to a printer."}},{"Name":"DLCREATEDIR","Type":"S","Help":{"#cdata":"Specifies to create a directory for a SAS library that is named in a LIBNAME statement \nif the directory does not exist."}},{"Name":"NODLCREATEDIR","Type":"S","Help":{"#cdata":"Specifies not to create a directory for a SAS library that is named in a LIBNAME statement. \n    \nThis is the default."}},{"Name":"AUTOCORRECT","Type":"S","Help":{"#cdata":"Specifies that SAS attempts to automatically correct misspelled procedure names, \nmisspelled procedure keywords, or misspelled global statement names. \n\nThis is the default"}},{"Name":"NOAUTOCORRECT","Type":"S","Help":{"#cdata":"Specifies that SAS does not automatically attempt to correct misspelled procedure names, \nmisspelled procedure keywords, or misspelled global statement names."}},{"Name":"EMAILUTCOFFSET=","Type":"V","Help":{"#cdata":"For e-mail that is sent using the FILENAME statement EMAIL (SMTP) access method, \nspecifies a UTC offset that is used in the Date header field of the e-mail message.\n    \nSyntax:\nEMAILUTCOFFSET=\"+hhmm” | \"-hhmm”\n\nSyntax Description:\n\"+hhmm\" | \"-hhmm\" \n  specifies the number of hours and minutes that are used as the UTC offset in the Date \n  header field of an e-mail. Use the UTC offset to establish the local time. \n  \n  Requirement:The value of the EMAILUTCOFFSET= system option must be enclosed in double \n  or single quotation marks."}},{"Name":"URLENCODING=","Type":"V","Values":{"@Value1":"SESSION","@Value2":"UTF8"},"ToolTips":{"@ToolTip1":"Specifies that the argument to the URLENCODE function and to the URLDECODE function  is interpreted using the SAS session encoding. This is the default.   Note:SAS session encoding uses the URL encoding standard RFC 1738.   Tip:SESSION is compatible with previous releases of SAS.","@ToolTip2":"Specifies that the argument to the URLENCODE function and to the URLDECODE function  is interpreted using UTF-8 encoding.   Note:UTF-8 encoding uses the URL encoding standard RFC 3986."},"Help":{"#cdata":"Syntax: URLENCODING=SESSION | UTF8\n\nSpecifies whether the argument to the URLENCODE function and to the URLDECODE function \nis interpreted using the SAS session encoding or UTF-8 encoding."}},{"Name":"INSERT=","Type":"V","Help":{"#cdata":"Inserts the specified value as the first value of the specified system option.\n    \nSyntax:\nINSERT=(system-option-1 =argument-1 <system-option-n =argument-n>) \n\nSyntax Description:\nsystem-option \n  can be AUTOEXEC, CMPLIB, FMTSEARCH, HELPLOC, MAPS, MSG, SASAUTOS, SASHELP, SASSCRIPT, or SET. \n  \n  Note:Some of these options are available only when SAS starts. These options can be \n  specified in the INSERT= option only when the INSERT= option is specified in a configuration \n  file or a SAS command. \n  \nargument \n  specifies a new value that you want as the first value of system-option. \n  \n  argument can be any value that could be specified for system-option if system-option \n  is set using the OPTIONS statement."}},{"Name":"VARLENCHK=","Type":"V","Values":{"@Value1":"NOWARN","@Value2":"WARN","@Value3":"ERROR"},"ToolTips":{"@ToolTip1":"Specifies that no warning message is issued when the length of a variable that is being read  is larger than the length that is defined for the variable.","@ToolTip2":"Specifies that a warning is issued when the length of a variable that is being read is larger  than the length that is defined for the variable. This is the default.","@ToolTip3":"Specifies that an error message is issued when the length of a variable that is being read  is larger than the length that is defined for the variable."},"Help":{"#cdata":"Specifies the type of message to write to the SAS log when the input data set is read \nusing the SET, MERGE, UPDATE, or MODIFY statements."}},{"Name":"UNIVERSALPRINT","Type":"S","Help":{"#cdata":"Specifies whether to enable menus for Universal Printing and to set up printing defaults."}},{"Name":"MAUTOCOMPLOC","Type":"S","Help":{"#cdata":"Displays in the SAS log the source location of the autocall macros when the autocall macro is compiled."}},{"Name":"MAUTOLOCINDES","Type":"S","Help":{"#cdata":"Specifies whether the macro processor prepends the full pathname of the autocall source file \nto the description field of the catalog entry of compiled auto call macro definition in the \nWORK.SASMACR catalog."}},{"Name":"MCOVERAGE","Type":"S","Help":{"#cdata":"Enables the generation of coverage analysis data."}},{"Name":"MCOVERAGELOC=","Type":"V","Help":{"#cdata":"Specifies the location of the coverage analysis data file."}},{"Name":"BOMFILE","Type":"S","Help":{"#cdata":"Specifies to write a byte order mark (BOM) prefix when a Unicode-encoded file is written to an external file."}},{"Name":"NOBOMFILE","Type":"S","Help":{"#cdata":"Specifies not to write a BOM prefix when a Unicode-encoded file is written to an external file."}},{"Name":"DATESTYLE=","Type":"V","Values":{"@Value1":"MDY","@Value2":"MYD","@Value3":"YMD","@Value4":"YDM","@Value5":"DMY","@Value6":"DYM","@Value7":"LOCALE"},"ToolTips":{"@ToolTip1":"Specifies that SAS set the order as month, day, year.","@ToolTip2":"Specifies that SAS set the order as month, year, day.","@ToolTip3":"Specifies that SAS set the order as year, month, day.","@ToolTip4":"Specifies that SAS set the order as year, day, month.","@ToolTip5":"Specifies that SAS set the order as day, month, year.","@ToolTip6":"Specifies that SAS set the order as day, year, month.","@ToolTip7":"Specifies that SAS set the order based on the value that corresponds to the LOCALE=  system option value and is one of the following: MDY | MYD | YMD | YDM | DMY | DYM."},"Help":{"#cdata":""}},{"Name":"LOCALE=","Type":"V","Help":{"#cdata":"Syntax: LOCALE=locale-name \n\nSpecifies a set of attributes in a SAS session that reflect the language, local conventions, \nand culture for a geographical region. \n\nRequired Argument:\nlocale-name \n  For a complete list of locale values (SAS names and POSIX names), see LOCALE= Values and \n  Default Settings for ENCODING, PAPERSIZE, DFLANG, and DATESTYLE Options."}},{"Name":"RSASIOTRANSERROR","Type":"S","Help":{"#cdata":"Specifies to display a transcoding error when illegal values are read from a remote application."}},{"Name":"NORSASIOTRANSERROR","Type":"S","Help":{"#cdata":"Specifies not to display a transcoding error when illegal values are read from a remote application."}},{"Name":"STRIPESIZE=","Type":"V","Help":{"#cdata":"Syntax: STRIPESIZE=directory-path-1 size-1 <directory-path-2 size-2 …> \n    STRIPESIZE=(directory-path RESET) \n    \nSyntax Description:\ndirectory-path\n  specifies an existing directory where the I/O page size for SAS data sets and utility files that \n  are created in this directory is set to size. Subdirectories of directory-path inherit the data \n  set or utility file size unless the STRIPESIZE= option has been set for the subdirectory.\n\nRequirements:\nIf directory-path contains spaces, enclose the directory in quotation marks. \n\ndirectory-path must \n  be a valid Windows or UNIX FIle System (UFS) path. Native z/OS data set names are not supported.\n\n  UNIX specifics:\n  The casing used for directory-path must match the casing for the directory under UNIX operating \n  environments. \n\nsize\n  specifies the number of bytes in a RAID (Redundant Array of Independent Disks) stripe, in multiples \n  of 1: 1,024 (kilo); 1,048,576 (mega); 1,073,741,824 (giga). For example, a value of 1024 specifies \n  1,024 bytes, and a value of 3m specifies 3,145,728 bytes.\n  Range: 1024–2147483648\n\n\nRESET\n  specifies to remove the directory from the value of the STRIPESIZE= option."},"SubOptionsKeywords":"RESET"},{"Name":"UBUFNO=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"hexX","@Value6":"MIN","@Value7":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the number of utility file buffers to be allocated.  Range: 0–20","@ToolTip2":"Specifies the number of utility file buffers in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the number of utility file buffers in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the number of utility file buffers in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the number of utility file buffers as a hexadecimal value.  You must specify the value beginning with a number (0–9), followed by an X.  For example, the value 0fx specifies 15 buffers.","@ToolTip7":"Sets the minimum number of utility file buffers to 0, which causes SAS to use the minimum optimal value  for the operating environment.","@ToolTip8":"Sets the number of utility file buffers to 20."},"Help":{"#cdata":"Syntax: UBUFNO=n | nK | nM | nG | hexX | MIN | MAX \n    \nSpecifies the number of buffers to use for utility files. \n    \nDefault: The shipped default is 0."}},{"Name":"UBUFSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the utility file buffer size in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the utility file buffer size in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the utility file buffer size in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the utility file buffer size in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the utility file buffer size in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the utility file buffer size as a hexadecimal value.  You must specify the value beginning with a number (0–9), followed by an X. For example, the value 2dx sets the page size to 45 bytes.","@ToolTip7":"Sets the utility file buffer size to 0. A value of 0 specifies that the buffer size is set to the  default page size for the operating environment.","@ToolTip8":"Sets the utility file buffer size to the maximum possible number in your operating environment,  up to the largest four-byte, signed integer, which is (2³¹)-1, or approximately 2 billion."},"Help":{"#cdata":"[Syntax: UBUFSIZE=n| nK | nM | nG | nT |hexX | MIN | MAX]\n\nSpecifies the buffer size for utility files. \n\nDefault: The shipped default is 0."}},{"Name":"VBUFSIZE=","Type":"V","Values":{"@Value1":"n","@Value2":"nK","@Value3":"nM","@Value4":"nG","@Value5":"nT","@Value6":"hexX","@Value7":"MIN","@Value8":"MAX"},"ToolTips":{"@ToolTip1":"Specifies the size of the view buffer in multiples of 1 (bytes).  Replace n with an integer value.","@ToolTip2":"Specifies the size of the view buffer in multiples of 1,024 (kilobytes).  Replace n with an integer value.","@ToolTip3":"Specifies the size of the view buffer in multiples of 1,048,576 (megabytes).  Replace n with an integer value.","@ToolTip4":"Specifies the size of the view buffer in multiples of 1,073,741,824 (gigabytes).  Replace n with an integer value.","@ToolTip5":"Specifies the size of the view buffer in multiples of 1,099,511,627,776 (terabytes).  Replace n with an integer value.","@ToolTip6":"Specifies the size of the view buffer as a hexadecimal value.  You must specify the value beginning with a number (0–9), followed by an X. For example, the value 0fffeX specifies a buffer size of 65,534 bytes.","@ToolTip7":"Sets the size of the view buffer to 0.","@ToolTip8":"Sets the size of the view buffer to (2⁶⁴⁻¹)-1, or approximately 9.2 quintillion bytes."},"Help":{"#cdata":"[Syntax: UBUFSIZE=n| nK | nM | nG | nT |hexX | MIN | MAX]\n\nSpecifies the buffer size of the view buffer. \n\nDefault: The shipped default is 65536."}},{"Name":"VARINITCHK=","Type":"V","Values":{"@Value1":"NONOTE","@Value2":"NOTE","@Value3":"WARN|WARNING","@Value4":"ERROR"},"ToolTips":{"@ToolTip1":"Specifies that the DATA step continues to execute without writing a message to the SAS log when  a variable is not initialized.","@ToolTip2":"Specifies that the DATA step continues to execute and writes a note to the SAS log when a variable  is not initialized.","@ToolTip3":"The SAS log when a variable is not initialized.","@ToolTip4":"Specifies that the DATA step stops executing and writes an error message to the SAS log when  a variable is not initialized."},"Help":{"#cdata":"Syntax: VARINITCHK=NONOTE | NOTE | WARN | ERROR\n    \nSpecifies whether a DATA step stops or continues executing when a variable is not initialized \nand the type of message to write to the SAS log."}},{"Name":"PRESENV","Type":"S","Help":{"#cdata":"Specifies that collecting data for the preservation of the SAS environment is enabled."}},{"Name":"NOPRESENV","Type":"S","Help":{"#cdata":"Specifies that collecting data for the preservation of the SAS environment is disabled."}},{"Name":"TIMEZONE=|TZ=","Type":"V","Help":{"#cdata":"Syntax: TIMEZONE='time-zone-name' | 'time-zone-ID' \n    \nSpecifies the user local time zone.\n    \nSyntax Descriptiont:\nime-zone-name\n  specifies a three- or four-character time zone name. For example, EST is a time zone name \n  for Eastern Standard Time."}},{"Name":"DECIMALCONV=","Type":"V","Values":{"@Value1":"COMPATIBLE|COMPAT","@Value2":"STDIEEE"},"ToolTips":{"@ToolTip1":"Specifies to convert and format decimal values by using the conversion methodology that is compatible  with releases prior to SAS 9.4. Use this option when SAS output might be processed by existing applications  that are sensitive to the details of formatting.   z/OS specifics: DECIMALCONV=COMPATIBLE is always in effect because z/OS uses the IBM hexadecimal floating-point number  representation rather than the IEEE format.","@ToolTip2":"Specifies to convert and format decimal values by using the IEEE Standard for Floating-Point  Arithmetic 754-2008. Using the STDIEEE argument improves the accuracy and readability of  floating-point numbers. In some cases, more significant digits can be displayed in the same  field width."},"Help":{"#cdata":"Syntax: DECIMALCONV=COMPATIBLE | STDIEEE \n    \nSpecifies the binary to decimal conversion and formatting methodology."}},{"Name":"EMAILACKWAIT=","Type":"V","Help":{"#cdata":"Syntax: EMAILACKWAIT=number-of-seconds \n\nSpecifies the number of seconds that SAS waits to receive an acknowledgment from an SMTP server.\n\nSyntax Description:\nnumber-of-seconds\n  specifies the number of seconds that SAS waits to receive an acknowledgment from an SMTP server.\n\n  Range: 0–3600"}},{"Name":"COLOPHON=","Type":"V","Help":{"#cdata":"Syntax: COLOPHON=\"text-string\" \n    \nSpecifies a text string that is embedded in a graphic file or a PDF that is created by Universal \nPrinters. The text string is not displayed in the rendered graphic or PDF.\n\nSyntax Description:\ntext-string\n  specifies the text that is embedded in a graphic file.\n  Length: up to 4,000 characters.\n  Requirement: The text string must be enclosed in quotation marks.\n  Interaction: Text strings that are longer than the value of the LRECL= option are truncated. \n    The default value of the LRECL= option is 32767. Temporarily increase the value of the LRECL= \n    option for longer text strings."}},{"Name":"SVGAUTOPLAY","Type":"S","Help":{"#cdata":"Specifies to automatically start the animation in the web page."}},{"Name":"NOSVGAUTOPLAY","Type":"S","Help":{"#cdata":"Specifies to display the first frame of the animation in the web page. The animated file is started \nby clicking"}},{"Name":"SVGFADEIN=","Type":"V","Help":{"#cdata":"Syntax: SVGFADEIN=n \n    \nSpecifies the number of seconds for an SVG frame to fade into view.\n\nSyntax Description:\nn\n  specifies the number of seconds for an SVG frame to fade into view. Valid values can be any \n  numeric representation (for example, .01, 5, or 6.5)."}},{"Name":"SVGFADEMODE=","Type":"V","Values":{"@Value1":"OVERLAP","@Value2":"SEQUENTIAL"},"ToolTips":{"@ToolTip1":"Specifies that for each SVG frame that is fading in or out of view, the fading of frames overlaps  in the same time span.","@ToolTip2":"Specifies that for each SVG frame that is fading in or out of view, the frame fades out after the  fade-out is complete. The next frame is a frame that is fading in."},"Help":{"#cdata":"Syntax: SVGFADEMODE=OVERLAP | SEQUENTIAL \n    \nSpecifies whether an SVG frame overlaps the previous frame or whether each frame is played \nsequentially when a frame is fading in and out."}},{"Name":"SVGFADEOUT=","Type":"V","Help":{"#cdata":"Syntax: SVGFADEOUT=n \n    \nSpecifies the number of seconds for an SVG frame to fade out of view.\n\nSyntax Description:\nn\n  specifies the number of seconds for an SVG frame to fade out of view. Valid values can be any \n  numeric representation (for example, .01, 5, or 6.5)."}},{"Name":"SVGMAGNIFYBUTTON","Type":"S","Help":{"#cdata":"Specifies to enable the SVG magnify tool in SVG documents."}},{"Name":"NOSVGMAGNIFYBUTTON","Type":"S","Help":{"#cdata":"Specifies to disable the SVG magnify tool for all SVG documents."}},{"Name":"EXTENDOBSCOUNTER=","Type":"V","Values":{"@Value1":"YES","@Value2":"NO"},"ToolTips":{"@ToolTip1":"Requests an enhanced file format in a newly created SAS data file that counts observations beyond  the 32-bit limitation. Although this SAS data file is created for an operating environment that  stores the number of observations with a 32-bit integer, the data file behaves like a 64-bit file  with respect to counters.","@ToolTip2":"Determined by the long integer size for the operating environment. In operating environments with  a 32-bit integer, the maximum number is 231–1 or approximately two billion observations  (2,147,483,647). In operating environments with a 64-bit integer, the maximum number is 263–1  or approximately 9.2 quintillion observations."},"Help":{"#cdata":"Syntax: EXTENDOBSCOUNTER=YES | NO\n    \nSpecifies whether to extend the maximum observation count in a new output SAS data file."}},{"Name":"CSTGLOBALLIB=","Type":"V","Help":{"#cdata":"Syntax: CSTGLOBALLIB='location' \n    \nSpecifies the location of the SAS Clinical Standards Toolkit global standards library. \n\nSyntax Description:\n'location'\n  specifies the directory where the SAS Clinical Standards Toolkit global standards library \n  is located. If the directory contains spaces, enclose the directory in quotation marks."}},{"Name":"CSTSAMPLELIB=","Type":"V","Help":{"#cdata":"Syntax: CSTSAMPLELIB='location' \n    \nSpecifies the location of the SAS Clinical Standards Toolkit sample library.\n\nSyntax Description:\n'location'\n  specifies the directory where the SAS Clinical Standards Toolkit global sample library \n  is located. If the directory contains spaces, enclose the directory in quotation marks."}},{"Name":"DSACCEL=","Type":"V","Values":{"@Value1":"ANY","@Value2":"NONE"},"ToolTips":{"@ToolTip1":"Enables the DATA step to execute in supported parallel environments.","@ToolTip2":"Disables the DATA step from executing in supported parallel environments."},"Help":{"#cdata":"Syntax: DSACCEL=ANY | NONE \n    \nSpecifies whether the DATA step is enabled for parallel processing in supported environments."}},{"Name":"AUTHINFO=|CASAUTHINFO=","Type":"V|CAS","Help":{"#cdata":"Syntax: AUTHINFO='authinfo_file_path'  | CASAUTHINFO='authinfo_file_path'\n    \nSpecifies a file where user ID and passwords are kept for authentication. \n\nauthinfo_file_path\n  specifies the path where an Authinfo file is located. The Authinfo file provides an alternative \n  to including passwords in programs. The most frequent use of this option is to submit code to \n  CAS from the command line, in batch mode."}},{"Name":"CASDATALIMIT=","Type":"V|CAS","Values":{"@Value1":"<integer>","@Value2":"<integerK>","@Value3":"<integerM>","@Value4":"<integerG>","@Value5":"ALL"},"ToolTips":{"@ToolTip1":"Specifies the total number of bytes to read ","@ToolTip2":"Specifies the total number of kilobytes to read.","@ToolTip3":"Specifies the total number of megabytes to read.","@ToolTip4":"Specifies the total number of gigabytes to read.","@ToolTip5":"Specifies that the entire file can be read, no matter how large it is."},"Help":{"#cdata":"[Syntax: CASDATALIMIT=integer | integerK | integerM | integerG | ALL]\n    \nSpecifies the maximum number of bytes of data that can transferred from the SAS Cloud Analytic Services server to SAS. \n\nDefault: 100M\n\nTip:\nThis option can prevent you from accidentally transferring a large amount of data from the server to the client.\n\nWhen you use the caslib all assign; statement to create CAS LIBNAME assignments for all defined caslibs, \nthe default value of 100M is used as the maximum number of bytes that can be transferred from the CAS \nserver to SAS.. To override this value, use the CASDATALIMIT= system option. \n\nIn SAS Viya, you can limit the data transferred from the CAS server to SAS by using the DATALIMIT LIBNAME \noption or the DATALIMIT data set option."}},{"Name":"CASHOST=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASHOST=\"host-name\"\n\nSpecifies the host name of CAS that is associated with a CAS session. \n\nRange: 256 characters \n\nExample:\nOPTIONS CASHOST=\"rdcgrd001.unx.sas.com\";"}},{"Name":"CASLIB=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASLIB=\"name\"\n    \nSpecifies the caslib name for the session that is identified by the SESSREF= option.\n\nDefault: None\nRange: 128 characters\n\nInteraction:\nThe CAS statement session option CASLIB= overrides this option. For more information, see CASLIB= Session Option.\n\nNote:\nThis option can be restricted by a site administrator.\n\nTip:\nA best practice is to explicitly set options for a session using the CAS statement SESSOPTS= option. \nHere is an example:\n  \n  cas mysess sessopts=(caslib=mycaslib collate=UCA); "}},{"Name":"CASNUMCHARMULTIPLIER=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASNUMCHARMULTIPLIER=n\n    \nSpecifies a multiplication factor that is used to increase the number of bytes for a fixed character \nvariable when data is transcoded to the UTF-8 encoding in order to run in the CAS server."}},{"Name":"CASNWORKERS=","Type":"V|CAS","Values":{"@Value1":"ALL","@Value2":"<number>"},"ToolTips":{"@ToolTip1":"Specifies to use all of the worker nodes.","@ToolTip2":"Specifies the number of worker nodes to use. Replace <number> with an integer value ranging from 0 to 5000."},"Help":{"#cdata":"Syntax: CASNWORKERS= ALL | number \n    \nSyntax Description:\nALL \n  specifies to use all of the worker nodes. \nnumber\n  specifies the number of worker nodes to use. \n  In SMP mode, number is always 0, whether you set CASNWORKERS= to 0 or 1. \n  In MPP mode, specify number=0 to use the maximum number of worker nodes that are available. You can set \n    CASNWORKERS= to a number that is less than or equal to the maximum number of worker nodes. \n  Range: 0-5000"}},{"Name":"CASPORT=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASPORT=port-number\n    \nSpecifies the port to use when connecting to CAS. \n\nDefault: 0\nRange: 0 to 65535 \n\nExample:\nOPTIONS CASPORT=12345;"}},{"Name":"CASSESSOPTS=|SESSOPTS=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASSESSOPTS=(session-options) | SESSOPTS=(session-options) \n\nSpecifies one or more CAS session options for the default CAS session. \n\nThe following is a list of most of the session-options: \n  APPTAG= specifies the string to prefix to log messages.\n  AUTOCORRECT= automatically corrects misspelled procedure names and keywords, and global statement names.\n  CASLIB= specifies the caslib name to set as the active caslib.\n  COMPOPT= specifies the type of code generation optimizations to use in the SAS language compiler.\n  COLLATE= specifies the collating sequence for sorting.\n  DATASTEPFMTERR= specifies how the DATA step reacts when SAS cannot find a specified variable format.\n  DATASTEPMSGSUMLEVEL= specifies the DATA step message summary level.\n  DATASTEPREPLACETABLE= specifies whether a DATA step can replace an existing table.   \n  DATASTMTCHK= specifies which SAS statement keywords are prohibited from being specified as a one-level \n    DATA step name to protect against overwriting an input data set. \n  DKRICOND= specifies the error level to report when a variable is missing from an input data set during \n    the processing of a DROP=, KEEP=, or RENAME= data set option.\n  DKROCOND= specifies the error level to report when a variable is missing from an output data set during \n    the processing of a DROP=, KEEP=, or RENAME= data set option. \n  DQLOCALE specifies the default 5-letter SAS Quality Knowledge Base (QKB) ISO locale code to use as the \n    default locale for data quality (DQ) operations. \n  DQSETUPLOC specifies the name of the default SAS Quality Knowledge Base (QKB) to use for data quality operations.\n  ERRORS= specifies the maximum number of observations for which SAS issues complete error messages. \n  EVENTDS specifies one or more data sets that define events.\n  FMTCASLIB specifies the caslib where persisted format libraries are retained. \n  INVALIDDATA= specifies the value that SAS assigns to a variable when invalid numeric data is encountered.\n  INTERVALDS specifies one or more interval-name=value pairs, where the value is the name of a data set that \n    contains user-defined intervals.\n  LOCALE= specifies the locale to use for sorting and formatting.\n  LOGFLUSHTIME= specifies the log flush time, in milliseconds. \n  MAXTABLEMEM= specifies the maximum amount of physical memory, in bytes, to allocate for a table.\n  MESSAGELEVEL= specifies the log message level.\n  METRICS= specifies whether to include detailed performance metrics reports in the SAS log. \n  NWORKERS= specifies the number of worker nodes for a new session.\n  TIMEOUT= specifies the SAS Cloud Analytic Services session time-out in seconds for a new or existing session.\n  TIMEZONE= specifies the time zone offset, in hours, from UTC."},"SubOptionsKeywords":"\n      |APPTAG=|AUTOCORRECT=|CASLIB=|COLLATE=|DATASTEPREPLACETABLE=|DATASTMTCHK=|DKRICOND=|DKROCOND=|ERRORS=|FMTCASLIB|\n      |INVALIDDATA=|LOCALE=|LOGFLUSHTIME=|MAXTABLEMEM=|MESSAGELEVEL=|METRICS=|NWORKERS=|TIMEOUT=|TIMEZONE=|VARINITCHK=|\n      |DATASTEPMSGSUMLEVEL=|DATASTEPFMTERR=|DQLOCALE|DQSETUPLOC|EVENTDS|INTERVALDS|\n    "},{"Name":"CASTIMEOUT=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASTIMEOUT=seconds\n    \nSpecifies the CAS session time-out in seconds. The session time-out starts ticking when the number of \nconnections to the session is zero.\n\nDefault: 60\nRange: 0 to 99999999 \n\nExample:\nOPTIONS CASTIMEOUT=28800;"}},{"Name":"CASUSER=|CASUSERID=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASUSER=user-ID \n    \nSpecifies the user ID to use when connecting to CAS. \n\nDefault: no value \n\nExample:\nOPTIONS CASUSER=saszzz ;"}},{"Name":"DSCAS","Type":"S|CAS","Help":{"#cdata":"Specifies that by default, the DATA step runs in the CAS server."}},{"Name":"NODSCAS","Type":"S|CAS","Help":{"#cdata":"Specifies that by default, the DATA step runs in SAS."}},{"Name":null,"Type":"V|CAS","Help":{"#cdata":"Syntax: "}},{"Name":"CASINSTALL=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASINSTALL=\"physical-file\"\n    \nSpecifies installation location used to start CAS. \n\nNote: At a customer site, CASINSTALL is expected to be defined in an environment variable, CAS_INSTALL, \nthat is set in the install scripts. Note: Alternatively, INSTALL= can be included in the specified \nSETUPFILE= when a server is started with PROC CASOPERATE. \n\nRange: 256 characters \n\nExample:\nOPTIONS CASINSTALL=\"/opt/v9cas/laxnd/TKGrid\";"}},{"Name":"CASLIFETIME=","Type":"V|CAS","Help":{"#cdata":"Syntax: CASLIFETIME=duration \n\nSpecifies the duration, in minutes, for a server to run. After the specified lifetime is exceeded, \nthe server automatically shuts down. The CASLIFETIME= value is read during server start up. \n\nRange: 0 to 1000000 minutes\nDefault: 1000000 minutes \n\nExample:\nOPTIONS CASLIFETIME=480; /* shut down the server after 8 hours */"}},{"Name":"CASLOGCNTL=","Type":"V|CAS","Values":{"@Value1":"METRICS","@Value2":"NOMETRICS"},"ToolTips":{"@ToolTip1":"Specifies to include detailed performance metrics in the SAS log.","@ToolTip2":"Specifies to exclude the detailed performance metrics from the SAS log."},"Help":{"#cdata":"Syntax: CASLOGCNTL= METRICS | NOMETRICS \n    \nSpecifies the logging control for logging CAS actions. \n\nMETRICS\n  specifies to include detailed performance metrics in the SAS log.\n\nNOMETRICS\n  specifies to exclude the detailed performance metrics from the SAS log."}},{"Name":"SESSREF=|CASNAME=","Type":"V|CAS","Help":{"#cdata":"Syntax: SESSREF=reference-name |CASNAME=reference-name \n    \nIndicates the default session name. This session name is used when creating a session if the creation \nrequest does not explicitly identify the session name. This session name is used to identify a session \nwhen a request does not explicitly identify the session name. \n\nDefault: CASAUTO\nRange: 256 characters \n\nExample:\nOPTIONS SESSREF=mysessref;\nOPTIONS CASNAME=mysessref;"}},{"Name":"ACCESSIBLECHECK","Type":"S|CAS","Help":{"#cdata":"Specifies to write messages to the SAS log if accessibility problems are found."}},{"Name":"NOACCESSIBLECHECK","Type":"S|CAS","Help":{"#cdata":"Specifies not to detect for accessibility problems or write accessibility problem\nmessages to the SAS log."}},{"Name":"ACCESSIBLEGRAPH","Type":"S|CAS","Help":{"#cdata":"Specifies to create accessible ODS graphics by default.\n    \nTip: When you specify the ACCESSIBLEGRAPH system option, you do not need\nto set the ACCESSIBLE=YES option in the ODS HTML5 statement."}},{"Name":"NOACCESSIBLEGRAPH","Type":"S|CAS","Help":{"#cdata":"Specifies not to create accessible ODS graphics by default."}},{"Name":"ACCESSIBLEPDF","Type":"S|CAS","Help":{"#cdata":"Specifies to create accessible graphs, by default, for the ODS PDF destination. \n    \nTip: When you set the ACCESSIBLEPDF system option, you do not need to set the\nACCESSIBLE option in the ODS PDF statement."}},{"Name":"NOACCESSIBLEPDF","Type":"S|CAS","Help":{"#cdata":"Specifies not to create accessible graphs for the ODS PDF destination."}},{"Name":"ACCESSIBLETABLE","Type":"S|CAS","Help":{"#cdata":"Specifies to create accessible tables and reports by default."}},{"Name":"NOACCESSIBLETABLE","Type":"S|CAS","Help":{"#cdata":"Specifies not to create accessible tables and reports by default."}}],"#comment":[{},{},{},{},{},{},{},{},{},{},{},{}]}}