{"Keywords":{"Keyword":[{"Name":"BWIDTH=","Type":"V","Help":{"#cdata":"[Syntax: BWIDTH=box-width] \n    \nSpecifies the width of the box generated by either the INTERPOL=BOX or INTERPOL=HILOB option. \nBox-width can be any number greater than 0. By default, the value of box-width is the same as \nthe value of the WIDTH= option, whose default value is 1. Therefore, if you specify a WIDTH= \nvalue for and omit the BWIDTH= option, the width of the box changes accordingly."}},{"Name":"CI=","Type":"C","Help":{"#cdata":"[Syntax: CI=line-color|_style_] \n    \nSpecifies a color for an interpolation line (GPLOT and GBARLINE) or a contour line (GCONTOUR)."}},{"Name":"CI=_STYLE_","Type":"V","Help":{"#cdata":"Specifies the appropriate color for an interpolation line (GPLOT and GBARLINE)\nor a contour line (GCONTOUR) based on the current style."}},{"Name":"CO=","Type":"C","Help":{"#cdata":"[Syntax: CO=color] \n    \nSpecifies a color for the following:\n\n  o outlines of filled areas generated by the INTERPOL=map/plot-pattern option\n\n  o confidence limit lines generated by the INTERPOL=R series option\n\n  o staffs, boxes, and bars generated by the high-low interpolation methods: INTERPOL=HILO, \n    INTERPOL=BOX, and INTERPOL=STD"}},{"Name":"COLOR=|C=","Type":"C","Help":{"#cdata":"[Syntax: COLOR=symbol-color | _style_] \n    \nSpecifies a color for the entire definition, unless it is followed by a more explicit \nspecification. For the GPLOT and GBARLINE procedures, this includes plot symbols, the \nplot line, confidence limit lines, and outlines. For the GCONTOUR procedure, this includes \ncontour lines and labels."}},{"Name":"COLOR=_STYLE_","Type":"V","Help":{"#cdata":"Specifies the appropriate color for the entire definition based on the current style. For the GPLOT \nand GBARLINE procedures, this includes plot symbols, the plot line, confidence limit lines, and \noutlines. For the GCONTOUR procedure, this includes contour lines and labels."}},{"Name":"CV=","Type":"C","Help":{"#cdata":"[Syntax: CV=value-color|_style_] \n    \nSpecifies a color for the following:\n\n  o plot symbols in the GPLOT procedure\n\n  o the filled areas generated by the INTERPOL=map/plot-pattern option\n\n  o contour labels in the GCONTOUR procedure"}},{"Name":"CV=_STYLE_","Type":"V","Help":{"#cdata":"[Syntax: CV=value-color|_style_] \n    \nSpecifies a color for the following based on the current style:\n\n  o plot symbols in the GPLOT procedure\n\n  o the filled areas generated by the INTERPOL=map/plot-pattern option\n\n  o contour labels in the GCONTOUR procedure"}},{"Name":"FONT=|F=","Type":"V","Help":{"#cdata":"[Syntax: FONT=\"font\"] \n    \nSpecifies the font for the plot symbol (GPLOT, GBARLINE) or contour labels (GCONTOUR) \nspecified by the VALUE= option. The font specification must be enclosed in quotes and \ncan include the /bold and /italic font modifiers."}},{"Name":"HEIGHT=|H=","Type":"V","Help":{"#cdata":"[Syntax: HEIGHT=symbol-height<units>] \n    \nSpecifies the height in number of units of plot symbols (GPLOT, GBARLINE) or contour \nlabels (GCONTOUR)."}},{"Name":"INTERPOL=|I=","Type":"V","Values":{"@Value1":"BOX","@Value2":"HILO","@Value3":"JOIN","@Value4":"L","@Value5":"MEMPTY","@Value6":"MSOLID","@Value7":"M","@Value8":"NEEDLE","@Value9":"NONE","@Value10":"R","@Value11":"SM","@Value12":"SPLINE","@Value13":"STD","@Value14":"STEP"},"ToolTips":{"@ToolTip1":"Syntax: BOX<option(s)><00...25>         Produces box and whisker plots. The bottom and top edges of the box are located at  the sample 25th and 75th percentiles. The center horizontal line is drawn at the  50th percentile (median).  Values for option(s) are one or more of these:     F fills the box with the color specified by CV= and outlines the box with the color      specified by CO=      J joins the median points of the boxes with a line      T draws tops and bottoms on the whiskers.  In addition, you can specify a percentile to control the length of the whiskers within the  range 00 through 25. These are examples of percentile specifications and their effect:     00 high/low extremes. INTERPOL=BOX00 is not the same as the default, INTERPOL=BOX.      01 1st percentile low, 99th high      05 5th percentile low, 95th high      10 10th percentile low, 90th high      25 25th percentile low, 75th high; since the box extends from the 25th to the 75th percentile,    no whiskers are produced","@ToolTip2":"Syntax: HILO<C><option>                 Specifies that a solid vertical line connect the minimum and maximum Y values for each X value.  The data should have at least two values of Y for every value of X; otherwise, the single value is displayed without the vertical line.  To specify high, low, close stock market data, include this option:     C draws tick marks at the close value instead of at the mean value.   In addition, you can specify one of these values for option:     B connects the minimum and maximum Y values with bars instead of lines. Use the BWIDTH= option to      increase the width of the bars.      J joins the mean values or the close values (if HILOC is specified) with a line. This point is not     marked with a tick mark.      T adds tops and bottoms to each line.      BJ connects maximum and minimum values with a bar and joins the mean or close values.      TJ adds tops and bottoms to the lines and joins the mean or close values.","@ToolTip3":"Connects data points with straight lines. Points are connected in the order they occur in the input  data set. Therefore, the data should be sorted by the independent (horizontal axis) variable.","@ToolTip4":"Syntax: L<degree><P><S>                 Specifies a Lagrange interpolation to smooth the plot line. Specify one of these values for degree:   1 | 3 | 5 specifies the degree of the Lagrange interpolation polynomial. By default, degree is 1.   In addition, you can specify one or both of these:     P specifies a parametric interpolation      S sorts a data set by the independent variable before plotting its data.","@ToolTip5":"=Specifies that an empty pattern fill the polygon that has been defined by the data points.","@ToolTip6":"Specifies that a solid pattern fill the polygon that has been defined by the data points.","@ToolTip7":"Syntax: Mdensity<style<angle>>                 Specifies that a shaded pattern fill the polygon that has been defined by the data points. Density specifies the density of the pattern's shading:     1...5 1 produces the lightest shading and 5 produces the heaviest.   Style specifies the direction of pattern lines:     N parallel lines (the default)      X crosshatched lines.   Angle specifies the starting angle for parallel or crosshatched lines:     0...360 the degree at which the parallel lines are drawn. By default, angle is 0 (lines are parallel   to the horizontal axis).","@ToolTip8":"Draws a vertical line from each data point to a horizontal line at the 0 value on the vertical axis or the minimum value on the vertical axis. The horizontal line is drawn automatically.","@ToolTip9":"Suppresses any interpolation and, if the VALUE= option is not specified, also suppresses plot points.","@ToolTip10":"Syntax: R<type><0><CLM | CLI<50...99>>                 Specifies that a plot is a regression analysis. By default, regression lines are not  forced through plot origins and confidence limits are not displayed. Type specifies  the type of regression.   Specify one of these values for type:     L requests linear regression (the default)   Q requests quadratic regression    C requests cubic regression   To force the regression line through a (0,0) origin, specify: 0 to eliminate the intercept.  To display confidence limits, specify one of these:     CLM displays confidence limits for mean predicted values      CLI displays confidence limits for individual predicted values  You can specify confidence levels from 50% to 99%.","@ToolTip11":"Syntax: SM<nn><P><S>                 Specifies that a smooth line is fit to data using a spline routine. INTERPOL=SM  is a method for smoothing noisy data. The points on the plot do not necessarily  fall on the line.  The relative importance of plot values versus smoothness is controlled by nn. Values  for nn are as follows:    0...99 produces a cubic spline that minimizes a linear combination of the sum of    squares of the residuals of fit and the integral of the square of the second derivative    In addition, specify one or both of these:     P specifies a parametric cubic spline      S sorts data by the independent variable before plotting.","@ToolTip12":"Syntax: SPLINE<P><S>                 Specifies that the interpolation for the plot line use a spline routine. INTERPOL=SPLINE  produces the smoothest line and is the most efficient of the nontrivial spline interpolation  methods.  Specify one or both of these:     P specifies a parametric spline interpolation method.      S sorts a data set by the independent variable before plotting its data.","@ToolTip13":"Syntax: STD<1 | 2 | 3><variance><option(s)>                 Specifies that a solid line connect the mean Y value with ± 1, 2, or 3 standard  deviations for each X. Variance can be one or both of these:     M computes the standard deviation about the mean      P computes sample variances using a pooled estimate, as in a one-way ANOVA model.     In addition, specify one of these values for option(s):     B connects the minimum and maximum Y values with bars instead of lines.      J connects the means from bar to bar with a line.      T adds tops and bottoms to each line.      BJ connects maximum and minimum values with a bar and joins the mean values.      TJ adds tops and bottoms to the lines and joins the mean values.","@ToolTip14":"Syntax: STEP<placement><J><S>                 Specifies that the data are plotted with a step function. By default, the data point  is on the left of the step, the steps are not joined with a vertical line, and the data  are not sorted before processing.  Specify one of these values for placement:     L displays the data point on the left of the step.      R displays the data point on the right of the step.      C displays the data point in the center of the step.  In addition, specify one or both of these:     J produces steps joined with a vertical line.      S sorts unordered data by the independent variable before plotting."},"Help":{"#cdata":"Specifies various plots and plotting options."}},{"Name":"LINE=","Type":"V","Help":{"#cdata":"[Syntax: LINE=line-type] \n    \nSpecifies the line type of the plot line in the GPLOT procedure, or the contour line\nin the GCONTOUR procedure:\n\n  1 a solid line.\n   \n  2...46 a dashed line."}},{"Name":"MODE=","Type":"V","Values":{"@Value1":"EXCLUDE","@Value2":"INCLUDE"},"ToolTips":{"@ToolTip1":"Prevents values outside the axis range of plot axes from being displayed.  This is the default.","@ToolTip2":"Specifies that any interpolation method to include data values that are  outside the range of plot axes."},"Help":{"#cdata":"Specifies that any interpolation method exclude or include data values that are \noutside the range of plot axes. By default, MODE=EXCLUDE prevents values outside \nthe axis range from being displayed."}},{"Name":"POINTLABEL","Type":"S","Help":{"#cdata":"[Syntax: POINTLABEL<=(label-description(s)) | NONE>] \n    \nPOINTLABEL without any specified descriptions labels points with the Y value."}},{"Name":"POINTLABEL=","Type":"V","Help":{"#cdata":"[Syntax: POINTLABEL<=(label-description(s)) | NONE>] \n    \nLabels plot points. Label-description(s) can be one or more of these:\n\n  COLOR=text-color \n  specifies the color of the label text. The default is the first color from the color list.\n\n  DROPCOLLISIONS | NODROPCOLLISIONS \n  specify DROPCOLLISIONS to drop new labels if they collide with a label already in use. \n  Specify NODROPCOLLISIONS to retain all labels. The default is DROPCOLLISIONS.\n\n  FONT=font | NONE \n  specifies the font for the text.\n\n  HEIGHT=text-height <units > \n  specifies the height of the text characters in number of units. By default, HEIGHT=1 CELL.\n\n  JUSTIFY=CENTER | LEFT | RIGHT \n  specifies the horizontal alignment of the label text. The default is CENTER.\n\n  POSITION=TOP | MIDDLE | BOTTOM \n  specifies the vertical placement of the label text. The default is TOP.\n\n  \"#var\" | \"#x:#y <$char>\" | \"#y:#x <$char>\" \n  specifies the variable or variables whose values label the plot points. The variable specification must be\n  enclosed in either single or double quotation marks. The first specified variable must be prefixed with a \n  pound sign (#). If a second variable is specified, it must be prefixed with a colon and a pound sign (:#).\n  When you specify both the X and Y variables, you can also specify the character to display as the delimiter\n  between variable values in the plot label."}},{"Name":"POINTLABEL=NONE","Type":"S|V","Help":{"#cdata":"Suppresses the point labels."}},{"Name":"REPEAT=|R=","Type":"V","Help":{"#cdata":"[Syntax: REPEAT=number-of-times] \n    \nSpecifies the number of times that a SYMBOL definition is applied before the next \nSYMBOL definition is used. By default, REPEAT=1."}},{"Name":"SINGULAR=","Type":"V","Help":{"#cdata":"[Syntax: SINGULAR=n] \n    \nTunes the algorithm used to check for singularities. The default value is machine \ndependent but is approximately 1E-7 on most machines. This option is rarely needed."}},{"Name":"STEP=","Type":"V","Help":{"#cdata":"[Syntax: STEP=distance<units>] \n    \nSpecifies the minimum distance between labels on contour lines. The value of distance \nmust be greater than zero. By default, STEP=65PCT."}},{"Name":"VALUE=|V=","Type":"V","Values":{"@Value1":"PLUS","@Value2":"STAR","@Value3":"SQUARE","@Value4":"DIAMOND","@Value5":"HASH","@Value6":"PAW","@Value7":"POINT","@Value8":"DOT","@Value9":"CIRCLE","@Value10":"X","@Value11":"Y","@Value12":"Z","@Value13":"SQUAREFILLED","@Value14":"DIAMONDFILLED","@Value15":"TRIANGLE","@Value16":"TRIANGLEFILLED","@Value17":"_","@Value18":"#","@Value19":"$","@Value20":"%","@Value21":"=","@Value22":"-","@Value23":"@","@Value24":"*","@Value25":"+","@Value26":">","@Value27":".","@Value28":"<","@Value29":",","@Value30":"/","@Value31":"?","@Value32":"(","@Value33":")","@Value34":":","@Value35":"SPECIAL","@Value36":"NONE"},"ToolTips":{"@ToolTip1":"+ symbol","@ToolTip2":"* symbol","@ToolTip3":"Square symbol","@ToolTip4":"Diamond","@ToolTip5":"# symbol","@ToolTip6":"Four dots forming a square symbol","@ToolTip7":". symbol","@ToolTip8":"Dot symbol","@ToolTip9":"Circle symbol","@ToolTip10":"X symbol","@ToolTip11":"Y symbol","@ToolTip12":"Z symbol","@ToolTip13":"Filled square symbol","@ToolTip14":"Filled diamond symbol","@ToolTip15":"Triangle symbol","@ToolTip16":"Filled triangle symbol","@ToolTip17":"Square with curved sides symbol","@ToolTip18":"Heart symbol","@ToolTip19":"Square with curved sides (but with one corner pointed up) symbol","@ToolTip20":"Clubs (playing cards) symbol","@ToolTip21":"Lantern (star) symbol","@ToolTip22":"Small circle with a dot in the center symbol","@ToolTip23":"Small circle with a cross attached to the bottom and two curved hair-like lines at the top","@ToolTip24":"Small circle with a cross attached to the bottom","@ToolTip25":"Small circle with cross inside, cutting the circle in quadrants","@ToolTip26":"Small circle with an attached arrow pointed in the NE direction","@ToolTip27":"Symbol looks like the number 4 with the left top end curved away in a horizontal direction","@ToolTip28":"Symbol looks like the letter h with the right side curved","@ToolTip29":"A small circle with a dot in the center and an arrow attached at the top pointing up","@ToolTip30":"Symbol looks like a U-shaped spear with another spear attached in the center and a cross at the bottom","@ToolTip31":"Symbol looks like a letter P with a horizontal base","@ToolTip32":"Symbol looks like a quarter moon with the curved inner part facing east","@ToolTip33":"Small circle with 3 lines attached to the NE portion of the circumference","@ToolTip34":"Symbol is made up of 2 sumperimposed + or cross signs forming an asterisk","@ToolTip35":"Enables you to define unique special symbols for up to 12 plots (GPLOT) in one SYMBOL statement.  Some of the symbols include the following: CIRCLE, DIAMOND, DIAMONDFILLED, DOT, DOTFILLED,  HASH, PAW, POINT, PLUS, SQUARE, SQUAREFILLED, STAR, TRIANGLE, TRIANGLEFILLED, X, Y, and Z.","@ToolTip36":"Suppresses plot symbols at the data points, or labels on the contour lines. You can set the  VALUE=NONE option independent of the INTERPOL= option."},"Help":{"#cdata":"[Syntax: VALUE=special-symbol | text-string | NONE] \n    \nSpecifies a plot symbol for the data points (GPLOT and GBARLINE), or contour-label \ntext in a contour plot (GCONTOUR). VALUE=NONE suppresses plot symbols at the data \npoints, or labels on the contour lines."}},{"Name":"VALUE=NONE","Type":"V","Help":{"#cdata":"Suppresses plot symbols at the data points (GPLOT and GBARLINE), or labels on the \ncontour lines (GCONTOUR)."}},{"Name":"WIDTH=|W=","Type":"V","Help":{"#cdata":"[Syntax: WIDTH=thickness-factor] \n    \nSpecifies the thickness of interpolated lines (GPLOT) or contour lines (GCONTOUR), \nwhere thickness-factor is a number. The thickness of the line increases directly \nwith thickness-factor. By default, WIDTH=1."}}]}}