{"Keywords":{"Keyword":[{"Name":"COMMAND","Type":"S","Help":{"#cdata":"Executes the operating system command."}},{"Name":"LIST","Type":"S","Help":{"#cdata":"Lists either a specific active task or all of the active tasks in the system."}},{"Name":"KILL","Type":"S","Help":{"#cdata":"Forces the termination of the specified task(s)."}},{"Name":"WAIT","Type":"S","Help":{"#cdata":"Specifies that SYSTASK COMMAND suspends execution of the current SAS session until \nthe task has completed."}},{"Name":"NOWAIT","Type":"S","Help":{"#cdata":"Specifies that SYSTASK COMMAND does not suspend execution of the current SAS session."}},{"Name":"TASKNAME=","Type":"V","Help":{"#cdata":"Specifies a name that identifies the task. Task names must be unique among all active \ntasks. A task is active if it is running, or if it has completed and has not been \nwaited for using the WAITFOR statement."}},{"Name":"MNAME=","Type":"V","Help":{"#cdata":"Specifies a macro variable in which you want SYSTASK to store the task name that it \nautomatically generated for the task. If you specify both the TASKNAME option and \nthe MNAME option, SYSTASK copies the name you specified with TASKNAME into the \nvariable that you specified with MNAME."}},{"Name":"STATUS=","Type":"V","Help":{"#cdata":"Specifies a macro variable in which you want SYSTASK to store the status of the task. \nStatus variable names must be unique among all active tasks."}},{"Name":"SHELL=","Type":"S|V","Help":{"#cdata":"Syntax: SHELL<=\"shell-command\"> \n    \nSpecifies that the operating system command should be executed with the operating \nsystem shell command. If you specify a shell-command, SYSTASK uses the shell command \nthat you specify to invoke the shell; otherwise, SYSTASK uses the default shell. \nEnclose the shell command in quotes."}},{"Name":"_ALL_","Type":"S","Help":{"#cdata":"Specifies all active tasks in the system."}},{"Name":"STATE","Type":"S","Help":{"#cdata":"Specifies to display the status of the task, which can be Start Failed, Running, \nor Complete."}},{"Name":"STATVAR","Type":"S","Help":{"#cdata":"Specifies to display the status variable associated with the task. The status variable is  \nthe variable that you assigned with the STATUS option in the SYSTASK COMMAND statement."}}]}}