{"Keywords":{"Keyword":[{"Name":"ANGLE=|A=","Type":"V","Help":{"#cdata":"[For device-based procedures only][Syntax: ANGLE=degrees | A=degrees] \n    \nSpecifies the angle of the baseline of the entire text string with respect to the \nhorizontal. A positive degrees value angles the baseline counterclockwise; a negative \nvalue angles it clockwise. By default, ANGLE=0 (horizontal)."}},{"Name":"BOLD","Type":"S","Help":{"#cdata":"[For template-based procedures only] \n    \nSpecifies that the font weight is bold for the text string."}},{"Name":"BCOLOR=|BC=","Type":"C","Help":{"#cdata":"[Syntax: BCOLOR=background-color] \n    \nSpecifies the background color of a box produced by the BOX= option. If you omit \nBOX=, BCOLOR= is ignored. By default, the background color of the box is the same \nas the background color for the entire graph. The color of the frame of the box is \ndetermined by the color specification used in BOX=."}},{"Name":"BLANK=YES|BL=YES","Type":"V","Help":{"#cdata":"[For device-based procedures only][Syntax: BLANK=YES] \n    \nProtects the box and its contents from being overwritten by any subsequent graphics \nelements by blanking out the area where the box is displayed. The BLANK= option enables \nyou to overlay graphics elements with boxed text. It is ignored if you omit the BOX= \noption. Because titles and footnotes are written from the highest numbered to the \nlowest numbered, the BLANK= option only blanks out titles and footnotes of a lower \nnumber."}},{"Name":"BOX=|BO=","Type":"V","Values":{"@Value1":"1","@Value2":"2","@Value3":"3","@Value4":"4"},"ToolTips":{"@ToolTip1":"A value of 1 produces the thinnest box lines.","@ToolTip2":"A value of 2 produces the next thinnest box lines.","@ToolTip3":"A value of 3 produces the next thickest box lines.","@ToolTip4":"A value of 4 produces the thickest box lines."},"Help":{"#cdata":"Draws a box around one line of text."}},{"Name":"BSPACE=|BS=","Type":"V","Help":{"#cdata":"[Syntax: BSPACE=box-space<units>] \n    \nSpecifies the amount of space between the boxed text and the box. The space above \nthe text is measured from the font maximum, and the space below the text is measured \nfrom the font minimum. By default, BSPACE=1. If the BOX= option is not used, the \nBSPACE= option is ignored."}},{"Name":"COLOR=|C=","Type":"C","Help":{"#cdata":"[Syntax: COLOR=color] \n    \nSpecifies the color for the following text, box, or line. The COLOR= option affects \nall text, lines, and boxes that follow it and stays in effect until another COLOR= \nspecification is encountered."}},{"Name":"DRAW=|D=","Type":"V","Help":{"#cdata":"[For device-based procedures only][Syntax: DRAW=(x,y...,x-n,y-n)<units>] \n    \nDraws lines anywhere on the graphics output area using x and y as absolute or \nrelative coordinates."}},{"Name":"FONT=|F=","Type":"V","Help":{"#cdata":"[Syntax: FONT=font] \n    \nSpecifies the font for the subsequent text."}},{"Name":"HEIGHT=|H=","Type":"V","Help":{"#cdata":"[Syntax: HEIGHT=text-height<units>] \n    \nSpecifies the height of text characters in number of units. By default, HEIGHT=1. \nHeight is measured from the font minimum to the capline. Ascenders can extend \nabove the capline, depending on the font."}},{"Name":"ITALIC","Type":"S","Help":{"#cdata":"[For template-based procedures only] \n    \nSpecifies that the font style is italic for the text string."}},{"Name":"JUSTIFY=|J=","Type":"V","Values":{"@Value1":"LEFT|L","@Value2":"CENTER|C","@Value3":"RIGHT|R"},"ToolTips":{"@ToolTip1":"Justify to the left.","@ToolTip2":"Justify to the center.","@ToolTip3":"Justify to the right."},"Help":{"#cdata":"Specifies the alignment of the text string. The default is CENTER."}},{"Name":"LANGLE=|LA=","Type":"V","Help":{"#cdata":"[For device-based procedures only][Syntax: LANGLE=degrees] \n    \nSpecifies the angle of the baseline of the entire text string(s) with respect to \nthe horizontal. A positive value for degrees moves the baseline counterclockwise; \na negative value moves it clockwise. By default, LANGLE=0 (horizontal)."}},{"Name":"LINK=","Type":"V","Help":{"#cdata":"[For device-based procedures only][Syntax: LINK= \"URL\"] \n    \nSpecifies a uniform resource locator (URL) that a title or footnote links to. The \ntext-string that you use to specify the URL can contain occurrences of the variables \n#BYVAL, #BYVAR, and #BYLINE."}},{"Name":"LSPACE=|LS=","Type":"V","Help":{"#cdata":"[Syntax: LSPACE=line-space <units>] \n    \nSpecifies the amount of spacing above lines of note and title text and the amount \nof spacing below lines of footnote text."}},{"Name":"MOVE=|M=","Type":"V","Help":{"#cdata":"[For device-based procedures only][Syntax: MOVE=(x,y) <units>] \n    \nPositions subsequent text or lines anywhere on the graphics output area using x and y \nas absolute or relative coordinates."}},{"Name":"ROTATE=|R=","Type":"V","Help":{"#cdata":"[For device-based procedures only][Syntax: ROTATE=degrees] \n    \nSpecifies the angle at which each character of text is rotated with respect to \nthe baseline of the text string. The angle is measured from the current text \nbaseline angle, which is specified by the ANGLE= or LANGLE= options. By default, \nthe baseline is horizontal. A positive value for degrees rotates the character \ncounterclockwise; a negative value rotates it clockwise. By default, ROTATE=0 \n(parallel to the baseline)."}},{"Name":"UNDERLIN=|U=","Type":"V","Values":{"@Value1":"0","@Value2":"1","@Value3":"2","@Value4":"3"},"ToolTips":{"@ToolTip1":"UNDERLIN=0 halts underlining for subsequent text.","@ToolTip2":"Undelines with the thinnest line.","@ToolTip3":"Undelines with the next thickest line.","@ToolTip4":"Undelines with the thickest line."},"Help":{"#cdata":"Underlines subsequent text."}},{"Name":"WRAP","Type":"S","Help":{"#cdata":"[For device-based procedures only] \n    \nWraps the text to a second line if the text does not fit on one line. If the WRAP \noption is omitted, the text font-size is reduced until the text fits on one line. \nWrapping occurs at the last blank before the text meets the end of the window. If \nthere are no blanks in the text string, then there is no wrapping."}}]}}